[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…would never ask them to  sacrifice their child's well-being. That is not just offensive, that is  cruel, and it is inhumane.\n\nGender-affirming care is healthcare. Denying it sends a harmful  message to military families with transgender children that their  needs, their dignity, who they are, and their very lives do not matter.\n\nIn addition, when we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…floor again, Members  of this body will stand for the proposition that has been part of our  history that war is too big an issue to allow one person to make the  decision that sends our sons and daughters into harm's way.\n\nMr. KAINE. Mr. President, the remaining two speakers and Senator  Schumer have yielded their time to me. I will be the last speaker…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…duty-free access to markets.  Passing this bill will demonstrate that Congress is committed to our  long-term relationship with Africa. Most importantly, reauthorizing  AGOA sends a very strong message that, even though the President's  rhetoric toward many African countries has been a distraction, we in  Congress do acknowledge the very important role…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…suffered from the Republican effort, Mr. Speaker, under Donald Trump's  Presidency in 2017 to decimate the State and local tax deduction, every  single State is a donor State that sends more money to the Federal  Government than we ever get back in return, a donor State.\n\nSome people in this town are running around misrepresenting the  facts. We are okay to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…That is why I introduced an amendment to repeal this ban because this  ban doesn't strengthen our military. It weakens it. It doesn't uphold  our values. It betrays them. It sends the cruelest message to some of  our most devoted patriots that one identity they hold matters more than  their service.\n\nMy second amendment restores retirement benefits to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Mr. President. You talk a big game about  hunting down drug traffickers and getting drugs off our streets and  then turn around and free a dangerous, convicted drug lord. That sends  a message to other criminals: Suck up to Trump, and you will get a  pardon, no matter how many boatloads of drugs you pump into our  streets.\n\nEven one Trump adviser admitted…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…minerals that were just talked about  produced from this mine would actually stay in the U.S. and benefit the  American economy or American national security at all.\n\nAntofagasta sends most of its minerals to China, where they are then  sold on the global market, likely the same fate for these minerals if  this mine is allowed to happen.\n\nAll of this is why,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…ignores an order from the Supreme Court to bring  back a wrongfully deported immigrant, he is violating the rule of law,  which impacts all of us.\n\nMr. Speaker, when Donald Trump sends immigrants to a gulag in a  foreign country, believe him when he tells you that he will be doing  this to U.S. citizens next. In fact, he has already begun deporting  U.S.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…something right.\n\nI am sick and tired of folks in Washington or the think tanks or  wherever else looking for a win-win when there is a villain hurting our  people. If a railroad sends a toxic fireball into the sky over your  community, you don't look for a win-win. You fight them for your  people. When PBMs are killing pharmacies and jacking up drug costs,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…makes it worse. Here is what his order actually does: hikes energy  costs for millions of Americans by doubling down on expensive fossil  fuels when it makes no economic sense, sends hundreds of thousands of  American jobs overseas as other countries continue to develop their  next-generation energy sources, decreases our American-made domestic  energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…the fall. One of Abby's mentors with       Breakthrough T1D encouraged her to apply to be part of the       Children's Congress, an initiative the organization runs that       sends more than 160 kids with Type 1 diabetes to the capitol       every two years to advocate for research. She will be       speaking with a senator and representatives to share…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…parts, and agricultural products, has already signaled retaliation,  threatening our supply chains and manufacturing sectors. A similar  pattern occurs with China, where Illinois sends substantial volumes of  agricultural products and electronics. Mexico is another major trading  partner in auto parts, machinery, and food products. Disrupting the  supply…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…infraction  handled by a mere warning.\n\nInstead, she is locked up in an ICE detention center in Louisiana,  facing possible deportation to Russia. This isn't just cruel, it sends  a chilling message to scientists and international students around the  world: Come to America, and you may be imprisoned instead of empowered.\n\nThen there is Ardem Patapoutian,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…capitulation keeps going. As part of trade talks  with Beijing, they are also undermining export controls of U.S.  technologies deemed to be critical for our national security. This  sends an unmistakable message to adversaries around the world:  America's national security is open to negotiation under Donald Trump's  government.\n\nThe administration should revert…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693851/nvidia"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…up our power as the United States House  of Representatives to work the will of our Members on behalf of our  constituents and make changes to any legislation that the Senate sends  us. Instead, we are simply taking the language directly from the Senate  with no amendments, even when the chairman and other House Members know  that this bill is flawed.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…program. Today, we have the chance to close this final loophole so that  fraudsters do not get away with defrauding American taxpayers and  entrepreneurs.\n\nThis legislation sends a clear message that the era of taking  advantage of the American taxpayer is simply over.\n\nMr. Speaker, I urge my colleagues to support H.R. 4495, and I reserve  the balance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…House Republicans heard the American people. We  heard them loud and clear. We are keeping our promises to end the  waste, the fraud, and the abuse.\n\nThis rescissions package sends $9.4 billion back to the U.S.  Treasury. That is $9.4 billion of savings that taxpayers won't see  wasted.\n\nIt is their money, Mr. Speaker. It is, along with our One Big  Beautiful…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…democratic partner. It is also a key player in  the global supply chain, especially for semiconductors that power  everything from our cars to our national defense system.\n\nThis bill sends a clear and bipartisan message: If the CCP wages war  against Taiwan, there will be consequences. We are talking real,  targeted consequences for corrupt CCP elite. Their financial…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…parents--who bear the weight of that loss every day, yet continue to  honor their loved one's legacy through quiet strength and enduring  service to their communities.\n\nThis resolution sends a clear message: We recognize them. We honor  their sacrifice, and we stand with them.\n\nMr. Speaker, I urge my colleagues to join me in passing H. Res. 364,  making it the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…radical Green New  Deal agenda.\n\nToday that ends. House Republicans are taking action to stop this  Federal overreach. H.J. Res. 20, introduced by my colleague, Gary  Palmer, sends a clear message: We reject the Biden administration's  radical energy mandates.\n\nThis resolution expresses congressional disapproval of the Department  of Energy's rule that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688295/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…the way this  place works.\n\nTwo minutes of testimony, seven members in the Banking Committee,  present on that day, saying that they do not believe there was criminal  intent sends a very clear message to a young U.S. attorney with a dream  in the DC District: Why don't you come talk to people who were at the  alleged scene of the crime?\n\nWe said we do…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the Stop Forced Organ Harvesting Act of 2025, is a  bipartisan moral imperative. It holds perpetrators accountable and  targets the heart of this depraved industry.\n\nThis bill sends a clear message: The United States will not be  complicit. If you take part in forced organ harvesting, we are coming  after you. It imposes strong sanctions, strengthens reporting…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…communities have been devastated  by drugs, to the families who have lost loved ones, and to the people  of our hemisphere who have suffered under his criminal regime, this  action sends a clear message: Narcoterrorist dictators are not immune  from consequences, and the United States will not stand by while our  citizens continue to be poisoned and murdered…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…purpose. It  strengthens our diplomatic and security tools. It reinforces our  alliances, and it counters adversaries who seek to exploit instability  around the world.\n\nIt sends an important message that strong alliances require shared  responsibility. Our partners must contribute to their own defense if  they expect continued support from the United…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…tried by the U.S. Attorney's Office,  ensuring that woke, weird prosecutors like D.C. Attorney General Brian  Schwalb can't let violent offenders slip through the cracks. It sends a  simple message. Democrats may tolerate crime, but Republicans do not.\n\nMr. Speaker, every American should be able to walk down our streets  without fear of being murdered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…pro-crime policies. Republicans are the  party of safe cities. We are the party that stands with our police and  responds to our communities that demand law and order.\n\nThis bill sends a simple message: Criminals will be held accountable,  victims will be protected, and Washington, D.C., will remain on the  path to becoming the safe, thriving Capital our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…bills will be passed today,  including Homeland Security. These are transparent bills, accountable  bills, and fiscally responsible bills.\n\nThis hasn't happened in years, and it sends a clear, powerful message  back home that the House is back at work. We are back to governing.\n\nThese bills strengthen our military, secure our border, invest in  health and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…temporarily into schedule I.\n\nThis bill is a critical step in combating the opioid crisis in our  country because China and Mexico are heavily involved in this business.  China sends the precursors of fentanyl and fentanyl analogues, the API,  or active pharmaceutical ingredients, to the cartels in Mexico who are  then making the drugs and bringing them…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…of what the U.S.  Government is capable of doing if it is determined to do so under the  leadership of a decisive, energetic President like President Trump.\n\nAnd I think it sends an enormous message of deterrence to adversaries  around the world and potential adversaries like China, North Korea,  Iran, Russia. When they see a demonstration of competence…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…immigrant criminals to be deported. It was  bipartisan legislation. And 12 Democrats voted with us to pass this  legislation, and it is now law of the land.\n\nThe Laken Riley Act sends a clear message that tragedies like this  never be allowed to happen again in the United States of America, that  the era of open borders is over.\n\nSenate Republicans mean…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}]