[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…even refused to put that on the floor.\n\nBut what is happening here? The ability, the strength, the  constitutional authority of the Congress to say: No. No endless wars.  No sending all our money down to Venezuela and Lord knows what other  countries.\n\nAgain, just look at this, my Republican colleagues. Here is what  Trump said on oversight of Venezuela.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…about using taxpayer dollars to lower costs  for Americans over fueling the fear that persists in our cities. It is  about caring for our neighbors when they are sick over sending masked  agents to terrorize our communities. It really is that simple.\n\nChoose care over cruelty. I urge a ``no'' vote.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…imagine being more out of  touch with the needs of everyday Americans.\n\nFirst, I have to mention that H.R. 4626 would make the appliances in  your home more expensive to operate, sending your already high  electricity bill even higher. Like all other appliance-related debates,  this bill is just another way to kill floor time for Republicans who  seem to only…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…servicemembers and as motivated by mission and doing the right thing  and making moral and ethical choices. And that is all at risk.\n\nIn Senator Merkley's State, in Portland, they are sending armed  uniformed soldiers to do what we traditionally feel is police work-- intimidating the population, using tear gas against U.S. citizens for  no reason. By the way, National…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…operations that have cost  lives.\n\nI am sick and tired of seeing Republicans reward a rogue agency that  inflicts harm on our communities. Congressional Republicans greenlit  sending $400 million more to ICE detention and $370 million more to ICE  enforcement. This is on top of the unprecedented $170 billion the  agency received in Trump's big, ugly bill.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699381/communities-deserve-safety"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…can't happen. It cannot happen. You are  literally, through passivity in this U.S. Senate, where we have the  option to act or we have the option to hide, the second option is  sending a direct premium increase to our families, up to $40,000 in a  year for people who make $80,000. So this happens, this is on us. If  this happens, it is on us.\n\nMr. WELCH.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…things that I am  sure she will never forget. I think he loved every minute of that.\n\nThat is how I am going remember Doug. He was a great guy. I am  certainly thinking and sending best wishes to his family and everyone  who loved him.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…human beings without  care. They are doing it, regardless of whether people are undocumented,  legal residents, or even American citizens.\n\nThey are splitting up parents by sending them to different detention  facilities and then making children navigate the funds for a lawyer and  basic survival.\n\nIf I cannot get answers as a U.S. Congresswoman, how…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…concluded that the Government of Israel is  committing genocide in Gaza.\n\nIt calls on all countries to take immediate concrete actions to  prevent and punish genocide, to stop sending weapons to the Israeli  Government, and to bring individuals forward, again, to hold them  accountable and to seek justice for the genocide.\n\nMr. Speaker, I include in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…without having to fund Israel's  military. Those who support Israel's military should be able to do so  in a standalone bill. I cannot in good conscience vote to authorize  sending our tax dollars to a military whose prime minister has been  accused by the International Criminal Court of ``the war crimes of  starvation as a method of warfare and of intentionally…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698049/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…programs, ends clean energy and climate programs, and strips  away healthcare from almost 14 million Americans.\n\nThe Republicans' agenda will make Americans sicker and poorer,  sending more Americans to the hospital, and ensuring fewer Americans  can afford the healthcare they need.\n\nMr. Speaker, I urge my colleagues to vote for clean air. Vote ``no''  on…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…help start  businesses. Now, we have a President who wants to cut that, maybe  because he wants all the money.\n\nWe have a President, supported by the Republican Party, who is  sending in the National Guard and militarizing soldiers against  citizens in those cities and States. They are right here at Union  Station in Washington, D.C. The taxpayers are footing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…``Tariffs are taxes, and Mr. Trump's  latest tariffs are estimated to be about an annual $150 billion tax  increase. Taxes are antigrowth. That is the message investors are  sending this week since Mr. Trump let his 25 percent tariffs on Canada  and Mexico take effect.''\n\nThe Wall Street Journal said: ``Brace for higher prices on berries,  bell peppers,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…We are adding to the  perception that Congress somehow is legitimizing or overlooking his  behavior--in fact, looking the other way. That is not the message we  ought to be sending at this moment in our history, and it is not  legally right under the Constitution.\n\nWe ought to be voting on his emoluments, every one of these benefits.  That is the reason…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump's own policy advisers are struggling to explain his flip- flopping.\n\nThe only thing Donald Trump's tariffs have succeeded in is raising  the  odds of recession and sending markets into a tailspin.\n\nI have talked to business owners in New York. I was in Suffolk County  at Tandy's, a well-known dress seller there. Her costs are going up 30  percent…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…about your ability to respond with  aggression.\n\nWith increasingly dubious financial health and a larger share of  resources devoted to interest payments, the United States is sending a  message of weakness.\n\nYet Congress has reportedly chosen to ignore the deficit, raise the  debt ceiling, and continue to fund foreign wars. Instead of budgeting,  Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…aisle. I don't agree with him on anything, but he is my friend and I  dig that.\n\nMr. Speaker, we must send a very strong message that the United  States will no longer tolerate sending U.S. tax dollars to terrorist  organizations in Afghanistan and across the Middle East.\n\nI urge my colleagues to support this measure, and I yield back the  balance of my…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…no more  men playing in women's sports; restoring America's leadership on the  world stage; rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing up for American workers; adding 345,000 new  jobs; securing billions of dollars in new investments in the United…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…delegation shall consist of experienced and accomplished  Hill staff who can contribute to the success of the exchange on both  sides of the Atlantic. The Bundestag reciprocates by sending senior  staff professionals to the United States.\n\nApplicants should have a demonstrable interest in events in Europe.  Applicants need not be working in the field of foreign…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Security colleagues on both sides  of the aisle as we work to advance over a dozen bipartisan pieces of  legislation to the House floor this week. As chairman, I look forward  to sending many more legislative priorities to the House floor.\n\nMr. Speaker, I urge support for H.R. 2212, and I reserve the balance  of my time.\n\nMr. GARBARINO. Madam Speaker, I yield…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…step in  fulfilling that promise.\n\nI applaud my Senate colleagues Chairman Scott and Senators Hagerty,  Lummis, and Gillibrand for energizing an often calcified Senate and  sending over the GENIUS Act. Furthermore, I thank my colleagues,  Speaker Johnson and Leader Scalise, along with Chairman Hill and  Chairman Thompson, for putting this bill on the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…consultatIon and coordination with Indian       Tribal Governments, including Alaska Native Tribes and ANCSA       Alaska Native Corporations, the record does not support that.       Sending one letter informing these stakeholders of a       rulemaking effort followed by a lack of adequate consultation       and doing so during an importance subsistence harvest…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and it is  our duty to adhere to the will of the people by swiftly passing this  bill and sending the SAVE America Act to President Trump's desk for  signature.\n\nMr. Speaker, you know me to be a data-oriented individual, so let us  review the numbers before us as we debate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…alliance is  growing more brazen and aggressive. This  week, Xi Jinping is hosting Iran, North Korea, Russia, and other  hostile actors for a military parade. They are clearly sending a  message to the United States and our allies that they are more united  than ever.\n\nTime is of the essence. We need to expedite the AUKUS partners'  access to markets and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…capital to recreate our ideas or reverse- engineer and then use them against us.\n\nHow can we expect to outcompete our most significant competitor on  the world stage if we are sending billions of dollars directly into  their arsenal?\n\nPresident Trump has been a great partner with Congress on ending this  exploitative relationship with China. Again, this…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Thune", "party": "Republican", "sentence": "…will help the next generation get a running start on  their American dream. In a word, the American people will be able to  keep more of their hard-earned money instead of sending it to the  Federal Government in Washington, and they will have the freedom to  spend, invest, and save more of their own money how they see fit.\n\nIn addition to providing…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…dinner tables and a lot of children going to  bed hungry. Democrats have voted against reopening our government 13  times. Thirteen times they have voted to deny children food, sending  families to food banks instead.\n\nI am told that food banks will not be able to keep up. Federal  workers, single parents with young children, walking into empty food  banks.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…simply give up on crossing  our borders illegally, proven by the 94 percent drop in apprehensions  since March 2024.\n\nThese efforts have only been strengthened by Governor Braun sending  the Indiana National Guard to the border and the House passage of the  SAVE Act.\n\nGovernor Braun has made Indiana healthier by signing nine health- related executive orders,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690592/first-100-days-are-just-the-beginning"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Maduro, with his arms  wrapped around you, or do you stand shoulder to shoulder to protect the  United States of America and our people from the people who are  murdering us and sending their drugs over? The choice is up to you.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Thune", "party": "Republican", "sentence": "…have  been hard at work executing the mandate we received from the American  people last November. We already have a number of accomplishments on  the list.\n\nWe got started by sending the Laken Riley Act to President Trump's  desk during his first week in office to keep criminal illegal  immigrants off our streets.\n\nPresident Trump signed the HALT Fentanyl…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}]