[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President, the need for this resolution is simple.  It is clear. The American people do not support another forever war  with Venezuela. The American people don't want Donald Trump sending our  troops into harm's way without so much as a debate in Congress.\n\nToday, the Senate has a chance to move forward on asserting  Congress's constitutional authority on matters…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…healthier and more productive because of  vaccines. Vaccines have become a global investment in a strong public  system.\n\nIn our modern times, we no longer need to worry about sending our  kids to school, going to large sporting events or concerts, or even  traveling, all because of the major reduction in the spread of disease.  Vaccines are to thank for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…like them, for them to  be convicted and then released by the President of the United States of  America, is that justice? Is that protecting us? What kind of message  is that sending to just go after the little guy in a boat who was  instructed by others?\n\nHow many of the big kingpins have been brought to justice? Who is  going after and building a case…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…DOGE going about it?\n\nAnd we are here to talk about how they are doing it in the Department  of Health and Human Services, under Mr. Kennedy. Basically, they are  doing it by sending out firing notices to people. Over 5,000 people  have been fired, and that includes 700 in the Food and Drug  Administration, 1,200 in the National Institutes of Health, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…things, and these  people are doing these things. They have made our lives better.\n\nYou want to kick them out by accusing some of them of crimes while  never convicting them, by sending a person never convicted to prison in  another country, but others by bullying them out. Using your bully  pulpit and your agents, all of whom now speak with such a degree…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…about using taxpayer dollars to lower costs  for Americans over fueling the fear that persists in our cities. It is  about caring for our neighbors when they are sick over sending masked  agents to terrorize our communities. It really is that simple.\n\nChoose care over cruelty. I urge a ``no'' vote.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Secretary of Defense.\n\nSomeone made the remarks, Mr. Speaker, today that people were hidden,  there were hidden figures in American history. I know the message that  they are sending, referring to the movie ``Hidden Figures,'' the  African-American women who did the math to put man on the moon but  somehow were unceremoniously removed from all the accolades…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Maryland's Fifth District, who gave me a majority of  their votes 23 times.\n\nTo my wife, Dr. Elaine Kamarck, who has made my life whole and happy.  Thank you, Babe.\n\nAnd to God, for sending me down this road so many years ago that I  call the ``Road to Damascus.''\n\nI thank all of my colleagues--extraordinary people, decent people,  people whom their neighbors…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…bellies  hungry.\n\nIn my district, Mr. Speaker, 30,000 jobs are in jeopardy. I don't  want to hear another word from Republicans about people not wanting to  work when they are sending them to the unemployment line.\n\nMr. Speaker, this is a bad bill. Do not allow the people in my  district to be unemployed, hungry, and without the ability to live  their American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…into unnecessary emissions and energy costs at a time  when the planet and the American people cannot afford it. It also puts  us on a treadmill of litigation and uncertainty, sending us back  theoretically to a plan that was already adjudicated to be illegal.  Maybe Republicans are waiting for a new plan to come forward from the  Trump administration,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…resolution and recognizing Jewish American Heritage Month, we are not  just celebrating the numerous accomplishments and contributions that  Jews have made to our country, we are sending the message back, a  message that Jewish people have a place in America; that this is our  home as well; that our lives, that they have value and they have  meaning, just…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…human beings without  care. They are doing it, regardless of whether people are undocumented,  legal residents, or even American citizens.\n\nThey are splitting up parents by sending them to different detention  facilities and then making children navigate the funds for a lawyer and  basic survival.\n\nIf I cannot get answers as a U.S. Congresswoman, how…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…dangerous. To terminate TPS now, at       this moment of unprecedented crisis, would be to ignore       reality and abandon the moral and legal framework of TPS. We       would be sending children, mothers, fathers, workers,       students, and community members back to circumstances where       their safety cannot be guaranteed.\n\nIn addition, TPS termination…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…can't happen. It cannot happen. You are  literally, through passivity in this U.S. Senate, where we have the  option to act or we have the option to hide, the second option is  sending a direct premium increase to our families, up to $40,000 in a  year for people who make $80,000. So this happens, this is on us. If  this happens, it is on us.\n\nMr. WELCH.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…competitions, he knew when to guide or be a reassuring presence.\n\nAbove all, he was a man of deep principles and kindness.\n\nMr. Speaker, I and so many in my community are sending prayers to his  family and friends and all who had the privilege to know him.\n\nMay he rest in peace.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…preventing  the call for regime change, the consequences of which, if applied to  Iran, risk the total destabilization of the Middle East. The American  people are sick and tired of sending their children to fight and die in  war zones on the other side of the world with no tangible U.S.  interests at stake.\n\nAbdicating our constitutional responsibility by allowing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…object?\n\nAnd on the Republican side, every Senator said: Nope, good by me.\n\nAnd on the Democrat side, every Senator said: Nope, good by me.\n\nAnd so this is now passed, and we are sending it to the House of  Representatives.\n\nHere is the good news. With what we just saw now, the certainty that  we will see No Tax on Tips become the law of the land, I think,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…no more  men playing in women's sports; restoring America's leadership on the  world stage; rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing up for American workers; adding 345,000 new  jobs; securing billions of dollars in new investments in the United…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…promises from  the campaign trail? This is a welcome change. Donald Trump said that we  are going to bring America back by putting more money back in their  pockets, instead of sending it up here to Washington, D.C.\n\nHe promised a secure border. Mr. Speaker, there is a 99 percent  reduction in the number of people coming across the border illegally.  That…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693227/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Security colleagues on both sides  of the aisle as we work to advance over a dozen bipartisan pieces of  legislation to the House floor this week. As chairman, I look forward  to sending many more legislative priorities to the House floor.\n\nMr. Speaker, I urge support for H.R. 2212, and I reserve the balance  of my time.\n\nMr. GARBARINO. Madam Speaker, I yield…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…response to longstanding workforce gaps. It  is not simply service programs. They are workforce solutions.\n\nThat is why I have respectfully requested in a letter that I am  sending today that the Appropriations Committee and its Subcommittee on  Labor, Health and Human Services, Education, and Related Agencies  provide robust funding for AmeriCorps in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…consultatIon and coordination with Indian       Tribal Governments, including Alaska Native Tribes and ANCSA       Alaska Native Corporations, the record does not support that.       Sending one letter informing these stakeholders of a       rulemaking effort followed by a lack of adequate consultation       and doing so during an importance subsistence harvest…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and it is  our duty to adhere to the will of the people by swiftly passing this  bill and sending the SAVE America Act to President Trump's desk for  signature.\n\nMr. Speaker, you know me to be a data-oriented individual, so let us  review the numbers before us as we debate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…make the postponement of certain deadlines by reason of disasters  applicable to the limitation on credit or refund, and to take  postponements into account for purposes of sending collection notices,  as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1491\n\nBe it enacted by the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…were so, then where were those laws  under Joe Biden?\n\nSecond, even if their argument was true and the legislation was  entirely unnecessary, then why would they object to sending a strong  message around the world that terrorists will get no quarter here?\n\nMadam Speaker, if you have associated with Hamas, then you are  persona non grata in America,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…people, try and change our country into the country they came from,  have us pay for it, and then disrespect us while they are doing it by  killing our citizens and while sending our tax dollars to the terrorist  organizations in the country that they left.\n\nIt is unacceptable at any and every single level.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…dinner tables and a lot of children going to  bed hungry. Democrats have voted against reopening our government 13  times. Thirteen times they have voted to deny children food, sending  families to food banks instead.\n\nI am told that food banks will not be able to keep up. Federal  workers, single parents with young children, walking into empty food  banks.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…specific needs such as installation  resilience and NATO infrastructure commitments. As Russia continues to  wage an illegal war in Ukraine and threaten Europe, we should be  sending a clear sign that we stand with our NATO allies, allies who  have stood by us for decades. We are talking about infrastructure for  our troops who are over there, as well…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Maduro, with his arms  wrapped around you, or do you stand shoulder to shoulder to protect the  United States of America and our people from the people who are  murdering us and sending their drugs over? The choice is up to you.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Thune", "party": "Republican", "sentence": "…have  been hard at work executing the mandate we received from the American  people last November. We already have a number of accomplishments on  the list.\n\nWe got started by sending the Laken Riley Act to President Trump's  desk during his first week in office to keep criminal illegal  immigrants off our streets.\n\nPresident Trump signed the HALT Fentanyl…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}]