[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…jokes. I haven't asked much. I asked you guys  just to be funny, and you are not. You are really going to have to work  on that in life. I mean, you have got to have a sense of humor.\n\nBut what you lacked in humor, I was blown away by just how good  people you are, and this world is yearning for more good people.\n\nYou have seen this place split along…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…new  experiences, dedicating himself recently to a passion for international  travel. Among many things, he will be remembered for his care,  compassion, loving kindness, sense of humor, his unique laugh, and his  face full of freckles.\n\nCorey's circle of love extended to his beloved partner, Laurence  Jones; many aunts--including Carole (and husband Clayton),…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…legacy to a  history of American industry, immigration, and a resilience that Great  Falls represents.\n\nBill Pascrell deserves this legacy. He was a legacy. He had a great  sense of humor, and when he walked in, everyone knew he was in the  room. We miss him dearly here, and his name belongs in this place not  only in the official record, but in the very…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Doug today, I know plenty of people  who disagreed with him, but I don't know anyone that disliked him. When  you hear these qualities about his authenticity, his warm sense of  humor, just how relatable he was, that is all very, very true.\n\nI go back almost 20 years with Doug because we were in the State  legislature together. A lot has been said about…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…their  congressman and for their support, I will be forever grateful. One of  the things that I appreciate most about Councilman Hutchins is the fact  that he has wonderful sense of humor and the fact that you can almost  count on him to tell a ``good joke.''\n\nAs Councilman Hutchins begins his well-earned retirement, Vivian and  I join his family, friends,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…affectionately called him, was  someone everyone loved.\n\nMadam Speaker, you would see him in downtown Fort Worth, and you  would see him in Arlington holding court with his sense of humor.  Regardless of your background, Snake was someone whom you embraced. He  is going to be missed. He was figuratively and literally speaking a  towering figure in our community.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…a  colleague with whom you could disagree without being disagreeable. It  is a quality that Members should strive to emulate here.\n\nHe was a good man, friendly, with a sense of humor, a gentle giant.  Our deepest condolences are with his wife, Jill; their children; and  his staff. It always hurts to lose a friend and a colleague, but I know  that Doug's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698723/9999"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…lived.\n\nHe fought tirelessly for the farmers, the ranchers, and the  communities too often ignored by the coastal elites, and he did so with  candor and conviction and a sense of humor that made even the hardest  days feel better.\n\nDoug was more than a colleague. He was a friend. He was a brother.  His leadership, his wisdom, and his heart for service…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698721/9999"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…him, they understood  his unique love of nicknames, movie quotes, and NASCAR. They understood  his dislike of food waste, smartphones, and ketchup on hot dogs.\n\nDoug's sense of humor, collegial manner, and expertise will be sorely  missed. While he is no longer with us, Doug's significant contributions  to agricultural and rural policies will endure…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…been recognized by friends and colleagues for his  steadfast commitment to public service and his expertise in the  legislative drafting process, it is his unparalleled sense of humor  that truly sets him apart. Over the course of his nearly four decades  of service, the House saw a lot of change. Noah's ability to constantly  adapt and consistently…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "John James", "party": "Republican", "sentence": "Mr. JAMES. Mr. Speaker, I thank the gentleman from Texas whose  devastating good looks are only exceeded by his patriotism and sense of  humor.\n\nMr. Speaker, I rise today to advance a transformative vision for our  Nation's energy future through my bill, the Securing America's Critical  Minerals Supply Act.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…director, Mr. Matt Reed.\n\nMatt has been on my staff for 2\\1/2\\ years. During that time, he has  been a crucial member of my team.\n\nMatt has tremendous work ethic, an infectious sense of humor, and is  a friend to everyone in the office. From late hours in the D.C. office  to road trips throughout central Washington, Matt has been my megaphone  across three Congresses,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700048/recognizing-matt-reed"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rent-free in a friend's home, and inspired by  a then-up-and-coming Martha Stewart.\n\nWhat she lacked in resources, she made up for with resolve, talent,  and a sparkling sense of humor. Over the next four decades, Susan Mason  Catering became synonymous with silver service, culinary perfection,  and timeless Southern style. Whether planning wrap parties…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693702/susan-mason-savannahs-style-and-service-icon"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…was serious about policy, direct in his  approach, and deeply committed to the people he represented, but anyone  who has worked alongside Doug also knows he had quite a sense of humor.\n\nI learned that early on. Doug and I both did a lot of 1 minutes. He  used to intentionally leave this speaking podium raised up to above my  head to remind me of how…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698730/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…operations director, Alex Keledjian, for his 4 years of service in the  House of Representatives, and this is Alex's son, Anthony.\n\nAlex's dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and my office on track, smiling,  and teaching us Armenian history along the way.\n\nWhile he was working around the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia, and  other local charities.\n\nSam Asbury was a proud graduate of the University of Georgia and a  diehard Bulldog. He lit up every room with his smile and unique sense  of humor. No one knew of the pain and battles he faced daily.  Tragically, in 2020, Sam lost his silent struggle. His story is a    =========================== NOTE ===========================…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…a chaplain. He attended St. Ann Catholic  Church in Ridgecrest, California, and enjoyed serving meals and singing  in the choir.\n\nBruce will be remembered for his great sense of humor and his  generous heart. He was a faithful son, wonderful brother, and a fun  uncle to his nephews and nieces.\n\nHis personal relationship with Jesus Christ took him through…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…greatness of this country and about our tireless  work to improve the lives of the people he represented. For that  commitment, his kindness, his optimism and faith, and his sense of  humor, I and all of my many Republican colleagues will miss Doug  dearly. He was in every sense a giant among us.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698734/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…compounding, and a gift shop. The pharmacy is  known for its commitment to customer service and community focus.\n\nOverall, Mr. Chapman is remembered for his generous spirit, wry sense  of humor, keen insight, and love of all things mechanical. In fact, one  of his favorite pastimes was tinkering on engines, along with pulling  weeds, long conversations on the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…was so sudden that it  literally had been prepaid. It arrived, and we sat there thinking of  the person who had the best joke every week, who had a constant,  positive sense of humor, even about dire times.\n\nWe talked not long ago about how much he got done during the shutdown  and what it was like to actually meet with his constituents multiple  days…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698722/9999"}]