[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…unfortunately, Republicans have not shown  the courage yet on Trump's tariffs, just capitulation, as they do on so  many other issues.\n\nBy opposing my bill and preventing those sensible resolutions from  moving forward in the House, Republicans are allowing Trump to tax any  good from any country for any reason--no rules. And the only reason is  Trump doesn't…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…using cell phones and location data would  help alleviate the stress caused by irregular shuttles and the traffic  that is very unpredictable around the airport.\n\nThis is a sensible bill, Mr. Speaker, that would address important  quality-of-life concerns for a very critical workforce and, ultimately,  our national security when it comes to commercial…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…It is our duty to ensure that, regardless of the political climate,  science remains at the forefront of our Nation's progress and  innovation.\n\nSo, Mr. Speaker, I urge my sensible colleagues on both sides of the  aisle to support efforts that increase the resiliency of our Federal  science agencies in the face of these growing threats from the  administration,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…House.\n\nAnd we know that he doesn't represent America because we can do  things like test public opinion and polls. And I have a recent one here  that asks about some of the sensible solutions to the climate change  problem, to all the pollution spewing. Here is one: Carbon pollution  limits on big companies.\n\nObviously, Trump would do everything he possibly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, I rise to join my colleague Senator  Whitehouse, the ranking member on the Environment and Public Works  Committee and the foremost voice for sensible climate policies, someone  who for years has warned us of the approaching dangers of climate  change and today once again has demonstrated his great insights-- particularly…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Making these cuts is optional, and I am  asking my Republican colleagues to please vote no. We can do a lot  better with this legislation. Please--please--let us negotiate a  sensible resolution of this legislation.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…with a gimmicky bill that  they passed to create a false legislative day that never ends so that  they can't even invoke Congress' Article I trade authority and put some  sensible sideboards on this trade and tariff policy.\n\nIt is madness, and the gentlewoman is right. We are outraged.\n\nMr. HUFFMAN.  Castor), who represents the Gulf and may have some…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…governance, are relevant to a company's performance. Considering  whether a real estate investment will literally be underwater because  of sea level rise is not ideology. It is sensible for plan fiduciaries  to be permitted to consider such factors and to be able to adopt them  if they don't reduce investment returns. That is precisely what the  rule from…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Democrats have a proposal to bring the deficits back down under 4  percent. Bob Rubin and Larry Summers were the last ones who have done  it. Hakeem Jeffries is leading with a sensible proposal to lower  deficits.\n\nIf you care about debt in this country, if you care about our  grandkids  being burdened with debt, if you care about a bond market devastation,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693228/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Biden administration. They were to be found and removed and held  accountable for their conduct.\n\nNo matter where you are on the political spectrum, that mission  sounded sensible. Why would we ever allow those dangerous people in the  country either by accident or intention, and why wouldn't we do  everything we could to remove them?\n\nThe President…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…access to water, shaded or cool recovery areas, and training  that delivers information in a language and format that workers can  certainly understand. These are simple and sensible safeguards that  will save lives.\n\nAs the climate crisis accelerates, workers are increasingly at risk.  Heat stress is a predictable problem, but it is also a preventable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…majority  that is in search of not common ground and common sense but rather  extreme measures that divide and polarize the Congress and the people.\n\nOnce upon a time this was a sensible, bipartisan bill led by our  Democratic colleague, Val Demings from Orlando, Florida, who had been a  police chief. Her bill allowed Federal agencies to sell handguns that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…actions regarding Taiwan's status. It is important that this  body continue to stand up for our decades-long relationship as allies  and trading partners.\n\nThis bill is a sensible measure to warn China that the United States  is poised to act should it escalate its aggression toward Taiwan. If  China chooses to do so, the United States would be required…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…country. And if  anyone needs to be identified, it is these abusive thugs who are in the  Border Patrol, who are in ICE.\n\nIf Republicans can't come to the table on these very sensible  changes, then the violence we see happening around the country is going  to continue.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…goes on. And  an expansion of the child tax credit, an idea that has proven  successful--all that was sacrificed to give billionaires tax cuts  instead.\n\nIn the end, three sensible Senate Republicans looked at this ugly  betrayal of a bill and agreed they couldn't be part of the process. I  commend them. But, sadly, three votes on the other side of the…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…our country back from the left. It  will defund the wasteful government programs subsidizing illegal aliens  and provide President Trump with the very tools to solidify his  sensible border security initiatives.\n\nFor example, President Trump's budget would eliminate the shelter and  services program that facilitated swarms of illegal aliens into  American…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…appropriate  glidepath for the orderly phase-out of the tax credits.\n\nMany of my colleagues advocated pulling the rug out from wind and  solar projects, but I worked to find a sensible compromise. Based on  that compromise, the law's December 31, 2027, placed-in-service  requirement for wind and solar facilities is only effective for  ``facilities the construction…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…recommend,  personally, that they send a rescissions package on a monthly basis.\n\nI am going to be very interested to see how our Democratic colleagues  react to some of these sensible spending cuts or rescissions. So far,  what they have done is they have been in complete opposition to  anything and everything that the Trump administration has proposed,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…Committee for working with me in bringing this bill to the  House floor today.\n\nMr. Speaker, I ask my colleagues on both sides of the aisle to vote  ``yes'' on this practical and sensible piece of legislation.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692066/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…and take care of their crony capitalists.\n\nRetirement plan sponsors have a duty to prioritize financial returns,  ensuring Americans' hard-earned savings are invested in a sensible  manner. The Protecting Prudent Investment of Retirement Savings Act  delivers a significant win to retirees across the Nation, and I  strongly urge my colleagues on both…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…future attacks on the homeland by strengthening our counterterrorism  efforts.\n\nMr. Speaker, I thank Mr. Correa for his support, and I urge my  colleagues to support this sensible legislation.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, we have a duty to be vigilant about potential terrorist  threats to the homeland. This bill ensures that the Department…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…acres were closed to new  infrastructure, with development across millions of additional acres  subject to requirements for no surface occupancy, seasonal timing, and  other sensible protections, but then the 2022 plan rejected that,  closing off 8.3 million acres to any new infrastructure.\n\nThe 2020 plan was well received by most Alaskans because it was…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the  veterans. Apparently, he is only for the veterans today because the  veterans of tomorrow will not have the program because it will break  the bank.\n\nThis is actually sensible. It is a way that we can do this. We can  make sure our veterans are taken care of. We need to pass the bill that  we were just discussing, which is H.R. 1228.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…visitor wants to  come buy some ivory earrings in Alaska by one of our great Alaska  Native artists and then bring them home to a State that has a ban on  ivory, which is not sensible--again, walrus ivory, not African elephant  ivory--we want to be able to say at the Federal level that we should be  able to do this.\n\nSo that is what my ARTIST Act does.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…reduced its emissions  like the United States, and we do not need overly restrictive  regulations to continue this.\n\nGiving our private sector the ability to innovate on a sensible  timeline is a different approach than the inflexible, top-down mandate  that became accustom over the past 4 years.\n\nThe good news is, every Member of this Chamber now has…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…Supervisor Nelson, and also my  colleagues on the other side for their support and their leadership.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this sensible solution.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that Sam Liccardo  and I have introduced is the only one that actually does not increase  the deficit and, indeed, actually achieves savings for taxpayers.\n\nWe do this with sensible cost controls, income caps, to make sure  that the tax credits go to those who truly need it. You will still be  eligible as long as you are a family of four with an income…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…priorities,  supports the programs our communities care about, and reduces the  bureaucratic overreach of the prior administration. This bill does just  that, and it makes sensible cuts across 28 bureaus and agencies and  closing one agency that has completed its mission.\n\nThoughtful cuts were made to the Department of the Interior,  resulting in a nearly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…and protein products for the military from  feeding our men and women. How disgusting does that sound?\n\nWith a national debt of over $37 trillion, we can't afford to litter  sensible appropriation bills with wasteful spending.\n\nAn October 20 press release revealed BioMADE received $87 million in  Federal dollars under the Biden-Harris administration to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion, that would solve a lot of this debate, wouldn't it? We can  actually get those types of bond rates if we demonstrate to the world  that we are creditworthy, disciplined, sensible, seeing long term, and  actually understanding the honesty of our demographics.\n\nInstead, a bunch of the brain trusts here in Washington spend their  time attacking Moody's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}]