[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…U.S. Senator for the State of California, Senator  Padilla, slamming a woman to the ground at 26 Federal Plaza in front of  her young girl, not representing or respecting sensitive locations like  places of worship, houses of worship--this is the State of America  today.\n\nThis is the Trump dictatorship. It is not tomorrow. It is not next  week, next…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…be an entire person-- barely just more than a half a person--three-fifths of a person is what  Black people were counted as, then it is understood why many of us are  very sensitive to efforts to attack things like diversity and efforts  to attack things like equity and inclusion, because we know that we  come from a culture and from a people who had…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Social  Security Administration, threatening to close field offices, a website  crashing several times in March, a plan to end paper checks as an  option, and DOGE accessing sensitive data systems.\n\nAll of this puts people at risk, and the impact will be clear. It  means longer waits and travel times to get the benefits people have  earned, putting those…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…security needs, as well.\n\nThere is also a very important component on countering UAS  domestically. The threat the drones pose to many of our military  installations and other sensitive areas in the country is a real  problem. This bill takes a step toward trying to address that. I am  also very pleased that this bill does a meaningful job of trying to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…wrong dosage.\n\nAnother person who I met with asked the officer, who had accompanied  them to a health appointment in the community, to step out of the room  while he received sensitive medical information. The officer refused.\n\nThis administration's reckless dehumanization of our immigrant  neighbors is horrific, and it is not just immigrants who they are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699659/horrific-ice-abuses"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…We had a drought. We had early  floods. And now we have these tariffs that are increasing the input  costs. I know, Mr. President, as a Senator from Indiana, you are very  sensitive to the challenges that our agriculture economy and our  farmers face.\n\nThings were bumping along, and then President Trump just recently  announced an additional 10-percent…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…workers in our health  Agencies. This is not efficient, and it is not a profile in competent  leadership. What it is, instead, is absolutely dangerous, and it is  putting sensitive information and decisions between life and death in  the hands of grossly unqualified people.\n\nSecretary Kennedy's pledge to make America healthy again is another  promise…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…percent. That means it is  effectively unavailable nearly one-half of the time that it is needed.\n\nAs noted by the North American Electric Reliability Corporation,  large voltage-sensitive loads like data centers require flexible,  responsible grid solutions, not slow-ramping generators that can take  up to 12 or more hours to come online. Coal plants are inherently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…threat or has done something illegal; and, second,  doing so would let bad actors know who DHS is on the lookout for. That  information, in other words, is law-enforcement sensitive.\n\nH.R. 275, Representative Marjorie Taylor Greene's tipping off  terrorists act, requires DHS to make public information it has long  deemed law-enforcement sensitive. That…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…President, and attempting to strip States of  these rights is flagrantly illegal and unconstitutional.\n\nPresident Trump's lackeys have attempted to bully States into handing  over sensitive and personal information contained within State voter  rolls. DOJ has requested information or meetings about election  administration from States and has demanded 40 States--40…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…staff; terminated  programs that are key to ending housing discrimination, such as  Affirmatively Furthering Fair Housing and the Equal Access Rules;  compromised Americans' sensitive data by granting Elon Musk's so-called  DOGE personnel with the agency exposing victims of domestic violence  and/or assault; reported plans to launch dangerous blockchain…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…policies that  expand our Nation's carbon pollution and expose our communities to  future disasters. Not only would this legislation grant access to one  of the most ecologically sensitive and, yes, incredibly difficult  regions to drill but it would reverse significant strides that  Democrats have made to protect lands that Tribal Nations have occupied  since…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…people in our  State that were legal, born in our State, have passports. They wouldn't  even listen to them when they told them as they threw them into a car.  We must protect sensitive locations, and the racial profiling must end.\n\nToday, a number of our colleagues, including myself, voted against  continuing to fund ICE. Budget shows our values. That extra…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…few  years, I am part of the so-called Gang of 8. If we don't do our jobs,  nobody is watching all of these intelligence Agencies.\n\nEven more damaging, we have seen highly sensitive intelligence  declassified and released, clearly for political purposes, without  proper coordination with the Agencies responsible for protecting  sources and methods--that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…attention much more  available, they would not get on a chat and have this be exposed to the  public. There was no desire that it be exposed to the public. They said  it is sensitive information. It is sensitive because it is classified  information that has not been declared such because it would inculpate  the Defense Secretary.\n\nSo you have the Vice…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…ambitious one. It doesn't  come without risk. And it is worth making the clear case to the  country.\n\nI appreciate the administration's willingness to brief Senators on  the sensitive details of a tactical victory. But they owe it to the  American people--and, frankly, the long-suffering people of Venezuela-- to lay out the path to strategic success in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…information, unless authorized under Section 8 of S. Res. 400       of the 94th Congress, as amended, or Rule 9.      Rule 9. Procedures for Handling Classified or Committee Sensitive                                  Material\n\n9.1. Committee staff offices shall operate under strict       security procedures administered by the Committee Security…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…we know that a baby's heartbeat starts at just  about 22 days after conception, their unique fingerprints are formed at  12 weeks of gestation, and by 15 weeks, the baby is sensitive to pain.  That is why I have cosponsored the Life at Conception Act, which  legally recognizes the life and value of an unborn child regardless of  their size or level of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…House Armed Services  Committee and the Foreign Affairs Committee were set to take up these  inquiries about the Secretary of Defense using unclassified Signal  chats to share sensitive information about military strikes with his  family, his personal lawyer, and a journalist.\n\nThey don't want to vote on Signalgate, so they are rigging the rules  to block…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…infrastructure supports jobs. It supports trade and economic growth  across the country.\n\nThere is also a serious national security component to this. Undersea  cables carry sensitive government and military communications. Delays  in installing, repairing, or maintaining this infrastructure create  real vulnerability to our national security. Even today,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…others across the  country, safe and efficient deicing operations are essential to keeping  passengers, crews, and cargo moving during winter months.\n\nAircraft are uniquely sensitive to any amount of ice and snow that  accumulates on the airframe, causing irregularities that add weight,  interrupt airflow, and can come loose during flight, potentially…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Topeka, Kansas, operating the RB-50  Stratofortress and later the RB-47E Stratojet. During the Cold War,  Airmen of the 55th Wing routinely conducted high-risk and politically  sensitive reconnaissance missions along the frontiers of the Soviet  Union, with frequent and sometimes deadly interactions with Soviet  fighter aircraft.\n\nIn August of 1966, the 55th…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Interior's own orders for meaningful       consultation.\n\nThe 2020 Coastal Plain Oil and Gas Leasing Program (2020       program) included robust protections for wildlife and       sensitive habitats and was supported by the elected       leadership from the North Slope and Kaktovik. The development       of the 2020 program followed a transparent process that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…our trusted partners.\n\nH.R. 4233 addresses these challenges by facilitating quicker, more  secure transfers of defense materials while preserving critical  protections for sensitive technologies.\n\nSpecifically, it expands the expedited licensing to include  retransfers, removes the congressional notification requirement on  certain AUKUS transfers, requires…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…system with similar or advanced       capabilities.\n\n7. A determination has been made that Australia can provide       substantially the same degree of protection for the sensitive       technology being released as the U.S. Government. This sale       is necessary in furtherance of the U.S. foreign policy and       national security objectives outlined…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that Australia can provide       the same degree of protection for the sensitive technology       being released as the U.S. Government. This proposed sale is       necessary in furtherance of the U.S. foreign policy and       national security objectives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…for foreign theft, espionage,  and influence.\n\nIt is our responsibility to safeguard them from malicious actors and  prevent the unauthorized access to, or disclosure of, sensitive  information.\n\nThis is why I reintroduced H.R. 901, the Research Security and  Accountability in DHS Act. This legislation requires the Science and  Technology Directorate…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…of sextortion against our Nation's children is  troubling. Sextortion is a form of exploitation that occurs when  someone threatens to distribute another person's private, sensitive  material unless that person complies with a demand for additional  sexual content, sexual favors, or money.\n\nIncidents of sextortion have increased dramatically in recent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…and more Americans are having their  identity stolen. It is a sad fact. However, actors are becoming more  sophisticated. They are using new technology to gain access to  sensitive information. Just last year, there were over 3,000 separate  data breaches that were reported, including many leaks involving stolen  Social Security numbers.\n\nCurrently,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…public.\n\n(C) Accessability.--The authorization portal shall be       accessible to Congress, Federal agencies, and the public,       with appropriate safeguards to protect sensitive or       classified information and information restricted by user       type as appropriate.\n\n(D) Public accessibility.--To the extent practicable and       consistent with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]