[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Office of the Presidency, and the way  that they are doing this is extremely alarming to me and my fellow  Democrats.\n\nNow, let me go through this timeline once more.\n\nIn September 2024, on the campaign trail, the Trump family launched  World Liberty Financial, which they have described as a decentralized  finance, or DeFi company.\n\nOn January 17, 2…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…immigration system, and we created the Department of Homeland Security.  Even then, we did not amend the Immigration and Nationality Act to  specifically reference the events of September 11 or to bar the  individuals involved in the planning or commission of those outrageous  terror attacks from entering or remaining in the United States.\n\nThe reason for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…analysis has shown an overwhelmingly successful program  with an outsized return on investment for taxpayers.\n\nUnfortunately, the SBIR and STTR programs are set to expire on  September 30. If these programs are allowed to expire, agencies would  lose the ability to issue new awards, cutting off a vital source of  early-stage funding for small businesses.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…did this once before. In 2019, he funded SNAP during his last  shutdown. Back then, Trump kept SNAP funded. This time, he is  deliberately pulling the plug, even though in September he said he  would fund it and could fund it, independent of any shutdown.\n\nTrump is weaponizing hunger. He is using kids and parents as pawns.  Donald Trump is a vindictive…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…about. There have  been four lethal strikes against boats in the Caribbean. The  administration wrote us a letter--wrote this body a letter--about what  they were doing in September. They said they considered themselves to  be in a ``non-international armed conflict''--that means a war--against  a secret list of ``designated terrorist organizations.''…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…requirements for him to do  so. By not following a statutory requirement to submit these EXORDs to  Congress, Secretary Hegseth and the President are breaking the law.\n\nOn September 2, the U.S. military carried out its first strike,  killing 11 individuals on an alleged drug boat. Additional strikes  continued throughout the fall and winter, and to date,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Authorizations for  Use of Military Force (AUMF) related to U.S. military actions in Iraq,  the bill does not repeal the 2001 AUMF that was passed following the  terrorist attacks September 11, 2001. I have long supported a repeal of  the 2001 AUMF because it was intended to authorize military action  against Al-Qaeda in Afghanistan, a mission that has long…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…achievements are matched by his academic  accomplishments, having earned advanced degrees in Military Operational  Art and Science as well as National Resource Strategy.\n\nOn September 30, 2025, Colonel Halasi-Kun completed his final flight  in the F-15C Eagle, marking both the end of his own flying career and  the conclusion of the F-15 mission at Barnes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…months later, a combined Defense and Labor-Health and Human  Services bill passed. It passed the Senate; it passed the House; and it  was signed into law by President Trump on September 28--just days short  of the expiration of fiscal year 2018. It wasn't the only pair of  bills. Several other appropriations bills were enacted prior to October  1 also.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…All-Holiness Bartholomew I, who is the  spiritual leader and the Primus inter Pares (First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people. This  September, His All-Holiness Ecumenical Patriarch Bartholomew visited  our Nation's capital, continuing his longstanding practice of meeting  with the President and engaging with Members…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697433/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-of-constantinople"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…benefits  for veterans exposed to burn pits, Agent Orange, and other toxic  substances.\n\nTim is also passionate about veteran suicide prevention, and even  helped advocate for September 22 to be recognized as Veteran Suicide  Awareness and Prevention Day in Ohio.\n\nWith this award, and all the hard work that came before it, Tim is a  shining example of why…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bill from  the D.C. Mayor, the entire D.C. Council, and the D.C. Attorney General,  all of whom were elected by D.C. residents.                                                September 10, 2025.      Hon. James Comer,      Chairman, House Committee on Oversight and Government Reform,           Washington, DC.      Hon. Robert Garcia,      Ranking Member,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Wyden                               NOT VOTING--3       Coons      Cruz      Moran\n\nThe resolution (S. Res. 412) was agreed to.\n\n(The resolution is printed in the Record of September 19 (legislative  day, September 16), 2025, under ``Submitted Resolutions.'')", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696009/en-bloc-nominations"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Ms. HIRONO. Mr. President, earlier this month, the State of Hawaii  officially designated September 2025 as Hawaiian History Month.  Designated on September 2, 2025, the 187th anniversary of the birthday  of Hawaii's last ruling monarch Queen Liliuokalani, Hawaiian History…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…court. And in court, the Federal judge said: You can  put that project back to work. The stop work order from President Trump  is invalid.\n\nThe judge made that decision on September 22. The Trump  administration had 60 days to appeal. It did not appeal. We got to  November 21, the last appeal day, no notice of appeal was filed. The  matter was settled;…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and deductibles, or repayment of APTC if income or       other eligibility was misrepresented.\n\nWe previously reported that APTC is at risk of fraud. For       example, in September 2016, we found that federal and state       marketplaces approved coverage for our fictitious applicants.       Nearly all of these fictitious applicants remained covered…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…join me in supporting it  today.\n\nHouse of Representatives,                                  Committee on Natural Resources,                                  Washington, DC, September 3, 2025.      Hon. Glenn Thompson,      Chairman, Committee on Agriculture,      Washington, DC.\n\nDear Chairman Thompson: I write regarding H.R. 1045, the       ``Utah Wildfire…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Afghanistan, 43 of their soldiers lost  their lives fighting alongside American soldiers, defending our freedom  and holding the Taliban and al-Qaida responsible for the events of  September 11.\n\nForty-three soldiers losing their lives--there are only about five or  six NATO countries who lost more. And what is remarkable about this is  this is a country of about…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…allocation of resources. By securing placements at  facilities like Pasco Hope, the team supported individuals and families  along a pathway to rebuild their lives. Between September 28 and  October 18, 2024, the team managed an overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…avoid  a shutdown and give the American people assurance that the government  will be functional, operational, and working in a bipartisan, bicameral  process between now and September 30 of this year.\n\nMr. Chair, I urge the passage of the legislation before us, and I  yield back the balance of my time.\n\nMr. COLE. Mr. Chair, I move that the Committee do…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the       Whole House on the state of the Union for consideration of       the bill (H.R. 7148) making further consolidated       appropriations for the fiscal year ending September 30, 2026,       and for other purposes. The first reading of the bill shall       be dispensed with. All points of order against consideration       of the bill are waived.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…do, that that is what the Democrats offer.\n\nEighteen of the twenty-four fake enrollees--this is even worse--were  still receiving taxpayer-funded subsidies as recently as September.\n\nNow, remember, September--the month of September, end of September-- that is when the Democrats shut down the government of the United  States. Why? Because of these COVID…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, I rise today to acknowledge a special  anniversary in Alabama's 4th Congressional District. One hundred years  ago, on September 12, 1925, Wilson Dam began commercial operations. As  a part of the Tennessee Valley Authority's network of hydroelectric  dams, Wilson Dam supports TVA's mission of providing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…(d) of section 7616 of title 38, United States Code, as added       by subsection (a).\n\n(2) Termination date.--The termination date specified in       this paragraph is September 30, 2027.       SEC. 3. PROHIBITION ON SMOKING IN FACILITIES OF THE VETERANS                     HEALTH ADMINISTRATION.\n\n(a) Prohibition.--Section 1715 of title 38, United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…different family in China. The latter is the case for the  Robinson family of Iowa.\n\nDoes that sound like China always honors and delivers what it  promises? I think not.\n\nIn September of last year, I wrote to the Chinese Ambassador to the  United States, outlining my concerns about China's termination of its  intercountry adoption program and urged China…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Bart Brockbank. Despite their loss in the championship, they  played admirably throughout the entire season, even giving Corner  Canyon their only loss of the season back in September.\n\nI congratulate the teams, the coaches, and the schools. They  certainly make Utah proud.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of ``inciting       ethnic hatred and ethnic discrimination'';\n\n(B) Dr. Gulshan Abbas, a retired medical doctor and Uyghur,       who was wrongfully detained in the XUAR on September 11,       2018, and unjustly sentenced to 20 years in prison in       retaliation for her sister's advocacy for Uyghur human rights       issues; and\n\n(C) Kamile Wayit, a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interesting. Increase in monthly costs in  Arizona, and we thought we would do a snapshot. I am blessed that I  represent the Phoenix, Scottsdale area. So between January 2021 to  September 2021, so we are actually doing the same snapshot of time, if  you lived in the Phoenix area, you functionally lost $1,597 to  inflation. That is for the average family.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "John Thune", "party": "Republican", "sentence": "…not been daunted. We have just kept  plowing through confirmations, racking up an impressive number of hours  in session and a historic number of votes in the process.\n\nIn September, we took steps to restore Senate precedent on largely  noncontroversial Presidential nominees to ensure that no other  President has to face the kind of petty partisanship…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. EXTENSION OF SBIR AND STTR AUTHORITY.\n\n(a) SBIR.--Section 9(m) of the Small Business Act (15       U.S.C. 638(m)) is amended by striking ``September 30, 2025''       and inserting ``September 30, 2026''.\n\n(b) STTR.--Section 9(n)(1)(A) of the Small Business Act (15       U.S.C. 638(n)(1)(A)) is amended by striking ``through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}]