[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…County's own, Brigadier General Frederick R. Lopez.\n\nMy bill would name the South Patterson Avenue post office in  recognition of General Lopez's distinguished legacy of service and his  dedication to our country, serving in the United States Marine Corps  for over 30 years, both in Active Duty and the Reserves.\n\nGeneral Lopez was born in Santa Barbara as the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…care.\n\nOur community appreciates their ongoing efforts to keep us safe and  supported.\n\nI thank the Stickney Police Association for their unwavering  commitment to service and their dedication to our community and each  other. Congratulations on their centennial celebration.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690438/recognizing-the-stickney-police-association-100th-anniversary"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…through their food pantry  that nourishes those in need or through their dedication to spiritual  learning and growth.\n\nThe 12th Congressional District honors their service and dedication  to creating a place of friendship and learning for our community. I  thank them for being a guiding light rooted in faith and service to  all.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Mayor William  ``Bud'' Starker for his years of public service and dedication to the  City of Wheat Ridge.\n\nAs a more than fifty year resident of Wheat Ridge, Mayor Starker has  long been a pillar of the community. As both a city councilor and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696268/recognizing-mayor-bud-starker"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…transportation and food aid, and free answers to  medical questions. The church's continued service to our community  represents the very best of Oregon's spirit of commitment, service, and  dedication.\n\nFirst Presbyterian Church of Ashland's impact extends far beyond just  the people they have directly helped; it ripples outward to make Oregon  a better place for…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693320/recognizing-the-150th-anniversary-of-first-presbyterian-church-of-ashland"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…regional public safety is  invaluable. On behalf of the city of Fredericksburg and its residents,  I extend our deepest gratitude to Chief Layton for his unwavering  service and dedication. His impact on our community will be felt for  years to come.\n\nMr. Speaker, I am honored to congratulate Chief Layton on this well- earned moment and recognize him…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697520/recognizing-chief-brian-layton"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…lives on the line  for the benefit of the community.\n\nAs a former volunteer firefighter myself, I thank the crews operating  out of the new Aldie Fire Station for their service and dedication to  our community.                   Effects of Big, Ugly Bill on Virginians\n\nMr. SUBRAMANYAM. Mr. Speaker, the big, ugly bill the House passed is  actually far worse…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…nominated, General Brown had logged in over 3,000 flying hours,  including 130 combat hours and command of the Pacific Air Forces for  the U.S. Indo-Pacific Command. His service and dedication are  impeccable.\n\nMost galling is that the person President Trump nominated is  affirmatively less qualified than General Brown was when he was  nominated. This person…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…expanded to include an as-is lot that essentially  created Goodwill Industries throughout the country.\n\nPlease join me in thanking Goodwill Industries for 100 years of  service and dedication to our community and to our Nation.             Congratulating Students of Magnolia Science Academy\n\nMr. CORREA. Mr. Speaker, I rise today to congratulate the students…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…of Washington. Mr. Speaker, I rise today to congratulate  Linda McCarthy on her retirement from Mt. Baker Planned Parenthood and  thank her for her many decades of service and dedication to the people  of Northwest Washington.\n\nSince 1977, Linda McCarthy has been an advocate for women's health at  Mt. Baker Planned Parenthood, starting as a secretary…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…on Army Aviation and all who have served alongside him.\n\nI would like to congratulate Colonel Richard Tucker on his well- deserved retirement and thank him for his service and dedication to the  United States of America.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Ms. Kelly Botti, a respected leader, advocate, and CEO of Trumark  Credit Union, whose birthday on November 3rd provides a fitting  occasion to honor her outstanding service and dedication to our  communities.\n\nBased in the Greater Philadelphia region, Ms. Kelly Botti has built a  distinguished career marked by integrity, compassion, and an unwavering…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Honoring the Life of Joseph Rylon Wills, Jr.\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Mr. Joseph Rylon Wills, Jr., a man of faith, service, and dedication.\n\nBorn in 1957 in Plant City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment to faith…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Southeast High School.\n\nOn behalf of the people of Florida's 16th District, I congratulate  each of these outstanding educators and offer my sincere appreciation  for their service and dedication.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…highest recognition. Yet, what  makes this occasion truly special is not only the years Mr. Good has  lived, but also the example he has set for all of us through his  service, dedication, and lifelong commitment to faith, family, and  community.\n\nMr. Speaker, it is my distinct honor to recognize Edmund Good on the  occasion of his 100th birthday. His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695832/recognizing-edmund-good-on-the-occasion-of-his-100th-birthday"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Chief Master  Smith on his retirement upon more than 38 years of service to our  Nation in uniform--26 of those in the Pennsylvania Air National Guard.  His tireless service and dedication to his fellow Airmen and the United  States of America set the standard by which we all should be judged.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Bank\n\nMr. COMER. Mr. Speaker, I rise today to recognize Terry Forcht,  Forcht Group of Kentucky chairman and CEO of the Forcht Bank, for an  impressive 40 years of service and dedication to communities across the  Commonwealth, including in the First Congressional District.\n\nThe core banking principles of Forcht Bank are respecting the  customer, offering…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…generations to pursue the  American Dream right here in Texas.\n\nOn behalf of Texas' 14th Congressional District and this great  Nation, I want to thank Dr. Johnson for his service and dedication. His  hard work and vision set an example for all leaders.\n\nI congratulate Dr. Johnson on his well-earned retirement. May it  bring him the rest and reward he so richly…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Today, we honor her in return for all she has done for the  community. Warminster Township, Bucks County, and the Commonwealth of  Pennsylvania are better because of the service, dedication, and  integrity that Judy Hoover has brought to every role she has held. May  we wish her continued success as she remains engaged in the civic life  of her community.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "John Carter", "party": "Republican", "sentence": "…privilege to present a  Congressional Veteran Commendation to Lieutenant Colonel Barbara  MacMillan, U.S. Army, Retired. Her life and career reflect hard work,  selfless service, and dedication to her Nation and Central Texas.\n\nLTC MacMillan served from 1976 to 1999, amassing experience at Fort  Liberty, West Point, Fort Cavazos, and others. As a 1st Lieutenant…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I am honored to take the opportunity today to  recognize members of the Chriscoe family for their outstanding  generosity, service, and dedication to their faith. I had the pleasure  of meeting the Chriscoes during their visit from Summerfield to the  Capitol and was amazed by their commitment to using their…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700093/recognizing-members-of-the-chriscoe-family"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Chief  Administrative Officer, and the Inspector General. Their long hours,  hard work, diverse skills, and team spirit are invaluable, and their  years of unwavering service and dedication set an example for their  colleagues and raise the bar for those who will follow in their  footsteps. I applaud all our honorees, and I am proud to stand before  you…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…I see them: Thank you for your service,  and I am not for defunding the police.\n\nTo our law enforcement officers nationwide: Thank you for your  sacrifice, your service, and your dedication.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to honor a man whose lifetime  of service and dedication to Cass City has left an indelible mark on  our community. It is with great admiration that I recognize James E.  Baker, II, as the 2025 Cass City Citizen of the Year.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…City  Builder award, and the Agency Best Practices award from the Celina  Police Department and Fire Department. I would like to thank Mark for a  lifetime of public service and dedication to our community.\n\nIt is an honor to bestow Mark with the Patriot Award for his  exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}]