[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Record the names of the  following individuals:\n\nElly Doyle Special Recognition: Cynthia Glakas, Paul Gross,       Brian Keith, and Christina Tyler Wenks.\n\nElly Doyle Park Service Award: Tim Bowers and Carolyn J.       Gamble.\n\nHarold L. Strickland Partnership and Collaboration Award:       Marc Kohn.\n\nSally Ormsby Environmental Stewardship Award: Sara…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…it is my distinct honor to recognize Annie  Watson as the 2026 recipient of the Maine Department of Agriculture,  Conservation and Forestry Commissioner's Distinguished Service Award.  This recognition honors Annie's remarkable leadership and service in  Maine's agricultural community.\n\nSince opening an organic dairy farm in Whitefield with her husband,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of Distinction Awards;\n\nAlan R. Gray, Jr., Esquire, Exchangeite of the Year;\n\nYosef Unger from the San Souci Rehabilitation and Nursing Center  received the Distinguished Service Award;\n\nAnn Muro, the longtime president of the Exchange Club of Yonkers,  Outstanding Leadership and Community Service Award.\n\nAll of these individuals deserve our respect and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697851/finding-solutions-to-bridge-strikes"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of hope and resilience;       and\n\nWhereas, Apostle Dr. Dana Carson was recognized by       President Barak Obama and was bestowed the Lifetime       Achievement Call to Service Award, was honored as one of the       Top 50 influential Leaders Worldwide in Pentecostalism and he       is an active member of Kappa Alpha Psi Fraternity, Inc.\n\nNow, therefore,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Mathematics: Eamon O'Leary, South Lakes High       School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service Award: Brian Bond\n\nService Pins: Gerald Hamilton, 55 Years; Howard Foard Jr.,       50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years;…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Across all ages, citywide suicides have decreased by 50  percent. That is lifesaving work. It is being recognized, too. Joliet  recently received the Congressional Fire Service Award for Excellence.\n\nI hope to support this effort in any way I can. Illinois recently  received Federal approval to use Medicaid to cover preventive mental  health services…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…throughout  the region.\n\nMs. Wilson's many contributions to public service have been  recognized throughout her career, including receiving the Katherine  Hanley Public Service Award for her extraordinary impact on Fairfax  County and her dedication to improving the lives of others, and  Leadership Fairfax's Non-Profit Leadership Award for her tireless…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Community Advisory Panel, Saint  Thomas More Parish, and more recently, Gerard was honored for his  service by being presented with the 2025 Mel and Jean Carnahan Public  Service Award, which recognizes individuals who have dedicated their  lives to serving the public. Former members of this esteemed body,  including Representative Russ Carnahan and Representative…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…important  resources to communities in need during the COVID-19 pandemic. His  service has earned him several honors, including the REALTOR Spirit  Award in 2022, Community Service Award in 2023, and COVID-19 Hero  Award. He has also been named among Schneps Media's Queens Power List  and Kings of New York. A proud New Yorker and son of Nepali immigrants,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public service didn't end after the uniform came  off, though. His second mission serving our next generation began in  the Monrovia Unified…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…spent  mostly on the ground supporting those who do fly. Those contributions  to her industry have been recognized by the high honors of the  industry's ``Distinguished Service'' award and its ``Distinguished  Stateswoman in Aviation'' award.\n\nMary's contributions are aptly described as ``the wise, trusted  relational bridge to many and varied aspects…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Honoring Marlee Lauffer\n\nMr. McCLINTOCK. Mr. Speaker, on May 17, the College of the Canyons  Foundation will honor Marlee Lauffer with the 2025 Silver Spur  Community Service Award in recognition of her longtime philanthropic  work.\n\nI first met Marlee as a high school student leader in Tustin, and she  was my first and only choice as chief of staff…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…receiving many awards  and acknowledgements including his induction into the Florida 4-H Hall  of Fame, National FFA Honorary American Degree, Florida Farm Bureau  Distinguished Service Award, Honorary State FFA American Degree,  Partners in Education Award, Certificate of Appreciation for Commitment  to Orange County Public Schools, and the Jefferson Award.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…officer, Gene  Goldsberry, was tragically killed. Deputy Marshal Beam and three of his  fellow marshals were recognized for their heroism with the Director's  Distinguished Service Award.\n\nServing in law enforcement and the U.S. Marshals Service is a  selfless calling, and for the last 34 years, Craig Beam has done it  effortlessly. Not many people openly…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Editorial Board, Board Member of the Lee-Russell  County Council on Aging, Active with People of Action for Community  Enrichment and recipient of the Arthur Hill Community Service Award  (2023).\n\nMr. Payne retired from the City of Opelika Engineering Department  (1990 to 2000) after previous employment with the Augusta Environmental  Company (1981 to 1989)…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…for the Texarkana Chamber of Commerce, and  currently as Chair of the Red River Credit Union Supervisory Committee.\n\nIn 1986, Dennis was awarded the Outstanding Community Service Award  by the Army and later received the Department of the Army Meritorious  Civilian Service Award.  While Dennis has been recognized with numerous distinguished service  and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…members.\n\nHe received the Purdue University College of Veterinary Medicine's  Distinguished Alumnus Award in 2001 and the American Veterinary Medical  Association Meritorious Service Award in 2022, which recognizes a  veterinarian who has brought honor and distinction to the veterinary  profession.\n\nIndiana is proud to be the home for Dr. Scamahorn, and I…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…commitment to the network's mission.  Cindy's guidance has empowered both her team and the entrepreneurs that  they serve.\n\nJeanne Best received the 2025 Administrative Service Award for her  excellence behind the scenes, ensuring operations run smoothly.\n\nAleshia Marshall earned the highest honor in the SBDC system: The  2025 State Star Award, recognizing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…who were selected this year by an independent committee  comprised of a cross section of current and retired fire and rescue  personnel living in the district:\n\nAssociate Service Award: Adam Nover of Manatee County       Department of Public Safety.\n\nDedication and Professionalism Award: Firefighter Rob Day       of East Manatee Fire Rescue, Firefighter/Paramedic--Company…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Congratulating Dave Preisler\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Mr. Dave Preisler  on receiving the Minnesota Pork Board's Distinguished Service Award.\n\nFrom a childhood in 4-H and FFA to a 28-year career in the pork  industry, Dave has dedicated his life to Minnesota agriculture. His  expertise, compassion, and ability…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Celina City Council  and Celina Economic Development Corporation Board. For her outstanding  contributions, Carmen has received the City of Celina's Distinguished  Public Service Award, the Governor's Recognition Award, and the State  of Texas' Certificate of Appreciation. I am pleased to commend Carmen  for her dedication to serving and representing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Director of Public Safety on January 1, 2020.\n\nThroughout his outstanding and tireless career, Chief Kingsborough  was recognized by Middlesex Township with an Exceptional Service award,  a Medal of Honor, a Purple Heart, 2 Meritorious Service awards, 2  Outstanding Arrest awards, an Outstanding Community Service award, 2  Medals of Valor, and a Silver…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Speaker, recognized by peers and leaders alike, Mrs. MacGibbon  received the Congressional Veteran Commendation Award from Congressman  Sam Johnson in 2017 and the Ray Colvin Service Award from the West  Point Society of North Texas in 2023.\n\nCaptain MacGibbon's legacy of service reaches well beyond her  professional achievements. She met her late husband,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…dedication has been recognized through multiple awards, including  the USPS Outstanding Supervisor Award from the Coppell Post Office in  the spring of 2022, the USPS Customer Service Award from the Consumer  Advocate Headquarters in September 2022, and the USPS Chief FOIA  Officer's Award in May 2023. Beyond these honors, Mrs. Maddalena has  consistently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}]