[{"senator": "Al Green", "party": "Democrat", "sentence": "…humanity, from you. You are allowing him to reduce you to a less-than.\n\nI will speak for you. Mr. President, you are demeaning the humanity  of the people who are in service to this country. I will speak for them  and tell you that, if I were in that room, I would walk out. I would  not sit there and allow you to demean me in that fashion.\n\nAt some point,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Missal, the former  inspector general of the VA, but also a U.S. Air Force veteran with  more than 30 years of military service who retired from a lifetime of  dedicated service to his country in November and immediately  rededicated himself to serving his fellow veterans at the Department of  Veterans Affairs. He started work on January 13. He was illegally…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…stronger  community that serves all people. As he moves on to serve as CEO of  Sound Transit, I ask my colleagues to join me in celebrating Dow's  accomplishments and service to our country. On behalf of Washington's  7th Congressional District, I thank Dow for making King County a more  inclusive, sustainable, and just place to live.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…and the respect he earned across Congress will  continue to shape the institution he devoted his career to  strengthening. I thank Gene Dodaro for his extraordinary service to our  country and wish him continued success in the next chapter of his  public service.", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…aliens.\n\nMy great-grandfather, my GG, was one of them. He was locked behind  barbed wire while his son, my grandfather, joined the Military  Intelligence Service in service to a country that saw him as the enemy.  That small stone marker is all that remains to tell their story.\n\nToday, the Trump administration is removing national park signage  that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…VINDMAN. Mr. Speaker, as a veteran, I cannot support a budget  that would cut $23 billion from care for veterans exposed to burn pits  and toxic substances during their service to our country.\n\nThis budget also harms local police by cutting hundreds of millions  to COPS grants and justice assistance grants.\n\nThe Federal workers I represent know firsthand…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688714/members-of-congress-should-show-up-to-work-without-pay-during-a-shutdown"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…sure our veterans, who are waiting for weeks for  appointments at VA clinics, get the desperate care they need after  making such extreme sacrifices in the honor of service to our country,  or we could rename the Gulf of Mexico.\n\nWe could be protecting Social Security and Medicare, protecting  Medicaid, finding affordable childcare for the millions of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690744/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…at the       esteemed Infantry Officer Course, further sharpening his       combat leadership skills and preparing to take command of a       Marine rifle platoon in service to our country; and\n\nWhereas, his achievement marks not only a significant       personal milestone but also a reaffirmation of his solemn       oath to serve and protect the United…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…our Nation and the military families of the central  coast.\n\nMr. Speaker, I ask my colleagues to join me in recognizing and  thanking General Lopez for his exemplary service to our country by  passing my bill to name the South Patterson Avenue post office in his  honor.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…12th Congressional District. We worked over 3 years to present  Matthew Fisher, a remarkable resident of my district, with the Purple  Heart for his dedication and service to our country.\n\nMatthew Fisher was born in Livonia and is a proud graduate of  Stevenson High School. In 2004, Matthew answered the call to serve  others by becoming a firefighter…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…themselves? Is it too much to say thank you?\n\nAll that said, I support this bill to award medals of sacrifice to  other public safety officers who lose their lives in service to their  country and their communities, and I thank them.\n\nMs. SCANLON. Mr. Speaker, I endorse the comments of the sponsor of  the bill. I totally agree we should be honoring the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699503/medal-of-sacrifice-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…contributions to the Social  Security Administration, including the modernization of the systems,  disability policy, and unhoused population advocacy.\n\nI thank him for his service to our country and wish him the best on  his well-earned retirement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…so  that people, again, can get the services they rely on.\n\nI am a strong supporter of the post office. It is in the  Constitution. It is mandated we have a Postal Service in this country.  People depend on it to get their medications, to get important  documents, and to receive their monthly Social Security payments.\n\nTo have a dysfunctional system…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…his praise when he decided that  their being transgender, one small part of who these soldiers are,  somehow outweighed their years of proven high performance and service  to this country. These servicemembers were just dismissed by this  administration.\n\nThe most powerful aspect of our military, the thing that makes it  unique against our adversaries,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…veterans from reuniting with  their families.\n\nIn October 2017, Congress finally awarded the Filipino veterans of  World War II the Congressional Gold Medal to honor their service to our  country, but we must do more as we promised. Additionally, in 2016, the  U.S. Citizenship and Immigration Services created the Filipino World  War II Veterans Parole Program,…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Small Business Development to devise an outreach and  promotion strategy for programs available to veterans transitioning  into the business world.\n\nWhen veterans' service to our country ends, they should not face  additional difficulties in accessing capital and resources. With  transparency and increased reporting, we can better ensure that they…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…that prepares their students for life.\n\nMr. Speaker, as a fellow veteran and Navy SEAL, I know you can never  have enough marines around. I thank Mr. Grapes for his service to our  country and our community.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689794/recognizing-jesse-grapes"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…my prayers are with his wife, Jill; his children; his  grandchildren; the entire LaMalfa family, including his great staff. I  thank them for sharing him with us in service to our country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698714/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…returned home and served  in the reserves and ultimately retired with the rank of Lieutenant  Colonel. During his service in the reserves and after, he continued his  service to country and community, through his faith and devotion to  God, he lead his family of five in service to the Catholic Church and  received many recognitions including the very…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…involving two members of our National Guard from West  Virginia, Specialist Sarah Beckstrom and Staff Sergeant Andrew Wolfe.\n\nSpecialist Beckstrom gave her life in service to our country. She  wore our Nation's uniform with honor, stood ready to defend her  neighbors, and lived out the highest ideals of duty and sacrifice. We  grieve her loss deeply,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Mr. Speaker, I am honored to present retired USAF  Technical Sergeant Martha Socorro Ybarra of Waco, Texas, with a  Congressional Veteran Commendation. Her 20-year service to our country  followed by her heavily involved community service is a template for  American Exceptionalism.\n\nTSgt. Ybarra enlisted in the Air Force in May 1986, through the  delayed…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The Nittany Leathernecks campaign annually provides a Christmas gift  experience to more than 9,000 children.\n\nMr. Speaker, I thank these selfless Marines for their service to our  country and their dedication to uplifting our communities.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698118/recognizing-nittany-leathernecks"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…retired USA  Lieutenant Colonel William (Bill) Patterson Matthews, of Mexia, Texas,  with a Congressional Veteran Commendation in recognition of his  outstanding service to both his country and his community.\n\nAfter receiving his Bachelor of Science in Education from Texas A&M  University, Lt. Col. Matthews served with distinction in the United  States…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…support this  measure.\n\nMr. DIAZ-BALART. Mr. Chairman, before anything else, I will tell you  what I have told Mr. Crane privately. I will say it publicly. I revere  his service to the country. We must always thank those who served, and  he served honorably.\n\nOn this amendment, the bill that we are debating right now  substantially reduces spending, while…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I rise today to honor Anna  Kathleen Cummins Kennedy of Poplar Bluff, Missouri, whose life  exemplified service to country, devotion to family, and tireless  commitment to community. Born on January 1, 1925, near Falmouth,  Kentucky, Anna Kathleen was the seventh of ten children on her parents'…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Dakota is so proud of Ray Curtis. We are grateful for his  service, his sacrifice, and his example.\n\nHappy birthday to Ray. Congratulations on a life well-lived in  service to our country.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699742/recognizing-ray-curtis"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…District, I offer my  thanks for the important role that Letterkenny plays in aiding our  warfighters and look forward to their continued innovation and  dedicated service to our country.               Energy and Commerce Committee Working Diligently\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to highlight the  great energy bills that will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Speaker, I rise today to recognize Frank Esten Cook  III and his service to his country. Frank was born in Washington, D.C.  on March 25, 1963, and passed away in Richmond, Kentucky on September  13, 2025. He was an avid outdoorsman, boater, and hunter.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…addition to helping  recover victims of Hurricane Katrina.\n\nMr. Speaker, I ask that my colleagues join me in congratulating and  thanking Fire Marshal Brett Lacey for his service to our country and to  the Pikes Peak region.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}]