[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…alongside my good friend, the gentleman from Idaho (Mr. Fulcher).\n\nMr. Speaker, this bill authorizes The National Mall as the location  for the memorial, commemorating the service and sacrifice of the women  who worked on the home front during World War II.\n\nThis bill advances a decade-long effort to properly honor the more  than 18 million trailblazing women…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…brave law enforcement officers of  Spotsylvania and Fredericksburg and all officers serving across the 11  counties of Virginia's Seventh Congressional District. Their service  and sacrifice is deeply valued.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691301/commending-virginias-seventh-district-law-enforcement-officers-for-their-bravery"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…managed the Investigations,  K9, Firearms, and Records units. As a well-distinguished and awarded  police officer, Captain Regan's 35-year-long career exemplifies true  service and sacrifice. He has defined what it means to protect and  serve our community.\n\nMr. Speaker, I thank him for all he has done to keep our families and  our communities safe. I congratulate…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…great pride to the Commonwealth of  Massachusetts and to our Nation.\n\nI ask my colleagues to join me in honoring Colonel David ``Moon''  Halasi-Kun for his decades of service and sacrifice. We extend our  deepest gratitude to him, his wife Gretchen, and his son Luke for their  steadfast support throughout his career. His legacy will continue to  inspire…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…multigenerational effort, admired around  the world with each generation standing firm. In just over 100 days,  Donald Trump, whose family has no record anywhere of military service  or sacrifice for this Nation, is carelessly throwing liberty to the  wolves. He seems to enjoy dictatorship, plutocracy, and wealth over  principle. Russia celebrates as America…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…thank my colleague on the Veterans' Affairs Committee, Congressman  Hamadeh, for his collaboration and partnership on this bill. I also  thank our veterans for their service and sacrifice.\n\nMadam Speaker, this bill removes barriers for student veterans  seeking a STEM education by modifying eligibility requirements for the  Edith Nourse Rogers STEM Scholarship.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695426/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…a proud  legacy and to honor those who have selflessly given back to our country  and community.\n\nI commend American Legion Post 667 for fifty years of leadership,  service, and sacrifice, and I wish them continued success in the  decades ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…this community and stand as a testament to what it means  to serve. I ask all my colleagues to join me in honoring these brave  first responders for their extraordinary service and sacrifice.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…our servicemembers sacrifice to serve  this country. That is why, this week, I am recognizing Robert as  Constituent of the Week.\n\nMr. Speaker, I thank Robert for his service and sacrifice now and  into the future for this Nation. In Congress, I will always work to  deliver for servicemembers like Robert.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694938/recognizing-robert-upton"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…or living Americans.\n\nWhat happens when they decide the story of my GG is too negative to  remember? What happens when they want to whitewash history and remove  the service and sacrifice of our communities of color?\n\nIn March 2025, the U.S. Army removed its web page honoring the 442nd  Regimental Combat Team, the all-nisei unit that became one of the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…here today to speak on behalf of all veterans who have been  fired by President Trump and Elon Musk.\n\nLook, Donald Trump couldn't tell you the meaning of the words  ``service'' or ``sacrifice'' if he had a dictionary laying open in  front of him. So how dare a coward who cried ``bone spurs,'' when his  Nation needed him the most, turn his back on those…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, I rise today to honor Mauro Reza, a  Vietnam War veteran from Palmdale, California, whose service and  sacrifice exemplify the highest ideals of patriotism and dedication to  our Nation. Mr. Reza was selected as this year's Boots on the Ground  Alliance's Veteran of the Year,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…pursuant to  Public Law 87-726, enacted on October 1, 1962, National Police Week  here in the United States Congress, where Congress honors the courage,  the bravery, the service, the sacrifice, and the heroism of members of  law enforcement. Is that correct?\n\nMr. JEFFRIES. Mr. Speaker, a further parliamentary inquiry.\n\nMr. JEFFRIES. Mr. Speaker, do the House…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691256/parliamentary-inquiries"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…continues our effort to properly honor Rear  Admiral Duerk. I look forward to working with colleagues, on both sides  of the aisle, to ensure Rear Admiral Duerk's legacy of service,  sacrifice, and excellence is properly honored and commemorated by the  people of the United States of America.\n\nGo Navy.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…conducting basic oversight?\n\nI have to ask again: Why is this administration going to war against  the very professionals sworn to keep our country safe? Why are decades  of service and sacrifice being tossed aside?\n\nWhy? Because they think they are still obliged to provide the truth  and speak truth to power. But, instead, it appears that sometimes those  truths…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Point.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force--the United States Army--guided by duty, honor,  and country.\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since its inception, defending our way of life  from Lexington to Normandy.\n\nAnd throughout our history,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692756/congratulating-wyatt-spaulding"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…devotion that defined the very  best of this country.\n\nI am proud to bring this bill forward, and I urge my colleagues to  join me in honoring Commander Olson's remarkable service and sacrifice.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697599/commander-delbert-austin-olson-post-office"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Mr. Speaker, ahead of our Nation's 250th anniversary next year, this  bill ensures meaningful access to our national parks and public lands  and recognizes the immense service and sacrifice of our Nation's law  enforcement officers and firefighters.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, as we prepare to mark Memorial Day, a  time to honor those who gave their lives in defense of our country, I  rise today to recognize the enduring service and sacrifice of the  Washington Army National Guard's 1st Battalion, 161st Infantry  Regiment.\n\nFor nearly 90 years, this unit has called the city of Spokane home.  Once stationed…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…service and for his excellent acts of  leadership that have protected our country and also helped his local  community. His story is a testament to the American spirit of service,  sacrifice, and leadership, and it is an honor to recognize him as our  Veteran of the Month.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Merchant Marine  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force, guided by the motto: ``Acta Non Verba''\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since its inception, defending our way of life  from Lexington to Normandy.\n\nA vital part of our Nation's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692770/congratulating-jack-gray"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the Month for April 2025  from Michigan's 9th Congressional District. His lifelong commitment to  duty, both in uniform and beyond, exemplifies the highest ideals of  service, sacrifice, and community.\n\nRobert Longo answered the call to serve his country in July 1968,  enlisting in the United States Air Force at the height of the Vietnam  War. Over the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…secure freedom.\n\nRay now resides at Minot Lodge Senior Living, surrounded by family  and caregivers.\n\nNorth Dakota is so proud of Ray Curtis. We are grateful for his  service, his sacrifice, and his example.\n\nHappy birthday to Ray. Congratulations on a life well-lived in  service to our country.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699742/recognizing-ray-curtis"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…of Congress. H.R.  2290 provides that authority, ensuring this memorial can be located in  a place of national prominence alongside other monuments honoring  wartime service and sacrifice.\n\nThis bill is bipartisan and straightforward. It properly recognizes  the contributions of millions of American women whose work was  essential to victory in World…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Leidlein for his outstanding military service and for his  enduring contributions to our Nation's strength and security. His story  is a testament to the American spirit of service, sacrifice, and  excellence, and it is an honor to recognize him as our Veteran of the  Month.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…. . willing to give their lives defending her.'' Allen  Brady was not just such a person, he embodied that call.\n\nGod bless Captain Brady and his incredible life of service and  sacrifice. Katie and I, all Floridians, and this Nation offer our  thoughts and prayers to  the Brady family as they celebrate his life. May he rest in peace.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…among law enforcement agencies, it  is not good.\n\nTo the families of the fallen: Your loss is shared by a grateful  nation. We will never forget your loved ones' service, nor their  sacrifice. God bless them. God bless law enforcement. And may God bless  the United States of America.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…lost their lives in the line of duty. Since 1776, nearly 27,000  officers have made the ultimate sacrifice, including 165 last year and  25 so far this year. Their service and their sacrifice must never be  forgotten.\n\nMr. Speaker, the men and women of law enforcement represent the very  best of our communities. We are safer because of their commitment,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  April as the Month of the Military Child. While we rightly honor the  service and sacrifice of the men and women in our military, April  reminds us that service comes in many forms.\n\nWe are celebrating the more than 1.6 million children whose parents  serve…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…a frequent guest speaker at local elementary and  middle schools, where he shares his World War II experiences with  younger generations, ensuring that the legacy of service and sacrifice  lives on.\n\nAbove all, Richard is a loving husband and devoted father. Together  with his wife, he raised three children. He recently celebrated his  100th birthday,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}]