[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…the finger at others. He and the White House have repeatedly  attempted to place responsibility for the September 2 strike squarely  on Admiral Bradley's shoulders.\n\nI served in the Army on Active Duty for 12 years, and one of the  first and most important lessons I learned is that a military leader  can delegate authority, but you can never delegate…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Diego by the San Diego Rotary.\n\nA lifelong San Diegan, Tom was born in 1934 and grew up in Point  Loma. In 1957, he married his beautiful wife, Jane, a La Jollan.\n\nTom served in the Army before beginning a long and successful  business career in San Diego.\n\nTom has always been involved in community service, and it has been at  the center of his and Jane's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695799/recognizing-tom-fetter"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…custody of her children.\n\nMr. Speaker, let me also tell you about Michael. Michael is a 66- year-old disabled veteran from San Pedro, California, in my district.  He served in the Army for 7 years. He and his partner, Suzanne, now  rely on SNAP to afford groceries. Without it, they go hungry.\n\nFor Tylynn, for Michael, and 42 million Americans, food…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…and Legacy of Howard Koch\n\nMr. CORREA. Mr. Speaker, I rise today to honor the legacy of World  War II and Korean war veteran Howard Koch.\n\nDuring World War II, Howard served in the Army's elite 10th Mountain  Division, America's only mountain and winter warfare fighting unit.\n\nThis unit, the elite 10th Mountain Division, was formed to defeat the  Nazis…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…more.\n\nWorld War II, in the 1940s, during World War II, our Uncle Tony was  deployed by the Office of Strategic Services, or OSS, to the China- Burma-India theater. He served as an Army parachutist and truck  driver--he was so brave--under command of General Vinegar Joe Stilwell.  Fighting off Japanese regulars in bitter combat, our uncle was part of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…introduced  alongside Representatives Alford and Conaway. This bill honors our  veterans' service by helping them succeed as entrepreneurs and small  business owners.\n\nMy mom served in the Army for 20 years, and my grandfather served in  the Army, as well. Through them, I learned about service, leadership,  and dedication to country.\n\nOur veterans defended our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow failure at home.  When I served as an Army intelligence officer overseas, we lived by a  simple creed: Mission first, and no Americans left behind.\n\nMy bill is an embodiment to that promise. This isn't partisan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…heroic  efforts earned him the National Defense Service Medal, the Vietnam  Service Medal, and the Vietnam Campaign Medal. After being honorably  discharged in 1970, Bill served in the Army Reserves until 1975.\n\nAlthough his military service had ended, Bill stayed committed to the  honorable life of a public servant, becoming a firefighter with the  Temple…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…They and their families deserve the same devotion to them that they  are providing to us.\n\nI come from a military family. My father, brother, sister-in-law,  uncles all served in the Army, and my father long said he first really  understood what it means to be an American when he was responsible for  others and others' lives when deployed.\n\nTaking care…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Birthday\n\nMrs. MILLER-MEEKS. Mr. Speaker, I wish a happy birthday to a very  special person, the eldest of eight children, my brother, Richard  Miller.\n\nRichard Miller served in the Army, served in the coal mines in  Pennsylvania, joined the Secret Service, and guarded four Presidents  during their Presidency and Ronald Reagan post-Presidency.\n\nAfter…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…dedication and  leadership, he was selected to serve as the 39th Vice Chief of Staff of  the U.S. Army and was promoted to the rank of four-star general. In  that role, he has served as the Army's second highest ranking officer,  helping to oversee the readiness, modernization, and the strategic  direction of our Nation's land forces.\n\nBut beyond rank and assignments,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Army outside of war time.\n\nDanny Melton of Riverview who served in the U.S. Marine       Corps outside of war time.\n\nMaryAnn Rowe of Sun City Center who served in the Michigan       Army National Guard during the Iraq War.\n\nRichard Steinestel of Valrico who served in the U.S. Navy       during the Vietnam War.\n\nRoland Tiso, Jr. of Valrico who…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}]