[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "…veterans, and their families have the support that they  earned and deserve. One way we can do that is by ensuring that veterans  are financially secure when their military service is over.\n\nMedal of Honor awardees receive a monthly pension that has not been  raised in 23 years. It is well past time to do the right thing and  increase the pension for these distinguished…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…decades to come.\n\nColonel Halasi-Kun's service has been recognized with some of the  military's highest honors, including the Legion of Merit, the  Meritorious Service Medal, the Air Medal, and the Aerial Achievement  Medal. His professional achievements are matched by his academic  accomplishments, having earned advanced degrees in Military Operational…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…prestigious  leadership courses. Her dedication to excellence is further highlighted  by her numerous awards and decorations, including the Bronze Star Medal  and the Meritorious Service Medal with three oak leaf clusters. She has  also been recognized with multiple Airman and Noncommissioned Officer  of the Year awards throughout her career.\n\nChief Master Sergeant…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognition of her outstanding contributions, Major General  Clellan has been awarded the Legion of Merit with Bronze Oak Leaf  Cluster, the Bronze Star Medal, the Meritorious Service Medal with two  Bronze Oak Leaf Clusters, and the Parachutist Badge.\n\nOn behalf of the people of Colorado and the United States Congress, I  extend profound gratitude to Major…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nuclear weapon in New Mexico.  We still live with the legacy of above-ground nuclear tests.\n\nTwo years ago, the Defense Department awarded the Atomic Veterans  Commemorative Service Medal to the still-surviving veterans of that era  and their family members.\n\nWe must also honor the downwinders, civilians whose health and land  suffered from the effects of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Carter", "party": "Republican", "sentence": "…organizing a USO show with the Gatlin Brothers on October 24,  1994. Her exemplary service earned her numerous accolades, including  the Legion of Merit and the Humanitarian Service Medal.\n\nAfter retiring, LTC MacMillan continued her commitment to service,  joining the Fort Cavazos Retiree Council and working with  The Caring Place, speaking to schools about…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Marines, continuing  his tradition of exemplary leadership and dedication.\n\nHis distinguished service earned him numerous personal decorations,  including the Meritorious Service Medal, Joint Service Commendation  Medal, Navy and Marine Corps Commendation Medal, and the Combat Action  Ribbon, among other service and campaign awards. He is also authorized…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "John Carter", "party": "Republican", "sentence": "…military service earned him numerous  accolades, including the Legion of Merit with oak leaf cluster, the  Army Commendation Medal with oak leaf cluster, and the Meritorious  Service Medal with four oak leaf clusters. He is also a recipient of  the prestigious De Fleury Medal and has been inducted into the Order of  St. George, underscoring his outstanding…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…commendable  service was recognized with numerous decorations, including the Bronze  Star Medal, the Army Commendation Medal, the Army Achievement Medal,  the National Defense Service Medal, the Combat Medic Badge, the  Parachutist Badge, the Driver and Mechanic Badge, and the Operation  Enduring Freedom Campaign Medal. These honors stand as a testament to…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recognized for his hard work and  sacrifice during his time in the Army. He received accolades including:  the Army Commendation Medal of Valor, National Defense Service Medal,  Afghanistan Campaign Medal with campaign star, and Senior Aviation  Badge. He was a four-time recipient of the Army Achievement Medal and  three-time recipient of the National Defense…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687967/mourning-the-loss-of-staff-sergeant-ryan-austin-ohara"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…advance stability operations in some of the nation's most challenging  provinces. For his valor and meritorious service, he was awarded two  Bronze Stars, a Meritorious Service Medal, a NATO Medal, and a  Presidential Unit Citation.\n\nFollowing his retirement in September 2011, Sergeant First Class  Leidlein left behind a legacy of courage, innovation, and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…became a platform instructor, training airmen entering  the airborne reconnaissance career field. During his distinguished  military career, Tom was awarded the Meritorious Service Medal, eight  Air Medals, two Meritorious Achievement Medals, the Combat Readiness  Medal, and numerous other decorations. Later in his Air Force career,  he cross-trained in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…were  recognized through numerous awards, including the Purple Heart, the  Bronze Star Medal, the Army Achievement Medal, the Army Good Conduct  Medal, the Southwest Asia Service Medal, the National Defense Service  Medal, and the Army Service Ribbon.\n\nThe Purple Heart is a solemn testament to his sacrifice in defense of  our freedom, having been wounded…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Throughout her time in uniform, Petty Officer Gramer earned numerous  military honors, including the Meritorious Unit Commendation, Navy Unit  Commendation, National Defense Service Medal, and Armed Forces  Expeditionary Medal. These awards recognize her hard work and the  strong performance of the units she served with.\n\nFollowing her honorable discharge…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…commitment to mission and purpose he has carried all  throughout his life.\n\nRichard served 3 years in foreign service to our Nation in combat  earning the following: Vietnam Service Medal with 3 Stars, Vietnam  Campaign Medal, National Defense Medal,  Good Conduct Medal 1st Award, Rifle Sharpshooter Badge, Combat Action  Ribbon, Good Conduct Award 2nd Award…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…General Rasch served in both Desert Storm and the global war on  terrorism. Over his 36 years of service, he has earned numerous awards,  including the Army's Distinguished Service Medal, the Legion of Merit,  and the Combat Infantryman Badge. He is also a Ranger-qualified  soldier, holding the prestigious Ranger Tab.\n\nGeneral Rasch's leadership and mentorship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…enlisted at the age of 17 on August 6, 1946, and received  an honorable discharge on April 29, 1948. He served in the South  Pacific on the USS Whiteside. He earned the China Service Medal, the  World War II Victory Medal and the Navy Occupation Service Medal. Leroy  served in the South Pacific on the USS Whiteside. He took great pride  in collecting Navy…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…over $600,000. She completed key  leadership courses and earned multiple awards, including the Army  Commendation Medal, the Army Achievement Medal, and the Humanitarian  Service Medal.\n\nMajor Jennie Marie Fregoso's service has strengthened the operational  readiness of the Army Reserve medical community and shaped the careers  of countless soldiers.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…the  Armed Forces and over 15 years of law enforcement experience. Upon  returning home from his recent deployment, Master Sergeant Holliday was  awarded the Meritorious Service Medal in recognition of his outstanding  leadership.\n\nWhat makes America exceptional are men and women like Brandan  Holliday, the quiet heroes who put their lives on the line…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and after being honorably discharged, he joined the Army  Reserves in 1948 where he remained until 1985. For his distinguished  service, Ralph has received the Meritorious Service Medal, the Southern  Philippine Islands Campaign with one Bronze Star, the Philippine  Liberation Medal and Ribbon with one bronze Star, and many more  commendations.\n\nIn addition…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}]