[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…graduate of  Stevenson High School. In 2004, Matthew answered the call to serve  others by becoming a firefighter in one of our counties. In 2007, he  made the decision to serve our Nation by joining the U.S. Army. He was  deployed to Kuwait and Iraq from December 2007 to 2009. Unfortunately,  he was there when a horrific bomb changed his life forever. It…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…participation in National History Day, Ms. Green has  worked with her students to preserve the stories of Delaware's silent  heroes, everyday individuals who answered the call to serve our Nation.\n\nThis past school year, Ms. Green and her students chose to research  two Korean war veterans. They researched the lives that these veterans  led before their service,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694007/recognizing-emily-green"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…research  efforts. By doing so, we reaffirm our commitment to sustaining the  momentum of these proven programs that save lives and improve the  health outcomes of those who serve our Nation.\n\nI urge my colleagues to support this legislation to ensure that  medical research for our troops and veterans remains strong,  innovative, and fully funded.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692417/introduction-of-medical-research-for-our-troops-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of spying on Federal workers and  contractors and firing ones who aren't the most blindly loyal that the  best are chosen, the brightest, the most qualified people to serve our  Nation, to keep us healthy, safe, and secure.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…clerical staff.\n\nThe Trump administration has jeopardized care, putting lives and  health at risk. Many of the brave men and women who serve in our Armed  Forces continue to serve our Nation in the civilian workforce,  including in the VA.\n\nSo far, 1,400 employees have been dismissed and an internal memo  shows 80,000 more to come--the firing of 80,000 VA…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688623/fighting-for-our-veterans"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…them  the same commitment in return. I am grateful for the way we have come  together across party lines to ensure the rights of working people and  protect those who serve our Nation.\n\nI stand strong with our Federal workers and with all working families  across Oregon. I commend my colleagues for coming together to fight for  what is right. I am eager…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…district  represented by Congressman Jared Golden. I am thankful for Congressman  Golden's service. He served his Nation with distinction overseas and  has come back home to serve this Nation in the United States Congress.\n\nKasey writes as a single mom of two young children and nonprofit  professional in rural Maine, Kasey and her children rely on Medicaid…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that those paychecks will  arrive and that the government should strive to improve service to you,  not brag about cutting it; basic American principles like, if you serve  your Nation in the military, if you put your life in danger abroad, you  will be respected and taken care of. You will be cherished and honored  and not forced to worry that the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…funded care for veterans who were  exposed to burn pits in Iraq and Afghanistan and toxic substances from  their military service.\n\nMy resolution is about all veterans who serve this Nation. Some of  the veterans who have been laid off are park rangers in our National  Park Service who are now out of a job--people who were promoted because  they did such…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, I rise today outraged at the ongoing assault  on the rights and protections of the Federal workers who serve our  Nation, over 48,000 of them in Hawaii alone.\n\nJust yesterday, this House passed the NDAA, meant to strengthen our  national defense. However, the NDAA means nothing if we cut…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697988/protect-americas-workforce-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Employment and Transition Success, or FAST VETS Act.\n\nI am grateful to Representatives Messmer, McGarvey, and Van Orden for  joining me in this bipartisan effort to better serve our Nation's  veterans.\n\nLike many physicians, I trained at the VA where the sign on the door  said: The price of freedom is visible here. Our veterans gave  everything for this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…no former marines, and there are no ex-marines. It  is a lifelong commitment and identity. ``Semper Fidelis'' speaks to the  bond between marines, to the cause they serve, and to the Nation that  they protect. That bond by no means ends with Active Duty. It continues  in communities across America where marines continue to serve, living  out the values…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and fearful that they may or may  not be able to continue to receive their medical care.\n\nThis is a serious and profound moment. This is a self-inflicted  crisis.\n\nI did serve this Nation during a time of real economic crisis during  the Great Recession in the administration of Barack Obama. That was  when I was in the Treasury Department, working to save…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…data on the experiences of transgender people at the  Department of Defense is critical to addressing the challenges the  community faces.\n\nEvery person who steps up to serve our Nation in uniform, including  trans people, should be treated with the utmost respect. These  servicemembers have continuously shown that they are fit, qualified,  and willing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…were  bolstered. Because of their work, and the courage of our veterans and  servicemembers, our Nation has been spared from similar attacks.\n\nWe thank all of those who serve our Nation, both as civilians and  servicemembers, in the fight to secure our homeland.\n\nDespite this success, we remain vigilant in the face of continuing  threats against our country.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…that were needed to be developed in young  boys. From that, grew a global movement and in our country inspired  what is now Scouting America, chartered by Congress to serve our  Nation's youth by instilling the values of the Scout oath and law.\n\nAs a proud Scout dad, I rise today to say very clearly: Scouts is an  outstanding program, and America needs…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker, when danger strikes, it is not just  about boots on the ground. It is about paws in motion.\n\nToday, I rise in defense of those who cannot speak for themselves but  serve our Nation with unmatched loyalty, discipline, and courage. I am  talking about canines and horses that serve our law enforcement  officers on the front line every single day.\n\nFrom…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…attorney, she has  led a team of talented attorneys in the AG's office, fighting to  protect the constitutional rights of Tennesseans. There is no doubt  that she will serve our Nation admirably on the Sixth Circuit. She will  be a tireless advocate for our Constitution.\n\nShe will show respect for the rule of law. She will show respect for  the Constitution…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and the various coclerks that he has worked with at the Tenth Circuit  and the U.S. Supreme Court.\n\nLike Mr. Dunlap, I believe Mr. Tung will make a phenomenal judge and  serve this Nation honorably and with distinction. I encourage my  colleagues to support both of these fine circuit court nominees.", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…support they  need to succeed globally. I know he will deliver on these promises. His  deep understanding of how trade policy intersects with our national  interest will serve this Nation well.\n\nSo today, I congratulate William Kimmitt on his confirmation as our  next Under Secretary of Commerce for International Trade. I thank him,  his wife Heather,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…from their home address, which would prevent them from  receiving these updates.\n\nIt will also reduce postage costs, allowing the VA to spend money in  ways that better serve our Nation's heroes. It is a win-win overall.\n\nMadam Speaker, I thank my colleagues, Mr. Van Orden and Mr. Tran, for  their help in introducing this bill as we continue to work to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…the Corps of Cadets'  chain of command.\n\nSecond Lieutenant Robinson will now report for active duty at Fort  Sill, Oklahoma.\n\nI am proud of Caroline and her desire to serve our Nation as an  officer in the United States Army. I know she will serve our Nation  with great distinction and honor.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Yesterday was Veterans Day. It is a timely reminder of the commitment  our Armed Forces personnel have made and the responsibility we have to  take care of those who serve our Nation.\n\nThe military construction and veterans affairs component of the  legislation meets that goal. The legislation includes $133.3 billion  for the Department of Veterans…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…my district, but in my State  and in my country. I will do it because I care. I swore an oath to the  Constitution to serve my constituents, to serve my State, and to serve  my Nation every possible way that I can.\n\nMr. Speaker, I urge my colleagues to take cyber threats by malign  actors seriously. I urge my colleagues to protect the security of  Americans'…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…its World War II service.\n\nColonel Swain's lifelong commitment from cadet to congressional  liaison made Civil Air Patrol stronger, more visible, and better  equipped to serve the Nation.\n\nI have been proud to work with Colonel Swain to fight for Civil Air  Patrol funding throughout my time in Congress and thank him for his  service.\n\nI am also thankful…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…tending to the family farm--not an unusual thing in Kansas, certainly  not in his generation.\n\nAt age 19, Jim surrendered his farm deferment, courageously  volunteering to serve his nation in the U.S. Army during World War II.\n\nThrough his service, Jim fought in the Battle of the Bulge as part of  Company B, 18th Infantry Regiment, 1st Infantry Division.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]