[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…veterans, callers who speak  Spanish, and LGBTQ+ youth.\n\nMr. Speaker, 1.2 million Americans have selected that last option,  but it might not be an option for much longer.\n\nThe service has saved lives and allowed Americans to receive the care  they need on the hardest days of their lives. To me, that is what  public service is all about. It is about being…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691373/fully-fund-crisis-services-for-lgbtq-youth"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Tim Hauser as the  Champion of the Week for Ohio's 13th Congressional District.\n\nTim was recently named the Veteran of the Year by the Veterans  Service Commission of Summit County. He is a Gulf War veteran and  founder of the Veterans Assurance Network, which provides advocacy,  support, education, services, and resources…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise today to honor the 100th anniversary  of The Garden Club of Alexandria, which was founded in 1925 and  distinguished by a century of hands-on service, civic leadership, and  lasting contributions to our community.\n\nFor one hundred years, The Garden Club of Alexandria has been a  cornerstone of our community, dedicated to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…seeking a better life, and was willing to  work hard for it. He was only 24 years old--taken from us far too soon.\n\nSix individual lives, connected to their coworkers through service,  connected to their families through love, connected to our community  through their work to make our infrastructure stronger--1 year later,  we remember their loss. They…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Brody Hafer for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nBrody has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690316/recognizing-brody-hafer"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…doing or the value they  bring to the workforce and to the American people. They are just doing  it and getting on TV with a chain saw.\n\nThese are people who went into public service for a reason. They are  people, in the case of Health and Human Services, who keep us healthy  and save lives, who work every day to keep America at the forefront of  medical…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Agency tirelessly serves the public trust. Day in  and day out, agency professionals uphold the highest standards of  security, while delivering the responsive, compassionate service  Commonwealth residents have come to know and appreciate. Whether it is  assisting a college student preparing for a semester abroad, a  grandmother traveling to welcome a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters. They are getting run out of town now. I  don't hear a lot about Elon Musk. He has lost some elections for my  friends across the aisle, so they are trying…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…is already being  forgotten, or at least there are some people who would like us to  forget their heroism. That is on the symbolic front, because everybody  wants to pay lip service to the police, and everybody wants to say that  we honor them. Let's really honor them.\n\nLet's put up a permanent plaque for future generations of Americans  to see that these…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Whereas, its 406.8 square miles of rich farmland, flowing       rivers, and vibrant towns have been home to generations of       Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud       testament to the enduring values of self-reliance, civic       engagement, and American perseverance;…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…controllers. It  increases funding for air traffic control towers and facilities by 26  percent above fiscal year 2025.\n\nThe bill also protects investments for continuing Amtrak service  along the Northeast Corridor and national network by providing $2.4  billion.\n\nThe bill also includes $100 million for the 2026 World Cup and $94  million for the 2028 Olympics…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…21 officers  patrolling on Indian-brand motorcycles has grown into a modern,  technologically advanced law enforcement agency committed to the  highest standards of public service.\n\nFrom the earliest days of policing rural roads to the current use of  cutting-edge technology, the agency has continually evolved to meet the  challenges of each era while…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…national security and effectiveness in  the world.\n\nI express gratitude to the patriotic men and women at the State  Department, many of them my constituents, for their decades of service,  and I affirm our enduring commitment to the values they have worked so  hard to advance.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693533/mass-state-department-layoffs"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Parker Wells  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nParker has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691947/recognizing-parker-wells"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Speaker, I want to discuss democracy, or lack thereof, in D.C.  There are 700,000 D.C. residents. D.C. residents are required to pay  Federal taxes, register with the Selective Service System, and serve on  Federal juries in the same manner as residents of States. Yet, D.C.  residents have no voting representation in Congress, and Congress has  the ultimate…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…gratitude. The legacy  of New Freedom Farm will live on in the hearts it healed and the  community it united.\n\nMr. Speaker, I thank Lois for her vision, compassion, and unwavering  service. She has left an indelible mark on all she has touched.                 Honoring Retirement of Fire Chief Tim Williams\n\nMr. CLINE. Mr. Speaker, I rise to recognize and commend…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Smith, U.S. Marine  Corps (Ret.), with a Congressional Veteran Commendation. His life and  career are a testament to his exceptional character and unwavering  commitment to service.\n\nOn active duty from 1973 to 1997, Lt. Col. Smith served in various  locations around the globe, including Quantico, London, Brussels, Hong  Kong, Australia, and Turkey.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Act''.       SEC. 2. PRECISION AGRICULTURE SATELLITE CONNECTIVITY.\n\n(a) Review.--The Commission shall--\n\n(1) review the rules of the Commission relating to fixed       satellite service, mobile satellite service, and earth       exploration satellite service to determine if there are rule       changes that the Commission could implement under existing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…does she empower her  students academically, but she also plays a pivotal role in supporting  her colleagues and fellow educators, reflecting her ongoing commitment  to public service and civic responsibility.\n\nDr. Sandfort exemplifies the highest standards of educational  excellence and leadership, which led her to be recognized recently by  the Folsom…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…two  combat tours, surviving a missile attack in northern Kuwait in March  2003, and retired at the rank of Lieutenant Colonel in 2016 after 30  years of civil and military service.\n\nThroughout her distinguished career, Ms. Prehoda received a plethora  of awards and commendations, including, but not limited to, a Joint  Service Achievement Medal, a Navy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…resilience required to live with a rare disease. Through  her unwavering dedication, Liz ensures that the voices of rare disease  patients are heard. We thank her for her dedicated service to our  community.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688709/recognizing-elizabeth-kennerleys-tireless-rare-disease-advocacy"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Outstanding Coxswain Trophy, one of the highest  honors given to a Coast Guard boat operator. His leadership, skill, and  commitment to mission excellence represent the very best in service.\n\nAlongside him, Machinery Technician First Class James Lang has earned  the Fireman First Class Paul Clark Outstanding Engineer Award, a  national recognition of his outstanding…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690914/recognizing-bm1-bradley-walker-and-mk1-james-lang"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…repealed the Democrats' $600 reporting requirements for  payments through PayPal or Venmo  and requirements for paperwork reporting of small payments to casual  sellers and service providers.\n\nThis, again, is an effort to simplify the tax code and make it work  for American families so they will be able to have more of what they  earned. I will get to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…On July  1, Principal Kern retired from his career in public education, closing  a chapter marked by educational leadership, unwavering support for  students, and dedicated service to his community.\n\nIn August 1993, Principal Kern began his career in education as a  Music Teacher at Maple Point Middle School. Six years later, he rose to  the challenge…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Petty Officer  Second Class Katrina Gramer for her honorable service to the United  States Navy and her unwavering dedication to supporting our veteran  community. Her service in uniform and her continued dedication to  fellow veterans represents…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Eastern  Municipal Water District (EMWD) as it celebrates a major milestone in  the district's history. This year, EMWD will mark its 75th Anniversary  and a proven legacy of service to our community.\n\nEMWD was established on October 16, 1950, through a public vote by  San Jacinto Valley property owners to help facilitate groundwater  rights in the region.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the selfless acts  of service done by Diana Lawrence and the Troop Box Ministry to bless  our Nation's servicemembers.\n\nIt all began nearly a quarter century ago in the garage of the  Lawrences' residence…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…promoted to sergeant.\n\nHis leadership, coupled with his dedication to both administrative  and field duties, showcases his true passion for law enforcement and  community service.\n\nWe are grateful for Sergeant Jenkins' exceptional service to our  community, and I am proud to congratulate him on his well-deserved  retirement.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…community spirit. Since its founding in 1875, the South Dayton  Depot has welcomed generations of travelers and neighbors, serving  first as a vital hub for freight and passenger service, and now as a  museum where history is preserved for generations to come.\n\nThe South Dayton Depot has not only preserved our community's  railroad heritage, but has also become…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…old. She was tragically killed  by the same storm and fast-moving floodwaters caused by a dam that had  overflowed and took down all the power, radio communication, and phone  service. Major Quintero was swept downhill and was hit by a tree  careening in the fast-moving water.\n\nShe served more than 17 years with the Madison County Sheriff's  Office. Major…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}]