[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the striving, and  tolerant of the weak and the strong because someday in life you will  have been all of these.'' Overseer Carter's legacy extended beyond  church walls, serving people from all walks of life. He founded First  Monumental Community Outreach, Inc. (FMCO), providing critical support  services. Notably, he spearheaded initiatives like Job's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…service as a parks commissioner, as a city councilmember, and as mayor  of Tacoma.\n\nI congratulate Victoria on an exemplary and distinguished career of  more than 15 years serving the people of Tacoma. Under her leadership,  the city launched the Equity and Empowerment Initiative, which led to  the creation of our Office of Equity and Human Rights. The city…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Members of Congress who do  not represent them.\n\nWe have more important work to do than to express displeasure at a  Member of Congress who has spent his entire life serving the people of  Illinois and people across this country.\n\nNow, please, let's get back to the real work on behalf of the  American people. I urge my colleagues to reject this reprimand.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696781/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Chief  Brian Tholen for his distinguished career in law enforcement and his  lifelong commitment to serving the people of Minnesota through  education, volunteerism, and public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police officer…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…earlier in the debate, I deeply respect  the sponsor of this resolution. We are fellow appropriators, and I  observe firsthand the energy and commitment she brings to serving the  people of southwest Washington.\n\nThis resolution is wrong. It shouldn't be before us. The House has so  much work we need to do. We need to address the affordability crisis…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…influence down here.\n\nIt is also why you see the obscene practice of people getting rich in  Congress, trading stock on information that they may learn in their job  serving the people in Congress. It is corrupt. We ought to end it.\n\nMr. Speaker, I thank the gentleman from Texas (Mr.  Casar) for his comments.\n\nMr. Speaker, if you want to respect hard…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…all over this country who think it is ridiculous that folks in  power and elected office get rich off the inside and sensitive  information that we learn in our jobs serving the people, representing  the people who elect us.\n\nNo one should be using that information to enrich themselves, to get  rich off of public trust. I am proud to be here in a bipartisan…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, I rise today to congratulate Cuyahoga  County's Myesha Watkins on her latest and well-earned recognition for  serving the people of northeast Ohio.\n\nLast month, Myesha received the Capstone Achievement Award from the  University of Chicago's Community Violence Intervention Leadership  Academy.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…just a week before I was laid off. The local economy here in Grants  will be devastated. I moved here to serve my community. I joined the  local library board, and I am serving my people, but now I am afraid I  will have to leave. There are no options left.\n\nDevrie, who works with the Friends of Bosque del Apache National  Wildlife Refuge, shared: We…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Chief  Brian Tholen for his distinguished career in law enforcement and his  lifelong commitment to serving the people of Minnesota through  education, volunteerism, and public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police officer…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…federal government. Their commitment to constituent service by  assisting my casework team has been amazing to see, and I am so proud  of the work they have accomplished serving the people of Illinois' 13th  Congressional District.\n\nThe impact that these individuals had on my office will be felt for  years to come, and we will be very sad to say farewell…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…enforcement who  deal with the risk of their loved ones who may not come home.\n\nFinally, we remember the family members who made the ultimate  sacrifice for our safety. Serving in the people's House means we  support law enforcement. I am proud to have secured funding for police  training and safety.\n\nFrom Rockford to the Quad Cities, Peoria to Bloomington-Normal,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691333/thanking-our-law-enforcement-officers-and-their-families"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…hardworking Americans who are really suffering  with higher costs.\n\nMr. Speaker, people deserve a whole lot better. I hope they will vote  this bill down and get back to work serving the people whom we  represent.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Noah the best for his  well-earned retirement.\n\nOn behalf of my colleagues and the entire House community, I thank  him for his leadership and longstanding commitment to serving the  People's House.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, I rise today to recognize the incredible  career of Jim Monaghan, a dedicated public servant who has spent a  lifetime serving the people of Stony Point.\n\nJim's public service began with a 29-year career in the New York City  Police Department, where he rose to the rank of lieutenant. From  January 2016…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, I rise today to send my greatest gratitude  to Representative Harry Warren as he retires after eight terms serving  the people of Rowan County in North Carolina's 76th District.\n\nRepresentative Warren has been a steady, respected voice in Raleigh,  and folks back home knew that they could always…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697946/recognizing-representative-harry-warren"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…local,  and Federal levels have consulted with Debbie or sought her advice at  some point in her career.\n\nMany Kansans know Debbie and have appreciated her dedication to  serving the people of the Fourth District of Kansas. She is a pillar in  Kansas politics and has been repeatedly recognized for her service,  most recently receiving the Spirit of Unity…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…to honor the lives of Deputy  Michael Hislope and Deputy Gabriel Ramirez of the Christian County  Sheriff's Office who yesterday were killed in the line of duty while  serving the people of southwest Missouri.\n\nDeputy Ramirez was murdered during a traffic stop while doing what  law enforcement officers across this country do every day: protecting  the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700214/moment-of-silence-for-deputies-michael-hislope-and-gabriel-ramirez"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…connecting those in need with emergency responders. Mary's  colleagues praised her ability to remain calm despite the severity and  stress of the job.\n\nAfter 43 years of serving the people, some of them on the worst day  of their lives, and being a lifeline to those in the field, I  congratulate Mary on a well-deserved retirement. I wish her the best as…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the House to change course, to reclaim its legislative authority,  to actually drive policy in the right way, and to become the people's  House again by actually serving the American people in a way that will  make a profound difference in the lives of many of them throughout the  country.                           Calling for Accountability\n\nMr. KILEY…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…TVA is refurbishing units to improve  dam safety and increase hydro generation output. Wilson Dam has  fulfilled--and continues to fulfill--TVA's mission statement of serving  the people of the Valley region.\n\nI hope my fellow Alabamians will join me in celebrating all that  Wilson Dam has done for our state, and our region, for one hundred  years. Here's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}]