[{"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to thank Daniel Rubin for his  outstanding service to the House of Representatives, to the House  Judiciary Committee, and to the constituents of New York's 12th  Congressional District.\n\nDaniel Rubin is an exceptional talent, with…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "Mr. SMITH of Washington. Mr. Speaker, I rise to recognize Phil  MacNaughton for his many years of dedicated service to the House Armed  Services Committee.\n\nAfter 17 years, this is Phil's last week on the committee. Phil  joined the committee staff in 2009 and has been the Democratic lead for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kate O'Connor Harper  for her service to the House Committee on Energy and Commerce.\n\nA native of Chicago, Illinois and a graduate of the University of  Chicago, Kate began her career as a Staff Assistant for Senator…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Seth Gold for his  service to the House Committee on Energy and Commerce.\n\nA native of Cincinnati, Ohio and graduate of The George Washington  University for both a Bachelor of Science in Public Health and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Emily Hale for her  service to the House Committee on Energy and Commerce.\n\nA Louisville, Kentucky native, Emily graduated with a Bachelors of  Arts in Political Science from the University of Kentucky in 2024.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "John Rose", "party": "Republican", "sentence": "…farmers, broadly,  across our country. As an eighth-generation Tennessee farmer, I found  it easy to relate to Doug, a proud fourth-generation rice farmer.\n\nThroughout our service on the House Ag Committee, I appreciated  having a partner with similar perspective and values as we worked to  set ag policy. I learned quickly to trust his instincts. I will miss…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698713/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…words about my dear friend, Congressman Doug  LaMalfa.\n\nDoug was a husband, a father, and a fourth-generation rice farmer. He  dedicated more than 20 years to public service, both in this House and  in the California State Legislature.\n\nDoug was a giant in both stature and character. After meeting Doug,  you couldn't help being struck by his kindness and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Gavin Proffitt for  his service to the House Committee on Energy and Commerce.\n\nA Lynchburg, Virginia native, Gavin began his career on Capitol Hill  as a Research Assistant for Rep. Louie Gohmert (TX-01) in October…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692115/recognizing-gavin-proffitt"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kaitlyn Peterson for  her service to the House Committee on Energy and Commerce.\n\nA graduate of the University of Minnesota and native of Massapequa,  Long Island, New York, Kaitlyn began her career in Washington,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Madam Speaker, today, I rise to recognize and thank my  operations director, Alex Keledjian, for his 4 years of service in the  House of Representatives, and this is Alex's son, Anthony.\n\nAlex's dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kaley Stidham for her  service to the House Committee on Energy and Commerce.\n\nA London, Kentucky native, Kaley began her career as an intern for  her hometown member and Dean of the House Congressman Hal Rogers…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Joanne Thomas for her  service to the House Committee on Energy and Commerce.\n\nA graduate of Wayland Baptist University, The University of Sydney,  and The Catholic University of America's Columbus School of Law,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692136/recognizing-joanne-thomas"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Office of  Inspector General, and the Office of the Chief Administrative Officer  of the U.S. House of Representatives who have reached the milestone of  25 years of service.\n\nThe House's most important asset is its remarkable and steadfast  employees, whose work is essential to keeping its operations running  efficiently and effectively. The employees…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Ranking Member Morelle and  myself, I kindly ask my colleagues to join me in recognizing Noah Wofsy  on his retirement as Deputy Legislative Counsel after 39 years of  service to the House of Representatives. Noah joined the House Office  of Legislative Counsel in 1986 after  earning his J.D. from the University of Southern California. I have had  the…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Molly Brimmer Lolli  for her service to the House Committee on Energy and Commerce.\n\nA graduate of the University of Maryland for both a bachelor's degree  in Political Science and a Juris Doctorate degree, Molly began…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}]