[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…many of the workers there  are among the 150,000 civil servants who call Maryland home. Each one  of them has made a commitment to public service. Each one of them is a  civil servant that I am proud to represent. These abrupt and improper  firings have shaken up the lives of thousands of dedicated workers who  do not deserve this treatment. And what makes…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…this occasion of his 100th birthday, we recognize  Paul David Lopez not just for the longevity of his years, but for the  richness of his legacy. He is a war hero, a public servant, a family  man, and a treasured friend to so many. It is an honor to celebrate his  century of life, sacrifice, and service.\n\nHappy 100th birthday to Paul. I thank him for…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…honor the career of David  Caron as he retires after over eight years of service as Town  Administrator of Derry. Throughout his tenure, Dave has been a  tremendous public servant in his role, overseeing all the day-to-day  operations of Derry Town Departments.\n\nDave has managed numerous projects to improve the lives of Derry  citizens, including renovating…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…the person standing next to former Congressman Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped out…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…people we  serve. Always calm, steady, and deeply knowledgeable, Marc has been a  trusted presence and an invaluable resource to our constituents and our  team.\n\nA true public servant, Marc earned his nickname, the mayor, in our  office because he knows the communities, local leaders, and needs of  the Seventh District better than just about anyone.\n\nMr.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…spread disinformation and continue to divide our Nation.\n\nThe latest example is President Trump's removal of Dr. Carla Hayden  as Librarian of Congress, a respected public servant with decades of  experience, and his illegal installation of personal attorney, Todd  Blanche, in her place. He is not a librarian or a scholar but only a  Trump loyalist.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…100 years.\n\nMr. Speaker, I am proud to represent such an extraordinary citizen of  Batavia, Illinois, who exemplifies what it means to be a good neighbor  and a true public servant. I ask my colleagues to join me in honoring  Robert ``Bob'' P. Hubbard for his remarkable lifetime of service and  congratulating him on being named the 2024 Citizen of the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…studies.\n\nMr. Singleton has brought discipline, leadership, and a commitment to  service to our schools in Monrovia Unified. Our community is fortunate  to have a dedicated public servant like him.\n\nMr. Speaker, I thank Mr. Singleton for his military service and his  exemplary public service to our students and schools.                         Recognizing Penny…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Paccione for her service to constituents in Colorado as  Executive Director of the Colorado Department of Higher Education  (CDHE).\n\nDr. Paccione has been a lifelong public servant, working in education  for over 27 years before joining CDHE. Since her appointment to this  role in 2019, Dr. Paccione has worked to expand access to higher  education for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…that our government  works for every family, not just the richest in the world or the close  friends and colleagues of the President.\n\nI am here today not just as a public servant but as a mother who  knows what it feels like to lose everything to gun violence, and I know  this: Every family in America deserves the right to be safe at school,  at the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…advocacy for Chicago's immigrant communities, teachers, public  employees, and the economically striving and struggling among us.\n\nRepresentative Garcia is a dedicated public servant, and his record  of accomplishment is worthy of celebration.\n\nMr. MORELLE. Mr. Speaker, I once again remind the Members that any  one of the citizens of this district could…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…them with  action, compassion, and resolve.                        Recognizing Chief Jeremy Story\n\nMr. VASQUEZ. Mr. Speaker, I rise today to recognize an exceptional  public servant from my district, Chief Jeremy Story.\n\nChief Story is from the Las Cruces Police Department, my hometown,  and he is someone I was proud to serve with in local government.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…protected--with no  exceptions.\n\nMelissa was the best of Minnesota. She cared about others, treated  everyone with dignity and respect, and she knew how to listen and lead,  As a public servant and as Speaker of the House, she left Minnesota  better than she found it. I will miss her dearly.\n\nAs we mourn the loss of Melissa and Mark, our hearts are with their  children,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Caribbean American  Heritage Month to recognize an exceptional public servant from  Rochester, New York: Marlene Henry.\n\nAs the owner of PeppaPot Catering, Marlene Henry is far more than a  business owner--she is a quiet but powerful force for good…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…pathways for trade students and I had the pleasure of working with him  on my bipartisan Supporting Apprenticeship Colleges Act.\n\nNelson leaves a tremendous legacy as a public servant--in fact,  Governor Walz even declared August 11, 2025 ``Terry L Nelson Day'' in  Minnesota. I am grateful for his leadership and dedication to ensuring  workers receive the…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…units operate with greater strength, efficiency, and purpose,  reflecting his ability to maximize their potential and bring out the  best in those he leads.\n\nA lifelong public servant, Chief Estes is truly a pillar of our  community. He is defined by his consistent and active engagement and  his deep dedication to those he serves, going above and beyond…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…mark on all she has touched.                 Honoring Retirement of Fire Chief Tim Williams\n\nMr. CLINE. Mr. Speaker, I rise to recognize and commend an  extraordinary public servant, Shenandoah County Fire Chief Tim  Williams, who will retire on October 1 after an astounding 50 years of  dedicated service in fire and rescue.\n\nChief Williams began his…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…service, Debra has advocated  tirelessly for the Victorville community and its citizens' most  pressing concerns. Debra is renowned in our community as a selfless and  caring servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November 2018 and sworn into office  the following month, she went on to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…District and the United  States House of Representatives, I would like to thank and honor Deputy  Jeff Bilodeau for serving and protecting the region as a dedicated  public servant.                        Recognizing Deputy Chad Blair\n\nMr. KILEY of California. Mr. Speaker, as part of the California  Congressional District Three Police Honor Roll and…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…February 2022, Joan Moore has touched the  lives of over 10,000 hospice patients and their families through giving  her time, talent, and treasure with Gulfside Hospice. With a servant's  heart, Joan quietly, yet passionately finds ways to support one of the  most vulnerable groups in her community--the elderly. Joan's journey  into volunteering began later…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, the Senate will vote later today to confirm  Linda McMahon to be Secretary of Education. Mrs. McMahon is an  accomplished businesswoman and public servant. She is known for her  role in building World Wrestling Entertainment, better known as WWE,  from a small operation to a large and thriving enterprise. And she has  used her…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Utah's first Black mayor and the first Black  Republican woman elected to Congress, but her impact went far further  than those titles. She was a fierce advocate, a tireless servant, and a  bright light in the lives of so many.\n\nMia brought passion, energy, and an unwavering commitment to the  people of Utah's Fourth District, a district that I am now…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…and legacy of Stanley R. Lawson, Sr., a veteran and trailblazer in  Pennsylvania.\n\nBorn and raised in Harrisburg, Stan was a loving father, son,  community leader, and public servant whose life's work was defined by  service to others. He was a proud combat veteran of the United States  Navy, serving in Vietnam from 1960 to 1964. After returning home,…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency and reliability  that only a true public servant could provide.\n\nIn recognition of his outstanding service and commitment to safety,  Joseph was honored with the prestigious Million Mile Award from the  United States Postal…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…tremendous qualifications.\n\nProfessor Mascott is a law professor at Catholic University. She is  so beloved by her students. She has had a very distinguished career as  a public servant and has impeccable professional qualifications.\n\nJust as an example, as a law student at George Washington University,  she earned a recordbreaking 4.22 GPA. Her professors…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…School Teacher of the Year and Rookie of  the Year at Lindale Elementary School. A devoted follower of Jesus, Kay  is most proud of supporting Sheriff Lane's career as a public servant  and being a role model for her children and grandchildren. I am pleased  to commend Kay for her distinguished career as an educator for our  youth, and I wish her continued…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, today I rise to recognize and thank an  extraordinary public servant, Joanne Horn, who has retired after  decades of faithful service to the people of Pennsylvania's 11th  Congressional District.\n\nJoanne has been a valued member of my staff…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Sheppard to receive designation as the  Air Force's Technical Training Center of Excellence.\n\nBeyond his professional excellence, Major Hanson will be remembered  most for his servant leadership, integrity, and team-first spirit. His  patriotism, humility, and unwavering commitment to others have left a  permanent mark on my staff and our mission that will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the other side of the aisle. It  is kind of refreshing to have something that we  agree on, but we agree that America comes first, our constituents come  first, and we, as servant leaders, should come last.\n\nMr. Speaker, I thank the gentleman for holding this Special Order  hour.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Madam Speaker, I rise today to recognize an incredible  public servant and a great friend, Mayor Marilyn Hatley of Myrtle  Beach, South Carolina, who is retiring after two decades of public  service.\n\nMarilyn has been a constant force for many…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}]