[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…birthday on  June 22, 2025.\n\nBorn in Santa Barbara, California, in 1925 in a home his father built  by hand, Mr. Lopez's life has been a shining example of courage,  service, and commitment to country and community. A proud son of the  Eastside, Paul attended Franklin Elementary, Santa Barbara Junior High,  and Santa Barbara High School. In 1943, during…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Founded in 1918 in  the basement of a building under construction on Twelfth Street, just  eleven devoted charter members came together, united by a vision of  faith and service. Their commitment and love for their community  sparked growth, soon reaching 23 members. As the neighborhood around  them evolved, so did the church, embracing change and relocating…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…traditions and to  stand up to gentrification through cultural resistance.\n\nOn behalf of Illinois' Third Congressional District, I commend Billy  Ocasio for his lifetime of service and commitment to fighting for our  communities. At a time when wannabe kings threaten welcoming cities  like Chicago, I am inspired by the stories of local residents  demonstrating…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Additionally, he was in the Global Directory of Who's Who as  the Top Doctor of 2013.\n\nFor his outstanding accomplishments, it is my honor to recognize Dr.  Huu Vo. His service and commitment to both California and our Nation  are worthy of the highest commendation.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…deeply involved  with the California State University, Northridge Semester in Washington  Program, where he teaches and mentors students pursuing careers in  public service. His commitment to these students reflects dedication to  helping others.\n\nI am glad that Andrew is remaining on the Hill and I am sure that I  will see him around Rayburn. I look…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…Representatives, do hereby congratulate Second Lieutenant       Jack C. O'Neill on his graduation from The Basic School and       commend him for his exemplary service and commitment to the       ideals of freedom, integrity, and duty;\n\nBe it further proclaimed that his leadership and sacrifice       stand as an inspiration to all Americans, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…stature bring  to the myriad causes we in Congress grapple with each day.\n\nIn addition to welcoming His All-Holiness to the United States and  recognizing his lifetime of service and commitment to peace, I also ask  that the House join me in congratulating Patriarch Bartholomew for  receiving this year's Templeton Prize. Established in 1972, the  Templeton…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Mr. Speaker, I congratulate Myesha on her recognition from the  University of Chicago. On behalf of a grateful district and a grateful  nation, I thank her for her service and commitment to making our  Cleveland communities safer.                       Trump's Attacks on Black America\n\nMs. BROWN. Mr. Speaker, there is a saying: When America catches…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…currently contributes his time and expertise as a board  member of the Coalition Against Global Genocide (COAGG).\n\nI commend Mr. Yeremyan for years of devoted leadership, service, and  commitment to the Armenian community and to the people of Colorado. His  efforts embody the spirit of civic engagement and cultural stewardship.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize the wonderful  class of interns who served in my office during the fall 2025 semester.  Their incredible dedication to public service and commitment to  learning has been truly inspirational, and the contributions they have  made to Illinois' 13th Congressional District have left a significant  impact.\n\nIn my Washington…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…family was active at St. Francis Xavier Catholic Church, just  off Troost Avenue. His parents, with strong Catholic roots, instilled a  deep sense of faith, public service, and commitment to others,  particularly the underserved, in all of their children.\n\nGerard would continue his Jesuit education at Rockhurst High School,  before attending the University…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…to play a policy role will be important for both of  our nations and for all of us who care about maintaining democratic  values. I know that his passion for public service, his commitment to  internationalism, and his insightful analysis are ending here after his  time in Washington.\n\nIn closing, on behalf of my colleagues in the Senate, I extend my…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…honoring  John Post as he serves as a Co-Grand Marshal of the Mountainside  Memorial Day Parade. His life is a testament to the core principles  that define our Nation: service, commitment, and integrity.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…and what a difference he has  made.\n\nMr. Speaker, I say to Doug and Shelley: Well done. I know I speak for  a lot of people. I thank him for his example of selfless service and  his commitment to helping his fellow man. Godspeed and may he enjoy a  well-earned retirement.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…ensuring that  his community received their mail with the efficiency and reliability  that only a true public servant could provide.\n\nIn recognition of his outstanding service and commitment to safety,  Joseph was honored with the prestigious Million Mile Award from the  United States Postal Service--a testament to his exceptional record of  accident-free…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…District will be felt for  years to come. On behalf of myself, my staff, and the constituents I  proudly serve, I want to thank Bryan Brody for his years of loyal  service, his commitment to excellence, and his patriotic spirit. I wish  him the very best as he continues to work diligently for the American  people.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…police officer basic instructor. Dave also taught criminal justice for  Central Texas College while stationed in Okinawa, Japan.\n\nDave's life is one truly defined by his service. His commitment to  our community, to our great State, and to our Nation has been  unlimited. Above all, Dave's family has always been his greatest source  of strength. Dave has been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…its  economic vitality.\n\nMr. Speaker, it is with great pleasure and immense pride that we  honor and thank the Lakes Pilots Association for their decades of  dedicated service, commitment to safety and environmental stewardship,  and for their indispensable role in sustaining commerce and maritime  heritage throughout the Great Lakes region.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Seiler, named the 2026 Woman of the Year by the United Way of the  Coastal Empire at the annual Women Who Rule event in Savannah, Georgia.\n\nMs. Seiler's leadership, service, and commitment to community reflect  the very best of civic engagement and personal dedication. A graduate  of the University of Georgia's Henry W. Grady School of Journalism, Ms.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the service and  commitment of the Chester First Aid Squad. Since 1945, the Chester  First Aid Squad has provided exceptional care in times of need. For 80  years, these volunteers have provided…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695189/recognizing-chester-first-aid-squads-80th-anniversary"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…District  to the many firefighters who have given their time and bravery to this  firehouse over the years. Congratulations to S.W. Johnson on 150 years  of dedicated service. Their commitment, bravery, and volunteer spirit  are an inspiration to us all.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…continues to be felt in the work we do every day. On behalf of myself,  my staff, and the constituents I proudly serve, I want to thank Kathy  Zhu for her years of loyal service, her commitment to excellence, and  her patriotic spirit. I wish her the very best as she continues her  journey in public service.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…nonprofit that supports well-being of the department's employees and  their families.\n\nOn behalf of a grateful community, I thank Chief Augello for his  outstanding service and the commitment to the people of Palm Bay.\n\nCongratulating Brevard, Indian River, and Orange Counties in Florida\n\nMr. HARIDOPOLOS. Mr. Speaker, I rise today to congratulate three…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693664/recognizing-chief-mario-augello"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…course of more than three decades in economic development, Mr. Greer  has helped shape the future of Cullman County through his steady  leadership, dedication to public service, and commitment to creating  opportunities for others.\n\nMr. Greer was born in Birmingham and moved to Cullman with his family  more than 50 years ago. Cullman has been his home ever…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}]