[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…workplace.\n\nThese significant investments in the service signal our confidence in  the capability of the Coast Guard to conduct each of their diverse  missions to better serve the American people.\n\nThis bill puts coasties first by addressing the need for more  affordable and quality housing. It also provides enhancement of our  coasties' quality of life,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…percent of public service,  have been really disrespected and disserved in just these weeks, with  such destructive and repugnant effects on them, on the veterans they  serve, and on American values. Our Nation and they deserve better.\n\nRes. 105, which is at the desk; further, that the resolution be  agreed to, the preamble be agreed to, and that the motions…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Capitol are among America's most iconic. Limiting  commercial filmmaking and photography of the Capitol, an important  vehicle for telling the Nation's story, does not serve the American  people. Commercial films and photographs of the Capitol, the seat of  our democracy, are perhaps the best modern vehicles for telling the  Nation's story and showcasing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699181/introduction-of-a-bill-to-permit-commercial-filmmaking-and-photography-on-the-grounds-of-the-us-capitol"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…efficiency.  It threatens the integrity of our civil service. These rights exist for  one essential reason: to shield Federal employees from political  pressure so that they serve the American people, not the agenda of any  one President or political party.\n\nNo worker should have to take a political loyalty test to receive or  keep his or her job. The Protect…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…parties. They felt that it was very important  for Congress to be able to be the backstop at a moment when, for  whatever reason, a President made a decision that didn't serve the  American people properly or well.\n\nIf we can't overcome this veto, I think it would say that no bill is  safe and that the efforts of every single elected Member of Congress…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…tumultuous elections, and a rapid collapse  of our social fabric.\n\nIn the last 9 months, the Republican majority has given up the power  and the responsibility of Congress to serve the American people and has  turned this Congress into nothing more than a rubber stamp for Donald  Trump.\n\nWe should do what we were sent here to do. We should make people's  lives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…power. This is a  moment to draw a line between a political system that serves donors and  one that serves the American people. What we really want in the end is  to serve the American people.\n\nIf you just look back at the past couple of decades since Citizens  United, since 2010--in 2010, in that cycle, $3.6 billion in total cost  of Federal elections…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…nursing homes open? How do we take care of the American  people's health?\n\nThis Republican resolution is totally irresponsible. It is an  abdication of our duty to serve all the American people, not just those  at the top.\n\nMr. Speaker, the top 1 percent of earners in this Nation control more  wealth than the bottom 50 percent. It is time for economic…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689913/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…never have to stand up and tell me they will  interrupt their lives to stand up and fight with me in D.C. against the  Republican agenda, but they did.\n\nOur job is to serve the American people, not rip access to basic  necessities away from them at the behest of a President who declared  himself king. Frankly, it is insulting to me, to this institution,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…claiming retirement  benefits. However, I am concerned that the bill's lack of  administrative funding to implement the legislation would harm the  Agency's ability to serve the American public.\n\nAccording to SSA estimates in September 2025, implementing this bill  would cost between $8 and $12 million and require significant manpower  to update its rules,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…can't  even imagine how anything could cost that much to build. Maybe there  will be an eighth-inch of gold on every surface or something--I don't  know--but that doesn't serve the American people. It doesn't make one  single person in America have better healthcare or a better education  or a decent home in a decent community or a better job. It doesn't…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…that is critical to the functioning of our government.\n\nAs House appropriators, we are tasked with ensuring that our Federal  agencies are properly funded so they can serve the American people.  However, we are being asked to perform this vital duty without even  knowing what plans DOGE has for the future of our agencies, let alone  the true role Elon…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688338/stopping-appropriation-work"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Speaker, I rise in support of the rule and the underlying  legislation. The four separate measures being considered under this  rule all have a singular commonality. They serve to put American  interests first, where they should always be.\n\nAll of us can agree that within the global markets, and on the global  stage, America must always remain competitive…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693550/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…What is taking place in Minnesota is pure  evil, and it is straight from the pit of Hell.\n\nIt is impressive to me that a 23-year-old independent journalist did  more to serve the American people with investigative reporting than the  so-called experts in the legacy media. Where are they?\n\nThe fake news is complicit with the radical Islamic takeover of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…$900 million-plus on progressive  politics, and 86 percent of it came from their member dues. They are  using taxpayer-backed salaries to fund partisan activism, not to serve  the American people.\n\nH.R. 2550 strips the President of his constitutional authority,  undermines national security, and rewards partisan obstruction.  President Trump is trying…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…measures undoing ill-advised Biden-era policies, represents a  decisive step in the right direction.\n\nLet's get back to smart, forward-thinking policies that actually  serve the American people, not far left activists and D.C. bureaucrats.\n\nMr. Speaker, I urge my colleagues to support this rule, and I reserve  the balance of my time.\n\nMr. Speaker, the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…who are being used in  what is a political battle--I want to excuse them from a partisan  political battle that is not of their making so they can go back to  work and serve the American people.\n\nWhat we have here is a political standoff between Democrats and  Republicans in Congress. It has nothing to do with the air traffic  controllers. Some of them…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…should not be used to fund woke projects overseas or  bloated government programs at home. They should be funding efforts  that protect our border, defend our Nation, and serve the American  people.\n\nHouse Republicans promised to root out waste, fraud, and abuse. H.R.  4 keeps that promise and takes a critical step forward toward a leaner,  more accountable…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…million hours and $135 million in 2019, the lack of unified  reporting means the full scope of the problem remains unknown today.  This is money that should have gone to serve the American people, not  to subsidize private union interests.\n\nEnding ``official time'' is a commonsense step to ensure taxpayer  dollars are used responsibly and to increase accountability…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…outlined in our Article I  responsibilities to appropriate funding for the missions of departments  across the government. When we fail to uphold that mandate, we fail to  serve the American people. We fail to do right by them.\n\nWe must bring the appropriations process to a close. We must move  forward and complete more work in service to the American people.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…groups, such as Demand Justice. The situation is  bad for our country and really bad for the American people.\n\nPutting high-quality judicial nominees on the bench to serve the  American people should be something that unites this body. In fact, in  the Biden administration, that happened. Over 80 percent of the  judicial nominees in that administration…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…than manage schedules and  operations. She shaped culture. She built a team that worked hard,  treated people with respect, and never lost sight of why we are here:  to serve the American people, especially the veterans and families who  depend on us.\n\nShe has an uncommon ability to see both the big picture and the  smallest details. She could navigate…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…forward.\n\nAt the end of the day, our eyes must remain affixed to our very own  North Star. Our North Star is governance, Mr. Speaker. Deviating from  governing does not serve the American people, nor does it make good on  the mandate they entrusted us with.\n\nThe compromise agreement of dead pairing that was formulated and led  by the Speaker and others…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Mr. KNOTT. Mr. Speaker, I am ready for that debate any day, and I am  ready for that discussion any day.\n\nAgain, the Republicans believe that American tax dollars should serve  American citizens and not those who are here illegally.\n\nCongressman Harris pointed out back in February that an NGO in North  Carolina was actively working to hinder law enforcement,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…The Republican message is simple: Let's fund the government; protect  Social Security; keep servicemembers and border agents paid; keep the  government open in order to serve the American people.\n\nSenate Republicans are ready. Ready to keep the government open.  Senate Democrats are bragging about being ready to shut it down. The  choice is theirs, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}]