[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Joshua  and his team from the Twinsburg Fire Department to ensure that they got  that baby out safe and sound.\n\nI just say to Joshua and the entire Twinsburg fire safety services  team: There are people who run away from fire, but you-all ran toward  it. Not only did you run toward it in that situation, you run every day  that you are on call. In this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Together, we were able to focus on  the end-to-end guest experience of constituents visiting our Nation's  Capital for the inauguration.\n\nThe JCCIC ticketing and Member services team, led by Davita Jones and  including Anthony Davis, both detailed from the House Sergeant at Arms  Office, and Navy CAPT Judy Malana, counted, organized, and distributed…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Kyle Smith has made through his work with the Pasco  County Human Services Team. The Pasco County Human Services Team has  proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Danielle Bierman has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…This prestigious award recognizes the amazing hospital  workers in our State for their longtime service in healthcare.\n\nMr. Barth serves as director of rehabilitation services, where his  team is committed to delivering quality care  to their patients and clients in Blairsville and Union County, Georgia.\n\nMr. Barth has provided extensive care for disorders…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…and our families and our communities to stop the flood  of drugs and crime pouring into this country. It is unacceptable.               Honoring the UMC Emergency Medical Services Team\n\nMr. ARRINGTON. Mr. Speaker, I rise today to honor a group of heroes  that have been a lifeline for the people of Lubbock County for 50  years: the UMC Emergency Medical…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Maria Wilkinson has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Rebecca Seils has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jordan French has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}]