[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…families'  power bills.\n\nThe administration pulled the same trick with the Eddystone oil and  gas plant in Pennsylvania, where two units that were nearly 60 years  old were set to expire. Pennsylvania's grid operator determined that  taking the plants out of service would not impact grid reliability, but  President Trump didn't care. The Pennsylvania Public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…alike since the COVID-19  pandemic.\n\nThe current waiver, which has been extended by the Drug Enforcement  Administration and the Department of Health and Human Services, is set  to expire in December of 2025. This legislation will make permanent VA  prescribers' authority to prescribe controlled substances via  telehealth, if and when DEA and HHS end the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…private agencies provide foreign importers with certainty regarding the  quality of the grain bought from U.S. farmers.\n\nWith parts of the existing U.S. Grain Standards Act set to expire on  September 30, 2025,  I am proud to be the lead Democratic cosponsor to reauthorize and  improve this law.\n\nThis bill before reauthorizes annual appropriations for standard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…HOYLE of Oregon. Mr. Speaker, at a time when global tensions are  rising, the last thing we need is more weapons. That is why it is so  important that the New START treaty, set to expire in 21 days, is  renewed by the administration quickly and in good faith.\n\nThe New START treaty reduced the number of nuclear warheads in the  United States and Russia to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…side of the aisle  have blocked each and every one of these efforts.\n\nNow, this program to provide that help that families need to cover  their cost of health insurance is set to expire at the end of the year,  and there is no plan in sight to replace it and to help families afford  health insurance. Allowing these tax credits to expire is going to harm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…with 8 years of Active Duty service in the  Air Force was fired from the VA in Michigan after receiving an  ``outstanding'' performance review. His probationary period was set to  expire last week, just 12 days after he was let go.\n\nThese cuts are not based on fact. They are not based on logic. They  are just cruel. And our country will not be better off.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…approaching ACA tax credit  funding deadline and to give voice to everyday Americans who will be  harmed by the Republican-led healthcare crisis. The enhanced ACA tax  credits are set to expire on December 31 unless congressional  Republicans join Democrats to extend them.\n\nIn a few short weeks, millions of Americans will be forced to pay  astronomical prices…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…uncertain? This is not a theoretical issue. These are the       very real questions that our residents and community members       are asking themselves as TPS for Haiti is set to expire on       February 3rd. For our children, what is next for them if this       protection is stripped away? Separating families in this way       undermines everything we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…however, Haiti faces extraordinary political unrest, economic  strain, and humanitarian need. Just as families are struggling to  afford basic goods, this vital program is set to expire. Without this  critical trade preference, Haitian exporters will face sudden and steep  tariff increases. For many factories, these added costs are  unsustainable. This…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Affordable Care Act tax  credits to access affordable, quality healthcare and coverage.\n\nI could go on with the things. For example, currently these tax  credits, they are set to expire at the end of this year. If these tax  credits were taken away, families will pay up to 90 percent more for  their healthcare, and 5 million Americans could lose their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…capabilities of the world.\n\nToday, that system is fraying. Russia has suspended its participation  in New START. Onsite inspections remain paused. The treaty itself is  set to expire in less than 1 month.\n\nAnyone who remembers past arms control negotiations understands the  gravity of this moment. Negotiating a successor agreement will take  years,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…funding  deadline, 30 days to go, and to give voice to everyday Americans who  will be harmed by the Republican-led healthcare crisis.\n\nThe enhanced ACA tax credits are set to expire on December 31 unless  congressional Republicans join Democrats to extend them.\n\nWithout an extension of the ACA tax credits, tens of millions of  individuals and families…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…a precipice. In less than a month, the New  START treaty, the last remaining major arms control agreement between  the Soviet Union, or Russia, and the United States, is set to expire.\n\nIf we allow this treaty to lapse without a replacement, then we will  be entering a world we haven't seen in decades, a world without limits  on the nuclear arsenals…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Members. It supports arms control and condemns Russia's  purported suspension of its participation in the New START Treaty.\n\nThe current extension of the New START Treaty is set to expire in  under a year, and anyone who remembers previous arms control  negotiations will know that there is almost no time left to negotiate a  subsequent treaty.\n\nAdditionally,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…creating loopholes for plans that will escape any  regulatory oversight.\n\nFurther, Mr. Speaker, this plan does nothing to extend the ACA  enhanced tax credits which are set to expire. Millions of people will  see their premiums skyrocket, and millions more won't be able to afford  any insurance at all. If we bring up the bipartisan bill, then we could…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…that is only one part of the conversation. The second part of the  conversation is, what do we do about January 1, 2026, when the tax  credits that the Democrats passed are set to expire at the end of this  year? What do we do for those Americans who are in some cases facing  $33,000-a-year premiums who have a salary of $90,000? What do we do for  them?…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…have reinvested in the U.S. and, at the same  time, have reinvested in their communities, reinvested in their  employees, and have grown their presence. Most of that is set to expire  at the end of this year. If we don't get a tax bill done, then you are  just going to see a significant tax increase across everything.\n\nMr. Speaker, I will also talk…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…been stress-tested by Members on both  sides and one that works out better in the long-term for the American  people.\n\nBut with the COVID-era enhanced ObamaCare credits set to expire  according to a timetable set by Democrats since no Republican voted for  it in the first place--instead of working through the regular order to  come up with a bipartisan…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…but they  predate the park's expansion and have long been recognized by Congress  as a valuable energy asset.\n\nWith the current statutory authorization for the permits set to  expire in 2026, this bill provides much-needed certainty for the  continued operation of a critical source of reliable energy. Without an  extension, Southern California Edison…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…up the enhanced or COVID- era premium tax credits that are expiring at the end of this month.  Since we are talking energy tonight, we need to understand that they  were set to expire, without a single Republican vote, to expire them in  the Inflation Reduction Act, which was spent money on the Green New  Deal.\n\nSo when you put in context what President…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…of this, and we should not  spend more money to prop up a failing program, certainly not a COVID- era, temporary program that they put in place and they, the Democrats,  set to expire this year.\n\nWaste, fraud, and abuse in this program cannot be ignored. My fellow  colleagues have gone over that today in large measure, but today,  Congress is being asked…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…disproportionately harmed  by lockdown policies due to their reliance on confined gathering  spaces.\n\nThe statute of limitations for prosecuting fraud within these  programs is set to expire beginning early next year. If Congress does  not act, law enforcement will not have the necessary time to  investigate and prosecute these crimes.\n\nAlong with my colleague,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…companies who were seeing record profits. That is now  what they want Republicans to renew.\n\nIt is an insurance company bailout that Democrats created to be  temporary. They set it up to expire. They are now saying that the world  is going to end if that insurance company bailout doesn't get renewed.\n\nAt the same time we as Republicans worked to actually lower…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…far from reality. Adding qualified providers to the list of grantees  helps keep the door open for veterans seeking mental health services.  The reality is this program is set to expire in September, and we  cannot allow this to happen.\n\nDelay jeopardizes this program. We have big problems to solve. Adding  qualified mental health providers will only help.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in this issue, but not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which was a bill under the reconciliation  process. It was solely the Democratic Party who put that in place, and  the question I have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…would have had to pay an  additional $7,450 in taxes next spring without that legislation having  passed. The lower rates from the Tax Cuts and Jobs Act from 2017 were  set to expire at the end of this year, but the Working Families Tax  Cuts bill made these lower rates permanent.\n\nIn addition to the increased standard deduction and lower rates  across…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…programming? The central bank. They can condition your  access to your own money with whatever parameters they put in place.  They can filter transactions. They can even set them to expire.  Monetary policy wonks in the communist banking world think this is a  feature, not a flaw. They think if they can set your access to your  money to expire, then it…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693732/anti-cbdc-surveillance-state-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…fund.\n\nNow, Democrats are uniting behind that policy to send billions more  of taxpayer dollars to big health insurance plans. With the Democrats'  temporary COVID credits set to expire at the end of the year, they are  attempting to turn their policy failures into political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…criminal laws.\n\nRight now, fentanyl analogues are considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now set to expire on September 30 of this year.\n\nThat is why the HALT Fentanyl Act, led by myself and my friend, the  gentleman from Ohio (Mr. Latta) in this House and then Senators Cassidy…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Baskaran)\n\nThe African Growth and Opportunity Act (AGOA), first signed       into law by President Bill Clinton in 2000, is a unilateral       U.S. trade preference program set to expire in September       2025. Its pending reauthorization has sparked debate over       whether--and how--it should be extended and reformed. A       failure to extend AGOA…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}]