[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…to issue subpoenas before hearings. That means third parties can  be compelled to produce relevant documents, electronic records, and  other evidence early, facilitating settlement, reducing the need for  protracted litigation, and helping to resolve disputes sooner rather  than later.\n\nThis bill also expands the role of special trial court judges,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…related orders to provide information to the court and  opposing counsel, while publicly flaunting their refusal; acted in  contempt of court for violating a court-sanctioned settlement  agreement; and conducted enforced disappearances of persons without due  process and without disclosing their fate and location to their  families and legal counsel, in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…their colleagues.\n\nThis shutdown need not have happened. Republicans control the House,  Senate, and Presidency. They could have kept the government open with a  negotiated settlement, or in the same way they placed Mr. Gorsuch on  the Supreme Court, by using a majority rule rather than a 60-vote rule.\n\nI cannot support this corrupt and dirty CR, and I…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the waste, fraud, and abuse that  it helps the Department uncover and address. Those negotiations have  allowed the Department to bar criminally bad actors from receiving  settlement funds and being reinstated.\n\nThere is a lot more to say on this topic, but let me just finish by  saying that I hope we can work together. I hope the chairman and I can…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…allies and to punish perceived enemies.\n\nLet me briefly highlight just a few other examples.\n\nEarlier this year, the Trump Department of Justice agreed to a $5  million settlement with an estate of a January 6 rioter who was killed  while attempting to violently breach this Chamber just outside those  doors. As the chief of police of the Capitol Police…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 2916 would finalize a longstanding land claim in  New York for the Saint Regis Mohawk Tribe by ratifying and confirming  the Agreement of Settlement and Compromise to resolve the Akwesasne  Mohawk Land Claim in the State of New York.\n\nUnder this settlement, the Tribe will see 3,500 acres of land  returned to reservation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697674/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the ``Luzones Indios'' came  ashore from the Manila-built galleon Nuestra Senora de Esperanza in  Morro Bay, California. This was followed by the first permanent  Filipino settlement in the United States in St. Malo, Louisiana in  1763.\n\nSince those early beginnings, our Filipino American community has  grown to nearly 5 million people and is the third…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Native Allotment Act to provide  individual Alaska Natives up to 160-acre allotments. However, this law  was later repealed with the passage of the Alaska Native Claims  Settlement Act in 1971. While many Alaska Natives were able to apply  for allotments prior to the ANCSA, others were unable to due to their  active military service at the time.\n\nTo…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693475/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…from the Park Service  to answer any questions, but there are two problems with this  assumption they seem to be proceeding under.\n\nOne, the current rule was issued under a settlement agreement to  enforce compliance with environmental protection laws. Repealing that  rule doesn't repeal those legal obligations, so whatever outdated rule  the administration…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…blindfolded, and often beaten in military vehicles  during transport before arriving at an Israeli police station for  interrogation, which is often located in an Israeli settlement. They  are routinely interrogated alone without the presence of a family  member or attorney and often threatened with physical violence if they  don't confess.\n\nNearly half…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…full faith and backing of the U.S.  Government. A CBDC could serve as an alternative to existing forms of  payments, and it will have benefits, including instant payment  settlement, providing a medium for cross-border transactions, and  fostering greater financial inclusion. Additionally, Congress could  require that the architecture of a central bank…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…is an unrealistic objective.\n\nHe further stated:\n\n[T]he United States does not believe that NATO membership       for Ukraine is a realistic outcome of a negotiated       settlement.\n\nIn essence, Secretary Hegseth conceded away our most important  leverage against Russia. His statements, echoed by President Trump and  Vice President Vance, have already…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…individuals who  were there doing the civil liberties work and doing this oversight  work--they are gone. So now, what we are seeing is that lawsuits are  being dismissed. Settlement agreements, you know, issues that really  would have been brought to light are just being dismissed.\n\nSo the reason I am asking this is because my colleagues now have a…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…I know  they think about them. I know they are serious about the points they  make. Reopen the government and raise your issues. Let's see if we can  come to a negotiated settlement, but let's not punish the American  people.\n\nA ``no'' vote on this, again, means soldiers and military families  don't get paid. A ``no'' vote means that people in need of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…hundreds of thousands of dollars out of the Justice Department and the  Federal Government--taxpayers--this would address that by simply saying  anything that is awarded--a settlement that is awarded under this  statute--would be forfeited to the U.S. Treasury. But it would preserve  the important protections that are in place under the statute when it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…communities, but for far too long, Alaska Native  Corporations have faced unnecessary delays and constraints in securing  the lands they were promised under the Alaska Native Claims Settlement  Act.\n\nAfter more than 50 years, Cape Fox Corporation, representing the  village of Saxman, is among the last southeast villages still waiting  for a full land entitlement.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…to  the President; we just want to get it accomplished. We want to get some  things done for Alaska.\n\nThe first measure, which is H.R. 42, amends the Alaska Native Claims  Settlement Act, or ANCSA. It amends it to ensure that when Alaska  Native elders, the blind, and the disabled receive dividends from their  settlement trusts, they do not inadvertently…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…That was in the law.\n\nWhen these guys were over serving in Vietnam, Congress changed that  law. It is complicated, but they passed what was called the Alaska  Native Claims Settlement Act--a very important bill--and it  extinguished the ability for Alaska Natives to get their Native  allotment.\n\nWell, guess what. A lot of these guys and a few women were…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I thank my colleague, Representative  Crank, for yielding.\n\nMr. Speaker, I rise in support of H.R. 2916, my bill to ratify the  land claim settlement agreement between the Saint Regis Mohawk Tribe,  the Mohawk Council of Akwesasne, New York State, Franklin and St.  Lawrence Counties, the towns of Fort Covington and Bombay,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…why would they  do that? Ashli Babbitt was wrongfully killed on January 6, 2021. The  Federal Government admitted it, and they paid money to her family as  part of a legal settlement. Interesting. But Democrats, they don't care  about the truth.\n\nToday is a reminder that radical Democrats and the Deep State, they  don't like our country the way we run…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and responsible natural resource development, like mining  and timber harvesting.\n\nWhen these acres were put aside, rural communities lost their access  to this land for settlement and economic development. To compensate  these communities, they were supposed to receive a portion of the  revenue the Federal Government generated from responsible resource…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2916) to authorize, ratify, and confirm the Agreement of  Settlement and Compromise to Resolve the Akwesasne Mohawk Land Claim in  the State of New York, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…expanded the permissible uses of off-road vehicles  throughout Glen Canyon, but groups quickly sued, leading the Biden  administration to enter into a hasty and secretive settlement against  the wishes of local communities.\n\nUnder that agreement, the Park Service issued a revised rule in the  waning days of the Biden administration that restricts motorized…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…303 of the Federal Food, Drug, and Cosmetic Act       (21 U.S.C. 353) for failure to comply with requirements under       such section 505B, including, for each penalty, settlement,       or payment, the name of the drug, the sponsor thereof, and       the amount of the penalty, settlement, or payment imposed.''.       SEC. 5. EXTENSION OF AUTHORITY…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Donald Trump. God bless President Donald J. Trump. I am so glad he  won. What has he tried to do? Make peace, not war. He gave the  Ayatollah 60 days to find a peaceful settlement regarding their  enrichment program. They could have nuclear power, but they can't  enrich. There are 20 nations that have nuclear power that get the fuel  for their reactors…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…domestic  energy production.'' The Arctic Slope Regional Corporation, ASRC, one  of the 12 land-owning Alaska Native corporations created under the 1971  Alaska Native Claims Settlement Act, ANCSA, and representing the  interests of more than 13,000 Inupiat shareholders, echoed those  concerns. In testimony before the Alaska Legislature, ASRC Vice  President…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…of the area truly highlights Wyoming's Western heritage.  In 1834, William Sublette and Robert Campbell established Fort William,  a trading post for fur traders. As the settlement grew in popularity,  it expanded and attracted other travelers, including emigrants,  missionaries, and homesteaders.\n\nFrom 1841 to 1890, the area served as an important…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…an order remanding the       matter to the agency for reconsideration without vacating the       analysis;\n\n``(iv) any claim under the civil action was resolved by a       settlement agreement or consent decree between any plaintiff       and the defendant lead agency;\n\n``(v) the civil action is still active; and\n\n``(vi) any of the plaintiffs received…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}]