[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…years--and I was looking around, and I realized  that times change and they don't.\n\nCatholic Relief Services, which is one of the largest agencies in the  United States that help settle refugees, who are legal immigrants-- refugees are legal immigrants--about 15 years ago settled a Congolese  family into my church who had been in a refugee camp after fleeing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Administration in more than 15 years, Jack has  proven to be a trusted partner and effective negotiator.\n\nJust to show you how much work he does do, one of the issues we had  to settle on the FAA Reauthorization Act occurred when I was in my  district on Whidbey Island, while Sam was on Midway Island in the  middle of the Pacific--I don't even know which…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…regrettably, you may cross over.\n\nMr. President, I beg that you not do so. I beg that you would not do  so and that you would honor the third branch of government designed to  settle disputes among us, not always in a favorable way to some,  obviously, but that is what it is there for.\n\nI beg you, Mr. President, that you would not dishonor the judiciary…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…million into  Trump's crypto ventures. And guess what. Trump's SEC--poof--it is not a  legal term, by the way--poof--the SEC paused the litigation and now is  in negotiations to settle that case. It is out in the open.\n\nOne shipping firm with operations in Mexico announced it has raised  $20 million to purchase the Trump coins for the express purpose of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Europe. Study the map. Mr. Speaker, if you know  nothing about Europe and that vast continent, think about 11 time zones  and then our closest allies in the free world. Let that settle.\n\nThe facts speak for themselves. If my colleagues need more proof, ask  Poland, Georgia, Estonia, Latvia, Lithuania, and a dozen other  countries that Russia covets. They…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…particularly vile Democrat, a  guy by the name of Benjamin ``Pitchfork'' Tillman--just a bad, bad guy.  Actually, our rule XIX, which we use against each other occasionally to  try to settle the tone of debate, it is in our rules because of  Benjamin ``Pitchfork'' Tillman.\n\nAnyway, Roosevelt--a Republican--and Tillman--a Democrat--got  together and said: Let's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Hortman and John Hoffman, were  gunned down in their homes. Tragically, Melissa died alongside her  husband, Mark.\n\nNobody should be killed for their views. This is not how we settle  our differences. I can't help but feel that we have lost our way as a  country.\n\nThe radicalization and easy access to firearms has been a lethal  combination that doesn't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…for observing that conduct will best be  referred to your own reflections and experience. With me, a predominant  motive has been to endeavor to gain time to our country to settle and  mature its yet recent institutions and to progress without interruption  to that degree of strength and consistency which is necessary to give  it, humanly speaking, the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…dollar, not the Chinese  yuan.\n\nThere is reason for both consumers and small retailers to be  supportive of this legislation. Stablecoins offer faster, more  affordable ways to settle transactions that will benefit everyone.\n\nEarlier this year, Senators Hagerty, Alsobrooks, Scott, Lummis, and I  introduced the bipartisan GENIUS Act, which is the strongest…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of the legislation would exempt firms if they relate to ``the       operation of a blockchain system.'' Crypto projects may win       exemption for contracts that trade and settle on a       blockchain. The bill exempts tokens with ``value, utility or       significance,'' a designation that the sponsor itself can       claim. And all existing tokens…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Congress set up inspectors general  to do.\n\nBy confirming Mr. Bell, the Republicans send yet another strong  message to Donald Trump that he can use the Federal Government to  settle personal scores.\n\nI urge my colleagues to respect the laws that we passed here and to  respect the privacy, the decency, and the safety of patients and  providers. I urge my…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…need of  financial relief. In chapter 7 bankruptcy, an individual debtor who has  fallen on hard times, rather than go to debtor prison, which was the  old-school method, can settle his or her debts, pay off back taxes,  stop further collection actions, and secure a fresh start.\n\nThe process is means-tested, so it is available only for those who  really…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of American innovation.\n\nLet's be honest about what's going on here. Elon Musk and the so- called Department of Government Efficiency are using the Federal  Government to settle scores: cancer trials, nonessential; national  science databases, too expensive. That is not policy. It is a crusade  against expertise.\n\nLast month, I sat down with five undergraduate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the Federal Government to       federal Indian policy. The fact that our ancestral lands were       claimed by the Federal Government before our people had a       right to settle aboriginal land claims should inform every       decision the Federal Government makes in managing those       lands.\n\nUnlike the Lower 48 model of indigenous representation…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…American citizens.\n\nIn Illinois, JB Pritzker and the Democrats rolled out the red carpet  and actively enticed illegals and those covered by Biden's bogus asylum  programs to settle in my State, to the tune of over 500,000 people.  They received welfare benefits, CDL licenses, and State identification.  The Democrats have even voted to allow them to be…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…the old system failed to give SIFI designees due process or an  opportunity to address the perceived risk before designation. As a  reminder, the MetLife case took years to settle.\n\nLastly, it failed to incorporate the views of the primary regulator,  who typically would have better insight into a company's financial  standing.\n\nMr. Speaker, I believe…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…not buy the newest taser models due to the increased  liability.\n\nThis is not some hypothetical. Unless we make this change, State and  local police departments will have to settle for weaker, less-accurate  taser models due to this misclassification.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…by awarding grants to States and other jurisdictions to       assist residents of such States and jurisdictions to       establish and document property ownership rights or settle a       decedent's estate;\n\n(C) by awarding grants to entities which provide housing       counseling, legal assistance, and financial assistance to       homeowners and their…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Today's resolution is not about any of that. Today's resolution is  about something much simpler, a notion that I would hope would be  unobjectionable: that in this country we settle our differences through  reasoned arguments and debate and not through force and violence, that  we make political decisions through elections and not through riots.\n\nI hope…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Federal Government to       federal Indian policy. The fact that our ancestral lands were       claimed by the Federal Government before our people had a       right to settle aboriginal land claims should inform every       decision the Federal Government makes in managing those       lands.\n\nUnlike the Lower 48 model of indigenous representation…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…spirit shown by generations of village residents have made  Tontogany an outstanding example of American ingenuity.\n\nTontogany's long history dates back to the first settlers to settle  in the area, Samuel and Eliza Hamilton. The village's name comes from  the Ottawa Native American Chief Tondoganie. When it was officially  incorporated in 1895, the town…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…``Siam,'' Eng  and Chang were the first documented Siamese twins. Early in their adult  lives, they traveled around the entire world working in show business,  but decided to settle in the United States.\n\nAfter becoming naturalized American citizens and following a short  stint in Wilkesboro, North Carolina, Eng and Chang, along with their  wives and children,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697642/recognizing-the-siamese-twins-museum"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…United States.\n\nWe are a Nation of pioneers. Martha beautifully embodies that  pioneering spirit. She immigrated to the United States, crossed the  Great Plains, and helped settle Utah when it was a frontier State. She  challenged societal expectations, standing alone in the fields of  science and politics, to advocate for her convictions.\n\nHer unwavering…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…between a child in the  womb and a child outside the womb other than time. That is a separate  child.\n\nScience has settled that issue, but, culturally, we haven't been able  to settle this issue: Are some children valuable and are some children  disposable? Our culture still believes there are some children that are  disposable. I don't. I think every child…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…passion for and knowledge of  our local community.\n\nI commend Sarah Firestone, Sally Bollinger, and Leah Flinchbaugh for  their leadership in the Pennsylvania FFA. As they settle into their new  roles and prepare for bright futures ahead, I wish them continued  success in all of their endeavors.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Act, or ANCSA, land entitlement. In addition, this  legislation will resolve land management issues tied to the Mahoney  Lake power project.\n\nANCSA was enacted by Congress to settle the aboriginal land claims of  Alaska Natives. Under ANCSA, Alaska Native Corporations were  established to receive land under the settlement and disburse money to  Alaska…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal land claims of Alaska Natives.\n\nUnfortunately, this congressional action coincided with the Vietnam  war, meaning that many Alaska Natives who were serving overseas…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…for observing that conduct will best be  referred to your own reflections and experience. With me, a predominant  motive has been to endeavor to gain time to our country to settle and  mature its yet recent institutions and to progress without interruption  to that degree of strength and consistency which is necessary to give  it, humanly speaking, the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}]