[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…it crystal clear that calling  up and passing this resolution would in no way restrict the United  States' ability to defend itself or our partners.\n\nAnd with that question settled, we should be able to turn to the real  need for this debate: Should this Congress continue to abdicate our  constitutional duty to an administration that, at every turn--at…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…U.S. Army Air Corps. He graduated from Morehouse  College in Atlanta after returning home from war, and then he went on  to earn a divinity degree from Colgate in 1952. He settled down in  Seattle, where he came to lead the congregation of one of Seattle's  oldest and largest African American churches for forty-three years as  pastor of Mount Zion Baptist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…causes.\n\nFor too many of our young people, the root causes are that access to  guns is very easy and that they weren't taught to regulate emotions.  Things that in my age were settled on the playground with a fist are  now settled with a gun. Mr. Speaker, you can call someone a name on  social media, and the next thing you know, you are shot dead. We need…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…other Member of this  Chamber grew up like I did where on a pretty regular basis, we would be  sent home from grade school because of the intensity and dangers of  smog that settled over the San Fernando Valley, the city of Los  Angeles.\n\nHow many of you grew up to more reports of unhealthy air quality in  the air quality index or hazardous air quality…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…revocation of  government security clearances and prohibitions on entering Federal  buildings to these law firms.\n\nTwo of the law firms--Skadden; and Paul, Weiss--immediately settled  to avoid sanctions and committed a collective $140 million in pro bono  work to support the Trump administration's agenda.\n\nOther targeted law firms--WilmerHale; Jenner &…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…service. We know that it has been used to pump up profits, in fact,  illegally on several occasions.\n\nMr. Speaker, in 2017, TCF National Bank was cited by CFPB and  ultimately settled. It paid $30 million for its abuse of overdraft  fees.\n\nIn 2020, TD Bank was sanctioned $123 million for, among other  violations, deceptive practices related to debit card…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689853/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that they break is that it has to be a rule. Like I  said, pretty much any Executive action could be plowed through the  process that is being created here. And so however settled the reliance  on a particular permit or a particular license or a particular  Executive decision from years ago, it is all up for grabs under this.\n\nAnd the third, of course--other…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…September 22. The Trump  administration had 60 days to appeal. It did not appeal. We got to  November 21, the last appeal day, no notice of appeal was filed. The  matter was settled; work could continue; and everybody was already back  at work.\n\nThirty days later, the 22nd of December, a new stop work order was  dropped by the Trump administration with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…May 15, he  arrived at the Guam Orote Point Refugee Camp where he volunteered as a  physician at the Army hospital. A month later, he served at Camp  Pendleton and eventually settled in Gardena, California.\n\nIn 1976, he passed the Educational Commission for Foreign Medical  Graduates. Before his eager return to the medical field, he worked a  multitude…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Congressional Hispanic Caucus, we  come from different nations in Latin America and the Caribbean. We are  immigrants, like myself. Many of the members also have ancestors who  settled in places in these United States before the United States even  existed, and everywhere in between. We share, like most Americans with  roots from all over the world, a special…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…with no transparency and no public input.\n\nAs I said, it was being written in the dead of the night prior to the  vote on May 22. This is what we know now as the dust has settled in  terms of what the impact of this bill is.\n\nIn terms of healthcare, the bill is going to cut our Medicaid  program, America's largest healthcare program, and extract roughly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Services, which is one of the largest agencies in the  United States that help settle refugees, who are legal immigrants-- refugees are legal immigrants--about 15 years ago settled a Congolese  family into my church who had been in a refugee camp after fleeing  violence in the Congo. Catholic, French, and Swahili speaking, one  Congolese family came…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…in America, and  average working families didn't benefit nearly, nearly as much. That is  where we should be focusing relief, No. 1.\n\nNo. 2, he argues that the math has been settled because when tariffs  are imposed, those are revenues going into the U.S. Treasury. I repeat:  When the costs go up by American companies importing products, they are  going…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…a better  life for yourselves and family. In the mid-1800s, Steve's paternal  great-grandparents, Pierce and Ellen Dargan, emigrated from Ireland to  the United States and settled in New Haven. His maternal grandparents,  John Glacken and the former Margaret McGowan, who left County Donegal  and Derry, Northern Island respectively, for America at different…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…National Park, they formed temporary camps on tree  islands. The water that flows through our River of Grass was a source  of food, water, and a means of transit.\n\nDepot Tiger settled on a tree island at the turn of the 20th century.  Her son, John Tiger Poole, was born there and later helped found the  Osceola Camp. However, the construction of a new major…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Doyon (and other non-      federal) lands in the vicinity, impeding Doyon's ability to       make economically productive use of its lands as Congress       intended when it settled aboriginal land claims in Alaska.       The management decisions made in the 2024 Central Yukon RMP       also will have long-term implications for communications,       electric…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…morning: I will not allow any Board member for the Federal Reserve to  go through the Banking Committee for a Chair or for replacement of  expired terms until this matter is settled. I have no problem with us  having an investigation, like we should with so many other areas of the  government.\n\nI would like to have oversight of the East Wing construction…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the Androscoggin River, making the location  particularly appealing. The family went on to build a gristmill close  by the following year. The land was considered formally settled in 1812  and then founded in 1826 with the fabled city of antiquity as its  namesake.\n\nBy the 1880s, the town had grown to more than 500 residents and had  farms, two sawmills,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…laws on June 20, 1908, it was in 1925 that the city  officially received its charter, thus marking the beginning of its  formal governance and development.\n\nColeman was first settled in 1882 by pioneers who farmed the fertile  lands of the Warm Springs Hammock. The Florida Gazette of 1886-1887  listed Dr. B.F. Coleman, a physician and one of the area's…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Northern Plains, earning the nickname the ``Grand Old Post.''\n\nIn 1890, the Army decommissioned the fort and sold the land and  buildings to local residents. In its absence, the settled town of Fort  Laramie continued to grow. With homesteaders continuing to move into  the area and the addition of a railroad extension from Cheyenne, Fort  Laramie became a…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…State was sharing with me, one of the great frustrations of  Democrats in my area is, for 15 years, they raised money and ran on  marriage equality. Well, that is pretty much settled. They ran on the  right to terminate pregnancies. Well, now that is in my State  constitution.\n\nWhat do they run on now? They run on rage, apparently.\n\nI want to get this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Wesleyan University,  where he played football for 4 years and later earned his MBA from  Washington University.\n\nIt was at Illinois Wesleyan that Ted met his wife, Carol. They  settled in Pearl River, New York, where they raised their children,  Traci and Craig, before later moving to Stony Point.\n\nTed built a remarkable career at Ted Schultz Auto Sales,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Polk County, Florida. The city officially received its  charter on April 3, 1925, thus marking the beginning of its formal  governance and development.\n\nPolk City was first settled in 1922 when Mr. Isaac Van Horn was  traveling through Polk County and believed oil fields waited to be  exploited. Mr. Van Horn was responsible for naming the town after…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694002/recognizing-the-100th-anniversary-of-the-city-of-polk-city-florida"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…policy is untested or  unprecedented doesn't mean it is illegal. Democrats may impugn  President Trump all they want, but these fundamental constitutional  concerns are best settled at the appellate level.\n\nThis legislation does nothing to affect the proper avenues for  constitutional challenges. Congress has always reserved this power to  bring order…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…celebrating the 225th anniversary of a community that is a beautiful  place to live, work, and raise a family.\n\nLeeds, initially part of the Littleborough Plantation, was settled as  early as the 1780s, with fertile land and plentiful water nourishing  the first families. As Leeds developed, so did agriculture and small- scale manufacturing that proved…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Speaker, for the umpteenth time: There will be no mining in the  Boundary Waters. There will be no mining in the buffer zones around the  Boundary Waters.\n\nMr. Speaker, that was settled in 1978. Then-Democratic Congressman  Jim Oberstar said: Okay, if you are going to make the wilderness area,  do not take our livelihoods away, which was timber harvesting…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…will mark this historic milestone with  a Centennial Celebration on Saturday, June 21, 2025.\n\nThe roots of Mascotte trace back to around 1885, when founder J.W.  Payne first settled the area. The city takes its name from the  Mascotte, a ship owned by Tampa civic leader Henry B. Plant. The  vessel, which played a role in transporting tobacco from Cuba…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692392/recognizing-the-100th-anniversary-of-the-city-of-mascotte-florida"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the next cycle.\n\nIt has gotten completely out of hand. It has gotten to the point  where we could get into this world of rolling redistricting where  district lines are never settled for more than a couple of years and  where the connection between voters and Representatives is continually  being severed.\n\nI have called time and again for an end to this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…citizens and following a short  stint in Wilkesboro, North Carolina, Eng and Chang, along with their  wives and children, made the decision to move to Mount Airy in 1854.\n\nThey settled on Mount Airy because they sought better farmland and  believed that the area presented many educational opportunities for  their children. They each had 13 children. Soon…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697642/recognizing-the-siamese-twins-museum"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…became a municipality in 1923 and was incorporated as  a city in May 1925. The City of Ocoee will host their Centennial  Celebration on Friday, May 9, 2025.\n\nOcoee was first settled in the mid-1800s, near Starke Lake, southeast  of Lake Apopka. In 1886, Dr. H.K. Clarke, Charles J. Chunn, and R.B.F.  Roper developed the Town of Ocoee subdivision, naming…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690916/recognizing-the-100th-anniversary-of-the-city-of-ocoee"}]