[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…It is not substance abuse. It is  loss of a job. Homelessness is directly linked to joblessness.\n\nThese folks that Trump fired, these are folks who did one, two, six,  even seven tours. They came home and chose to continue serving their  Nation by joining the Federal service. These are heroes who deserve our  utmost gratitude, not a letter from Elon…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…successfully  arguing against his executive orders and the harms and effects they may  have on America.\n\nIn addition, many of our colleagues across the aisle have introduced  at least seven bills to impeach Federal judges who have ruled against  the Trump agenda.\n\nThey attempt to cripple our judicial branch of government which  guaranties a delicate balance in…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…agent has my photo on his phone.'' She was stopped and shot.  The bullets caused her to bleed profusely. The wounds caused her almost  to bleed to death.\n\nThe agent who shot her seven times--seven bullets in her body-- boasted about it. Charles Exum, the agent--she knew him; she named him.\n\nHere is what Charles Exum had to say to his friends, his colleagues,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.       The Judicial Nomination Commission, with seven members       appointed by the Mayor, DC Council, President, US District       Court for DC, and the DC Bar, works. As recently as last       month, President Trump nominated…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…weeks, my Democratic colleagues and I have seen Americans' frustrations  firsthand. During the Easter recess, I traveled from one end of my  State to the other. I visited six of seven congressional districts  represented by Republicans in Congress in New York, and I spoke with  small business owners, seniors, healthcare workers, veterans, local  electeds,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…President Trump has sent a bill to Congress, and one of the pillars  of that bill is to rescind the funding for refugee resettlement  programs in the United States run by churches. Seven of the ten  organizations that resettle refugees in the United States are faith- based organizations. The largest two are the U.S. Conference of  Catholic Bishops, operating…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…every ACA exchange for covering  abortion.\n\nThis is catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured through ACA since 2014 will be subject  to this change.\n\nAnd while our communities get sicker, our kids get hungry.  Republicans weren't satisfied…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.       The Judicial Nomination Commission, with seven members       appointed by the Mayor, DC Council, President, US District       Court for DC, and the DC Bar, works. As recently as last       month, President Trump nominated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…humanitarian work, and right now over  16,500 people are waiting to be medically evacuated from Gaza for  essential treatment.\n\nI recently heard from a mother named Hadeel. Seven months ago, her 6- year-old son died while awaiting medical evacuation. He suffered from a  kidney condition, and the decimated medical system in Gaza could not  provide him…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…literally, healthcare, mental health  support, and the things they need. That is over a trillion dollars to  Trump's so-called Department of War, even after the Pentagon failed  seven audits in a row.\n\nAs recently as 2023, the Pentagon could not even account for 62  percent of its assets--a trillion dollars, while the President is  deploying troops in our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…filing service that helped over 140,000 people file their taxes in  2024.\n\nSix, it increases fees on asylum seekers and dumps billions into  Trump's mass deportation efforts.\n\nSeven, get this: The Republicans' bill is great for Big Oil and Gas.  It turns over millions of acres of public lands to big corporate  drillers and would allow them to pay to get…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this evening to say that the rioters who created the chaos that  day here at the Capitol were un-American. They were violent. They were  unlawful.\n\nI rise to pay tribute to the seven officers who died, the 150 that  were injured, many of whom were hospitalized and some deal with PTSD  until today.\n\nOn March 2022, a year following that, this Congress passed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…criminalizing  our communities while stripping away the very resources that keep us  safe.\n\nFinally, money talks, so let's talk money. This administration  slashed funding of seven government agencies that provide Black  communities with educational materials and economic opportunities,  including the Minority Business Development Agency, the only Federal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Cuthbert, Georgia, and John Melton Redding (Amanda) of Baton Rouge,  Louisiana; and his sister, Gail Redding Corlee (Leonard) of Georgetown,  Georgia. ``CP'' also leaves behind seven grandchildren, nine great- grandchildren, two great-great-grandchildren, and numerous nieces,  nephews, and cousins.\n\nMr. Speaker, my wife Vivian and I, along with the more…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…for passage because at the end of the day, this body  has not been willing to hold the Pentagon and defense industry's feet  to the fire.\n\nThe Pentagon has failed to complete seven audits in a row. That is  seven. Until the Pentagon faces real consequences for being unable to  account for the billions of taxpayer dollars it spends every year and  failing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…some candy at the Main Drug  Store. Christine's father, Roy, Jr., managed the business until 2003,  when Christine officially purchased the business from him.\n\nFor more than seven decades, the Hebard Insurance team has been  committed to working closely with their clients to help them make  important and informed decisions relating to their protection…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nTwo hundred one (201) MK 83 MOD 4/MOD 5 General Purpose       1,000-pound bomb bodies.\n\nFour thousand seven hundred ninety-nine (4,799) BLU-110A/B       General Purpose 1,000-pound bomb bodies.\n\nOne thousand five hundred (1,500) KMU-559C/B Joint Direct       Attack Munition (JDAM)…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…entirely volunteer-run organization, the pantry serves more than 1,000  individuals each month, generously giving their time to meet the needs  of their neighbors.\n\nAs we celebrate seven decades of service, I ask my colleagues to join  me in honoring the volunteers and community members whose dedication  has made the Delaware Valley Food Pantry a lasting success…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695073/commending-the-history-and-service-of-the-delaware-valley-food-pantry"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…that pivotal conflict on the  fields at Gettysburg.\n\nPresident Lincoln, months after, spoke in dedicating the cemetery at  Gettysburg. At that point, it was ``four score and seven years ago.''  Today, it would be 12 score and 10 years ago because we, this year,  celebrate 250 years since the founding of our Republic through the  Declaration of Independence…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…We are now down to  nine refineries, and two more of those, Phillips in southern California  and Valero in northern California, are closing by April. That will  leave us just seven refineries to serve the State.\n\nCalifornians already pay the highest gasoline prices in the United  States, averaging $4.64 a gallon as of yesterday. The same gallon costs…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…and Brodi Bartee, who each contributed standout  performances shooting their lowest scores of the season, Ethan  Thompson, Chriss Bassett, and Ainsley Asbury.\n\nCompeting among seven strong teams at Dogwood Trace Golf Course in  Petersburg, the Tigers captured the championship by narrowly edging  York High School by just three shots for the victory. This…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696433/congratulating-the-tabb-high-school-tigers-golf-team"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…fostering a winning culture built on  hard work, respect, and perseverance.\n\nThis program's success is also a testament to the collective effort  of 55 student-athletes and seven devoted coaches, each playing a vital  role in this historic season.\n\nMr. Speaker, the Clarkston High School wrestling team has exemplified  the values of teamwork, resilience,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "James Risch", "party": "Republican", "sentence": "…sixteen (16) AH-64E Apache       Helicopters (remanufacture); twenty-two (22) T700-GE 70 1D       engines; thirty-six (36) remanufactured T700-GE 701D engines;       twenty-seven (27) AN/AAR-57 Counter Missile Warning Systems       (CMWS); eighteen (18) Embedded Global Position Systems with       Inertial Navigation (EGI) with Multi-Mode Receiver (MMR);…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…directly related copollutant emissions reductions through the       advanced production of cement, concrete, and asphalt.\n\n``(i) Sunset.--This section shall terminate seven years       after the date of the enactment of this section.\n\n``(j) Research Security.--The activities authorized under       this section shall be applied in a manner consistent…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of  Green Cove Springs.\n\nSteve joined the city as City Manager on October 1, 2018, following  more than 38 years of exemplary municipal service in Georgia. During  his nearly seven-year tenure here, he led with vision, steadiness, and  a keen sense of public service, culminating in an impressive 48-year  career in local government.\n\nOne of Steve's signature…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "French Hill", "party": "Republican", "sentence": "…her associate of science and  associate of arts degrees at the University of Arkansas Community  College at Morrilton in 2014 at age 33. She continued her education,  earning seven more degrees after leaving UACCM, balancing her time  between her studies and raising her 10 children. In 2025, she passed  the State board exam for the credential of family…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the Honor Guard and an adult volunteer with the  Waco Young Marines.\n\nRecently, she made history as the first Native American female  Commander of VFW District 29, overseeing seven posts in Texas. Nola is  also a proud mother of four successful children, all of whom have  pursued higher education or military service. Nola Saldana exemplifies  lifelong…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Framework for Managing       Fraud Risks in Federal Programs (Fraud Risk Framework).\n\nTo support all three objectives, we interviewed CMS       officials and representatives from seven stakeholder       organizations that represent agents and brokers, state       insurance regulators, researchers, and one of the entities       that CMS approved to host a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…You will have lots of activists say to just open up immigration. That  will take care of the Social Security shortfall. Remember, the report  says, in 2033--so, what is that? Seven or 8 years from now, there is a  23 percent cut coming in Social Security checks. That means we will  double--we have had witnesses that explained this to us. We will double…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…filing of the request. If, within three calendar days       after the filing of the request, the chairman does not call       the requested special meeting, to be held within seven       calendar days after the filing of the request, a majority of       the members of the committee may file in the offices of the       committee their written notice that…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}]