[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…War II. After the war, she  came to visit her sister in Garden Grove, California, my district,  where her life changed forever.\n\nShe met Wally Davis. They got married and had seven beautiful  children. She never returned to Germany. Wally Davis was one of Orange  County's first Hispanic attorneys and a civil rights icon. Irmgard was  always there for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694152/irmgard-hermann-davis-90th-birthday"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…are not radical ideas; they are about restoring trust and  making sure that this place works for people who don't have lobbyists,  who don't have super PACs, who can't write a seven-figure check.\n\nThese shouldn't be radical demands. They are basic expectations. And  here is why this matters so much right now. As long as big money and  billionaires dominate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cut those emissions to the maximum degree of reduction  achievable, even eliminating them entirely if possible.\n\nThe rule also prevents any backsliding by major sources of the seven  most dangerous hazardous air pollutants, including mercury and PCBs. By  repealing this rule, Republicans are going to allow large facilities to  increase their toxic emissions…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…every ACA exchange for covering  abortion.\n\nThis is catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured through ACA since 2014 will be subject  to this change.\n\nAnd while our communities get sicker, our kids get hungry.  Republicans weren't satisfied…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this evening to say that the rioters who created the chaos that  day here at the Capitol were un-American. They were violent. They were  unlawful.\n\nI rise to pay tribute to the seven officers who died, the 150 that  were injured, many of whom were hospitalized and some deal with PTSD  until today.\n\nOn March 2022, a year following that, this Congress passed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…successfully  arguing against his executive orders and the harms and effects they may  have on America.\n\nIn addition, many of our colleagues across the aisle have introduced  at least seven bills to impeach Federal judges who have ruled against  the Trump agenda.\n\nThey attempt to cripple our judicial branch of government which  guaranties a delicate balance in…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…women, including women of color. This is a clear indicator of  positive growth and strong entrepreneurial activity, but more work  needs to be done.\n\nToday, we are considering seven bipartisan bills that will create  additional opportunities for entrepreneurs.\n\nMr. Speaker, my hope is that we can work together to conduct  oversight of the Trump administration's…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of the PARTNER Act,  introduced by Congressman Castro of Texas, and cosponsored by myself  and seven of our colleagues who  are particularly invested in advancing our country's relationships with  crucial international organizations.\n\nThis bill extends diplomatic privileges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…ground before. Somehow, we were lucky enough, by God's  grace, that  nothing bad happened to the men and women in the service of our Nation.  Yet they actually were injured, seven of them.\n\nThe U.S. military is being used against Venezuela without  congressional authorization, without transparency, and in ways that  appear only designed to benefit the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.       The Judicial Nomination Commission, with seven members       appointed by the Mayor, DC Council, President, U.S. District       Court for DC, and the DC Bar, works. As recently as last       month, President Trump nominated…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Resources for more than three  decades, including many years as Director of Air Quality. Today, he  lives in Farmington with his wife Judy, his sons Brian, Jacob and  Kevin, and his seven grandchildren.\n\nPeter dedicated both his military and civilian careers to serving and  protecting his fellow Americans. I am honored to have this opportunity  to recognize…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Dr. Anthony Fauci, physician and       immunologist, served as director of the National Institute of       Allergy and Infectious Diseases and Chief Medical Advisor to       seven different presidential administrations.\n\nNIH scientists have made major contributions to health and       medical science for over 100 years, including 163 Nobel       laureates,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…financially  prudent, responsible legislation. It is outrageous and borderline  criminal against the people of this country.\n\nLet's talk about food assistance. Mr. Speaker, one in seven Texans  rely on SNAP at a time when Trump's tariffs have made groceries more  expensive than ever. Republicans want to take food off the tables of  families who are just trying…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…good-faith  proposals that could prevent pushing millions off a health care cliff.  But the Speaker of the House closed the United States House of  Representatives for business for seven weeks. That's no way to run  government.\n\nThis Continuing Resolution is a betrayal to the people we represent.  Outrageously, at the last-minute Republicans included a provision…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…to have to  worry about how they are going to put food on their family's table next  week or keep a roof over their heads next month.\n\nThese are folks who did one, two, six, seven tours and then came home  and chose to continue serving their Nation by joining Federal service.  These are heroes who deserve our utmost gratitude. Instead, Trump and  Musk…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise to urge support for my bill, H.R.  1044, which authorizes seven permit renewals for the Kaweah  Hydroelectric Project in Tulare County, California.\n\nSouthern California Edison has operated the Kaweah Hydroelectric  Project since 1899, marking…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693463/amendment-to-kaweah-project-provision"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…President Sarah Firestone, State Vice President Sally  Bollinger, and State Secretary Leah Flinchbaugh.\n\nHaving emerged from a rigorous nomination and election process, a  total of seven State officers were chosen to lead the Pennsylvania FFA  this year. Three of the seven individuals belong to chapters in  Pennsylvania's 11th Congressional District.\n\nSarah…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…number three, out-of-control  homelessness; number four, reckless crime policies; number five, the  high-speed rail disaster; number six, the sanctuary State disgrace;  number seven, failing public schools; number eight, manmade water  shortages; number nine, catastrophic wildfires; and number 10, chaotic  elections.\n\nThe good news is we have made significant…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Framework for Managing Fraud Risks in Federal Programs (Fraud       Risk Framework).\n\nTo support all three objectives, we interviewed CMS       officials and representatives from seven stakeholder       organizations that represent agents and brokers, state       insurance regulators, researchers, and one of the entities       that CMS approved to host a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nTwo hundred one (201) MK 83 MOD 4/MOD 5 General Purpose       1,000-pound bomb bodies.\n\nFour thousand seven hundred ninety-nine (4,799) BLU-110A/B       General Purpose 1,000-pound bomb bodies.\n\nOne thousand five hundred (1,500) KMU-559C/B Joint Direct       Attack Munition (JDAM)…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to congratulate Sergeant  Christine Bettis on her retirement after twenty-seven years of  dedicated service to the Michigan State Police. I thank Sergeant Bettis  for her tireless work to keep the citizens of Northern Michigan safe.\n\nAfter graduating from…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…very lucrative.\n\nWhat will go away is some of the far-left radical views that are  being espoused. By the way, when this goes away at NPR, you can still  turn on about six or seven other channels and get the same far-left  radical views, but they are all going to be private companies, Mr.  Speaker, not taxpayer-funded entities.\n\nIf somebody wants to pay…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Congress was notified by       congressional certification transmittal number 24-0T of the       inclusion of twenty-five (25) M1150 Assault Breacher Vehicles       (ABVs); thirty-seven (37) M2 .50 caliber machine guns; sixty       thousand (60,000) 120 mm M908 High Explosive Obstacle       Reduction-Tracer (HE-OR-T) cartridges; thirty (30) 120 mm       M865…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, I rise today to celebrate the birth of  Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to loving parents Taylor and Kristin Flukey Fritsch, who  serves as a valuable member of my team on the Subcommittee on Health…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of  Green Cove Springs.\n\nSteve joined the city as City Manager on October 1, 2018, following  more than 38 years of exemplary municipal service in Georgia. During  his nearly seven-year tenure here, he led with vision, steadiness, and  a keen sense of public service, culminating in an impressive 48-year  career in local government.\n\nOne of Steve's signature…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the leg. Poulos wound up barricading himself in an  hours-long standoff and shot an additional six officers before San  Antonio PD neutralized the situation. Thankfully, all seven officers  survived.\n\nHe was a 46-year-old with a history of erratic behavior. He was  charged with DWI and assault. A few days before the shooting, he had  been arrested for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…and President. Currently she serves as Secretary and on the  Board of Directors, chairs the organization's annual Clay Shoot, and  has chaired the Scholarship Committee for seven years. Beyond her  service to Kern County Cattlewomen, Ms. Woody also remains active in  her church and throughout the community.\n\nMr. Speaker, we ask our colleagues in the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Jersey'' and  the ``Number One Amusement Park in New Jersey.''\n\nThe Land of Make Believe has provided lasting entertainment and fun  in the Northern New Jersey area for over seven decades. Since its  founding in 1954 by Herman Maier, the park has remained family-owned  and operated, with the Maier family upholding the same high standards  of excellence…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694756/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…appeal, the right  to be tried in a public court, full independence of judges, abolishment  of the mullahs' sharia law, and dissolution of the Islamic  Revolutionary Courts.\n\nSeven, autonomy for and removal of double injustices against Iranian  nationalities and ethnicities consistent with the NCRI's plan for the  autonomy of Iranian Kurdistan.\n\nEight,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…community, which he has  done faithfully for the past 56 years.\n\nIn 1961, he married Dorothy Neal, and the two of them welcomed four  children, Paula, Cynthia, James, and Timothy, seven grandchildren, and  one great-grandchild.\n\nThis year, Elder Childs was rightfully promoted to superintendent,  and he will continue to serve the Kingston community in an even…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}]