[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…facing a health  crisis caused by the Republican Party. Thanks to President Trump and  Republicans in Congress, more than 58,000 of my constituents in  Alabama's Seventh Congressional District will see their health  insurance premiums skyrocket next year.\n\nOne of my constituents is a 63-year-old gentleman from Wilcox County,  Alabama, in the rural part…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…their time of need. The  Chaffee County community will remember Annette's role in keeping them  and their loved ones safe.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Annette Stolba for her four decades of service  to the citizens of Chaffee County.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688126/recognizing-annette-stolba"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…straight to  food banks, schools, and churches. Both Shannon and Eugene are facing  uncertain futures because of these cuts.\n\nMore than 56,000 kids in Virginia's Seventh Congressional District  rely on Medicaid or SNAP. These cuts would take food away from children  as young as 8 years old. I guess we will just have to give our 8-year- old kids little,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691489/gop-tax-scam-hurts-women-and-families"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…provide for her? Please,  support individuals like my daughter who are vulnerable and need our  help. Thank you from my heart.''\n\nMartha lives in Florida's Seventh Congressional District, a district  represented by our colleague, Mr. Speaker, Congressman Cory Mills.\n\nWe have heard from people from the heartland of this country. In  Indiana, Kim writes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Company provides excellent service and beers, contributing to  Colorado's leadership in producing outstanding craft brews.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate New Terrain Brewing Company for this  award.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694718/recognizing-new-terrain-brewing-company"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…World Association of Girl Guides and Girl Scouts participate to  bring the voice of girls and young women to the global stage.\n\nMr. Speaker, on behalf of Texas' Seventh Congressional District, I  congratulate these four young women on their selection. I thank them  for their leadership and send best wishes for their future endeavors.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688693/recognizing-girl-scouts-of-san-jacinto-county-texas-at-the-united-nations-69th-commission-on-the-status-of-women"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…State  Fire Chief of the Year for his outstanding service. Chief Lombardi's  career has an incredible legacy in our state.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Don on his well-earned retirement and to  thank him for his service.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Company provides excellent  service and beers, contributing to Colorado's leadership in producing  outstanding craft brew.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Elevation Beer Company for this  accomplishment.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob Baker on his retirement.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…difference when other help isn't always readily available, and  we are grateful for their lifesaving service to our community.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Evergreen Fire/Rescue on their 3rd  consecutive Mission Lifeline EMS Gold Award. We thank them for the  exceptional care they provide…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…held in Pontevedra, Spain next  year. We are incredibly proud that he'll represent the United States at  this global event.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Alex Willis for his win at the 2025  Winter Triathlon National Championships, and join his friends and  family in rooting for his…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692077/recognizing-alex-willis"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…assistance; five Alabama hospitals will close, and it adds $5 trillion  to the national debt.\n\nOn behalf of the 750,000 Alabamians that I represent in Alabama's  Seventh Congressional District and the 5 million hardworking  Alabamians, I say  vote ``hell no'' on this bill, and I urge my colleagues to do the same.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…residents, law-abiding visa  holders, U.S. citizens, and even veterans who have fought for this  country.\n\nIn border communities like the one I represent in Arizona's Seventh  Congressional District, we see the impact of these abuses every single  day. We have seen Border Patrol waiting outside of hospitals, literally  arresting women after they have given…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697450/fighting-dhs-immigration-raids"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Coloradans they serve  are lucky to have an incoming Chief with such an impressive and lengthy  record of public service.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Jeremy Metz for his promotion to Chief  of the West Metro Fire Protection District. We thank him for his  continued commitment…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694725/recognizing-jeremy-metz"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…future. As a dad of two kids who have attended Virginia schools, I am  grateful.\n\nMr. Speaker, today, I thank Mayor Devine and all the teachers across  Virginia's Seventh Congressional District who go above and beyond to  make sure every student feels seen, valued, and empowered. Their work  is incredibly important.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Mr. Speaker, it is my pleasure to rise today to  congratulate our newest colleague and our fellow Arizonan on her  swearing in as the Representative for Arizona's Seventh Congressional  District, Congresswoman Adelita Grijalva.\n\nCongresswoman Grijalva has concentrated her career on issues  advocating for students and supporting families.\n\nAs she follows…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696710/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…its darkest hour. Her story, which is  woven into the fabric of our Nation, is nothing short of remarkable. I  urge my colleagues to join me and all of Michigan's Seventh  Congressional District in wishing her a very happy 100th birthday.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…or to reenter the workforce.\n\nI commend the Medina County Career Center and express my gratitude  for the center's role in producing future leaders from Ohio's Seventh  Congressional District.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689426/recognizing-medina-county-career-center"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…we  have a pretty important game coming up, so I will simply say: Go Navy,  beat Army.\n\nMr. Speaker, I now welcome and yield to the gentleman from  Tennessee's Seventh Congressional District, Congressman Matt Van Epps,  for his response.\n\nMr. VAN EPPS. Mr. Speaker, I stand here today humbled by the trust  the people of Tennessee's Seventh District have…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}]