[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Department of Justice to release the  Epstein files, multiple criminal investigations which allegedly  documented trafficking of young women and girls by Jeffrey Epstein, a  sex offender and financier with whom the President often socialized.\n\nFor years, the President and those in his orbit, including Attorney  General Pam Bondi and FBI Director Kash Patel,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…a distraction to take away from  the fact that the guardians of pedophiles is literally trying to  protect pedophiles. The President is a convicted felon and an accused  sex offender.\n\nStacey Plaskett hasn't been accused of either.\n\nWhat are we actually here talking about? Trump and Epstein were  besties. We have all seen the pictures of them. We saw…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…rise today in support of this resolution censuring and  condemning Delegate Stacey Plaskett from the U.S. Virgin Islands for  inappropriate coordination with convicted  sex offender Jeffrey Epstein during a congressional hearing and  removing Delegate Plaskett from the Permanent Select Committee on  Intelligence and referring her to the Ethics Committee…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…crap. That is what the Intel  Committee says.\n\nBut here is the deal: When you are sitting there in a sitting  committee, and you are having communications with a convicted sex  offender, and you are taking their advice on how to ask questions,  maybe you have a problem. Maybe your problem is that you brought  disrepute on the House.\n\nThis isn't from the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696896/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…from the House Permanent Select Committee on Intelligence for conduct  that reflects discreditably on the House of Representatives for  colluding with convicted felony sex offender Jeffrey Epstein during a  congressional hearing.\n\nWhereas Stacey Plaskett, the Delegate representing the United States  Virgin Islands in the House of Representatives, inappropriately…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…to Minority Leader Hakeem Jeffries calling me a ``stone-cold liar''  during a press conference defending the recent discovery of Democrats'  communication with convicted sex offender Jeffrey Epstein.\n\nI bring with me something that he and many of his fellow Democrats-- Democrats like Jamie Raskin, Jasmine Crockett, and Stacey Plaskett-- apparently detest,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…this nonsense.\n\nAllowing delusional men to use women's restrooms, locker rooms, and  changing rooms is an affront to women, and it is reckless.\n\nIn Virginia, a registered sex offender with more than a dozen  convictions was allowed to use the women's changing room by claiming he  was a woman. For 6 months, he exposed himself to women and kids. This  is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…businesses. I  just want to give a few examples of what ICE is actually doing in  Minnesota, because I am someone who is here from Minnesota.\n\nThey have arrested a registered sex offender from Somalia with 17  prior convictions, including domestic violence and threatening  terroristic acts.\n\nThey have arrested an illegal El Salvadoran alien convicted of sexual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…in Coast Guard. Sec. 507. Modifications to the officer involuntary separation process. Sec. 508. Review of discharge characterization. Sec. 509. Convicted sex offender as grounds for denial. Sec. 510. Definition of covered misconduct. Sec. 511. Notification of changes to Uniform Code of Military Justice                or Manual for Courts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]