[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…foreign aid have already reduced or eliminated  food aid for many families, forcing parents to remove their young  daughters from school and into child marriage, increasing sexual  violence and the risk of pregnancy-related deaths.\n\nThis administration's ideologically driven disregard for global  public health worldwide is appalling. Contraceptives are legal…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…classified as a ``threat to safety'' which       includes cases when an officer imposed risk or harm to       people, through action or inaction, including physical or       sexual violence and mishandling firearms. The CPJRAA, by       excluding disciplinary matters from collective bargaining,       offered an opportunity to improve MPD's accountability…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…in the United  States.\n\nI have to say: If my colleagues across the aisle are so genuinely  concerned about the well-being of women who are serving in the military  and sexual violence, how about actually addressing that and the 45  percent of women who have reported that they have been sexually  harassed just last year alone? Dare I say: If my Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695234/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…National Latina       Institute for Reproductive Justice, National Network of       Abortion Funds, National Organization for Women, National       Organization of API Ending Sexual Violence, National       Partnership for Women & Families, National Women's Law Center       Action Fund, National Women's Political Caucus, New America       Higher Education…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…national security.\n\nAmong the organizations and programs the President plans to withdraw  from include the Office of the Special Representative of the Secretary  General on Sexual Violence in Conflict, the United Nations Population  Fund, the UN Framework Convention on Climate Change, the UN Register of  Conventional Arms, the International Tropical Timber…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…in  government knew. Yet, year after year, he continued to operate in  trafficking, exploiting, and destroying the lives of children and young  women.\n\nThis was not only sexual violence. There were financial crimes.  Epstein's empire was built on money, blackmail, and connections, and  those connections reached into the highest halls of power.\n\nWhat makes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…`threat to safety' which meant       these officers engaged in conduct that included a risk of       harm to persons through action or inaction, such as physical       and sexual violence, mishandling firearms, or compromising       evidence related to an arrest. The other 20 officers (54       percent) were terminated for reasons such as       misrepresentation…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…workforce--making sure that we have access to medical  care, housing, and behavioral health and to deal with what we know in  2023 was a decades long, uncovered, sexual assault and sexual violence  coverup in the Coast Guard.\n\nOperation Fouled Anchor identified 62 substantiated incidents of  rape, sexual assault, and sexual harassment perpetrated by at…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…legally permitted to possess a firearm-equivalent,       with the same lethal capacity, due simply to semantics.\n\nSo, now, let us return to the depraved domestic and sexual       violence offenders whose heinous acts were detailed in the       opening paragraph. Despite their use of TASERs to physically       and sexually abuse their intimate partners…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…legally permitted to possess a       firearm-equivalent, with the same lethal capacity, due simply       to semantics.\n\nSo, now, let us return to the depraved domestic and sexual       violence offenders whose heinous acts were detailed in the       opening paragraph. Despite their use of TASERs to physically       and sexually abuse their intimate partners…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…rise today to recognize  Centre Safe which celebrates 50 years of providing confidential and  professional services for victims and survivors of domestic, dating,  and sexual violence.\n\nCentre Safe began as a grassroots effort in 1975 as the Centre County  Women's Resource Center. Since then, it has grown from a one-room  operation in State College…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…sexual harassment. Sec. 521. Report on policy on whistleblower protections. Sec. 522. Review and modification of Coast Guard Academy policy on                sexual harassment and sexual violence. Sec. 523. Coast Guard and Coast Guard Academy access to defense sexual                assault incident database. Sec. 524. Director of Coast Guard Investigative…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…National Children's  Alliance, the National District Attorneys Association, RAINN, Covenant  House, the National Network to End Domestic Violence, the National  Network to End Sexual Violence, and the National Association of  Assistant U.S. Attorneys.\n\nMr. Speaker, our work is not done. We can and must get this bill  through the Senate, as we discussed across…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…opportunities are not stolen from them by  the mentally ill.\n\nMs. MACE. Mr. Chairman, may I inquire as to the time remaining.\n\nMs. MACE. Mr. Chairman, I will address the topic of sexual violence,  particularly with my female colleagues across the aisle.\n\nI have authored dozens of bills related to sexual violence, and very  few of my Democratic colleagues will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]