[{"senator": "Doris Matsui", "party": "Democrat", "sentence": "…know Republicans are  getting similar calls. Yet, instead of caring about the millions of  Americans who are being forced to make impossible choices, they are  putting up this sham of a bill. They should be ashamed.\n\nMr. Speaker, we came here to deliver for our constituents. Let's vote  on a clean extension and avert the cliff. Let's put an end to this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698364/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the line to save ours. Here is the kicker: This majority  still hasn't even hung the plaque honoring those officers, a plaque  required by law--required by law. Instead of a sham committee, how  about you get a screwdriver and hang the damn plaque because every day  it sits in a box is another day Republicans dishonor the heroes who  defended this place.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the same party that was content to let these lifesaving tax  credits expire until Democrats had to force them to vote on a clean 3- year extension. That is the shame and the sham of it all.\n\nDr. King once profoundly said: ``Of all the forms of inequality,  injustice in health is the most shocking and inhumane because it often  results in physical death.''…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Students'  Rights Act, which unfairly limits the information it requires colleges  to provide to students and the students it chooses to support.\n\nMost crisis pregnancy centers are sham organizations. They have the  sole purpose of advancing an anti-choice  agenda. They routinely engage in deceptive advertising to get people in  the doors, hold themselves out…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…leave them hanging when they get sick.\n\nMr. Speaker, the American people are desperate for our help, and this  Republican bill doesn't do a thing to provide it. This bill is a sham,  and a majority of the House knows it.\n\nI urge my colleagues to vote ``no.'' We should take real action  immediately by passing the Jeffries bill.\n\nMr. PALLONE. Mr. Speaker,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698391/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can meet this demand. Trump's  sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting, they are pricey, and they are getting  pushed abroad to the highest bidder as exports.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the two  resolutions that are before us. First let me comment upon the proposal  S.J. Res. 71, led by my colleagues Senator Kaine and Heinrich, to  overturn President Trump's sham energy emergency.\n\nYou would think that, in an energy emergency, the President would be  pursuing the all-of-the-above energy policy his administration has  touted, but instead…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…for every overdraft, would further push  them into debt.\n\nIt is a shame the Republicans are attacking poor people just to help  greedy bank CEOs get richer, the shame and the sham of it all.\n\nI oppose this resolution and encourage everyone to stand with working  people who are struggling to make every single dollar stretch.\n\nMs. PRESSLEY. Mr. Speaker,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…the same medical standards as licensed health  facilities.\n\nWhy are Republicans willing to categorically turn a blind eye to the  countless horror stories happening at these sham health clinics?\n\nIt is because for Republicans, when it comes to women's health,  accountability isn't required.\n\nThis bill defines pregnancy centers as organizations that support…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699229/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…their monthly premiums on January 1. And  Republicans can't even say they tried to stop it.\n\nHouse Republicans, meanwhile, are on the warpath to vote on a  rightwing healthcare sham bill, one that doesn't extend the ACA credits  a day, doesn't lower premiums, and does absolutely nothing to help  people afford coverage.\n\nSo let's be very clear. There is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…is not only a lack of political  courage, but it is a fundamental betrayal of the people, incompetence  and indifference to the suffering of our neighbors, the shame and the  sham of it all.\n\nAny Member of Congress who would vote to deny a child a meal or  medication, it is child abuse and neglect. I ought to file a 51A on  Republicans for that. Every…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696696/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Senator  Kaine are advancing and which will be voted on later this afternoon. I  am proud to be a cosponsor of this resolution, which would overturn  President Trump's really sham energy emergency.\n\nAt a time when the United States is already producing record amounts  of oil and gas, the President wants to bypass laws and explore eminent  domain to fast-track…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…government of, by, and for the people; it is government of, by, and  for the oil and gas companies. Families lose; billionaires win.\n\nThis emergency declaration is certainly a sham because renewable  energy costs less than fossil fuel energy. The International Renewable  Energy Agency found that the cost of new wind or solar is at least 30  percent cheaper…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…it is efficient to buy more toy  rockets for Donald Trump's billionaire friends while parents can't  afford groceries. The cruelty is the point. What a callous shame and a  sham.\n\nI urge my colleagues to stand with the people. Protect families and  reject this shameful budget resolution. In the words of a righteous  faith leader whose place of worship…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…administration, and this  President. Never again say these crimes did not occur. Never call them  a hoax, and don't attempt to abuse and pervert what this legislation  does by invoking a sham active investigation as a disingenuous excuse  to withhold a complete release of the Epstein files. Don't do this  because the brave survivors will not stand for it, and they…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Unfortunately, it turned out to be true that we had reason for  concern because the lab that was just discovered in Las Vegas is run by  the same individuals under the same sham LLC as the one that was  uncovered in Reedley.\n\nWhat is more, officials there described materials and equipment that  are consistent with the operation that was going on in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "Mr. GOODEN. Mr. Speaker, throughout this sham and shame of a  shutdown, we have heard so many lies from the Democrats. Over the last  45 days, and especially the last 45 minutes, I have heard them say this  is an evil bill,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696720/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…campaign  by the junta that has struck more than 1,000 civilian locations,  including Christian churches.\n\nWhile the military ruling class pledged open and fair elections, the  sham process that took place last month should be viewed as a rigged  farce and nothing more. Make no mistake, these mass atrocities will not  stop until the current regime is crippled.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…maybe,  but the real point was fraud. What the Governor hoped to do was to get  these measures passed.\n\nRemember how he was committing fraud on the ballot for the  redistricting sham? What he wanted to do for the ballot on Prop 36 was  to say that this is a measure that will repeal all of these other pro- public safety bills so that he could trick people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]