[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…economic development and public safety regulations  and mail delivery.\n\nFor example, Eastvale is a town in southern California that is home  to 69,000 residents. It currently shares two ZIP Codes with neighboring  jurisdictions.\n\nWithout a unique ZIP Code, Eastvale residents have reported mail  delivery issues for delivery of legal notices, code enforcement…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…securities law ever. The Securities       Industry and Financial Markets Association, the lobby that       represents firms that underwrite and help investors trade       stocks, shares this concern. Recently the association wrote       to the Securities and Exchange Commission with a warning       about the potential pitfalls of allowing firms to put stocks…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…forestland that pays no taxes to our local  government. Generations of families built their lives and livelihood  around Federal timber harvest, and counties relied on revenue shares  from those sales to fund public services. When the timber industry  collapsed, the revenue shares also disappeared.\n\nCongress made a commitment to support rural communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…least  expensive option. In fact, States leading in renewable generation  generally see lower electricity prices. According to EIA data, 17 of 22  States with above-average shares of wind and solar had below-average  electricity prices last year. Thirteen of those States voted Republican  in 2024, I might add. Another analysis showed that the 4 States…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…FBI and  the Boulder Police Department, which acted so swiftly in response to  this terrorist attack.\n\nMr. Speaker, I know Mr. Griffith, in particular, to be somebody who  shares, I believe, my views as I have articulated them with respect to  this particular attack, and I just hope that my colleagues would agree  to give this resolution its due course.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…State's ability to support our county-      based infrastructure. In our county-based service model, via       the property tax, counties already pay very significant       shares of human services costs, including child protection,       waiver management, chemical dependency, mental health, and       State facility stays, and have little capacity to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Heritage Trail of New Hampshire is to  promote awareness and appreciation of African American history and life  in order to build more inclusive communities today. The Trail shares  stories of prominent African American figures from New Hampshire and  southern Maine, and since becoming a statewide organization in 2016,  has expanded its outreach efforts…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…required under present law. One such  instance is when the EGC conducts a spinoff, which is a transaction in  which one company creates a new, independent company by selling new  shares of its existing business. So the one company becomes two  separate companies through a spinoff transaction.\n\nMr. Nunn's bill reduces this obligation for EGC spinoffs to 2 years.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…suspects of seeking a       lasting piece of Libya. Sahad argued that the United Arab       Emirates had thrown its weight behind Haftar in a bid for       port access and other shares of the country.\n\n``The UAE has this sickness of wanting to control harbors.       They came to buy New York Harbor one time,'' Sahad said.       ``The control of the Libyan…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that little  seed of hope that somehow, when push comes to shove, some powerful men  in this Chamber will hold other powerful men accountable.\n\nOn behalf of every citizen who shares that vision across our country,  who believes in the words carved above the Supreme Court, I and others  will continue to press for accountability, for transparency, for  justice.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…programs that still serve the greater Newark community  today.\n\nWhile Josephine Barbee passed away on February 1, 2025, her legacy is  carried on by her son, Mark Barbee, who shares his mother's commitment  to serving others, ensuring that her profound impact remains alive and  well in the lives of those she touched. We are fortunate that Mark  continues…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…industry crushed, and I have spent my entire  career trying to help rebuild it in America. Mr. Speaker, I am so proud  to serve with Representative Mrvan because I know he shares that same  commitment. I thank him for coming down to the floor tonight.\n\nAfter Mr. Tonko's presentation, I will turn to Representative Val  Hoyle from Oregon's Fourth District.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…governance structures. Multiclass governance structures are those where  corporate insiders or beneficial owners retain an outsized amount of  voting power relative to their shares.\n\nThese structures, while they may add value, pose significant risk,  making transparency ever more important for investors. Specifically,  these structures pose significant…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693914/enhancing-multi-class-share-disclosures-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…others. The Good Samaritan  stopping by the roadside to help a beaten stranger not of his own  religion is a testament to: ``Who is my neighbor?'' It is not just the  person who shares my skin color.\n\nPolicies to eliminate all DEI efforts are a vestige of the prejudiced  past, not a prescription for a stronger future America.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…grandmother loved       (which may have something to do with the name of the leading       lady), a love she also passed on to our entire family, the       titular wizard also shares some wisdom about love and       affection.\n\nAs the Tin Man asks him for a heart, the Wizard says,       ``Hearts can never be made practical until they can be made       unbreakable.''…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…from the calculation of       Acquired Fund Fees and Expenses those fees and expenses that       the investment company incurred indirectly as a result of       investment in shares of one or more Acquired Funds that is a       business development company.\n\nMr. Speaker, I rise today in support of H.R. 2225, the Access to  Small Business Investor Capital…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…million acres. In       addition, it has selected an additional 127,000 acres in the       Planning Area under ANCSA that have not yet been conveyed.       Doyon's land base shares approximately 3,000 miles of border       with BLM lands--potentially more than any other Indigenous       landowner in the nation. Consistent with ANCSA's intent, much…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…400 hours across our construction sites and  ReStores. Mr. Quinn's impact is profoundly felt by the partner families  working toward homeownership. On construction sites, he shares his  expertise by teaching them essential home building and maintenance  skills. His mentorship empowers these families with practical knowledge  and fosters a sense of ownership…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…with 5 percent or more of the total combined voting power of       all classes of securities entitled to vote in the election of       directors--\n\n``(A) the number of shares of all classes of securities       entitled to vote in the election of directors beneficially       owned by such person, expressed as a percentage of the total       number…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Yet, Members are voting  on that while trading stocks on a daily basis.\n\nCapitol Trades reports that 113 Members of Congress made 9,261 trades  in 2024 involving 706 million shares or other assets. We had a Democrat  who made 4,000 trades for a 20 percent return. We had a Republican who  made almost 2,000 trades for a 23 percent return; a Democrat, 575…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of the  Year, further demonstrating his compassion and commitment to community.\n\nRichard is also a frequent guest speaker at local elementary and  middle schools, where he shares his World War II experiences with  younger generations, ensuring that the legacy of service and sacrifice  lives on.\n\nAbove all, Richard is a loving husband and devoted father.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(B) the progress of the Commandant toward implementing the       electronic health record system in shipboard sick bays of the       Coast Guard;\n\n(C) how the Coast Guard shares medical records with the       Department of Veterans Affairs; and\n\n(D) any other matter the Comptroller General considers       appropriate with respect to medical record…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…time of the       veteran's death shall be paid to the first living person or       entity listed below:\n\n``(1) The veteran's spouse.\n\n``(2) The veteran's children (in equal shares).\n\n``(3) The veteran's dependent parents (in equal shares).\n\n``(4) The estate of the deceased veteran unless the estate       will escheat.\n\n``(b) Limitation.--In a case described…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…imperialism, which he cannot tolerate. He even goes as far as to say  that Russia could not accept a cease-fire since it would give time for  Ukraine to rearm.\n\nFinally, Putin shares a vision for a multipolar world to counter what  he perceives as Western imperialism and Russia's efforts to use  security and economic agreements toward these ends.\n\nIn sum,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…change. When we teach the history of women, we are  teaching the history of humanity, and those stories are not simply for  women, but for everyone. They are for everyone who shares the  pioneering spirit that drives Americans to keep challenging limitations  and working for freedom and opportunity.\n\nWhen we recognize women, let us remember the challenges…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that also serves as the storage and       transportation container for the rockets. Each rocket pod       holds six rockets.\n\n3. The M30A2 GMLRS Alternative Warhead (GMLRS-AW) shares a       greater than 90% commonality with the M31A1 Unitary. The       GMLRS-AW replaces the GMLRS-U's high explosive warhead with a       200 pound fragmentation warhead of…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…risk, return, liquidity, and diversification. It also addresses how  fiduciaries use shareholder rights, like proxy voting.\n\nUnder current practices, some fiduciaries use the shares held in  retirement plans to push political policies through proxy votes,  whether or not those policies benefit the workers whose money is at  stake.\n\nH.R. 2988 stops that.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…private markets based on  their knowledge and experience, whereas previously they could only  qualify based on their income.\n\nIt encourages new public companies to issue more shares without  burdensome regulations so they can focus on hiring and expanding  instead of diverting limited resources to filing paperwork with the  SEC.\n\nThanks to Representative…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697823/increasing-investor-opportunities-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Speaker, I rise in support of the Safer  Supervision Act, a bipartisan bill backed by Federal law enforcement,  probation officers, and public defenders. This broad coalition shares a  common goal: a supervision system that improves public safety and  supports successful reentry.\n\nToday, more than 110,000 Americans are on supervision. Probation  officers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697108/supervision-system-that-improves-public-safety-and-supports-successful-reentry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…senior nights, their annual cheer competition  and during the final matches of the historic Corey Hill Memorial  Wrestling Tournament. As an Athletic Director, Coach Kupcik shares that  having a consistent announcer locked in is always a plus. It's one less  thing to worry about. But having a consistent, amazing, professional- level announcer that transforms…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}]