[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…anti-Semitism--plain and simple. There is no justification in  the world for carrying out or condoning this violent and vile hate  crime. It is pure anti-Semitic violence.\n\nMy heart is shattered for the two Israeli Embassy workers who were  killed, Yaron and Sarah--taken from us far, far too soon. Both were  committed to public service, social action, peace, the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…preserved their stories, ensuring that future generations  will remember their courage and their sacrifice.\n\nThese men were not just warriors in the sky. They were pioneers who  shattered social and racial barriers, proving their excellence time and  again, despite the discrimination they faced. Despite their heroism,  their place in history has not always…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…is to promise relief but deliver  crisis, promise lower costs but drive them up, promise to protect  people then cut their care. But those broken promises will also mean  shattered families, deeper uncertainty, and an America that is sicker  and poorer.\n\nThis is what is happening to Catherine right now. She is on a  fixed income--roughly $45,000 a year--with…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…families and friends came together to eat, drink, and dance, they  looked forward to celebrating Cinco de Mayo and spending time in their  community. Instead, their worlds were shattered as someone with a gun  fired into the crowd outside the restaurant, killing three people and  injuring five more.\n\nI cannot imagine the pain and sadness that their families…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690714/mass-shooting-in-glendale-arizona"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…best friend Guy  Gilboa-Dalal have been held together and tortured together.\n\nEvyatar and Guy both have younger sisters, older brothers, parents,  friends whose lives are shattered by their absence.\n\nThis is Evyatar before, but recent photos show a man abused and  malnourished. And he was recently taken to witness the release of other  hostages and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…and Rockland Counties with unwavering dedication, fierce  advocacy, and an unbreakable spirit.\n\nAs the first woman to serve as chair of the Appropriations Committee,  Nita shattered glass ceilings with dignity and determination.\n\nAs the former dean of the New York delegation, Nita fought tirelessly  to secure resources for the Empire State, leading the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689210/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…which had to stay there.\n\nThese walls, these doors, these hallowed venues that we have walked  in and people have come to and thought of as being a symbol of  democracy were shattered unnecessarily.\n\nIt is important to find a way to commemorate this day. It is  important to remind the rest of the country that what Donald Trump said  were visitors visiting…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698547/january-6-attack"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…Operation Charlotte's Web.\n\nBorder Patrol agents engaged in extreme racial profiling, excessive  force, and brutal tactics, spreading fear in our community.\n\nIt was fear that shattered the car window of a U.S. citizen born in  Honduras. He was thrown on the glass-covered ground in handcuffs after  he already identified himself to agents.\n\nIt was fear when…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…safe.\n\nThe Gun Violence Archive has already reported that 133 mass shootings  have happened this year, and it is only the first week of June.\n\nEvery shooting leaves behind a shattered family, a traumatized  community, and a ripple effect that lasts generations.\n\nLet's be clear. Black Americans are not just victims of community  violence. We are also disproportionately…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…immigration raids . . . in Santa Ana have created a climate of fear,  anxiety, and instability across our community.\n\n``The aggressive tactics used by Federal agents have shattered trust  in law enforcement and are eroding the critical relationship between  our residents and the Santa Ana Police Department. When families are  too afraid to report crimes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…have never       known, away from the only home they've ever had? Or do       families face separation, with children growing up without       their parents, their stability shattered, and their futures       uncertain? This is not a theoretical issue. These are the       very real questions that our residents and community members       are asking themselves…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…platform as a military advocate to challenge segregation and to  elevate excellence in the Armed Forces. She publicly championed the  Tuskegee Airmen, whose skills and discipline shattered the lies used  to justify exclusion, and proved that racism, not readiness, was the  real barrier. You see, they were Black, for anyone who might not know  that, and by flying…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…domestic terrorism and hate crimes tied to gun  violence.\n\nThese decisions are not just reckless. They are deadly, making it  easier for violence to spread, for lives to be shattered, and for  communities to keep on living in fear.\n\nAs a mother who lost her son to gun violence, let me be perfectly  clear: The American people are crying out for the basic…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Silverio's lifeless  body out, slamming him onto the pavement, and handcuffing him as he  bled out.\n\nSilverio didn't make it. DHS' story doesn't add up.\n\nA man is dead. A family is shattered, and the agency responsible  keeps hiding behind masked thugs and unmarked cars. I use that term  because that is how so many agents are acting, either voluntarily or  not.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…which are special in America, which are  precious, which are unique in our country, are being recklessly--and I  would even say unconstitutionally--affected, attacked, even shattered.\n\nIn just 71 days, the President of the United States has inflicted so  much harm on Americans' safety, financial stability, the core  foundations of our democracy, and even…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…many stories, as Senator Wicker reflected upon.\n\nThe breadth and severity of this disaster have left swaths of the  Delta and north Mississippi with landscapes littered with shattered  trees and downed power lines. Line crews in this bitter cold from  Mississippi and other States are making steady progress in restoring  power to nearly 200,000 families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Mr. Speaker, I thank the chairman for yielding  and for his leadership throughout this process.\n\nMr. Speaker, years of chronic underinvestment in our national  security have shattered American deterrence. It has allowed our  adversaries to threaten and challenge us in new and unprecedented ways.\n\nThat ends today because, with the passage of the One Big…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…H. Res.  137 to rename the House Press Gallery the Frederick Douglass Press  Gallery, in honor of a man whose life and work embodied the very best  of American ideals and shattered through glass ceilings.\n\nFrederick Douglass was born into slavery in 1818 and courageously  escaped bondage in 1838. He built a life dedicated to truth, liberty,  and justice.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…back. It  secures the border, slashes wasteful spending, delivers tax relief for  working families, and begins to rebuild the economy that the Biden- Harris administration shattered.\n\nIt is time to put America first again, and the budget resolution is  how we get it done. Once adopted, our committees and the entire House  will begin detailed work to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the bravery of all who fought beside him, helped secure the freedom we  enjoy today. He was part of a generation that stared down tyranny,  defended liberty, and rebuilt a shattered world. And for that, we are  eternally grateful. Floyd's service didn't end when the war did. He  came home, built a life, raised a family, and continued to live with  honor,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Speaker, today, I rise to honor the remarkable career  and lasting legacy of Congresswoman Nita Lowey. As the first woman to  chair the House Appropriations Committee, she shattered barriers and  paved the way for so many others during her 32 years in the House of  Representatives.\n\nNita was a tireless advocate for the Hudson Valley, and she was  committed…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and I know  that he will be swiftly prosecuted to the fullest extent of the law.  But I suspect that is little comfort right now to the many whose sense  of safety has been shattered and who are worried that they will be  targeted simply because they are Jewish or Israeli.\n\nMy prayers today are with the families of the deceased, with event  attendees,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691633/capital-jewish-museum-shooting"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Over 900 medals in women's sports have been won by biological men,  stolen from women who worked hard to earn them.\n\nWomen have fought hard to earn records that have been shattered by  mediocre men, men pretending to be women, mentally ill men pretending  to be women.\n\nThis is a travesty and discourages women from competing at all. This  was the case…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]