[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…more than  200,000 in the district I represent. Every hospital I represent  sustains itself with Medicaid and Medicare.\n\nThis debate isn't just about the numbers on a balance sheet. It is  about the health of the American people. How will we keep our hospitals  open and our nursing homes open? How do we take care of the American  people's health?\n\nThis…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689913/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…economic  catastrophe warnings that are out there:\n\n[C]limate change could reduce the level of global GDP per       capita by 10-20%.\n\nThis is Fed Chair Powell. He is on my sheet right here: In 10 or 15  years, there  are going to be regions of the country where you can't get a mortgage.\n\nWhy is that? Because in those regions of the country you won't…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to predict the extra costs they will  pay in this escalating trade war. Last week, my office met with Traci  Tapani, a Co-President of Wyoming Machine, a small family-owned sheet  metal fabricator in Stacy, MN who relies on Canadian aluminum for their  operations. The past few weeks have been filled with uncertainty for  their business, not knowing…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…level  rise, but manageable with respect to considerable amounts of real  estate.\n\nNow, imagine that tomorrow we learn that we have permanently  destabilized the Greenland ice sheet or the aptly named ``doomsday  glaciers'' in West Antarctica. Suddenly, the expected sea level rise by  the end of the century doubles or more, and we know that we are  eventually…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and millions of American automotive jobs as the companies  were staring liquidation in the face.\n\nMr. Speaker, I will take a moment to share some words. On February 8,  at the Sheet Metal Workers union in Oakland County, Michigan, I was  joined by an incredible medical expert from Michigan, my friend, Dr.  Preetha Iyengar, who happens to be in this very…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…Washington breaks  its promises and when jobs and investments disappear.\n\nWe remember back home when Griffiss Air Force Base closed. We  remember when Carrier left. Those were our sheet metal workers. We  remember when New Venture Gear and a Chrysler plant closed. Those were  our UAW brothers and sisters. There were others that have left our  region behind.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…a means of giving tax cuts to the  ultrarich and powerful, those who never have to worry about access to  reliable healthcare.\n\nThese cuts are more than numbers on a balance sheet. These are lives  that hang in the balance. For western New York, this will make it  harder for Roswell Park Comprehensive Cancer Center or the University  of Buffalo to advance…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…basement with $500 from my parents. That company now manufactures  more than half of the theater lighting equipment in the United States.  Our company does hardware, software, sheet metal, wiring harnesses, and  customer support. We have kept all of those manufacturing jobs in the  United  States, and it is something I am very proud of.\n\nI think it is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…expect health care providers to survive.  Clinics, hospitals and nursing homes won't survive the massive pull out  of funds. That kind of blow doesn't just show up on a balance sheet, it  shows up in real lives. It also means people kicked off their coverage,  parents forced to choose between paying rent or filling a prescription  for their child, seniors…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693156/one-big-beautiful-bill-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of toothpaste. When my colleagues gas up their cars, note the  price of regular gasoline and their most recent electric bill. Date it  today, this day in September. Keep the sheet handy.\n\nIn January, I want my colleagues to do that list again. We won't need  a cable news station, a podcast, or a talk show to tell us what is  going on. We will see it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695047/buckling-under-the-weight-of-rising-costs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their healthcare stripped away, who get their  food benefits stripped away, who are going to get their rental  assistance stripped away.\n\nI did a little math--and I lost my sheet, so I am going on memory for  this math, which is dangerous for me--I found it. To qualify for SNAP,  a household's gross monthly income must be below 130 percent of the  Federal…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…support for H.R. 981, the Veterans  Education Transparency and Training Act, or VETT Act, introduced by  Representative Van Orden.\n\nThe bill makes improvements to the Shopping Sheet that is offered to  student veterans when they are applying to institutions of higher  learning.\n\nThese Shopping Sheets give student veterans more information about  the schools…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689601/veterans-education-transparency-and-training-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…economy, but there are some  places that ought to be left alone because their quality, history, and  identity to us as Americans is far too valuable to be measured on a  balance sheet.\n\nNow, much to my dismay, this administration has already issued an  executive order to rescind the Coastal Plain leasing program, and the  Department of the Interior has already…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…through more  favors for their billionaire buddies.\n\nThese three Congressional Review Act, or CRA, resolutions treat  America's public lands like they are just lines on a balance sheet.  They silence  public opinion, ignore the fires and storms that are made worse by  climate change to make fossil fuel extraction the number one priority  going forward for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…114-139, and the unanimous House and       Senate passage of the Taiwan Allies International Protection       and Enhancement Initiative (TAIPEI) Act of 2019.\n\n(9) In its fact sheet, entitled ``U.S. Relations with       Taiwan'', published on August 31, 2018, the Department of       State asserts: ``The United States supports Taiwan's       membership…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…against a Border Patrol agent in Portland. Both suspects  originally crossed the southern border under Biden and were released  into the interior. The driver wound up with a rap sheet, including DUI,  while the passenger is linked to a shooting and a prostitution ring in  Portland. That is what is happening.\n\nNow, why do I mention that here? Because we just…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…opportunities that are not generally available to the  broader public, like private offerings.\n\nMost current pathways to becoming an accredited investor are based on  your balance sheet, your wealth, and your income. This bill changes and  opens up a brand-new pathway allowing for investors' knowledge to be  the determining factor in whether they are able…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…hurt, and the American Dream dies.\n\nThe suspect that I talked about with the brutal stabbing in North  Carolina was 34 years old with a history of mental illness and a long  rap sheet: multiple convictions for armed robbery, felony larceny,  breaking and entering; more than 5 years in prison; and 14 criminal  cases.\n\nHis own family had warned of his history…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…anniversary. Goodhart Sons Inc. is a  steel fabricator and installer based in Lancaster, Pennsylvania. Their  history began in 1935 when Frank G. Goodhart purchased the two-man  sheet metal shop that he was once an apprentice at. In the 90 years  since Goodhart's founding, Frank and successive generations of family  leadership have tapped into new markets,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695929/congratulating-goodhart-sons-inc-on-their-90th-anniversary"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…on our products, three  times the tariffs when you measure agriculture products, and the  deficit is going down. We have quadrupled revenue to strengthen  America's balance sheet and pay down the tax on our children, which is  the deficit. We have gone from 6.3 percent to 5.9, and exports are at  an all-time high.\n\nNow, what is the issue here? It is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…administration, ICE arrested 7,000  gang members from America's streets. This includes a criminal illegal  alien from Venezuela, an active gang member. The perpetrator's rap  sheet includes arrests for homicide, assault, cruelty toward children,  domestic violence, and damaged property. He entered the U.S. in 2022  and was released by the Biden administration.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}]