[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of Long Beach is expecting  similar declines.\n\nTake a minute to think about the magnitude of that drop in cargo  volume. That decline, at the end of the day, will mean empty shelves  and higher prices.\n\nThe over $300 billion in cargo coming through what we know as the San  Pedro Bay port complex is tied to nearly 1 million jobs in the region  alone and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…related to racial disparities have been deleted,  putting us in the dark on everything from sickle cell anemia to  maternal health.\n\nWe have seen Black authors pulled from school shelves and government  websites quietly erase information on figures like Harriet Tubman and  Jackie Robinson.\n\nJust last month, we learned that memorials honoring the contributions…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…reckless trade war has only begun to squeeze the American  people. Imports at the San Pedro Bay port complex in my district are  expected to plunge in May. That means empty shelves at our stores in a  few weeks and further price spikes as shortages hit.\n\nExports at the port complex have also plummeted as retaliatory  tariffs by other countries hit agriculture…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Thomas, who  is the owner of a beautiful brewery, the 1812 brewery in Watertown, NY,  on the shores of Lake Ontario, where the War of 1812 was fought. His  beer was taken off the shelves in Canada because of Donald Trump's  stupidity and name-calling of the Canadians.\n\nIn northern New York, we have had a great border--a peaceful,  wonderful, prosperous border--between…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…house, and can't get ahead. I hear it from  seniors who are struggling to survive on fixed incomes. I see it with  my own eyes. Moms and dads are putting items back on the shelves in the  grocery store because they can't afford them. Parents can't go back to  work because they can't afford childcare. People's health insurance  premiums are doubling…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…look at the  President's social media posts from just 2 days ago where he said:\n\n``Ontario won't even put the U.S. spirits, beverages, and other  alcoholic products, on their shelves.''\n\nTourism from Canada is down 30 percent. People in the hospitality  industry--Las Vegas, my home State of New York, and the chairman's home  State of Florida--are losing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Willy's Fresh Salsa, which just got into Winn-Dixie.  That was invented by a gentleman who came from Toledo. There is also  Gertie's Premium BBQ Sauce. That is a product on our shelves created  through that program to create wealth, opportunities, and jobs.\n\nSo many more, dozens and dozens of these companies, have been  created, and jobs. Why destroy something…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…are going to suffer are going to be the  small business people.\n\nIf you import toys, and there are maybe 20 different countries from  which you import your toys to put on the shelves of your stores on Main  Street everywhere, and parents can go in to buy the presents for their  child--I just think it is unrealistic. The President is saying: Well,  maybe…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Trump tax when he imposed these sweeping, unlawful  tariffs?\n\nHe taxed your groceries. He taxed your baby formula and your  strollers. He taxed the inventory sitting on the shelves of small  businesses that are just trying to survive.\n\nIn my home State of Nevada, families have paid nearly $1,800 more in  the last year because of these unlawful taxes.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…go  unanswered. Dozens of community members offered to pick up a shift or  two. The new workers were often older Vermonters who had been retired  for years, but they stocked shelves, checked out customers, and  prepared sandwiches with enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…how challenging I think competition in a fast-moving  information age global economy is. We can't afford a trade war that  lasts for 2 or 3 years, leaving our product off the shelves.\n\nWe must reassert Congress's role over trade policy and ensure that a  rules-based trade system is based on transparency, consistency, and the  benefits of the American public.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the brink of recession? Is it that his  tariffs will cost families an average of $4,700 annually? Is it that  CEOs and business owners are warning about rising costs, empty shelves,  and an economic downturn? Maybe it is that the Dow Jones is on track  for its worst April since 1932.\n\nThe truth is, Donald Trump's Presidency is no golden age; it is a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…to lower the cost of living? It really wasn't that long ago.\n\nToday, we have a tax on cars. We have a tax on coffee. We have a tax  on the eggs we import to fill the empty shelves. We have a tax of 125  percent on clothes, toys, and electronics.\n\nWhat does this all add up to? It adds up to a tax of $4,600 a year on  American families. While Trump shrugs…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…spirits.  And Canadians like to buy American products. But the retaliation and  the anger at the United States has caused many to decide to pull all  American products off their shelves--all American products off their  shelves. And I speak with a number of businesses in Virginia who would  face this.\n\nSo the consequences are very real. My colleague from…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…10 percent of the gas water heater  market, and right now, 60 percent of all models on the market already  meet these standards. This isn't an effort to pull products from  shelves. Instead, it is an effort to raise the quality of the products  on the shelves. That is what we are trying to do with the standards.\n\nThird, and most importantly, these standards…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…campaign.\n\nHe did it because he knows about the connection between energy  independence and bringing down inflation. When you go to the grocery  store, we see products all over the shelves that have been brought  there by trucks--trucks that are paying a lot for gasoline and diesel  fuel.\n\nYou see frozen food refrigerators lining the aisles that are plugged…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…a nearby country where self- proclaimed socialists destroyed the richest country in South America.  They implemented these government-run supermarkets, and they have empty  shelves. Venezuelans lost an average of 20 pounds due to starvation.  They promised free universal healthcare, and now they have a severe  shortage of medical supplies, medicine,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…families torn apart, entire communities forced into labor in factories  that feed global supply chains. Some of those goods end up right here  in the United States on our shelves and in our homes.\n\nThe No Dollars to Uyghur Forced Labor Act makes one principle clear:  Not a single American taxpayer dollar should be used to purchase goods,  raw materials,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…end of  freedom that they experienced and their families experienced  personally.\n\nIn my young life, I worked to bring freedom to Eastern Europe. I saw  East Germany's empty shelves, empty eyes, empty spirits, no choice, and  in West Germany, vibrancy. Yet, today, we would even have to debate  that socialism has some value to the human spirit across the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}]