[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…River Police Department for less than 1 year  and was still completing field training. His father, Deputy Sheriff  David Leroy Briese, Jr., of the Yellowstone County Sheriff's  Department, Montana, died in the line of duty on November 3, 2006. We  owe a special debt of gratitude to this family that has lost two of  their family members, police officers…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Sheriff's Office: A pilot program in county       jails\n\nLos Angeles Sheriff's Office: --``a CEW deployment is an       intermediate use of force tool''\n\nLos Angeles County Sheriff's Department Official Temple       Station\n\nMurrieta Police Department\n\nDesert Hot Springs Police Department\n\nHemet Police Department\n\nModesto Police Department\n\nOrange County Sheriff's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…enforcement including ICE for ``keeping our communities safe in the  face of danger.''\n\nI want to be clear. I commend local law enforcement, including the  Orange County Sheriff's Department, which I represent, for their  professionalism and courage. It is a tough job, and I am so grateful  for the men and women who go out there every day and risk their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…for the committee. He laughed about it, and he didn't make that  mistake again.\n\nMr. Speaker, I will say this about him. He was 100 percent American.  When the local sheriff's department asked for help with people who knew  how to operate diesel equipment, Doug showed up. Doug is the one. He is  the Member of Congress that we saw on camera, getting on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…SPARTZ. Mr. Speaker, I rise today to recognize Hamilton County  Sheriff Deputy Jeff Larkin, who is retiring after 16 years of service  with the Hamilton County, Indiana Sheriff's Department.\n\nPrior to his time with the Hamilton County Sheriff's Office, Deputy  Larkin served as a police officer with the Memphis, Tennessee Police  Department. In 1982, he…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…demonstrating his deep commitment to public safety.\n\nIn 1987, Lieutenant Moffett transitioned to a career in law  enforcement as a Deputy Sheriff with the Bucks County's Sheriff's  Department. Then, in 1990, he joined the Buckingham Township Police  Department, where he would serve for the next 35 years.\n\nHe began his service as an Officer and quickly distinguished…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Government to end the  violent riots and restore peace, and expresses gratitude to law  enforcement officers, including the Los Angeles Police Department, Los  Angeles County Sheriff's Department, California Highway Patrol, Orange  County Sheriff's Department, and other local, State, and Federal law  enforcement agencies, including the United States Immigration…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…rise today to recognize Sheriff Dave  Lange, who is retiring this month after a nearly 40-year career in law  enforcement, including 29 years with the Nicollet County Sheriff's  Department.\n\nA proud son of southern Minnesota, Sheriff Lange joined the  department right out of high school as a jailer-dispatcher. He then  went on to work briefly in North…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698459/recognizing-sheriff-dave-lange"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…continue to mourn this fallen hero.\n\nPlease also join me in praying for a swift recovery for Deputy White,  as well as Sheriff Whittle and the entire Columbia County Sheriff's  Department.\n\nMay God's grace be with our entire community as we continue to heal  from this tragedy.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690553/mourning-the-loss-of-deputy-brandon-sikes-and-praying-for-swift-recovery-for-deputy-gavin-white"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…was a  graduate of Avon High School and SUNY Brockport.\n\nOfficer Mazurkiewicz then began his law enforcement career in 1988 as  a jail deputy with the Monroe County Sheriff's Department in Rochester,  New York. In 1993, he joined the Rochester Police Department as a  patrol officer, serving both Clinton and Goodman sections until he  transferred to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Lieutenant Kurt  Delong of Westfield, Indiana who for his 25 years of service as a  reserve officer to the Hamilton County Indiana Sheriff's Department,  where he has served with distinction. Lieutenant Delong had a very  strong religious upbringing, while stating numerous times to his  colleagues that he is a ``Missionary…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689279/recognizing-lieutenant-kurt-delong"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the rank of  staff sergeant.\n\nAfter leaving the military, Dick Burbine remained dedicated to  protecting others. He served in law enforcement with the Contra Costa  Sheriff's Department, the Danville Constable's Office, and the  University of California Police Department at Lawrence Livermore  National Laboratory. In 1987, he retired as a sergeant and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…deal, but in 1990, there was a great  debate that was still spinning on this issue. In fact, that year, that  September day, at at least one of those gatherings, the sheriff's  department came out and arrested the students for praying--praying--on  their school campus before class started.\n\nThe result of that was that the next September, a million students…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…committee tasked with developing the new jail for Milam  County. His work with this committee led to the conversion of an old  hospital into the new offices for the Sheriff's Department, the Texas  Department of Public Safety, Precinct One and Two Justices of the  Peace, and attached to all of this was a new modern jail.\n\nBill has served on the Cameron…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}]