[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…also strengthens each of the Coast Guard's missions and authorizes a  30-percent budget increase to support that workforce.\n\nI noted the President last night talked about shipbuilding in  general. We are enthusiastic about that mission. I know that in budget  reconciliation, people are already, the chairman of the committee,  talking about the Coast Guard…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…perpetrated is not a law enforcement action by any stretch of  reasonable consideration. It is an act of war and occupation.\n\nAre funds being taken from our nuclear Navy shipbuilding program  which is already 2 years behind schedule? Are funds being subtracted  from cybersecurity accounts that are so essential to national security  and our future? What…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…effectiveness of naval forces; laying the legislative foundations for  the landmark AUKUS agreement; collaborating with the defense industrial  base to strengthen our submarine and shipbuilding capacity and  workforce; working tirelessly to ensure our Sailors and Marines had the  necessary authorities, weapon systems, and capabilities; and leading  efforts to secure…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American  strength without steady support. This bill fails liberty on all counts.\n\nThis bill misses crucial opportunities to strengthen America's  defense industrial base. Shipbuilding is backed up over 2 years. The  Great Lakes region, a cornerstone of American industrial manufacturing,  can play a major role in relieving that backup, but all of America…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…maritime Nation and ensuring  a strong fleet is essential to our success and national security.  During his time, the National Defense Authorization Act plussed up Navy  shipbuilding every year above the budgets submitted by Presidents Bush,  Obama, Trump 1.0, Biden, and Trump 2.0. Programs at the high end of  complexity, such as the Columbia and Virginia…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…constituents, who was an  original Rosie, Ms. Jean Lillian Winther, whose story was part of the  fabric of our country's history at a time when women were rarely seen  in the shipbuilding trades.\n\nJean stepped forward with courage and determination, taking up the  torch, quite literally. She showed that women could excel as welders,  as builders, as defenders…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…U.S.-flagged, U.S.-owned and U.S.-crewed. The rationale for this  ancient and outdated restriction has always been argued as national  security, to maintain a strong U.S. shipbuilding industry and merchant  fleet capable of supporting the military in times of conflict.\n\nBut today that argument, if it has any merit at all, is being  dangerously undermined,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…you add the  Reserve, and you add the civilian DOD and the military contractors and  their families. We train all the Marine officers in the world. We have  the biggest shipbuilding enterprise in the world. We have the Pentagon,  the largest military office in the world. We have been the site of more  battles on U.S. soil than any State in this country,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…constitutional mandate to ``provide and maintain a Navy.'' The Seapower  portion of this bill accomplished that goal.\n\nFor example, the bill includes a plus-up of $5 billion to  shipbuilding above the administration's request, including $1.9 billion  to address glaring OMB budget request shortfalls in the Virginia  submarine account. The Seapower and Projection…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…revoke permits for the Revolution  Wind project, which was fully permitted and 80 percent complete,  supporting more than 2,500 U.S. jobs across  construction, operations, shipbuilding, manufacturing. The project was  just steps away from powering more than 350,000 homes in Rhode Island  and Connecticut, but now that is at risk, so they are facing much…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Also, since a yearlong CR would not account for inflation, thousands  of DOD programs would see cuts. That includes programs that deal with  nuclear triad modernization, shipbuilding and ship  maintenance, munitions production and replenishment, and U.S.  priorities in the Indo-Pacific.\n\nUltimately, a yearlong CR would force too much uncertainty and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…suffocated the normal communication  and negotiation that would address glaring harm, such as the cut off of  health insurance subsidies and steady funding of the Navy's  shipbuilding budget. There is a better path, Mr. Speaker, which is to  have our chamber exercise its independent constitutional role and  protect both the health care and national security…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…readiness, modernizing our forces, and strengthening the foundation of  America's national defense.\n\nThe bill revitalizes our defense industrial base, strengthens  American shipbuilding, and supports the workforce that keeps our Navy  and joint force mission-ready. These investments deliver for our  Nation, and they deliver for Hampton Roads, home to the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697791/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…some ambitious, important, and overdue  priorities for America's national security, and none of them--none of  them--come cheap: the Golden Dome for America, an American shipbuilding  renaissance, sixth-generation stealth fighter aircraft, the long- overdue modernization of our nuclear force. Reconciliation isn't enough  to support these major efforts,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…deserve.\n\nI also visited the Curtiss-Wright service center in Chesapeake, where  skilled workers support our Navy's nuclear fleet. Their work is a  reminder that America's shipbuilding strength begins with the men and  women of our industrial base. The One Big Beautiful Bill Act invests  more than $29 billion in shipbuilding and another $25 billion in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Defense appropriations bill.\n\nThis amendment strikes section 8072, a misguided rider that prohibits  the Navy from decommissioning littoral class combat ships.\n\nThe state of shipbuilding in the United States is nothing we would  hope to have. It is broken. This program maybe represents the pinnacle  of its brokenness. The ship doesn't accomplish what it…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…country.\n\nWe are also making a major investment to bolster our national defense  and build a military that can defeat the threats of today and tomorrow.  We are boosting shipbuilding, expanding our Air Force fleet, and  investing in drones and counterdrone technology. We are restoring our  defense production capacity so that we can make more munitions…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…our  allies in the region.\n\nFurthermore, this bill increases the lethality of our forces to  prepare for and deter global threats. The bill authorizes over $26  billion in shipbuilding for additional submarines and surface vessels;  $38 billion to ensure air dominance with new generation fighter jets;  $25 billion to restore America's arsenal of munitions;…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…It will help us start to revitalize our defense industrial base and  restore readiness accounts to ensure we can fight tonight. It will also  help us start to expand U.S. shipbuilding capacity and enhance our  missile defense. It will also help begin restocking our Nation's  arsenal of critical munitions. It will help us position our military to  out-compete…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688078/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…aircraft programs,  as well as 47 additional F-35 aircraft. These investments will  guarantee America's air superiority around the globe.\n\nThe legislation also supports shipbuilding. It supports the  construction of a third Columbia-class ballistic missile submarine and  an additional Virginia-class submarine.\n\nAdditionally, the bill contains block…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]