[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…separated, who have had their humanity erased and their  dignity denied, the men, women, and children who have been ripped from  our communities, thrown into cold cells, and shipped off to countries  many have never known.\n\nThe Trump administration would have you believe that they are  pursuing hardened criminals. Yet, according to ICE's own data, 85…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…asked for is a fair  shot and for this place to stop screwing us over, but you can't help  yourselves.\n\nYou got us into terrible trade deals that made Wall Street rich and  shipped all of our jobs overseas. You bail out the banks while  neglecting rural America. You have rigged the economy so the corporate  PACs that are funding your campaigns make huge…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to be restored.\n\nFor years, USAID funded the production of ready-to-use therapeutic  foods at Edesia Nutrition in my district. The food that was  manufactured there has been shipped across the developing world, saving  the lives of 25 million  children since 2010, until funding for new orders was halted by the  Trump administration earlier this year.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690575/call-for-restoration-of-global-emergency-food-aid-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that.  If you have an existing pipeline, you can just double, triple, or  quadruple it, or whatever, and send American gas to Mexico, where it is  going to be made into LNG and shipped throughout the world.\n\nThat is only going to increase our gas prices here in the United  States. That is what is going to happen here.\n\nAgain, we on the Democratic side have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…since last using the benefit.\n\nThis bill from Representative Moylan builds upon that work by  simplifying the process for veterans who require their adaptive vehicle  to be shipped. This includes veterans who live in areas such as Guam,  Puerto Rico, and the Northern Mariana Islands.\n\nAgain, I support the substance of this bill, but I think we should…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689674/deliver-for-veterans-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…funding for  lifesaving food aid for starving children.\n\nThis is Plumpy'Nut, an emergency paste that is used to treat  malnourished children. Until recently, the United States shipped this  product all across the world, saving lives, saving the lives of  children suffering from malnutrition.\n\nThis is important because it is the right thing to do, but it…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…nuclear weapon. Instead, they dismantled their plutonium- based Arak heavy water reactor. They agreed not to enrich uranium  beyond 6.7 percent, and they didn't do so. They shipped all of their  more highly enriched uranium out of the country--some 25,000 pounds--to  be stored abroad.\n\nBut 3 years later, President Trump tore up that agreement. He did…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…this lifesaving food aid to children who are  starving in Gaza.\n\nNow, in the past, this would have been done with support from  America, from the U.S. taxpayers, and the boxes shipped to Gaza would  have said ``from the American people.'' However, because the Trump  administration has cut off lifesaving food aid for children, instead  this shipment is being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…of emergency food aid because it expired while  sitting in a warehouse. This is food that had already been paid for,  had already been produced, and was just waiting to be shipped to  starving people who needed it to survive. Instead, it is being  incinerated.\n\nIn my district in Rhode Island, 87,000 boxes of lifesaving nutrition  are sitting in Edesia…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694042/incinerating-500-tons-of-emergency-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…is a fortified peanut paste that has saved  millions of lives by getting safe nutrition to children in hard-to- reach places around the world. Until recently, this was being shipped  by USAID to war-torn and famine-torn areas all over the world, saving  lives under Democratic and Republican administrations, until the Trump  administration dismantled USAID.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…cities. They pull up on people,  jump out with assault weapons, force them into unmarked cars, and  disappear them. Their families learn days later that their loved one  has been shipped off to a foreign gulag without presenting evidence to  a judge that they should be removed.\n\nTrump has done this to legal permanent residents and talked openly  about doing…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…in the middle of the  night, and zip tying children.\n\nThey are using immigration hearings and check-ins as setups and  defying court orders, and then our neighbors are being shipped off to  countries where they have never even been. They are being held in  detention centers with unspeakable, inhumane conditions with no due  process, no access to attorneys,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697454/fighting-dhs-immigration-raids"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…that anybody can  get on. That is what we should be moving toward.\n\nThe bottom line is this: I remember when my mother, who was working  as a contractor because her job got shipped offshore, didn't have  insurance and she badly broke her leg, lost her home, went bankrupt,  lost everything, and had to start over.\n\nMany people in this country will lose…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Presidential library--a  huge waste of our money.\n\nAnd this bailout for Argentina--you know, earlier I was talking to a  colleague from Washington State who said a lot of soybeans are shipped  through Washington State but they are normally bought by China. Well,  China isn't buying a single bean this year because of the tension and  the argument between our two…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…therapeutic food, also known as Plumpy'Nut. This is a miracle  treatment. This is a peanut-based paste that treats malnutrition,  doesn't need to be refrigerated, and can be shipped around the world.  You don't need to add water, and it saves the lives of children.\n\nEdesia Nutrition in North Kingstown, Rhode Island, is one of the  factories that produces…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…delays during commuting,       permanent change of station travel, or other official travel.\n\n(3) The unavailability of local infrastructure to support       vehicles or goods shipped to duty stations in locations       outside the contiguous United States that are not connected       by the road system, including locations served by the Alaska       Marine…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…negotiating table in the process. For years, Democrats sold a bill of  goods to working-class Americans while they turned a blind eye as their  factories closed and their jobs were shipped overseas.\n\nToday, Democrats claim to be the party of working families, and we  know that is not the case. Yet, it is President Trump, over the  Democrats' loud objections,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…and  Coleman soon emerged as a center of diverse agricultural production. In  addition to citrus, settlers in Coleman raised cotton, cattle, sheep,  and hogs, with wool even shipped to Baltimore for processing. By 1923,  Coleman had earned national recognition as the ``Cabbage Capital of the  World'', attracting buyers from across the country.\n\nToday,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…forum that she learned  about sodium nitrite.\n\nWith the coaching of sinister strangers online, Kristine was able to  purchase sodium nitrite on Amazon and get it nondescriptly shipped to  her front door, all under her parents' noses.\n\nSodium nitrite is a chemical used in the preservation of meat and  fish, which in high concentrations is deadly if ingested.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President Trump declared that  addresses the flow of fentanyl across the northern border from Canada.\n\nFentanyl moves in a sophisticated supply chain. Precursor chemicals  are shipped from China to North America--landing in Mexico, Canada, and  the United States. Those chemicals are then used to produce fentanyl,  which is smuggled into the United States…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…sent our children and our wealth overseas to defend  the borders of distant nations while throwing open our own borders to a  tidal wave of mass migration here at home. They shipped the good- paying, middle-class American jobs that once were the backbone of our  economy to places like Mexico and China, transforming once prosperous  towns and cities into…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…were a       private security company under our nation's federal firearms       laws. This means that the tribal police departments cannot       have a bulk order of firearms shipped directly to their       police department and instead must send an authorized       representative of the tribal police department to a Federal       Firearms Licensee (``FFL'')…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…people and  truly has accomplished that in his time with the company across  Tennessee.\n\nFarris has an honorable record of humanitarian aid and philanthropy,  as well. He has shipped over 140 containers of humanitarian assistance  over the last 12 years to support east Tennessee families and refugees  at home and abroad.\n\nJohnny Wayne Farris is not only…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698413/recognizing-johnny-wayne-farris"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…These pro-growth policies are already  driving a surge of business investment. More investment means more  manufacturing at home and more American jobs--jobs that have been  shipped overseas by the Democrats in the past. More manufacturing leads  to high-paying jobs at home.\n\nConstruction sites are booming. You are seeing it there in the  construction…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…our troops depend on from the front lines to forward  operating bases.\n\nEvery rifle sight calibrated, every artillery shell inspected, and  every 3D-printed replacement part shipped from Rock Island shortens the  time between a soldier's need and the answer that keeps that soldier  alive.\n\nWhen rumors surfaced of workforce reductions at the island, I…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Manufacturing Finance Act.\n\nThe ability to manufacture in the United States is vital to our  country's economic and national security. However, for decades,  America's policies have shipped good-paying manufacturing jobs overseas  and opened the door for foreign adversaries to fill the void. We must  reverse this trend which would require more than just luck.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…K-12 education.\n\nThis seemingly localized decision has national repercussions, as  well. In 2024, Wyoming produced 191 million tons of coal, 171 million  tons of which were shipped to 26 different States for producing  electricity.\n\nAt these rates, Wyoming produces about 40 percent of the Nation's  coal and about 80 percent of all Federal coal production.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…aisle, I know you love your globalist pet  projects, but the American people are fed up. The voters that sent us  here are watching, and they are done seeing their dollars shipped  overseas and funneled into biased media.\n\nMr. Speaker, H.R. 4 is a victory for taxpayers, and I urge its  adoption.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692529/rescissions-act-of-2025"}]