[{"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, I rise with deep shock, concern, and outrage  at the carelessness of the Trump administration in disclosing highly  sensitive operational military plans on a commercial chat platform that  included…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…living paycheck to paycheck,  and they justifiably expect better from this government.\n\nWe should be working hard in a bipartisan way to make their life  better, not unleashing shock, awe, and pain on the American people.  That is what this one big, ugly bill will do, devastate everyday  Americans.\n\nLinda writes to us, a small business owner. I believe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…protestors and legal observers are being not just  harassed but assaulted and detained and even killed by Trump's agents.\n\nThe killings of Renee Good and Alex Pretti really shock the  conscience. They demand action. They demand accountability and justice.  Democrats are insisting that happens.\n\nAnd it is a good thing that at least some Republicans are…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…day, right now, in the streets of America, in the neighborhoods  of our great country.\n\nThey are a betrayal of the rule of law that is the foundation of our  Nation. It should shock America's conscience, and I believe it has, as  it has shocked mine. These kinds of brazen, abusive, lawless tactics do  not represent our Nation. Americans will have a hard…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…said: Did you ever experience any tingling? He said: Yes,  I did. I have experienced tingling in my hand and in my fingers. The  doctor asked: How long has that happened? To my shock, my husband said:  3 years.\n\nFor 3 years, he felt tingling in his fingers, and yet didn't think  maybe I should get that checked out.\n\nHe tried to have a tooth extracted without…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…walked into the  Capital Gazette and killed five members of our hometown newspaper:  Gerald Fischman, Rob Hiaasen, John McNamara, Rebecca Smith, and Wendi  Winters.\n\nAmid the shock and horror, just hours after the shooting, the Capital  issued a simple statement: We are putting out a damn paper tomorrow,  and that they did.\n\nThese journalists made clear…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693114/capital-gazette-shooting"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…financially secure. Allowing 16 million people, including  306,000 people from the State of Washington, to become uninsured is a  bad idea.\n\nWithout any alternatives, this will be a shock to our healthcare  system. It will bring it to the breaking point and threaten the very  lives of our constituents. I would like to take a moment to read a  letter from my…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Hemisphere.\n\nJust last night, President Trump declared: ``Venezuela is completely  surrounded by the largest armada ever assembled in the history of South  America,'' and that ``the shock . . . will be like nothing they have  ever seen. . . .''\n\nThis is not a strategy. This is a game, and the President is playing  it with the lives of American servicemembers,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…many of whom are still paying the price for  that day.\n\nOn the campaign trail, Donald Trump promised that he would pardon  January 6 insurrectionists--but it still came as a shock when, on the  first day of his second Presidential term, he issued a blanket pardon  and 14 commutations to all of those who had been charged or convicted  for their involvement…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…altogether.\n\nHouse Democrats stood united for more than 40 days to prevent this  outcome. We fought to shield families from exactly this kind of  financial ruin and healthcare shock. Once again, our Republican  colleagues across the aisle chose politics over people, and Brooklyn,  New York, like other districts across the Nation, will feel that pain  most…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…worst cases, victims have been driven to suicide.\n\nCongresswoman Ocasio-Cortez described her own reaction being depicted  this way without her consent. She said:\n\nThere's a shock to seeing images of yourself that someone       could think are real.\n\nWhile prominent women are often the target for nonconsensual, sexual  deepfakes, sadly, the victims can…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…mother's cancer was not detected  until it was stage IV, and therefore, was not treatable.\n\nTragically, the cancer took her life 8 short weeks after her  diagnosis. It was a shock to our entire family, the lingering effects  of which I feel every day.\n\nIn an effort to turn my pain into passion, I made a commitment to do  all that I could to prevent other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…fear; people  staying home; restaurants and businesses feeling the impact; Operation  Metro Surge costing our Minnesota economy an estimated $80 million per  week, all for the shock and awe, where such a small percentage of the  people that they apprehended were involved in violent crime.\n\nAt its peak, one study showed that the surge cost Federal, State,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…with. He makes a good salary, and he is a  hard-working guy, but he can't afford such a dramatic jump in the price  of his healthcare insurance. That is the kind of financial shock that  Jeremy will have about which I heard over and over and over and over  again.\n\nWhat do you do--sign up for healthcare you can't afford or go  uninsured? Go broke or go…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…heels of the devastating assassination of  Speaker Emerita Melissa Hortman and her husband Mark Hortman of  Minnesota, victims of premeditated political violence. This should  shock the conscience of every American, and it should cause all of us  to rise up and say: Enough.\n\nLet me be clear. I disagreed with Charlie Kirk on just about  everything, but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…time to give more choice and more competition. Those are the  only ingredients that are going to make costs lower. We can't keep  patching the same roof. Everybody has sticker shock.\n\nMr. Speaker, I urge everybody, the right answer is to vote ``no'' on  extending these horrible tax credits.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…number was, well, if you cut $2 trillion over 10 years,  that is $200 billion. He is right, but that is actually not what is in  the document here. It is functionally 1.2 with a shock absorber. Once  again, I will give you the shock absorber, depending on what Ways and  Means ultimately does. I thank the gentleman again. It shows we  actually are fairly…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…be cause for concern for the couple. They would  have to get married right away. They would have to work harder to  support the child.\n\nIt was to George Gilder's surprise and shock that, as he followed  this young couple around, they were thrilled that the woman got  pregnant out of wedlock because it allowed them to go from government  office to government…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, I rise today still in shock and saddened at  the political assassination of Charlie Kirk. There is no place for  political violence in our country, and it is antithetical to who we are  as Americans.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Speaker, the sudden passing of our close friend and  colleague, Doug LaMalfa, has caused both shock and sadness throughout  the entire House of Representatives. We lost a friend and a colleague.  His northern Californian constituents lost their tireless advocate in  the House.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…year, small businesses spend nearly  $15,000 per employee to comply with Federal laws. American companies  spend over $3 trillion a year on compliance.\n\nI am sure this is not a shock to anyone in this Chamber, but we know  that some of that cost gets passed on to consumers. The Competitive  Enterprise Institute estimates that U.S. households absorb $16,000…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…with profound impact on an       entire mesmerized nation. I vividly recall as a teenager       living then in Israel and myself son of Polish Holocaust       survivors, the shock of the horrific events described by       shaken witnesses. The author offers us a touching       confessional of a crisis of faith of an Orthodox raised Jew,       challenging…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Mr. GRIFFITH. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I find this debate fascinating and interesting. That may  come as a shock, because it is really pretty boring. However, I find it  interesting because my colleagues have just said: Why are we spending  time worrying about this little regulation from…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…defense was number one.  Now, the way you actually stack it, it is either number four or number  five in our spending.\n\nYet, if you go home and tell people that, what continues to shock me  is how many people say, ``If we just did this.'' Show them the math  that you just covered about 30 minutes of borrowing, and they look at  you angrily because, my belief…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…attempt to fool or strong-arm President Trump  will not succeed. If Putin thinks he is going to pull the wool over his  eyes or box him into a corner, Putin is in for a very rude shock.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…wasteful spending  overtook Washington during the Biden-Harris administration, they would  not be surprised. Their jaws would not drop, and their pupils would not  dilate in utter shock.\n\nThe American people saw the fiscal ruin that was created by the  previous administration. That is why they overwhelmingly chose  Republicans to lead the Nation and restore…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…way we do  these star ratings, where you use those things to pump up your  compensation, and actually do it from enrolling? Let's get the actual  models right. We will build a shock absorber if someone gets really  sick. We will share the risk.\n\nThen, the incentive is to help the population get healthier and  healthier because we have technology. We have…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…in history because  ``PTSD'' was not always a term of reference and a term of the norm when  it came to dealing with stress. In World War I, I believe the term was  ``shell shock.'' In World War II, the term was ``battle fatigue.'' In  Vietnam, when I was there, we used to call it the ``thousand-yard  stare,'' a certain emptiness we would see in others…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "John James", "party": "Republican", "sentence": "…Wal-Mart, they are vital  to America's national security interests, as well.\n\nMr. Speaker, we must do everything in our power to ensure that our  Nation's supply chain is resilient, shock resistant, and protected from  nefarious foreign adversaries; this includes the Chinese Communist  Party. The threat from China is real, and the time to act is now.\n\nDuring…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise at a moment when the  Nation is still in shock over the sudden and senseless death, the  brutal, barbaric murder, and the cold-blooded assassination of a man  beloved by millions.\n\nThe depth of this tragedy is hard to process:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}]