[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…very  exciting to be with a bipartisan delegation of Members of Congress for  a few days. It was during a recess period. I thought it was worthwhile  to do it.\n\nI was actually shocked that there were not American cars in Portugal.  I thought, my goodness gracious, where are your Fords? Where are your  General Motors? Where are your Chevys? Anything?\n\nMy…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…They are dissembling Social Security from within.\n\nDemocrats are aware of this, but all citizens--whether Republican,  Democrat, or unaffiliated--ought to be concerned and shocked by the  fact that your data, your personal information, has been hacked by  people who were not vetted and are unaccountable and have placed this  in a cloud, meaning in an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…moved to the side and shot two shots in the  driver's side window. That is what happened.\n\nAlex Pretti was out with his cell phone camera observing what was  going on and was shocked, I am sure, to see that an ICE agent was  pushing a woman into a snowbank, and he came over to try to get between  them. There was a scuffle. He was in total subjugation by…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…I am proud to support H.R. 5784, the AI-WISE Act.\n\nFour years ago, AI burst into mainstream focus with the launch of  OpenAI's ChatGPT. When I first tried this tool, I was shocked. I knew  then and there that AI had the potential to revolutionize the way  American firms operate and do business.\n\nAI, like all emerging technology, comes with risks. AI…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…childcare.\n\nDisruption to this funding will have substantial, immediate, and  destructive consequences to children, families, businesses, and  communities.\n\nI am upset but not shocked that the Republican leadership rejected my  amendment to this bill that would penalize HHS for illegally  withholding payments of TANF, Child Care Entitlement to States, or…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699231/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…come in such a dramatic form. I want  to kind of break down and put in the Congressional Record what has  actually transpired over the last 72 hours.\n\nI think many of us were shocked when we saw just a couple of days ago  when, on Tuesday at 1:30, Elon Musk tweeted the following. He said:  ``I'm sorry, but I just can't stand it anymore. This massive,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…most--were members of the Russian Air Force, pilots, some of them test  pilots.\n\nI flew with these guys. They weren't the best pilots in the world, I  have to admit. I was shocked the first time I flew with a guy who I  will not share his last name. His first name was Vladimir. But I was  really shocked that this guy who was a MiG-25 pilot could not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…racial.\n\nIn fact, one of the veterans who came back who had served in the  military and fought in World War II had his eyes gouged out when he  came back, an act of violence that shocked the country, but didn't  shock it enough. We had other lynchings, and the like, that went  through that era and continued until the 1960s. That is when Dr. King  and the civil…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…undermining.  There will be time for that debate. There will be time for that action.  Today, is a time to fund the majority of government for the American  people.\n\nMinneapolis has shocked the conscience of America. We ought to be  shocked, angry, and disgusted by the taking of life of Renee Good and  Alex Pretti. We the people want to end this violent occupation…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…provide oversight. I suggest Kristi Noem and DHS staff read section  527(a) of the Department of Homeland Security Appropriations Act of  2024, which is Public Law 118-47.\n\nAm I shocked? Let me be honest. I am not shocked. We were illegally  denied entry. While we weren't surprised, it was pretty disrespectful  for Members of Congress to not be able to do…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…identifying himself as a U.S.  Senator, bringing him into a hallway, bringing him down to the ground,  bringing his arms behind his back. I saw this happen to my colleague,  and I am shocked by how far we have descended in the first 140 days of  this administration, where we have a President calling out the military  over the objection of a Governor to try to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "Mr. MURPHY. Mr. President, I want to come to the floor today to talk  about a success story but, potentially, a success story interrupted.\n\nBack in 2022, we all were shocked to watch news playing out during an  afternoon that we were here, working in the Senate, of another mass  shooting--this one of just unthinkable size and scope--in Uvalde,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…discarded like garbage.       He was a dedicated worker with the highest possible rating on       his yearly performance appraisals. His staff and senior       leadership were shocked, dismayed and bereft at losing such       an important team member.\n\nMy son delivered this news with a crack in his voice,       something that will bring any mother to her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…within the frame of reference of any of us; it was  outside the box of what we considered possible, what happened this  evening 5 years ago. This is why earlier today, I was shocked to read  that the plaque that we had passed a law to commemorate the service of  the officers, that that plaque had been cast in bronze, but never  actually displayed as required…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…signature  is the only one that appears on all three documents, however. That is  not only something worthy of note, but something, of course, to  celebrate.\n\nThis is why I was shocked when I learned on my very first official  tour of the Capitol Building--which was given to me by my own team  member, Emma Consoli, who is the one we really should thank for…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Mrs. MOODY. Mr. President, last week, across America we were shocked,  astonished, gutted. The night before our Nation paused to give thanks  for the blessings in our lives--the night before Thanksgiving--two of  our country's finest were shot…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…FISCHBACH. Mr. Speaker, I thank Mr. Comer for yielding me the  time.\n\nMr. Speaker, I rise in support of H. Res. 519.\n\nThe events of June 14 were truly horrifying. Those events shocked  Minnesota, and they shocked the country.\n\nWe mourn the loss of Minnesota Speaker Melissa Hortman and her  husband, Mark. We pray for the swift recovery of my friend, Senator…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…what was  happening during that time period, no one paid attention to it, until  the next spring, that scrubby little tree in the asphalt started  sprouting. And people were shocked. It is alive. And suddenly it went  from being a scrubby tree in the parking lot that was just going to be  cleared out to being a sign of hope.\n\nSo we cleared the asphalt…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Iranian-backed Hamas terrorists launched the most harrowing  assault on Israel and the Jewish people since the Holocaust.\n\nWe witnessed an unprecedented act of violence that shocked the world  500 days ago. We will never forget the 1,200 innocent lives Hamas  murdered and the 240 civilians they took hostage that day, as well as  those affected in the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…she has curated for herself as a defender  of justice and accountability while secretly collaborating with an  individual whose crimes against vulnerable women and children shocked  the nation;\n\nWhereas Delegate Plaskett's willingness to receive instructions on  official congressional proceedings from Epstein, a convicted felony sex  offender with deeply…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "French Hill", "party": "Republican", "sentence": "…or Cuba or Venezuela  or imprisonment but the capture of the spirit that ends individual  freedom and ends individual opportunity.\n\nMr. Speaker, I will say that I have been shocked at some of the  debate today that we hear from a daughter of  Korea, two daughters from Cuba, who have seen firsthand the dangers,  the fear, the atrocities, the restraint,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…running for office anymore.\n\nHe went on to say very nice things, that he likes me and we work  together. I like the President. As a matter of fact, I know many people  would be shocked to hear this, but I never had a cross word with the  President. We never had an elevated discussion in either direction. I  suppose if it came from one direction, it would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, over the last few days, the  country has been shocked by the horrifying images coming out of Los  Angeles, but what is also shocking are the brazenly false statements  made by the Governor of California.\n\nGovernor Newsom has…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692292/controlling-riots-in-california"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in rural communities.\n\nWhen Dr. Hotz began practicing in Leesburg, Georgia, he was not only  the only doctor in the county but the first they had seen in nearly 40  years.\n\nShocked to see so many people suffering from diseases no longer  considered to be a widespread threat, such as tuberculosis, Dr. Hotz  made it his mission to remedy the lack of accessible…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…on all of us as Members of the House of  Representatives.\n\nMr. NEWHOUSE. I am prepared to close, Mr. Speaker.\n\nOne of the things when I was a freshman in Congress that just shocked  me, amazed me, is how easily events on the floor would devolve into  what I would describe as something akin to a high school pep rally, and  that pains me to say that.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…have us vote on something that is irrelevant because  the action they want to stop is not taking place. There is no war there  now.\n\nI think what my colleagues are is shell-shocked because after all of  these years of empty comments condemning Maduro, empty statements by  them, empty statements by Joe Biden talking about how bad of a man he  was, we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…often set up near our military  bases, just to give it another layer.\n\nThere are CCP and Chinese affiliations in 143 schools throughout this  country. Honorable Speaker, I was shocked myself to realize that one of  them sits right outside our capital city of Columbus, Ohio. This is  unacceptable.\n\nThey could be coming to a school near you very soon. That…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…12 matchups, including a crushing 10-3 exhibition  win just 3 weeks earlier. No one expected the Americans to win.\n\nHowever, on February 22, 1980, in Lake Placid, Team USA shocked the  world, defeating the Soviets in a stunning upset.\n\nIt wasn't just a hockey game. It was a symbolic victory for  democracy, resilience, and national pride.\n\nJust days…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…attempt to  aggrandize power at the expense of the legislature. They would have  expected it. Indeed, they did expect it. But they would be surprised-- the Founders would be shocked that Congress would voluntarily and  recklessly and fecklessly give up their power to the Presidency, to  submit to emergency rule. The Founders would not have expected the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…unknowingly funded for illegal aliens include  something as unique as music lessons. When digging into this issue,  Congressman Kennedy and I were both outraged and simply shocked at the  brazen and flagrant waste of funds on these perverse incentives.\n\nI know Congressman Kennedy to be a fierce advocate for conservative  principles both for his district…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}]