[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…stalking school parking lots and school routes and  detaining parents in front of their children. In one instance, ICE  agents surrounded two high school students at a coffee shop and pointed  rifles at them. This is beyond unacceptable.\n\nStudents as young as 9 years old know these actions are wrong. A  fourth grade student gave me a handwritten letter,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…economy, and they are. I  grew up in a house with a dad who worked for a huge company, and it was  his dream to start his own business. And he bought a little iron  working shop that, at the time that he bought it, had like four  employees. And during the entire growing-up period when I worked in my  Dad's shop, in a good year, it would be seven employees,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Silverio's tragedy is not alone. It affects families every day now.  That same day, in Little Village, ICE arrested William Gimenez, a day  laborer, as he walked into a barber shop with his wife. William was a  lead plaintiff in a lawsuit against Home Depot and local police for  abuse. ICE retaliated.\n\nWe all saw the Cicero case: children were left crying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…systems have made it harder for  entrepreneurs to access the resources they need.\n\nAfter repeated unsuccessful attempts to develop and deploy a platform  that would be a one-stop-shop for contracting certifications, the  committee requested the GAO review the SBA's efforts to figure out why  they failed. The report identified the critical gaps in the SBA's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…childcare, a car repair, and it is groceries for families that are  already struggling to get by.\n\nMy district has seen the real-world consequences. A neighborhood  cupcake shop, a local brewery, coffee roasters who built their dream  from the ground up were all forced to shutter their doors this past  year directly because their costs have skyrocketed…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…memories  through his woodworking. He was a true entrepreneur, operating a  successful logging company for over 25 years while also owning and  managing a country store, bait shop, grocery store, and restaurant. His  diverse ventures showcased his dedication to serving the community.\n\nIt has been said that ``Service is the rent that we pay for the space…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…get ready for the holiday season, I will talk about something  that is weighing on many of them.\n\nThe cost of everyday life keeps going up and people feel it every  time they shop for groceries, pay their utility bills, fill up their  gas tanks, or try to plan for the weeks ahead.\n\nAcross Ohio's 13th District, people are telling me the same thing:  Their…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…community as a bus driver for the  Dougherty County School System and as a dispatcher with the Albany- Dougherty 911 Communication Center. An entrepreneur, he owned The  Gentlemen Shop, G & W His & Hers Accessories, and the Albany Christian  Book & Gift Store.\n\nHis ministry and mission were global in scope--Bishop Williams  traveled extensively to Haiti, Africa,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…economic overhaul is disrupting lives and testing some voters' patience  in an election-deciding swing State.\n\n``New hires at a local truck-making plant had just started on the  shop floor last month when their company announced an abrupt change:  layoffs that could hit more than 10 percent of the workforce and that  the company blamed on tariffs and other…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…lapse of the enhanced premium tax  credits.\n\nI know this because I have met with small business owners in my  district, like Rachel Rozner, who is the owner of the Elden Tea Shop in  Reston, not far from here, a five-person business that is exactly the  kind of Main Street business that the majority claims to champion.\n\nAs she told me, Rachel's business…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Europe to allow  Jewish communities to have fresh and hot meals on Shabbat.\n\nSylvan Goldman invented the shopping cart, transforming the ease with  which people are able to shop for their families.\n\nWhen Hedy Lamarr, the famous and accomplished actress, was not acting  in films, she invented the concept of frequency hopping, which opened  the door to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…installed in their homes. In fact, these standards  preserve consumer choice. They ensure that all products on the market  meet a certain level of energy efficiency so consumers can shop with  confidence.\n\nThe standards impact less than 10 percent of the gas water heater  market, and right now, 60 percent of all models on the market already  meet these standards.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…country face. Our colleagues now want to invite the  Federal Government to come barging into the family dining room and in  the doctor's exam room like a raging bull in a china shop.\n\nDoes anyone believe the Freedom Caucus and President Trump love  America's children more than their own parents do or that they can make  better decisions for tens of thousands…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…locally owned small businesses bringing life and community  to our cities.\n\nMr. Speaker, as we approach Small Business Saturday and the holiday  season, I encourage everyone to shop small and take some time to  support your local businesses. By doing so, you are supporting your  neighbors, growing your local economy, and making your community  stronger.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…secretary, a  billionaire; his education secretary, a billionaire; his entire  Cabinet, Health and Human Services, Energy, Interior, all led by  billionaires.\n\nThese people don't shop for themselves or they don't worry about  paying rent. They don't care about us. Trump said he would drain the  swamp. What a bunch of BS. He moved the swamp into the Lincoln…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…some  of these other industries, have to compete against companies abroad.\n\nMr. Speaker, when these big multinational corporations have to decide  if they are going to set up shop in Germany or Korea or Brazil or India  or wherever, we want it to be favorable taxwise to set up shop in the  United States. Therefore, I do believe that, when the final tax…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…economy work  again for working families.\n\nThe economy isn't just numbers on a chart. It is the farmer who wakes  up at 4 a.m., the mom or dad working two jobs just to get by, the shop  owner figuring out how to keep the store lights on, and the truck  driver working overtime.\n\nMr. Chair, let me be clear, a vote against this budget is a vote to  raise taxes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Since 2022 alone, Ellen has dedicated over 1,000 hours of service  across nearly 300 separate volunteer commitments.\n\nWhether she is volunteering at the Perham Living gift shop, assisting  with local bake sales, or spending countless hours calling bingo games  for residents, Ellen's presence is a constant source of joy and  stability.\n\nEllen's service…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Funky  Buffalo Coffee House and Trading Company, a weird name, but a great  place. It is our September Small Business of the Month.\n\nNow, this just isn't an ordinary coffee shop. It is where community  happens, families gather, students study, friendships are built, and  real conversations are had like we used to do back in the day.\n\nWe had the opportunity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…principles that district court orders can  only bind parties before the court and not nonparties across the  country. This reform will also discourage the growing trend to forum  shop, Madam Speaker. If you can go to Hawaii because you can find a  judge who will rule against an action taken here in the District of  Columbia, then you will do so if you can…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…people who truly drive our economy and strengthen our communities: our  small businesses, our manufacturers, defense companies, farmers, and  hardworking Michiganders. From shop floors at Allied UV assembly lines  to AJG Aerospace in Clarkston, I heard directly from manufacturers who  are expanding--and I will say it again--expanding production and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and deporting members of MS-13, one of the most dangerous  gangs in the world; Tren de Aragua, another dangerous Venezuelan gang;  and other criminal networks who had set up shop here in the United  States in our neighborhoods and in our communities.\n\nGiven the vast networks of these international gangs, it became clear  to President Trump that it was…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…returned from the  war with an eighth grade education and some money he won playing craps  on the Queen Elizabeth on his way home. All of his children worked in  his butcher shop growing up. Later, I remember seeing my dad work 7  days a week on the midnight shift to put food on the table and a roof  over our heads. He worked hard and lived honestly.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Wisconsin  Manufacturing Hall of Fame.\n\nBorn and raised in Minong, Wisconsin, Mr. Link learned the  fundamentals of meat processing at an early age in his family's butcher  shop.\n\nBy the mid-1980s, after the family meatpacking business closed, Jack  identified an opportunity to improve the quality and consistency of  meat snacks available in the marketplace.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700132/congratulations-to-jack-link-founder-of-link-snacks-inc"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…single point of contact at  the Social Security Administration for Americans who have had their  Social Security numbers lost or stolen. Mr. Speaker, think of it as a  one-stop shop for those trying to protect themselves from identity  theft. Having a single point of reference, one point of contact, at the  Social Security Administration will simplify the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…month. She was       okay, as she had groceries, gas, and her bills paid, until       she got a flat tire on the way to a school function. She got       the car to the tire shop.\n\nMr. BARR. Mr. Speaker, I will finish the story.\n\nThe tire was irreparable. She had to buy a new tire for a       couple of hundred dollars she didn't have. She was not able…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…then, his locally owned business has grown and moved locations  to expand its services to include diabetic and asthma care, blood  pressure monitoring, compounding, and a gift shop. The pharmacy is  known for its commitment to customer service and community focus.\n\nOverall, Mr. Chapman is remembered for his generous spirit, wry sense  of humor, keen insight,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…all fundraising for the school. She helps with  ideas, calls, and follow-through with anything that needs to be done.  She also spends time with the students in the ``Pop up Shop'' each  Friday morning and provides extra supervision in the cafeteria at  lunchtime. She also, recently re-vamped the School Events Parent  Information Board which has all…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690177/recognizing-cheryl-wirt"}, {"senator": "James Risch", "party": "Republican", "sentence": "…seventy thousand (70,000) 120mm M1147 High       Explosive Advanced Multipurpose Round cartridges. Also       included were Forward Repair Systems; Next Generation (NG)       Shop Equipment Maintenance Contact (SECM) shelters;       communications equipment; GPS receivers; ammunition; Spare       and Repair Parts; Special Tools and Test Equipment (STTE);…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Public project labor agreements effectively make it impossible for a  contractor to compete for Federal contracts if its workforce isn't  unionized. So it is kind of like a union shop outlawed by the Taft- Hartley Act in right-to-work States. About 27 States have right-to-work  laws.\n\nWell, most of the workforce in Iowa isn't unionized. This Executive  order…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}]