[{"senator": "John Mannion", "party": "Democrat", "sentence": "…heat on.\n\nHealthcare should provide peace of mind, not financial anxiety,  because when essential services are gutted, community health centers  and rural hospitals face shortfalls, and people are forced to drop  coverage. It impacts everyone through higher premiums, and all of us  will be paying more and are paying more to get less. The House has…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bill at this moment, we have to go back to last Congress and the end of  the Biden administration.\n\nIn mid-July 2024, the VA informed the committee of expected funding  shortfalls for the Veterans Benefits Administration and the Veterans  Health Administration. At the time, VBA was facing a projected  shortfall of $2.9 billion for fiscal year 2024,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…For example, the bill includes a plus-up of $5 billion to  shipbuilding above the administration's request, including $1.9 billion  to address glaring OMB budget request shortfalls in the Virginia  submarine account. The Seapower and Projection Forces Subcommittee also  strengthened the industrial base by replenishing last year's wage  improvement authorities…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…like the one who started his own small  business selling action figures. After a lot of success selling  preorders of the action figures, his business is now facing budget  shortfalls because they don't know what the tariffs on China will be  from month to month. They don't want to raise prices on customers, but  the tariffs have made it impossible to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Zero.\n\nThat is why I was proud to help reintroduce the bipartisan 9/11  Responder and Survivor Health Funding Correction Act, which would  permanently fix the current funding shortfalls in the World Trade  Center Health Program.\n\nWe owe it to our 9/11 first responders to ensure that the programs  they rely on will be fully funded and fully staffed.\n\nIn addition,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…generated $3 billion in  economic activity. But DOGE wants to cap the overhead expenses of  research. University of Washington Medicine tells me that this would  leave them with shortfalls and that they might have to stop clinical  trials that are underway. You can't just stop medical research like it  is a faucet.\n\nOnce halted, the research, the data, the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…metrics requiring a report on veteran  employee separations, deferred resignations, early retirements, and  contractor-driven cuts exposing employment erosion and salary  shortfalls of those who have served our Nation. Veterans deserve data  not desertion.\n\nI will vote ``no'' on the military construction bill also because the  underlying bill underfunds…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…example--about a government audit that found extreme errors in his  judgment while he was CEO of a company called Cardinal, he blamed the  Democrats; he blamed others for his own shortfalls. That is not  leadership. That is not what our veterans identify as leadership.\n\nHe has never been the chief financial officer of any company. He has  never been CEO of a…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…One Big Beautiful Bill when senior  Pentagon officials began to report to my colleagues and I on the  Appropriations Committee that they still faced significant funding  shortfalls. Given the high pace of operations in the Middle East and in  the Western Hemisphere, it is safe to assume these costs are only going  to continue to rise.\n\nSo there is a…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…construction,       trucking, and professional services supporting mining       operations.\n\nSpur millions in royalty payments to state and federal       coffers, offsetting budget shortfalls.\n\nPreserve family-sustaining wages for miners, engineers, and       support staff across Montana.\n\nA stable, domestic fuel source that lowers electricity       costs for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…have long weathered challenges associated  with reduced flexibility and a decreased tax base.\n\nWhile a percentage of revenue from timber sales previously alleviated  tax shortfalls, shifting land management priorities in Washington,  D.C., have led to significant declines in timber harvest.\n\nThe Secure Rural Schools program was created to bridge the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…program that  required action. Bureaucratic red tape is the enemy.\n\nThe reports by the inspector general are a testament to what veterans  in my district already know: Staffing shortfalls are more than a  figure. They are missed appointments, endless long waits, and  canceled procedures.\n\nAmerican heroes' lives are at stake. Back home in Arizona, the  Phoenix…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…``Protecting Regular Order for Veterans Act of 2025'' or the       ``PRO Veterans Act of 2025''.\n\n(b) Quarterly Briefings on Department of Veterans Affairs       Budgetary Shortfalls.--\n\n(1) Quarterly briefings.--\n\n(A) Quarterly briefings required.--During the first quarter       beginning after the date of the enactment of this Act and in       each…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…ownership, counties that previously benefited from timber sales.  With the majority of Utah's land federally managed, our counties cannot  simply tax their way out of budgeting shortfalls.\n\nThe elected county commissioners in my district spend a lot of time  getting creative and stretching the dollars they have as far as they  can, and that includes working…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…these funeral honors, and  VSOs receive stipends for costs incurred.\n\nLast year, it was brought to my attention that some VSOs had their  stipends withheld due to budgetary shortfalls and the National Guard's  operational needs taking priority.\n\nMy amendment will require the DOD to identify best practices and  cost-effective ways to protect the operational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…liquidity       risk posed to financial institutions, including how the       discount window can--\n\n``(I) help financial institutions better respond to rapid       liquidity shortfalls; and\n\n``(II) prevent broader financial instability; and\n\n``(ix) the effectiveness of the discount window in light of       the stigma associated with its usage, ways to reduce…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this one, because this is  the stuff that gets you attacked at home. But it is the math, it is the  truth, and they are the CBO numbers.\n\nRising Social Security and Medicare shortfalls nearly drive the  entire 2019 to 2033 deficit. This board is a couple of years old, but  the facts are the facts.\n\nWe are terrified to tell the public the truth. The primary…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…as I  mentioned, the authorization expired in September 30, 2023, and final  payments were paid in April of 2024. Congress must reauthorize this to  avoid critical funding shortfalls.\n\nFor example, in some of the counties of my district: Plumas County  relies on Secure Rural Schools for $3.7 million, Sierra County for  $942,000, Yuba County for $122,000,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]