[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…have at stake is  also a State's ability, its right to make its own laws and to protect  its own citizens without having this body overturn that right.\n\nThis week's vote is shortsighted because it is going to have  devastating impacts for our Nation's health, but it is more than that.  And it should send a chill down the spine of legislators in every State…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Vladimir Putin's  intentions or Iran's plans.\n\nToo often, policymakers have a reflexive response. They are building  more. Then we should build more. Mr. Speaker, this is so shortsighted.  It is a dangerous reaction. It is very, very dangerous. We know  firsthand the harm that such devastating weapons can have.\n\nOn the 80th anniversaries, people of many…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…brings back four to our  economy, and that just makes common sense.\n\nLet me be clear to this new administration: Keep your hands off our  lakes. We will not stand by while shortsighted proposals gut the  programs that have protected our water, our health, and our jobs. I  would urge the President, while he is in Michigan, to go visit Flint,  Michigan,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…transactional alliances. It is a complete  abandonment of the idea that democracies should stand together against  authoritarian governments.\n\nAnd while it is foolish and shortsighted, it is also not surprising  to hear Defense Secretary Hegseth recently declare, at the Reagan  Defense Forum, an end to what he calls ``idealistic utopianism,'' while  calling…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…biotech domain.\n\nMr. Chair, I urge my colleagues to vote ``no'' on this amendment to  ensure DOD can test, validate, or reject technology on the merits, not  because of shortsighted, anti-science ideology.\n\nMs. BROWNLEY. Mr. Chair, I would just say that, yes, I want to be  competitive with China's military and their readiness first and  foremost.\n\nSecond,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, 1.4 million meals have been lost at local  food banks across Maryland, Virginia, and Washington, D.C., because of  the shortsighted funding cuts to the Department of Agriculture.\n\nThat is 1.4 million times in the last few months alone when our  neighbors couldn't get a meal when they were in need. Maybe…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691898/food-bank-cuts"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Chairman, I rise in strong opposition to a narrow- minded, shortsighted amendment that is going to be offered to this bill  on the National Endowment for Democracy, prohibiting funding for that  important organization.\n\nBy eliminating NED's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699042/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bill as an unsparing  attack against transgender veterans.\n\nMr. TAKANO. Mr. Chair, if that wasn't bad enough, this bill continues  the harmful Kennedy amendment rider. This shortsighted, dangerous  provision prevents VA from protecting beneficiaries and those around  them from potential harm, beneficiaries with debilitating mental  illnesses such as schizophrenia,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…from their mission.\n\nUltimately, this ban will hurt our military readiness and likely lead  servicemembers to leave the military. This amendment isn't only  bigoted; it is shortsighted and would hurt our national security. I  urge my colleagues to oppose this amendment.\n\nMs. JACOBS. Mr. Chairman, I claim the time in opposition to the  amendment.\n\nMs. JACOBS.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…better pay and benefits for  wildland firefighters.\n\nThe administration's current plan of slashing volunteer wildfire  crews is a disingenuous attempt to cut costs. It is shortsighted and  will cause more loss of property and lives.\n\nI stand ready to work with anyone who is willing to take this threat  seriously.              Funding Citizenship and Assimilation…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…rise today to demand answers on the recent funding and  staff cuts to the U.S. Forest Service. Last week, I led a letter to the  administration urging a reversal of these shortsighted decisions. We  are still waiting for a response.\n\nIn my district, a wonderful, nonpartisan organization called Keep  Indianapolis Beautiful has helped people and nature…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…is to encourage our students and young professionals  to pursue careers in STEM.\n\nFiring our future STEM workforce just as they are getting started in  their careers is shortsighted and irresponsible. These firings will  decimate the future Federal STEM workforce that will keep American  innovation competitive.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…they have arts education. Unfortunately,  arts education is often seen as an extra, or it is cut because it is  not included in the national test scores, but that is very  shortsighted.\n\nArts education has a remarkable and positive effect on students'  academic, social, and emotional outcomes, including higher test scores,  more compassion for others,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and blocking the release of the files?\n\nIt is Donald Trump, so please.\n\nLois Frankel).\n\nMs. LOIS FRANKEL of Florida. Mr. Speaker, we are witnessing a  reckless, cruel, and shortsighted assault on American values, global  leadership, and our constitutional responsibilities.\n\nLet's be clear. This is not a budget fix. It is a dangerous retreat  from our role…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the lifeblood of our economies. This bill  invests $10.4 billion in the indefatigable Army Corps of Engineers.  That is $3.8 billion more than the Trump administration's shortsighted  request.\n\nIt includes more dollars for harbor maintenance. It ensures that our  Great Lakes stay vibrant, our ports on all coasts stay open, and our  water infrastructure…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…mining  technology and workforce anywhere in the world. The United States  should be the world's mineral supply chain. The only reason we are not  is because of our outdated, shortsighted Federal policy that hinders  domestic mining.\n\nPresident Trump recognized the dangerous gap between America's  mineral needs and mineral production. Upon returning to office…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…use to define threats, identify objectives, and propose coherent plans  for aligning resources to actually meet them. But this time around, the  stakes are a lot higher. A shortsighted NDS that doesn't align with the  President's vision of American greatness and peace through strength  could wind up as the pretext to extend Biden-era constraints on our…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…policies that were pushed by these Agencies at the very,  very last minute of the Biden administration.\n\nIf this regulation were allowed to remain on the books, Biden's  shortsighted harmful energy standard would force commercial fridge and  freezer manufacturers to discontinue product lines and close factories  in the U.S. The results would be layoffs…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Congress to step in and course correct. That is exactly what H.J.  Res. 104 does.\n\nThe war on coal must end. It must end here with a vote to overturn  this dangerous and shortsighted rule. I urge my colleagues to vote  ``yes'' on H.J. Res. 104 and send a clear message that energy security,  economic stability, and the voices of rural America will not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Reliability and  Affordability Act, to help drive down the cost of energy for Coloradans  and Americans.\n\nThis is a straightforward piece of legislation that will help  counteract shortsighted energy policies that States like Colorado have  implemented for far too long to the detriment of my constituents and  their wallets.\n\nThis commonsense bill would require…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…secures our very way of life.\n\nThat is why on Monday, I introduced a resolution to overturn the  Biden administration's reinstatement of the Once-in-Always-in rule.  This is a shortsighted, bureaucratic mandate that punishes energy  producers, manufacturers, and small businesses for investing in  emissions reduction.\n\nThis rule permanently classifies certain…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…what cars they drive and what  trucks they use to deliver their goods.\n\nThis waiver was granted in the waning moments of the Biden  administration, and I believe it was shortsighted and misguided.\n\nTo be clear, I am not an opponent of electric vehicles, and I  consider myself an environmentalist, but I feel strongly that my  constituents ought to have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…chaos driven by  climate activists is putting grid reliability at risk and driving up  costs.\n\nJust look at this map I have with me today. You can see for yourself  how shortsighted policies can drive up electricity costs from one State  to the next. When Democratic States sidelined reliable, conventional  fuels and mandated rushed transition to renewables,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}]