[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…sure they don't move forward. So we must break  with the fear.\n\nJust recently a video surfaced from 26 Federal Plaza in New York City  that shows a distraught woman violently shoved to the ground, thrown to  the ground, and slammed to the ground by an ICE officer as her young  daughter tried to assist her. The woman was unarmed, nonviolent, and  posed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…for this reason.\n\nMore than half a million Americans, year after year after year after  year after year after year, for no fault of their own--because of a  metal bar shoved up through his toe, because of a diagnosis of cancer,  because of diabetes, because of things outside of their control--they  rack up medical debt that, as this man, can erode…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…individuals'  taxes don't go up, we could work out an arrangement, but not with a  price tag of which the top 1 percent are going to continue to rake in  tax cuts that were, again, shoved into the bill in 2017, lowering the  top marginal rate from 39 percent to 36 percent. Again, that was just a  complete and total windfall for people who don't need that type…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Democratic side--last  week and met with people in hospitals and patients and doctors and  nurses, we heard about that. We heard about the 15 million Americans  who are going to get shoved off their healthcare.\n\nBut the one thing they could have done--and they voted against it  once, but we know behind closed doors they are very interested in doing  something…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…source and confirmed by a second source familiar with the  investigation, said that the 27-year-old woman accused her significant  other for over a year of having grabbed her, shoved her, and pushed her  out of the door, and also said that the woman involved showed the  officer ``bruises on her arm which appeared fresh'';\n\nWhereas, NBC4 Washington also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…something so stupid before. So they called them out  for it for the first time because nobody had ever done such a thing  before.\n\nBut because of the politics, that just got shoved through here.  Because of the power of the fossil fuel industry, that just got shoved  through here.\n\nThis is part of a campaign of the Trump administration to pretend  that…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…this  floor, and this is the least prepared but the most clear I ever will  be: This is the stuff of dictatorships. It is actually happening.\n\nA U.S. Senator was manhandled, shoved to the ground, and cuffed. He  identified himself:\n\nI am Senator Alex Padilla.\n\nThat should be enough. That should be enough. A U.S. Senator who is,  by the way, protected…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…are weakening our labor force, shrinking our tax  base, and threatening industries that rely on a stable workforce.\n\nMembers of Congress should not be targeted with CS gas, shoved, or  have false charges filed against them simply for performing oversight.\n\nCitizens should not be shot at simply for raising concerns about the  safety of children in the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…just a couple of months--depends on the change in elections--60  days or thereabouts. Now, 30 years of stuff is available to be dropped  into the hopper in this process and shoved through this body.\n\nThe other is that it is not rules anymore; it is anything. So we have  gone from a very narrow, carefully guardrailed provision to provide a  short-term…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…man--someone who cared  about others in his community. We all saw Alex's last act was an act of  service, putting himself between a group of masked agents and a woman  who had been shoved into a snowbank.\n\nHe was not a threat. He was not an assassin. He was not a domestic  terrorist. This administration is asking Americans not to believe their  own eyes.\n\nAs…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…see  young parents and grandparents alike attending their immigration court  hearings, eager to officially call this country their home, only to be  met with handcuffs and shoved into cars by masked ICE individuals.\n\nThis is Donald Trump's America, but these are real people. These are  hardworking people whose labor and contributions make our communities…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, I have come to the floor to say I am  extremely outraged that the executive branch's security team has shoved  a U.S. Senator out of a room, has proceeded to put that U.S. Senator on  the ground and to handcuff that Senator. This is what we expect to see  in authoritarian nations that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…hat, they just leap out,  and they go after people. They are restraining them. They are hitting  them. They are spraying them with chemical agents, and then people are  just shoved into Suburbans and driven off.\n\nAnd nobody really knows what happens to them. This is happening in  Minnesota, if it isn't happening in your neighborhood. I want people to…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…building after he identified himself as a U.S. Senator. But  after he was out of that building, they did not stop there. They drove  our colleague to his knees and then forcibly shoved him upon his face,  wrenched his arms behind him, and Alex Padilla writes: If they do that  me, what are they doing to farmworkers and cooks and domestics?\n\nWhat are they doing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…because, once again, in the dark of night, the  GOP is passing bills, stripping the American people of their safety,  security, and support.\n\nLast night at 3 a.m., the Senate shoved through a dangerous  rescissions package that guts foreign aid and public broadcasting.\n\nJust this morning, the OMB Director suggested that he was just  getting started and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693677/department-of-defense-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…this last tallest bar. Since this chart was  compiled, we know that in the last 5 months of the Biden administration  alone, more than 1,400 new regulations were adopted and shoved out the  door. That is not 1,400 pages. That is 1,400 regulations, most of which  were long, so this chart is actually much higher.\n\nMr. Speaker, I rise tonight to remind all…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…contempt for the average people. I am sure these are people who  have worked for years in the Democratic Party or years in various,  different local elections. They are being shoved aside so that an  insider can grab the slot.\n\nMr. Speaker, in any event, I thank my colleague from Washington for  bringing this forward.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696764/political-contempt-for-the-average-american"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…source and confirmed by a second source familiar with the investigation  said that the 27-year-old woman accused her significant other for over  a year of having grabbed her, shoved her, and pushed her out the door,  and also said that the woman involved showed the officer bruises on her  arm which appeared fresh;\n\nWhereas NBC4 Washington also reported…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]