[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that, no, Republicans are not bringing bills to lower the cost of  living.\n\nI congratulate my Republican colleagues, their first bill of 2026, to  set the tone, is to address showerheads. This is critical. You heard  that right. It is ridiculous, isn't it? It is so out of touch.\n\nThe President promised he was going to cut Americans' power bills in  half,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…their utility bills. Instead of  addressing the affordability crisis that they have ignored, that  President Trump has called a hoax, the Republicans' priority on day one  is showerheads.\n\nIt is obscene that with all the work we need to do to uplift American  families, to give them a fair shot at the American Dream, the  Republican majority would choose…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…community.                      Funding to Rebuild After Wildfires\n\nMs. RIVAS. Mr. Speaker, here we are in the first voting week of 2026,  and Republicans are bringing up bills on showerheads. They are not  doing anything to address the affordability crisis, ICE terrorizing our  communities, Trump's illegal and unconstitutional actions in Venezuela,  or other…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…lives at risk by restricting access to vaccines.\n\nThere is a lot this Congress could be doing this week, but the first  bill Republicans bring to the floor in 2026 is about showerheads. It is  almost impossible to believe. To make matters worse, this bill will  actually drive up monthly utility bills for American families.\n\nElectricity prices are up 13…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Mr. Speaker, we have to understand how absolutely inane and bizarre  it is to come to the floor at 7 p.m. for the first real bill of this  Congress this year and it is on showerheads.\n\nWhen I heard that we were going to vote on showerheads, I literally  had to google and look up what this was all about. I was actually  genuinely shocked that the President,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…confusion for manufacturers and frustration  for consumers.\n\nThis was the status quo under the leadership of Democrats--regulate  everything in our lives right down to our showerheads. It is incredible  if you think about it. This may seem like a ridiculous bill to be  considering by our Democrat counterparts. Believe me, it is ridiculous  that their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…1975  act that Congress passed, not some bureaucrat and not some  administration. Congress actually got together and said we are going to  have some efficiency standards on showerheads and a number of other  things. We are going to pass this bill, in 1975, and for over 30 years  that was the national standard.\n\nEven the American Association for Mechanical…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…to Congressman Fry's bill and how I got  interested in it. We were replacing a showerhead at my mom's house, and  I said to my plumber, Marty: What is going on with these showerheads?  He said: You tell me. The people in Washington messed this up. Nobody  can have a darn good shower in the last 10 years.\n\nWhy does that matter? What did they say? They…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…an amazing 13,000 words  in length and a novel interpretation. This resulted in shower systems  with more than one nozzle having a lower flow rate compared to  individual showerheads.\n\nAdditionally, this definition is misleading to consumers looking to  buy multi-nozzled shower systems for the purpose of increasing water  flow.\n\nPresident Trump has taken…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration of  the healthcare tax credits, their priority was a bill about  showerheads. This week it is worse. They are actively putting their  thumb on the scale in favor of big corporations and against workers,  lowering what parents get paid in overtime,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]