[{"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…in the Indo-Pacific. ASEAN, the  Association of Southeast Asian Nations, is central to U.S. engagement  in Asia. Recognizing its diplomatic status here in the United States  shows our commitment to the region's future and to working with our  Asian partners on equal footing.\n\nSecond, the Western Hemisphere, of which we are a part, is obviously  incredibly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…this rule to provide transparency was well-meaning. The  execution, when applied to BDCs, has been counterproductive.\n\nResearch by U.S. and international financial professors shows that  after BDCs were removed from major U.S. stock indexes, as a consequence  of this misguided AFFE rule, BDCs experienced a 29 percent to 33  percent lower investment growth…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…ruling from the Fifth  Circuit. I call on this administration to do the right thing, to do  what is legally open, what history encourages us to do. The history of  this program shows the human potential of DACA recipients.\n\nI encourage my colleagues from both sides of the aisle to come  together with more permanent legislation for Dreamers. They give back.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…bipartisan measure from  Representatives Wagner, Connolly, and Lieu 404-7, and I see no reason  why today's vote should be any less supportive.\n\nIt is critical that the United States shows unwavering support for  our friend Taiwan in the face of the PRC's persistent use of economic,  political, and military coercion against it.\n\nJust last month, the PRC conducted…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…and leaves middle-class and lower income Americans in  the dust.\n\nThis chart was done by the Peterson Institute for International  Economics, a nonpartisan think tank, which shows again where the  benefit of that bill is going to go. The top 1 percent in income--in  the State of Connecticut from where I am from, that is people whose  income is about…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Medicaid also plays a profound role in the success of children and  their well-being. Nearly half of all children in the United States are  covered by Medicaid and CHIP. Research shows that when children have  access to care, they are more likely to stay in school, graduate, and  earn more as adults.\n\nThat is not surprising to people just to think it through.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…to lower costs, to raise wages, and to make sure people who  power our economy--our working families--can keep more of what they  earn. And through this bipartisan bill, it shows that I am not going to  allow Washington gridlock and partisanship to block a bill without a  fight. That is why we are going to pass it today, taking matters into  my own…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…ludicrous.\n\nThe Trump administration says they are cutting public broadcasting  because it is partisan and biased.\n\nWhat is the basis for that claim?\n\nMaybe it is because the shows on PBS, like the very popular ``Daniel  Tiger's Neighborhood,'' teach children the importance of kindness,  respect, empathy, and caring for others. These are all traits that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of Americans are going to lose their coverage and  many more could see their costs go up by as much as 75 percent. And  that is on top of the most recent inflation data that shows our economy  is headed in the wrong direction.\n\nDespite those numbers, everything that we have seen from this  administration--from its tariff policy raising prices on cars…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…in       the last year of the Biden administration, former Maryland       governor Martin O'Malley moved the project to a new       contractor, Amazon Web Services, and data shows that the       average wait time for the toll-free line was down to 50       minutes, half of today's average. But O'Malley ran out of       time to switch the new system to…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…works as intended, assists the companies as  intended, and, ultimately, levels the playing field for women-owned  firms competing for government contracts as intended.\n\nThe data shows that women are starting and running new small  businesses, generating revenue and jobs in their communities, and  growing in increasingly diverse industries, but fewer and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691800/wosb-accountability-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…colleagues and for leaders across this country because there seems to  be some confusion. There is a big difference between taking a knee and  bending a knee.\n\nTaking a knee shows that you can hold many truths at once, you can  love our country and believe that there is still more work to do. It  shows that you are willing to do that work and to live…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689224/repealing-green-subsidies"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…buy presents. It is going to make it harder for these  families actually to plan for 2026. And it is all because these  Republicans aren't willing to do it.\n\nHonestly, it just shows how unserious the Republicans are about  addressing affordability for families at the kitchen table. The cost of  living in this country is skyrocketing. And it is not just…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…office. His memory is worthy of dignity and  respect.\n\nRemoving his name from a ship is small and it is petty. It is  obviously an attempt to erase the history of anyone who shows  resistance to this administration. That is what autocrats and  authoritarians do.\n\nSince Secretary Hegseth took the helm, the Department of Defense has  been fraught with…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…saying that these  bills are an attack on working families and that they will score your  vote on these issues, and to vote ``no'' on both bills.\n\nMr. SHERMAN. Mr. Speaker, this shows what Trump had to say about  crypto before he learned he could make money from it.\n\nThe bills we have allow the President and the Vice President to  sponsor crypto. It means…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…tips--handsome tips, in many cases--making up the rest  of those workers' earnings.\n\nThis system empowers tipped employees to maximize their earning  potential. In fact, research shows that servers at full-service  restaurants earn over twice--let me say it again, earn over twice--the  Federal minimum wage. According to the National Restaurant Association,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…punish him or her for the crimes they seek to commit.\n\nEnough is enough.\n\nFor any illegal immigrant who has demonstrated a clear and perverse  disregard for our law, this bill shows that we will not wait for them  to harm another American before we punish them. The act of returning  after deportation is a serious crime, and it should denote serious  consequences.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…bank digital currency, or a CBDC, to  anyone.\n\nI don't think the Federal Reserve has the authority to do this. In  fact, a cursory, simple review of the Federal Reserve Act shows that  the Federal Reserve does not have the legal authority to issue a CBDC  to individuals absent explicit authorizing legislation from Congress.  The Supreme Court has also…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…families in the Magic Valley and throughout our country. This month,  Chobani has taken the initiative to empower military families in Idaho  and nationwide, an effort that shows pride and support for our Nation.\n\nAmerica would not be what it is today without those who risked their  lives for the greater good. Our service members and their families…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Law enforcement officers are faced with danger every single day, not  only on the job, but when they return to their homes. This commonsense  bill honors them a little bit and shows them that we want them to have  these weapons in their homes to protect them, their property, and their  families, as well.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…be coming to Washington, D.C., soon.\n\nTesla has a self-driving feature available on its cars as well and  they have been publishing some very encouraging data. What the data  shows, very clearly, is that even at the current state of the art that  is going to continue to improve, autonomous vehicles are overwhelmingly  safer than human-operated vehicles…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…pandemic. We are not in a war. We are not in a recession.\n\nUnderstand that when you take some of these charts of interest  exposure into the future--there is one of my charts that shows, in 9  budget years, interest, just interest, is over $2 trillion a year.\n\nWhy aren't we running around terrified here? I mean, if you care  about your retirement--or someone…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in taxes, 30 cents of it just paid interest.\n\nThink about that. In 10 years, 30 percent. This year, it is 18  percent. Dear Heaven, there is a model out there that actually shows  that if interest rates were to go up 1 percent in that nine budget  years, it is like 45 percent of all U.S. tax receipts go just to  interest.\n\nWe are playing a very dangerous…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…years, Austin has been a consistent and dependable voice  as the host of the ``Austin Rhodes Show'' on WGAC, making it one of  Georgia's longest running weekday drive-time talk shows.\n\nNearly 3 years ago, I stood before this body to recognize Austin's  30th year anniversary in broadcasting, and it is my honor to stand here  once again to mark yet another…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…together. It is a town where families plant  roots, where freedom is felt, and where opportunity isn't just a  promise; it is a way of life.\n\nAt the heart of Texas-26, Flower Mound shows what happens when faith,  family, and hard work form the foundation of a community.\n\nI congratulate the local leaders whose dedication made this  recognition possible. Flower…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…so far, and that is what he has done at the  border. We have gone from having over 300,000 people a month trying to  get into this country to under 8,000 in February.\n\nThat shows that, with a little bit of determination, we can enforce  our immigration laws.\n\nMr. Speaker, there was an important hearing that was not covered  enough in this Congress this…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688662/highlight-of-trump-administration"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…can have when they answer that call.  Generations of families will feel the ripple effect from her work  leading Habitat for Humanity Omaha. She truly reflects a life that  shows when someone shifts from receiving to giving, a world can be  created where everyone has hope, equity, and opportunity to thrive.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689058/recognizing-amanda-brewer-for-womens-history-month"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Theater in America by USA Today's Readers' Choice Awards.\n\nSince opening its doors in 1967, the Alhambra has brought Broadway to  Florida's First Coast, hosting a wide variety of shows, musicals,  comedies, and tribute acts.\n\nUnder the visionary leadership of my good friend, Managing Partner  Craig Smith, the Alhambra has evolved into a unique destination…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…here in Washington, D.C., getting things done with the leadership  of our President and our leadership here in the House, working together  with the United States Senate.\n\nIt shows that we are offering that certainty and stability once again  for our economy to make America first. We are going to make the dollar  dominant once again, and we are going…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693838/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…members cooked meals, shared traditions, and offered community to those  who needed it most.\n\nThis is a very best example of what it means to look out for one  another. It shows that a university is more than classrooms and  textbooks. It is a community.\n\nThese volunteers gave students comfort, belonging, and memories that  will last a lifetime. Their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697596/georgia-tech-thanksgiving"}]