[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Cuts to Medicaid will shutter rural hospitals, nursing homes, and  health centers, leaving families with higher costs and nowhere to turn  for care.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Republicans' devastating cuts would mean many PBS stations would be  forced to shutter, especially those in rural areas.", "title": "Corporation for Public Broadcasting", "date": "2025-06-10"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Trump has shuttered the  Consumer Financial Protection Bureau.", "title": "Protecting Americans From Harmful Crypto Practices", "date": "2025-05-08"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Dictators try to shutter museums, censor history, and whitewash the  truth, but we know the truth.", "title": "Trump's Attacks on Black History", "date": "2025-04-09"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "The administration is also trying to shutter Radio Free Asia as we  speak, despite the fact that Radio Free Asia helped break the story  about the PRC's program of detention, reeducation, and forced labor in  Xinjiang.", "title": "No Dollars to Uyghur Forced Labor Act", "date": "2025-05-05"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "Unfortunately, this tax-breaks-for-billionaires bill threatens to  upend the district's economy, shutter small businesses, and disrupt  south Florida's tourist industry.", "title": "Protecting South Florida", "date": "2025-05-21"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "So far, their signature accomplishment is a law that would kick 11  million Americans off Medicaid and shutter rural hospitals in my State  and others.", "title": "Affordable Care Act", "date": "2025-12-02"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "First, they slash Medicaid by a trillion dollars, kicked 15 million  Americans off of healthcare, set up the playboard for rural hospitals  to shutter, all so that they could give $7 trillion in permanent tax  breaks to their billionaire buddies.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "They shutter.", "title": "Keep Rural Hospitals Open As Lifeline", "date": "2025-06-25"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Just while I was running  for office, we saw at least four shutter.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "These were in addition to the attempts  to shutter USAID, the Department of Education, the Consumer Financial  Protection Bureau, the U.S.", "title": "Consequences of Doge", "date": "2025-06-05"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Earlier this year, the Department of Labor planned to shutter dozens  of the Mine Safety and Health Administration field offices across the  country.", "title": "Trump's Labor Agenda: Unsafe and Underpaid", "date": null}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Massive cuts to Medicaid will undoubtedly force more rural hospitals  to shutter.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "But we know that those kinds of cuts could potentially shutter  hospitals, particularly in the rural parts of my State.", "title": "Healthcare", "date": null}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "In addition to ongoing efforts to shutter regional offices,       with no detailed or communicated plans as to where those       offices will be relocated or when, SBA has also slashed its       workforce by 43%, further restricting the agency's ability to       meet the growing demands of today's small businesses.", "title": "American Entrepreneurs First Act of 2025", "date": "2025-06-06"}, {"senator": "John Thune", "party": "Republican", "sentence": "Regulatory burdens can be especially tough on smaller businesses,  sometimes leading them to sell or shutter their operations.", "title": "Energy Regulations", "date": "2025-04-08"}]