[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and Ram vehicles--and they are so popular--paints a  deeply disturbing picture. Nearly $2.7 billion in losses are tied  directly to these tariffs. That translates into plant shutdowns,  canceled programs, and over 900 American workers already laid off.\n\nSimilarly, the General Motors chief executive officer said tariffs  cost GM $1.1 billion this quarter…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…SSA, for example, the  website that millions of Social Security recipients depend upon for  services and information has crashed four times in only 10 days. We  have seen shutdowns of critical health research. Tens of thousands of  renters will be unable to pay their summer utility bills, and thousands  more parents will be stranded without Head Start…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…something that I take personally as someone who worked as a  career civil servant before. I told my constituents today how I worked  as a civil servant. I worked through multiple shutdowns before. Of  course, I don't want to see us get to this place. This should be an  absolute last resort. But, again, when they are not even bothering to  show up to work, we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Senators on both sides of the aisle often discuss  wanting to return to something we call regular order. We decry full- year continuing resolutions, or CRs, and government shutdowns. We say  we want to bring appropriations bills to the floor. This isn't a  pipedream, and I reject the idea that the appropriations process can't  work anymore. More often…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…runs out of money. I don't know a single person who  wants a government shutdown. After almost 16 years in the Federal  Government, where I was on the receiving end of those shutdowns, I do  not want our government to run out of money. But if my Republican  colleagues want my vote on that bill, they are going to need to act  like adults and come talk to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…clean-energy projects and over 400,000 new jobs created all across  America, many in Republican districts.\n\nSince the Trump administration came in and started these illegal  shutdowns and threatened new taxes through tariffs, the economy has  stalled. Has anyone looked at their 401(k) lately? People are very  uncertain.\n\nLet's get back to business, standing…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…save our  collective constituents from all this pain.\n\nWhen Democrats had the trifecta--when Democrats had the House and the  Senate and the Presidency--we didn't have any shutdowns. It wasn't  because there is more good will on the Republican side toward  continuing resolutions than there is on the Democratic side toward  continuing resolutions. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…a Republican--fact. It cannot be refuted. They are in  charge. The American people know that.\n\nSo just as a reminder, SNAP has never not been funded when there have  been shutdowns in the past, including in President Donald Trump's first  term. And even under President Trump's second term, he tapped a billion  of the $6 billion to pay for staff to administer…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…there was a shutdown, you had to  fight about backpay after, but now there is a backpay guarantee. When  there is a shutdown, people are guaranteed backpay. So that makes  shutdowns really foolish, like, you are going to shut down; you are  going to lock people out of their office; you are going to tell them  they can't do the work; and then you are…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, this week, I introduced a bill that would  exempt from Federal Government shutdowns the Federal and independent  agencies that are exclusively or primarily federally funded but have  jurisdiction over local District of Columbia civil and criminal justice…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695983/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-district-of-columbia-courts-and-related-agencies-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-such-courts-and-agencies"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the basic  needs of the American people.\n\nMr. McGOVERN. Mr. Speaker, I don't think we ought to be lectured by  somebody who, over the years, has been the king of government shutdowns  and who worked for a United States Senator that pushed for a government  shutdown to object to the Affordable Care Act.\n\nI just want to make it clear to everybody: This…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Republicans are out of town. They are out of touch with reality. The  way forward is simply bipartisan negotiations, coming together,  reaching a solution, as is the way shutdowns have been avoided in the  past.\n\nThe fact is that Donald Trump's so-called Big Beautiful Bill-- actually a big, blatant betrayal--along with inaction and avoidance by  Republicans,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce a bill that would exempt  from federal government shutdowns the National Capital Planning  Commission (NCPC) and the Commission of Fine Arts (CFA). This bill is  modeled on a provision I have gotten enacted each year since the 2013…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…hyperfocused on protecting them.\n\nI have worked across the aisle to introduce bipartisan legislation to  keep Social Security offices open and services running during  government shutdowns because seniors shouldn't lose access to help just  because Congress can't get its act together.\n\nI have pushed the Social Security Administration to stop clawing back  overpayments…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the Senate as the hours tick down to the end of  the Federal fiscal year and the shutdown of the Federal Government.\n\nI have served here 15 years. I have seen my share of shutdowns, and I  know how much they hurt, how much they hurt the men and women of our  military, Federal law enforcement, folks who serve and protect our  country at home and abroad.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Continuing  Appropriations, Agriculture, Legislative Branch, Military Construction  and Veterans Affairs, and Extensions Act, 2026.\n\nHistory reminds us, Mr. Speaker, that shutdowns never change the  outcome. The only cost is paid by the American people.\n\nOver the last 43 days, the facts did not shift, the votes required  did not shift, and the path…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Forces have service       requirements unlike those of other Federal employees, which       require them to continue to serve even if unpaid;\n\n(5) the impacts of historical shutdowns of the Federal       Government on members of the Coast Guard; and\n\n(6) other relevant matters, as determined by the       Commandant.\n\n(c) Appropriate Committees of Congress…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…shutdown is being felt by many  Americans. Particularly, what I want to talk about is the many  Americans who are traveling or working in the aviation industry.\n\nGovernment shutdowns are detrimental to some of our most basic  functions of government, and our already-fragile air traffic control  system is facing strain from this occurrence.\n\nWe are reminded…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…beginning, he decided to create  an animated Mario Kart-style video of himself racing Donald Trump,  thinking this was going to get him a lot of attention. I saw during the  COVID shutdowns how he would come up with one crazy scheme after  another because he was jealous that Andrew Cuomo was getting all the  attention. That didn't really work for him either.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Act. This just says  that while we are in a shutdown, Members of Congress don't get paid and  they don't get backpay.\n\nThe second bill is entitled Withhold Member Pay During Shutdowns Act.  That bill says that while we are in a shutdown, Members of Congress  don't get paid, but they will get paid. They will get their money in  arrears after we open the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, government shutdowns have real  consequences. I have said that countless times during my time here.  Incredibly, it seems to have taken Democrats a month to remember that  the proverbial stove…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…staring another government shutdown in the face on January 30.\n\nCan you imagine how much actual work we could get done if we didn't  exhaust ourselves in the fights over shutdowns and lurching from one  deadline to the next? Well, maybe that is something we ought to think  about, and that is the opportunity cost of going from shutdown to  shutdown…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…wreaking havoc on our airports while TSA and FAA are  unfunded, putting undue stress on our military families, and causing  further instability to the United States economy.\n\nShutdowns are never the answer. They don't work. They only hurt the  American people.\n\nToday, lawmakers in this Chamber have an opportunity to avoid  repeating past mistakes. I encourage…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…to get all of these bills signed into law--no continuing  resolutions that lock in previous priorities that don't reflect today's  realities, no more disastrous government shutdowns that are totally  unnecessary and so harmful.\n\nAgain, I want to thank my colleagues for supporting the final passage  of this important package so that we can send it to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…that math.\n\nFor too long, radical green activists in the Obama and Biden  administrations were able to hijack environmental agencies with no  authority over the grid to force shutdowns of power plants without  regard to the impacts on that very reliability I said we depend on.\n\nMadam Speaker, if the Biden EPA's radical clean power plan 2.0 had  gone forward,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats are  threatening with this reckless talk of a shutdown.\n\nThe American people shouldn't be forced to pay the cost of Democrats'  political games. That is what it is. Shutdowns are political games.  Political acts are choices.\n\nCongress has the tools to avoid this chaos. It requires, however,  cooperation from the Democrats.\n\nThe appropriations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…we need to be working on these appropriations bills.  It would have kept us moving forward and kept us from wasting time.\n\nOne of the things I think is so important is that shutdowns are  expensive, and this is something that ends up costing us money every  time we do it. And, of course, we have quite a bit of national debt.\n\nNow, when we talk about completing…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM of California. Mr. Speaker, history has shown that  government shutdowns accomplish nothing.\n\nThe last major shutdown cost our economy $11 billion, delayed wages  for Federal workers, and disrupted businesses that hardworking  Americans rely on.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695824/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…witnessing now is just further proof about why it took human  beings thousands of years to learn how to stand upright. This shutdown  is bone-deep, down-to-the-marrow stupid.\n\nSome shutdowns are based on policy. Some shutdowns are based on  politics. Some shutdowns are based on a combination of both. This one  is pure. It is as pure as Ivory Snow.\n\nThis shutdown…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}]