[{"senator": "Richard Neal", "party": "Democrat", "sentence": "…about his government. He loved  archery, fishing, and the great outdoors, but surely it will be his  character that is remembered most.\n\nTo his parents, Tamara and Robert; his siblings, Angela and Jeremy;  and all who loved him, including his best buddy Hunter, our deepest  condolences on behalf of the United States of America. May his memory  be a blessing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693539/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…1900s. They met and married, first settling in Norwich  before making West Haven their home.\n\nSteve was born in New Haven in 1955 to Margaret and Robert Dargan,  Jr. He and his siblings--Robert Dargan, III, Timothy Dargan and Mary  Margaret Dargan--were raised by their hardworking parents in a  traditional Irish Catholic household on Richards Place in the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…mostly depression. I've been in this country for almost 7  years, and in those 7 years, my mom and I found a home and made a  bigger family. I have never been separated from my siblings, and it's  honestly sad because they are little, and they need their mom and  sister.''\n\nShe goes on to say: ``I haven't been getting any school time. There  are various viruses.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700081/children-detained-at-dilley-ice-facility"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…country, serving in the United States Marine Corps  for over 30 years, both in Active Duty and the Reserves.\n\nGeneral Lopez was born in Santa Barbara as the oldest of six siblings  and spent his childhood between the communities of Santa Barbara and  Lompoc, and later in Goleta.\n\nAfter graduating from Lompoc High School, he attended Cal Poly San  Luis…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…more to strive for higher education.\n\nThe Young Scholars Program fosters generational change by instilling  a college-going culture in underserved areas, inspiring younger  siblings and peers to pursue higher education.\n\nFor her outstanding devotion, Lisa earned the respect and esteem of  many. In the wake of her departure, I know her numerous contributions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691972/recognizing-lisa-gissendaner"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…hospital was a Medicaid waiver       that paid for in-home nursing and life-support equipment.\n\nMedicaid gave us the opportunity to bring her home,       surrounded by her siblings, surrounded by the normalcy and       safety of parents that love her.\n\nSince that day Medicaid has kept up with Leda's needs as       she has grown. A toddler who once needed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…her. She was a devoted mother, compassionate friend, visionary thinker,  and dear friend. She will be forever missed by her children Nakisa  Asefnia and Bardia Asefnia, her siblings Sofey Saidi and Taher Saidi,  and her many friends and colleagues. She left an immeasurable mark on  our community, and her legacy will live on for generations to come.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…normalized. We have to condemn, resist, and reject  them at every turn.\n\nMr. Speaker, I rise today on behalf of the targeted and the  marginalized, on behalf of our immigrant siblings who have had their  bodies assaulted, who have had their lives disrupted, who have had  their families separated, who have had their humanity erased and their  dignity denied,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…She lovingly raised her daughter, Alisha;  adopted son, Eric; and numerous foster children over the years. She was  a nurturing force in the lives of so many, including her siblings,  grandchildren, greatgrandchildren, and many godsons and goddaughters.  My prayers are with her family and with everyone whose life was blessed  by her generosity.\n\nMr. Speaker,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Immigration Services created the Filipino World  War II Veterans Parole Program, a temporary administrative fix that  allows these veterans to request parole for their children or siblings.  Under this policy, they can live in the U.S. pending processing of  their permanent resident applications, which may still take years if  not decades. However, as these…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…his early life,  even then he knew he would have to fight and work hard to achieve the  American Dream. He worked as a janitor to help to support his mother  and his young siblings while he continued to work to make sure he  pursued the American Dream.\n\nCarlo is a first-generation college graduate and has begun his career  as a financial auditor, and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…violence in an  environmentally-friendly balloon release to honor the 46,000 lives lost  to gun violence every year. They have lost daughters and sons, nephews  and nieces, siblings, mothers and fathers to gun violence.\n\nOne daughter's name is Hadiya Pendleton. Hadiya was a bright student  involved in marching band and volleyball. She was on top of the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…things, like camping out--memories you carry  for a lifetime, wonderful memories, a rite of passage for many  individuals and families, a family tradition passed on to younger  siblings and, ultimately, to our own children and grandchildren.\n\nThere are so many images in our minds, over the last several days, as  to the tragedy that occurred in Central Texas.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the eighth grade.\n\nAs the third youngest of 14 children, she wanted more than the  domestic and laborer jobs that were available to her parents, her  grandparents, and her siblings. She had to move to go to high school,  becoming an educator herself, eventually running the TRiO Programs at  Virginia State University. These are federally funded programs…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…to serve and support others,  embodying a spirit of positivity, empathy, and generosity that touched  everyone she encountered.\n\nAs her parents, Carmine and Dana, and her siblings, Jordana and Tino,  continue to grieve this unimaginable loss, we keep them in our thoughts  and prayers. Gia's memory will forever shine brightly in the hearts of  all who…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…joy and  warmheartedness, Jay Larson was tragically killed in a mass stabbing  spree in March 2024 while delivering the mail.\n\nMr. Larson is survived by his mother, seven siblings, 10 nieces and  nephews, and many friends.\n\nI encourage my colleagues to support this bill, and I reserve the  balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…certificates and tell these people, in  essence, that they no longer can work, that they can go to a day center  and watch television, but they are not allowed to work like their  siblings work. They would not be allowed to get out and about in the  community where they would get to know people other than their  immediate relatives.\n\nFortunately, Trump's Department…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…making a significant portion of this adoption tax credit  refundable and giving us an option for more American families to be  able to choose adoption as an option. One of my siblings adopted all  four of his children from infancy. It is tough. It is expensive.\n\nThere is a lot that goes into it just on the financial side, let  alone the emotional side and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Stutzman.\n\nThey are celebrating their 50th anniversary this Saturday, one day  after Valentine's Day. I just want to acknowledge them in all that they  have done for me and for my siblings.\n\nThey have really been an example of what hard work and what faith can  do in a great country like America.\n\nMy dad dropped out of high school. They were married when they…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700043/happy-50th-anniversary-albert-and-sarah-stutzman"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Place of Hope has served more than 150,000  children, youth, and families--offering safe homes, educational  opportunities, and pathways to independence. Their programs keep  siblings together, provide refuge for trafficking survivors, and  distribute more than two million pounds of food to families in crisis.\n\nI commend the Founding CEO, Charles L. Bender,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…took advantage of every moment she had with us here on Earth.\n\nShe grew up in Mountain Brook, AL--a suburb of Birmingham--with two  loving parents, Anna and Richard, and two siblings, Hooker and Mary  Hamner.\n\nElla loved to play piano, dance, and travel. She was studying French  at Brown University. She also loved kids and spent much of her time  babysitting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…press corps to wake up and ask Congress whether  it is appropriate that we penalize married couples by $25,000 or  $35,000 a year because they got married, as opposed to their siblings  who may not have gotten married.\n\nMr. Speaker, there is one other thing I want to comment on tonight. I  was listening to a television program on one of the big conservative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Office for more than 14 years.  He died in 2021 from complications as a result of contracting COVID-19  in the line of duty and is survived by his daughter, parents, and three  siblings.\n\nWe honor their memory and stand beside their families with enduring  respect.\n\nRemembrance must also inspire action. Supporting law enforcement  means ensuring our officers…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…came for them to retire, they sold the business to their  daughter and her husband, who in turn sold it to their children. Now  more than seven decades later, Andy and his siblings are the third- generation owners of Manda Machine Company. Now, if that is not the  American dream, I don't know what is.\n\nAndy told me how beneficial the Tax Cuts and Jobs…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}]