[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…regardless of the political climate,  science remains at the forefront of our Nation's progress and  innovation.\n\nSo, Mr. Speaker, I urge my sensible colleagues on both sides of the  aisle to support efforts that increase the resiliency of our Federal  science agencies in the face of these growing threats from the  administration, and to continue supporting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…because I am a woman and because I chose  to have a baby, I have been prevented from doing so.\n\nMr. Speaker, I thank all of the people who have come forward on both  sides of the aisle in support of this effort, and I know that our fight  is far from over. We are not going to back down. We stand with the  people from across the country who have reached out,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…commend the committee for this much-needed network, and I ask my  colleagues to join me in support.\n\nMrs. DINGELL. Mr. Speaker, I strongly urge our colleagues on both  sides of the aisle to support H.R. 2482, and I yield back the balance  of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…my time.\n\nMrs. DINGELL.  Matsui), the ranking member of the Communications and  Technology Subcommittee.\n\nMrs. DINGELL. Mr. Speaker, I urge my colleagues on both sides of the  aisle to support H.R. 2449, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…for his leadership on this issue and  encourage my colleagues to support this legislation.\n\nMrs. DINGELL. Mr. Speaker, I strongly recommend my colleagues on both  sides of the aisle support H.R. 859, the Informing Consumers About  Smart Devices Act, and protect Americans' privacy.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Adams, both Presidents, and their family, and their leading role  in shaping our country. This recognition is long overdue.\n\nIn closing, I urge my colleagues on both sides of the aisle to  support this act, and I thank you for the time and courtesy.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…tangible impact on  thousands of taxpayers, and it will raise $6 million over the next 10  years.\n\nGiven the importance of the Tax Court, I urge my colleagues on both  sides of the aisle to support this important legislation.\n\nMr. Speaker, in closing, in support of H.R. 5349, the Tax Court  Improvement Act, is the fact that we want more commonsense, bipartisan…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…wellness.  It is full of examples, stories, and research.\n\nFor today's children and young adults who will be tomorrow's leaders,  I urge all of my colleagues on both sides of the aisle to support the  bipartisan Arts Education for All bill. For those keeping track, it is  H.R. 2485, and to fully fund the Every Student Succeeds Act, especially  title I and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…ensure that the Executive Branch follows the law and ensures  Appropriated and obligated funds are used for their intended purpose.\n\nI urge our colleagues on both sides of the aisle to support this  commonsense legislation.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…the balance of  my time.\n\nMrs. DINGELL.  Castor), a great leader on this issue.\n\nMrs. DINGELL. Mr. Speaker, in closing, I strongly urge that my  colleagues on both sides of the aisle support H.R. 906, the Foreign  Adversary Communications Transparency Act for the security of our  Nation. I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…is seeing the light today.''\n\nMr. Speaker, this bill passed the Committee on Ways and Means with  overwhelming bipartisan support. I urge my colleagues on both sides of  the aisle to support this commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate to bring it forward…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…million  over the next 10 years. This bill passed the Committee on Ways and  Means with overwhelming bipartisan support.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this very important clarification bill.\n\nMr. Speaker, H.R. 5346 is a commonsense bill that will help taxpayers  and the courts. I urge my colleagues on both sides…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…colleagues to support H.R. 2399.\n\nMrs. DINGELL. Mr. Speaker, I have no further speakers, and I am  prepared to close.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support H.R. 2399, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…after a major disaster.\n\nMr. Speaker, our residents must be able to live safely and fully  rebuild their lives after disaster strikes. I urge my colleagues on  both sides of the aisle to support this legislation. It is critically  important for our families.                 Ending Corporate Greed Through Price Gouging\n\nMs. TLAIB. Mr. Speaker, families in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…our long-term competitiveness as  a country, and I am glad to see that progress is being made on this  bill.\n\nMr. Speaker, I strongly urge my colleagues on both sides of the aisle  to support H.R.\n\nMrs. DINGELL. Mr. Speaker, I urge our colleagues on both sides of the  aisle to support H.R. 2444, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…country. It is strong State leadership. It is better  outcomes for communities. It is locally driven, not federally mandated.\n\nMr. Chair, I urge my colleagues on both sides of the aisle to support  H.R. 3898 and my amendment, and I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…elected us to make sure that  the communities in which they live are great places to live, worship,  and to raise a family.\n\nMr. Speaker, I ask all Members on both sides of the aisle to support  H.R. 4071, and I yield back the balance of my time.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…of Americans  every day to this poison.\n\nMr. Speaker, I look forward to supporting this legislation on the  floor, and I encourage all of my colleagues on both sides of the aisle  to support it as well.                             National Dairy Month\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, this month we celebrate  National Dairy Month to highlight…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…proposed  rules back to FERC for review, comment, and recommendations to prevent  severe impacts on grid reliability.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this bipartisan, commonsense legislation to ensure that no  future administration or unelected Federal bureaucrat can unilaterally  jeopardize grid reliability.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…but to tax and regulate how people use the  internet. This is a keen example of that principles-based legislation.\n\nMr. Speaker, I urge all my colleagues on both sides of the aisle to  support the GENIUS Act, and I yield back the balance of my time.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…future or watch the next FTX fail while we are left saying once  again: Well, we have been here before.\n\nMr. Speaker, I urge all my colleagues to join me on both sides of the  aisle and support the CLARITY Act. Let's fill these regulatory gaps  with the proper Federal oversight. Let's create a competitive digital  ecosystem. I support this bill, and I…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…soldiers and American public servants out  of work. We let them do their job on behalf of the American people.\n\nMr. Speaker, I urge all of my colleagues on both sides of the aisle  to support what is genuinely a bicameral and bipartisan product and one  that the President will sign and has urged us to pass.\n\nMr. Speaker, again, I urge passage of this…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…big banks from real competition.\n\nThe Democrats' opposition here is defending big banks without  competition, and that is why I urge all of my colleagues on both sides  of the aisle to support healthy competition to prevent bank failures  and to disapprove of this unwise regulation from the Biden  administration.\n\nMr. Speaker, I urge all of my colleagues…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…small businesses will be.\n\nMr. Speaker, I thank Representative Gottheimer for working with me on  this commonsense legislation, and I urge my colleagues from both sides  of the aisle to support H.R. 3351.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…It is  about standing up for American values, protecting American interests,  and preserving peace through strength.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this important legislation that I was proud to introduce. Let's  show the world that the United States stands firm against Communist  aggression and alongside our…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…applaud the Small Business Committee chairman,  Roger Williams, for his leadership in putting Main Street America  first.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support the Transparency and Predictability in Small Business  Opportunities Act.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…longer sit by while future  generations of American workers, parents, and community leaders are  taken away from us.\n\nMr. Speaker, I encourage my colleagues on both sides of the aisle to  support this legislation today and to save the lives of so many  throughout this great country. It is time to halt fentanyl.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…kidnapping, assault, and murder.\n\nI thank Mr. Knott for introducing this legislation. I wholeheartedly  support this legislation. I ask my colleagues on both sides of the  aisle to please support this legislation.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…need to expedite this, as Mr. Rouzer, my friend, said.\n\nMr. Chair, this is extremely good for the environment, and I would  still urge all my colleagues on both sides of the aisle to support this  amendment.\n\nMr. Chair, I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…are making significant progress with the inclusion of  these three appropriations bills, but our work is far from over. I  encourage all of my colleagues on both sides of the aisle to support  this deal, vote to end this unnecessary shutdown, and help us get back  to the business of hardworking Americans across this country.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}]