[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…long- term care coverage to one in three people with disabilities.\n\nMy colleagues across the aisle are so focused on giving tax cuts to  billionaires, I think they have lost sight of the everyday people who  will be harmed by their reckless decisions.\n\nOne of my constituents, Rachael, is a caretaker for her adult son  with Down syndrome. Payments from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…one of  these cemeteries.\n\nIf you find yourself overseas, do an internet search and see if you  can stop by an ABMC location. You will be awed and humbled by the  emotional sight of seeing the true cost of freedom and sacrifice. I can  assure you, you will find a passionate group of caretakers, educators,  historians, and advocates who take such care…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…It is certainly  not in Massachusetts.\n\nMr. Speaker, in any event, while this Chamber is wasting more time on  yet more messaging bills, a real crisis is unfolding in plain sight.  Our allies are preparing for a possible military conflict with the  United States. Let me repeat that again.\n\nOur closest allies, our partners in freedom and peace for decades,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…schooner a       short distance away. A white British ensign fluttered from       the schooner's topmast in a humid breeze.\n\nA sentry on deck peered into the darkness, catching sight       of the approaching boats.\n\n``Who comes there?'' he called.\n\nThe men in the boats bristled at the sentry's English       accent.\n\n``We mean to come aboard,'' replied a…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…comes at a moment of frustration or  hardship. Kathryn worked tirelessly to navigate federal agencies that  can be difficult to access and slow to respond, and she never lost  sight of the human impact of her work.\n\nConstituents benefited not only from her knowledge, but from her  persistence and her willingness to see cases through to resolution. My…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…efforts.\n\nNow, this program to provide that help that families need to cover  their cost of health insurance is set to expire at the end of the year,  and there is no plan in sight to replace it and to help families afford  health insurance. Allowing these tax credits to expire is going to harm  the record enrollment in the ACA Marketplace that so many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…U.S. Senate and Congress.\n\nWe need to take those votes if the President of the United States is  to accept any benefits or payments. And that is what is happening in  plain sight, openly, for all to see.\n\nLiterally, tomorrow night, in the White House, individuals who have  invested to the President's benefit in his meme coin and World Liberty  Financial…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…know there are  many who take for granted our air, just as we take for granted that the  sun will rise or set. While air that we breathe may feel like a given,  we cannot lose sight of the fact, for 135 million people--more than 4  in every 10 Americans--they live in a community impacted by unhealthy  levels of air pollution; and 24 million Americans--or…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Republican  Party. What this administration is doing is banning encampments with no  long-term strategy and cutting funding for community services to those  individuals.\n\nOut of sight and out of mind is not a solution to homelessness. We  cannot sweep homelessness and the homelessness crisis under the rug. We  have been talking about violent rhetoric recently.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695728/making-homelessness-a-national-priority"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…is important to find a way to commemorate this day. It is  important to remind the rest of the country that what Donald Trump said  were visitors visiting the Capitol to go sight-seeing was a lie and  that his pardon of over a thousand individuals later is a shameful,  shameful act.\n\nI pray to God that nothing like this ever happens again. If it does,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698547/january-6-attack"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the palace in the sky, that President  Trump just accepted from the Nation of Qatar. That is against the  Emoluments Clause of the Constitution. He took the bribe in plain  sight.\n\nMeanwhile, our Nation is very short on air controllers who are  trained. Look at Newark, New Jersey. They have had radar failures and  repeated flight delays due to serious…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691012/troubling-situation-in-newark"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…retirement  have declined; there has been a launch of a trade war that could cost  the average family in America over $4,900 a year this year alone with  no trade agreements in sight, threatening a recession.\n\nRather than offering solutions, my Republican friends are at this  time wasting this valuable effort on the floor by renaming the Gulf of  Mexico.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…dedicated as the one we have at the VA.\n\nEven as chaos unfolds around them, I know that VA employees are  trying hard to continue to deliver for veterans. We should not lose  sight of that. Even with the promise of evolving technologies, we know  that the human element is still the most important when delivering  world-class care and service to veterans.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped out of this race for one reason and one reason only:…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…are no statues on the Capitol tour of Mr.  Franklin. Indeed, Mr. Franklin's lone statue sits at the base of a  stairwell, a dark stairwell, just off the Senate floor, out of sight of  the hundreds of thousands of people who visit the Capitol.\n\nAs we approach this Nation's 250th anniversary, it really is of  utmost importance to have Mr. Franklin rightly…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "James Risch", "party": "Republican", "sentence": "…handheld radio is a       versatile, secure solution that leverages crossbanding to       provide simultaneous data & voice across satellite       communications (SATCOM), line-of-sight, and mobile ad-hoc       networking (MANET) modes. As mission needs evolve, this       software-defined handheld supports fast, in-field updates to       new capabilities.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691198/arms-sales-notification"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…service. From  becoming Bettendorf's first-ever school resource officer to leading the  Investigative Services Bureau and, finally, being named chief in 2018,  he never lost sight of his mission: to serve and protect with honor.\n\nHe has been a mentor to many, a leader in his department, and a  trusted figure in the community. Chief Kimball represents…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, did you know that 1 in 50 Americans  is living with an unruptured brain aneurysm? It is a silent killer  hiding in plain sight. Most won't know it is there until it is too  late.\n\nToday, I rise in recognition of Brain Aneurysm Awareness Month and to  highlight the lifesaving work of the Trinity Love…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695612/recognizing-trinity-love-hoblit-foundation"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting  everyday Americans. They ignore the rising costs hurting workers and  families in order to cater to their own extreme leftwing base.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…trillions of  dollars a year to do this, and that money we spend didn't just fall  from Heaven. We thank Heaven for it, but it came out of taxpayers'  pockets, and we shouldn't lose sight of that fact.\n\nThat is why I get so irritated--``irritated'' is the wrong word-- angry when I find out that people take advantage of the American  people's generosity. It makes…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Navigation (EGI) with Multi-Mode Receiver (MMR);       thirty-six (36) remanufactured EGIs with MMR; eight (8) AN/      ASQ-170(V) Modernized Target Acquisition and Designation       Sight/AN/AAQ-11 Pilot Night Vision Sensor (MTADS/PNVS);       seventeen (17) AN/APG-78 Longbow Fire Control Radars (FCR)       with Radar Electronics Units (REU); seventeen (17)…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "John Rose", "party": "Republican", "sentence": "…For 37 years, he faithfully served his  community as an advanced emergency medical technician.\n\nOver the years, he endured long shifts and countless challenges but  never lost sight of the mission: Helping people when they needed it  most. Those who worked alongside Eddy described him as dedicated, a  professional, and committed to the health and safety…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691822/recognizing-eddy-haynes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…shooter's drone and  even the shooter.\n\nThe Government Accountability Office's report also found that the  Secret Service planned to use farm equipment to address a line-of-sight  issue when securing the AGR building. Before the rally, a campaign  staffer asked Secret Service to modify the plan, and the advance team  did as the staffer requested.\n\nBut…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…talking about the CRA itself and about procedure. I  think that is important because I respect the Senate as an institution,  and I care about how we do things.\n\nWe shouldn't lose sight of the substance of what we are doing today.  We are deciding whether California, DC, and 11 other States can impose  an electric vehicle mandate that will take away consumer…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…will assist countless Wyoming  communities that are uniquely and disproportionately impacted by  bureaucratic decisionmaking beyond their control.\n\nLastly, we must not lose sight of the underlying problem and continue  to prioritize policies that restore timber production and the original  intent of our Federal land management agencies: supporting multiple…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…hysteria, hyperbole, and, sadly,  falsehoods about this bill, which have created a good deal of  confusion. Frankly, a lot of the issues have become muddled. I think we  have lost sight of what we are really debating in this Chamber. So  today I would like to dispel a few myths about the SAVE America Act and  address the legitimate questions raised or voiced…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "John Rose", "party": "Republican", "sentence": "…congressional Democrats were referring to the shutdown as  leverage.\n\nUltimately, House Republicans voted to fund the government and end  the suffering. However, we never lost sight of undoing the self-serving  money grab from taxpayers by a select group of Senators.\n\nHours before our vote, I introduced the first standalone bill to kill  that provision.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Its civilian  experts, many of them veterans, produce, repair, and innovate the  equipment our troops depend on from the front lines to forward  operating bases.\n\nEvery rifle sight calibrated, every artillery shell inspected, and  every 3D-printed replacement part shipped from Rock Island shortens the  time between a soldier's need and the answer that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Veterans Act. This is the very least we can do for the troops and  the families who have sacrificed so much for the freedoms that we hold  dear.\n\nBeyond the details, we must keep sight of the bigger picture. Our  adversaries--nations that hate America--well, they are sharing weapons  and resources and a common goal. They want to weaken American power and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…they do, what we rely on  them to do, what we count on them to do, and, more importantly, what  the people we represent, our constituents, count on them to do.\n\nWe can't lose sight of it. We must fix this system, tear down some of  the coral reef, and get those lines moving back down.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}]