[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…of the mailing department.\n\nWhile she worked at Point Park, Mrs. Cole earned her associate of  arts degree in journalism and communications. She was inducted into the  Alpha Sigma Lambda, a National Honor Society for part-time students, as  one of the 13 charter members of Point Park Gamma Epsilon chapter. She  boasted at the time she was possibly and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today to recognize and commemorate  the 10th Anniversary of the Epsilon Sigma Boule of Sigma Pi Phi  Fraternity, based in Prince William County, Virginia. Since its  founding on June 13, 2015, Epsilon Sigma Boule has exemplified the  highest standards…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, include in the Record the following  proclamation:\n\nWhereas, Delta Sigma Theta Sorority, Incorporated was       founded in 1913 on the campus of Howard University by 22       visionary collegiate women committed to public service with a       primary…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…the American Association of University  Women.\n\nOutside of the classroom, Edith is an active member of the Gary  community, holding memberships in the Red Hat Society and the Sigma  Gamma Rho Sorority, Inc. She is well known for her involvement with her  church, the First Church of God in Gary. In 2023, Edith was recognized  by the First Church of God…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, I rise as a proud member of Delta Sigma  Theta Sorority, Incorporated, to honor our Founders Day. Mr. Speaker,  113 years ago, 22 Black, courageous young women at Howard University  founded our sorority.\n\nDelta women…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699009/delta-sigma-theta-founders-day"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Studies and a Doctor of Ministry. She continues to lead  community service through the North Carolina Council of Churches where  she serves on the Board of Directors, the Delta Sigma Theta Sorority,  and health advocacy networks. I am honored to recognize Rev. Dr. Della  J. Owens-Barber on her fourth anniversary as Senior Pastor at the Saint  James Christian…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…livelihoods.\n\nThat is why the following groups are supporting this CRA: The  National Association of Food Equipment Manufacturers; NATSO,  representing truck stops and travel centers; SIGMA, representing fuel  marketers; and National Automatic Merchandizing Association, which  includes vending machine operators.\n\nMr. Speaker, I urge my colleagues to oppose this.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the University of Georgia from  Austin, Texas. He was a beloved son, brother, cousin, and friend whose  infectious spirit touched countless lives.\n\nThrough his involvement in Sigma Phi Epsilon and Cru, a religious  organization at the University of Georgia, George exemplified faith,  leadership, and kindness. His friends would describe him as smart,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…assistance  over the last 12 years to support east Tennessee families and refugees  at home and abroad.\n\nJohnny Wayne Farris is not only a great businessman; he is in my  fraternity, Sigma Chi. He is also even a better member of his  community, helping anyone and everyone he can.\n\nMr. Speaker, I congratulate my dear friend, Johnny Wayne Farris, and  thank him…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698413/recognizing-johnny-wayne-farris"}]