[{"senator": "George Latimer", "party": "Democrat", "sentence": "…and management plan was  signed.\n\nI have signed onto two bills. The first is the ESTUARIES Act that  will preserve Long Island Sound and 27 other estuaries of national  significance. The second is the Long Island Restoration and Stewardship  Act that reauthorizes grants made possible by the Clean Water Act  through fiscal year 2029.\n\nWe must keep clean…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693947/protecting-and-preserving-long-island-sound"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…time as you were standing on this floor talking  about authoritarianism hurting the institutions that were put in place  250 years ago, what is your feeling about the true significance of this  demolition project going on at the other end of Pennsylvania Avenue?", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…voted to reauthorize on a       bipartisan basis earlier this year, in addition to other       concerning eliminations within the Programs of Regional and       National Significance and those related to combatting       overdose-related deaths. These proposed eliminations come at       the same time that HHS extended the public health emergency…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…here today.\n\nThis year, the Association of National Estuary Programs' fall meeting  was held in Mobile, which is my hometown, a powerful reminder of Mobile  Bay's national significance and how this program brings people together  to share solutions across the country.\n\nThis program funds partnerships between the EPA, States, local  governments, and community…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…subject to CRA's submission requirement because       of CRA's exclusions.\n\nJust two other elements that, again, I think are in need of being  highlighted here because of the significance of the action taken this  evening--quoting still from the letter:\n\nEPA stated that the Notices of Decision were not rules       under CRA, and, in the underlying decision…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…speak of       NIH or the current administration as it is simply too much to       bear.\n\nThe National Institutes of Health limps along on invisible       crutches, its significance on life support, its staff feeling       diminished, dazed and confused. When this madness will end is       anyone's guess. With the Department of Health and Human…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…why I am in strong  support of this legislation. Raising the compensation owed to our  veterans to adjust to the cost of living is a small-in-dollar amount  but large-in-significance gesture to demonstrate to veterans and their  families that we see them, we understand their plight, and we can and  will do what we must to help them.\n\nMr. Speaker, I urge…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…appreciation initiatives have continued to grow  and gain global recognition, Planned events and gestures have grown,  promoting respect and recognition, and emphasizing the significance of  the contributions of school custodians. School custodians are our  children's first line of defense against germs and illness. Through  their consistent and tireless…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…If our age will  be remembered, it may be for those who dedicated themselves to the  cause of peace.'' In a time of global Turbulence, his visit marks a  moment of deep significance for Orthodox Christians in New Jersey and  across the United States.\n\nMr. Speaker, I join my colleagues in welcoming His All-Holiness  Ecumenical Patriarch Bartholomew to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Trump's  ``skinny'' budget, which proposes very large cuts to health programs  that American families rely on. These include eliminating programs of  regional and national significance at the Substance Abuse and Mental  Health Services Administration, otherwise known as SAMHSA, which  encompassed nearly all programs aimed at substance use and mental  health,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…dating to the sixth  century.\n\nThe role of the Ecumenical Patriarch as the primary spiritual leader  of the Orthodox Christian world and transnational figure of global  significance has increased exponentially during the tenure of His All- Holiness.\n\nHe has co-sponsored international peace conferences, as well as  meetings about racism and fundamentalism,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…honors is now under attack by the current administration.  While we mark Juneteenth with prayers and proclamations, we must also  confront a harsh and unsettling truth: the significance of this day and  African American history is being erased. Across our Nation, we are  witnessing the systemic losses of our hard-fought gains--the stripping  of diversity,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…endangered Hawaiian monk seal, one of the few seal species  that thrives in tropical waters, to the endemic 'alala (Hawaiian crow),  a bird with deep cultural and ecological significance, Hawaii's native  wildlife plays a crucial role in maintaining the health of its  ecosystems. The striking silversword plant, which grows only on the  volcanic slopes of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Hawaii and American Samoa.  It provides the clarity our fleet needs to operate effectively and the  consistency our Pacific partners expect from the United States.\n\nThe significance of this legislation extends well beyond economic  benefits. The treaty itself embodies a broader commitment, one rooted  in decades of cooperation, mutual respect and shared…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…from ICE, Frank has consistently fought to defend  the most fundamental of our collective human rights and our shared  liberation.\n\nMr. Speaker, this week carries profound significance for Frank. It  marks the 50th anniversary of his release from prison.\n\nI am honored on behalf of Illinois' Third Congressional District to  commend Frank Chapman for his…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "James Risch", "party": "Republican", "sentence": "…estimated total case value will increase by $150 million to a       revised $3.65 billion. Major Defense Equipment (MDE) will       constitute $2.64 billion of this total.\n\n(iv) Significance: This notification is being provided as       the MDE items for CIRCM systems were not enumerated in the       original notification. The proposed articles and services…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…$3.9 million. The estimated total case value will       increase by $15.1 million to a revised $37.8 million. MDE       will constitute $33.9 million of this total.\n\n(iv) Significance: This notification is being provided       because the additional MDE items were not enumerated in the       original notification. The proposed sale will improve NATO's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…arises from a need to make less-than-lethal       projectile devices more accessible and affordable for all law       enforcement, and this legislation is of even more       significance for Native American tribal police departments.       If enacted, this legislation would ensure that Native       American tribal police departments are not subjected to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…remain       at $720 million. The total case value will increase by $1.61       billion, resulting in a revised estimated total case value of       $2.81 billion.\n\n(iv) Significance: This proposed sale will significantly       enhance Japan's intelligence, surveillance, and       reconnaissance (ISR) capabilities and help ensure Japan is       able…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…references to laws, maps,  regulations, and records of the United States.\n\nThe Gulf of America is critical to the United States because of its  energy resources and ecological significance. This renaming symbolizes  Republicans' commitment to putting America first, and honors the Gulf  of America's important role in unleashing American energy and our  Nation's…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…economies and markets. It is a  region that I hold as a key priority as chair of the East Asia and the  Pacific Subcommittee of the House Foreign Affairs Committee due to its  significance to national security and economic prosperity.\n\nMeanwhile, the region also faces significant challenges, including  rising geopolitical tensions, maritime disputes, and growing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…will not result in a net increase in total cost of non-MDE,       which will remain at $55 million. The estimated total case       value will remain at $495 million.\n\n(iv) Significance: This report corrects an error included       in the original notification and includes additional non-MDE       items that increase the sensitivity of technology. The…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…``(2) Homeland security missions.--\n\n``(A) Ports, waterways and coastal security.--Conduct       maritime recovery operations in the aftermath of incidents of       national significance to ensure the continuity of commerce       and critical port and waterway functions, protect the United       States maritime domain and the Marine Transportation System,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Representative of Tennessee's 6th Congressional  District, I rise today to enthusiastically congratulate the Grand Ole  Opry on a century of entertainment and a century of significance. I am  confident the man or woman in my shoes 100 years from now will feel  compelled to do the same.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…challenging limitations  and working for freedom and opportunity.\n\nWhen we recognize women, let us remember the challenges they have  faced, the struggles we have endured, and the significance of our  choice to persevere.\n\nProgress is rarely easily won. Success is rarely freely given, but as  history has illustrated time and time again, women have found ways to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…community. It was officially incorporated in  1925.\n\nWhile the town of Fort Laramie developed independently of the  military fort, the community recognized the historical significance of  the site and pushed for its preservation. The State of Wyoming bought  the land from local residents and donated it back to the Federal  Government in 1937.\n\nToday,…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and  Credit Subcommittee, I, too, have seen firsthand the importance of this  law. Earlier this year, we held a hearing with industry stakeholders to  discuss the act's significance and explore ways to foster innovation.\n\nThe provisions in this bill ensure transparency, market confidence,  and fair price discovery, all of which are essential to a functioning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…billion. The       estimated total case value will increase by $5.83 billion to       a revised $9.58 billion. MDE will constitute $8.11 billion of       that total.\n\n(iv) Significance: This notification is being provided as       the additional MDE and non-MDE items were not enumerated in       the original notification. The inclusion of these items…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…righteous cause.\n\nThis bipartisan legislation would rename Saratoga National Historical  Park to Saratoga National Battlefield Park to more accurately reflect  the historical significance of the site and emphasize the crucial  military engagement that took place there.\n\nThe historic site was originally actually named Saratoga Battlefield  Park, but when it…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…with this notification. The estimated total case       value will increase by $893 million to $1.54 billion. MDE       will constitute $1.09 billion of this total.\n\n(iv) Significance: Recent cost increases have brought about       the need to add value to the original notification. The       proposed value increase will improve Israel's capability to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}]