[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…administration, appointed  dozens of judges who, during their confirmation hearings, refused to  say whether Brown v. Board was properly decided.\n\nLast week, the President signed an executive order to dismantle the  Department of Education--a department that was created to ensure that  students' civil rights were protected. The Department actually does  very…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…something that  happened on January 20.\n\nOn January 20, the President of the United States took the oath of  office at this Capitol. Shortly thereafter, he signed several executive  orders.\n\nOne executive order was Executive Order No. 14151. That executive  order ended all DEI programs. The argument that DEI initiatives  constitute reverse discrimination fundamentally…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…history and have begun promoting so-called patriotic  education, a sanitized version of history that skips over slavery, Jim  Crow, redlining, and systemic racism.\n\nHe signed an executive order reinstating ``commonsense discipline  practices in school,'' rolling back previous administrations' attempts  to address racial disparities in school discipline practices.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Mrs. HAYES. Mr. Speaker, the President of the United States signed an  executive order to dismantle the Department of Education. It is very  important for people to understand what calls for the closure of the  Department of Education would mean to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…holidays, the length of the workweek, and  vacations were negotiated for all of us. We have them because unions  negotiated them.\n\nWe are here because President Trump signed an executive order seeking  to end collective bargaining rights for  unionized Federal employees across several agencies. Congress granted,  not the executive branch, collective bargaining…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…administration is doing. They are trying to  take us back to a time where only the stories and lives of the few  mattered. It began a year ago, on day one, when the President signed an  executive order renaming Denali, the tallest mountain in Alaska and  most sacred site to multiple indigenous communities, renamed after a  President from Ohio without any consultation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…students and  places of learning, and prohibit discriminatory practices. The  President does not have the authority to dismantle the Department of  Education, and he signed Executive Order 14242, which aims to  ``Improving Education Outcomes by Empowering Parents, States, and  Communities'' violates the law and the Constitution.\n\nTwo, unlawfully directed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…reality. Like so much of his agenda, it  doesn't add up, and everything he does is rooted in a sweetheart deal  for his wealthy contributors.\n\nBack in February, he signed the Executive order declaring an energy  emergency. That is the subject of today's floor action. The emergency  declaration has nothing to do with energy dominance, but it has  everything…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…gave us the movement, and the movement gave us the right to  vote.\n\nYet, here we are in 2025, and it feels like we are back at square  one. This week, the President signed an executive order requiring proof  of citizenship to vote in Federal elections. He cut off mail-in ballots  unless they arrive on time as he cuts the postal workforce. He says  that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…government provides reduces college  affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher education institutions as  if they were…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…administration went       beyond threats to try to use the machinery of government to       punish critics. During his first week in office, President       Trump signed an executive order authorizing federal agencies       to withhold funding from ``sanctuary cities'' that refused to       cooperate with the administration's crackdown on undocumented…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…extremist who brought  us the January 6 insurrection.\n\nTheir objective of suppressing the vote was made even more clear last  week, Mr. Speaker, when President Trump signed an executive order to  erode voting rights and gave Elon Musk, an unelected, unconfirmed  person, the right to access Americans' personal voter information.\n\nMr. Speaker, as elected…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…these pardons also highlight the hypocrisy of  President Trump when it comes to his claimed crackdown on antisemitism.  Just days after pardoning these rioters, he signed an Executive order  outlining his administration's efforts to combat ``the explosion of  antisemitism'' in the U.S..\n\nBut, many of the rioters who Trump pardoned openly embrace violent…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…going to vote on showerheads, I literally  had to google and look up what this was all about. I was actually  genuinely shocked that the President, of course, had signed an  executive order in April, demanding that we change the efficiency  standards for showerheads.\n\nAs I often do, I went down a rabbit hole. In fact, I pulled up  pictures of the kinds…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…services at no cost to their parents. They have  legal and civil rights protections for their children under this  landmark law.\n\nOn March 20, 2025, the President signed an executive order directing  the Secretary of Education, Linda McMahon, to facilitate the  dismantling of the Department of Education, which raises significant  questions about the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…our legal system.\n\nMost recently, President Trump authorized the Smithsonian American  Women's History Museum in 2020. In his first few days of his second  term, he signed an executive order to protect women in sports.\n\nToday, we are fighting to get that museum that was authorized in 2020  its rightful place on The National Mall. I thank my colleagues…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…they say that this is a meaningless bill, it couldn't be further from  the truth.\n\nThis is the bill for national security. This is the bill that  President Trump signed into executive order. Today is the day that we  codify this into law.\n\nMr. Speaker, I urge all my colleagues today to have a ``yes'' vote.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Two illegal aliens who were allegedly members of the       Tren de Aragua gang have been charged with her murder.\n\n(3) On March 4, 2025, President Donald J. Trump signed       Executive Order 14229 (90 Fed. Reg. 11585; relating to       honoring Jocelyn Nungaray) renaming the area known as the       Anahuac National Wildlife Refuge to ``Jocelyn Nungaray…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…position that there are only two sexes, male  and female.\n\nThis is a position grounded in biological reality, not gender  ideology. Last month, the President also signed an Executive order that  bans biological males from competing in women's sports.\n\nIt was an honor to join President Trump at the signing ceremony along  with the brave young women and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska Land Transfer Acceleration Act  Report to Congress.\n\nFortunately, elections have consequences, and on his first day in  office of his second term, President Trump signed Executive Order  14153, ``Unleashing Alaska's Extraordinary Resource Potential,'' which  called for the rescission of the 2024 Record of Decision and a  reimplementation of the draft…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of President Trump's Executive Order No. 14172, which directed  the Board on Geographic Names to rename the Gulf of Mexico as the Gulf  of America. President Trump signed this executive order on his first  day in office.\n\nEnacting this legislation will help make President Trump's historic  action permanent and ensure consistency in references to laws,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…House Republicans and the administration to reduce  regulatory burdens and encourage American competitiveness, an objective  that President Trump emphasized when he signed Executive Order 14267,  Reducing Anticompetitive Regulatory Barriers.\n\nAdvancing this legislation will allow for the deployment of undersea  cables while providing appropriate protection…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…energy strategy and  unleashing the production and export of clean, affordable, and reliable  American LNG.\n\nIn the first days of this administration, the President signed an  executive order reversing President Biden's LNG pause, an important  step in reclaiming global energy dominance and lowering costs across  the board.\n\nIt is shocking to me that House…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…community health across the North Slope of  Alaska.''\n\nFortunately, elections have consequences, and on his first day in  office of his second term, President Trump signed Executive Order  14153, ``Unleashing Alaska's Extraordinary Resource Potential,'' which  called for the rescission of the 2022 Integrated Activity Plan Record  of Decision and a reimplementation…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…bolsters  our domestic manufacturing, returning production to the U.S., American  companies need the workforce to support these industries.\n\nLast week, President Trump signed an executive order to modernize our  workforce programs to better prepare the American people for these  high-paying jobs in the trades.\n\nThis Presidential action will support more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…President Biden placed a moratorium on  public land energy development that never truly went away until January  20, 2025, when President Trump was sworn into office and signed an  Executive order.\n\nWyoming and the West have fallen victim to the previous  administration's regulatory regime designed specifically to kill the  industry. Then, once he kills it,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and led to the creation of the 2024 ROD.  Fortunately, elections have consequences, and on January 20, his first  day in office of his second term, President Trump signed Executive  Order 14153, ``Unleashing Alaska's Extraordinary Resource Potential,''  which called for the rescission of Biden's illegal cancellation of the  ANWR leases and the 2024…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]