[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…aisle to take this  important step.\n\nLet's be honest. It was just that, one step. It was a step that needs  to be followed up with more steps, more action, more help, and more  signals that we are bigger and better than the gun lobby.\n\nSince then, since that one step, mass shootings have surged. Right  now, families are afraid to go to the mall, the movie…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…going to allow this to take place and not speak  up and speak out and say to the world that this has to change.\n\nWe are normalizing not just hate, but we are normalizing these  signals to persons who may not be as stable as I would like for them to  be, who will then proceed to do something to harm someone.\n\nYes, when you come to my office, the first thing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…commitment to civic responsibility and  education in the areas of American history, American government, or  civics.\n\nMrs. Baker began her service in the U.S. Air Force, conducting  signals analysis in support of Operation Iraqi Freedom.\n\nUpon leaving the military, Mrs. Baker continued to serve her  community through education. She went to school using the GI…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689665/recognizing-jasmine-baker"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…We can't say that on CNN. If we say  that it is racist on CNN, we become persona non grata. We are not going  to be back on CNN. If we are there, the host would send little signals  to let people know that this was something that was imposed and not  something that was desired.\n\nCNN is a status quo news network. I am not a status quo  Representative.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…immediate harm to African exporters and  U.S. importers, disrupting supply chains and costing jobs on both  sides.\n\nReauthorization preserves U.S. credibility. Letting AGOA expire  signals disengagement at a time when competitors like Russia and China  are deepening their presence across the continent.\n\nReforms can and should be considered, but holding the program…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…announced that it was going to let off the  hook gun dealers who are violating the laws.\n\nNow, throughout the last 100 days, the Trump administration has been  sending all sorts of signals that they are deprioritizing the work of  the ATF. Most recently, on April 9, they announced that the Army  Secretary would now be the acting head of ATF. This was basically…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the kind of bipartisan cooperation we need more of in  Congress.\n\nAfter Republicans' reckless budget bill rolled back critical  renewable energy programs, I hope this bill signals at least a partial  recognition that in America we must keep building, not dismantling our  clean energy capacity where possible.\n\nThe legislation will help power thousands…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693917/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Republicans and Senate Republicans, will do  it in a bipartisan appropriations process to try to reach an  enlightened agreement.\n\nMr. Speaker, what this rescissions package signals to us and the  people that we represent and, more importantly, what it signals to  America, as the OMB Director just said, Republicans aren't interested  in bipartisanship.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…red light, green light tariff policies have caused uncertainty in  all sectors of our economy as well as internationally. Wall Street and  Main Street alike have been sending signals for weeks that they do not  like or trust those economic plans. The stock market has dropped almost  9 percent and lost $4.5 trillion in wealth. This is hurting everyday…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690572/new-federal-economic-data"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…submitted over here under the pretense that it was a rule,  and with 30 votes and a majority behind it, off you go to the races.\n\nSo this is a bad, bad day for the Senate. It signals a willingness of  this majority, after so much talk about defending the filibuster--oh,  defending the filibuster. When we were in the majority, you never heard  them stop…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Office, to improve veteran       and beneficiary customer experience and satisfaction,       including through the use of what are known as ``trust-      scores'', Veteran Signals also known as ``VSignals'', and       related survey and data collection activities, processes, and       initiatives; and\n\n(2) submit to the Committee on Veterans' Affairs…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…more in line with what our grid  actually needs.\n\nAs I mentioned earlier, with the rise of AI, we are going to need a  lot more power. We should be sending the right market signals to bring  the power on that will actually meet the demand that we need for the  future.\n\nNumber six, wind and solar are no longer emerging technologies. They  are mature.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Speaker, many of my colleagues on the other side of  the aisle have repeated the phrase ``budgets are about priorities'' a  lot lately.\n\nMr. Speaker, do you know what really signals someone's priorities? It  is their actions.\n\nJust last week, we witnessed a group of elected officials storm an  ICE facility, demanding sympathy for illegal aliens who are…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691318/elected-officials-storm-ice-facility"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…prevent fraud before it even starts. Supporting the  SAVE America Act means promising every voter that their voice matters  and that their vote will not be diluted. This action signals a long  overdue step towards election integrity, which will preserve the  strength and the security of our democratic system for generations to  come.\n\nVery simply, our democracy…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…priority.\n\nSince its formation, the American Heart Association has been helping  people recognize the signs of cardiac arrest and how to effectively  respond to these critical signals.\n\nMore than 350,000 cardiac arrests happen each year away from medical  facilities. The American Heart Association's goal is to ensure those  lives are saved. Heart disease…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699741/recognizing-american-heart-month"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…dominance.\n\nThis legislation should be an easy, bipartisan bill. If you support  affordable, reliable energy, then this bill strengthens our economy. It  lowers prices, and it signals that you have studied the industry and  that you know your facts.\n\nMr. Speaker, I urge all my colleagues to support this and am proud to  offer H.R. 1949.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…and complex supply chains, trade is a detailed and  dynamic system which values certainty.\n\nAGOA is a unique opportunity to strengthen trading relationships  through market signals and cooperation on our partners' trade and  investment policy, rule of law, as well as worker and human rights. We  cannot sit on the sidelines while our global adversaries,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…traffic  control and other pilots have a better idea of nearby planes and  helicopters.\n\nNo. 2, it requires all aircraft, civilian and military, to equip and  receive ADS-B signals.\n\nNo. 3, it directs the FAA to comprehensively evaluate the safety of  airspaces around airports across the country so that no other airspace  has the same risk of collisions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…which I try to give most Thursdays. It  has been a while. For the pages, this is the highlight of the week.  Even our friends in the media like this speech because it usually  signals the end of the work week, but not right now. You saw the  minority leader's objection without any explanation on why on  confirming the Chairman of the Joint Chiefs, so we…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…bring an end to the dangerous, leftwing  ideologies that have been incorporated into our military. For far too  long, woke-ism has been prioritized in our military. This bill signals  the change that once again puts our servicemembers first.\n\nAdditionally, the NDAA secures made-in-America military equipment to  provide our troops with the best tools that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Sincerely,                                                     Brian J. Mast,                            Chairman, Committee on Foreign Affairs.\n\nMr. Speaker, this bill signals that the United States will not  tolerate the use of state violence to extract profit from the bodies of  the persecuted.\n\nI thank my friend, the gentleman from Pennsylvania…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Module       (SAASM) is a security device controlling the encryption that       enables Precise Positioning Service (PPS) and resists       adversary attempts to spoof GPS signals. The DAGR with SAASM       will provide position and location information necessary for       ground-based operations.\n\nThe Simple Key Loader (SKL) is a ruggedized and portable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}]