[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…elite and  the powerful who believed they could get away with it.\n\nEpstein told the young victims that he controlled the banks and the  government.\n\nThose women refused to be silenced. Today, they have pierced the dark  with their light.\n\nAnytime any girl is trafficked, molested, or abused, the world must  stand up. Today, the House proves Jeffrey Epstein…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…from voting? Working people who don't have the  time to do it and low-income people who cannot afford to do it would be  prevented from voting.\n\nHouse Democrats will not be silenced while Donald Trump and  Republicans try to disenfranchise millions of people.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…was exercising one of the most foundational pieces of  our democracy: engaging in free speech and debating his political views  in a public space without being threatened or silenced, and he was  targeted because of this.\n\nBefore this assassination, in April, Governor Josh Shapiro's house  was set on fire, endangering his entire family. Just 2 months after…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…facts rather than ideology were  imprisoned, killed, or sent to work in slave labor.\n\nEven as far back as Mao's Cultural Revolution, China dismantled  academic institutions, silenced experts, and elevated loyalty over  knowledge. Generations lost their chance at education, and the nation's  progress was stunted.\n\nMr. Speaker, if we do not learn from our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise, and still I rise,  a proud, unbought, unbossed, liberated Democrat.\n\nAnd still I rise, censured but not silenced. It is important to have  this photo tonight because it will get us into some very important  issues.\n\nThis was the occasion when I stood before the President as he stood…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be a descendant, a scion of  the economic foundational mothers and fathers.\n\nI hold this because there are people who would silence me if they  could. ``Censured, but not silenced.'' My voice is going to be here as  long as there is a breath of life in me and I am a Member of this body.  I plan to make sure that history records the truth about what…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…not a coincidence. This is an all-out attack on our past, our  present, and our future.\n\nMr. Speaker, let me be clear. Black Americans will not be erased. We  will not be silenced, and neither will the millions of people of all  backgrounds who are being harmed by this White House.\n\nIt is time for us to take up their voice and carry on their fight…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…recognized that an equal education is the foundation of any  democratic society.\n\nBefore these protections, young people with disabilities around the  country were not only silenced, they were institutionalized. Families  were told to stay quiet while bright and brilliant minds were  dismissed, and today that door is closing again, eerily quickly because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…These  women are asking for basic human dignity, the right to live without  fear, to speak freely, and to make decisions about their own lives.\n\nFor too long they have been silenced, imprisoned, and even killed for  demanding those very freedoms, but they still courageously protest and  persist.\n\nThey are fighting not just for themselves but for their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697722/free-iran"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…read the resolution. There will be an appropriate time to  read it. This is not that time, but I do want to call to your attention  the fact that I have been censured not silenced, and I say this because  I will be presenting this resolution, but I have many more things to  say about the effort that we are embarking upon and because this effort  is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…fought alongside us because he knows that  our destinies are intertwined.\n\nToday, let us honor the courage of a man who has refused to be cowed,  refused to bow to power, or be silenced by cynicism; a man who reminds  us that to lead is not simply to occupy an office but to carry a  people; a man who teaches us that loyalty to the truth, to the  community,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Member of the House of  Representatives to be removed from a joint session of Congress and,  thereafter, to be censured. I have been censured, Mr. Speaker, but I  have not been silenced. Censured, but not silenced.\n\nMr. Speaker, I rise today in agreement with the President. This is,  indeed, a dark day. Yesterday was a dark day--dark days because of  lives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…already been censured. This happened some  time ago, and I have signage that I used to indicate that, while I have  been censured, my signage indicates that I have not been silenced, and  I will not be silenced, censured but not silenced.\n\nThis was when the President was here for a joint session of Congress.  The President was indicating that he had a…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…informed ignored, oversight stymied and obstructed, and  inspectors general who are supposed to keep their eyes on these  Agencies--inspectors general and their personnel silenced, forced out,  or removed.\n\nAnd I remind my colleagues, in terms of oversight for the  intelligence community, that is not a right that all 100 Senators have.  There are literally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…history is American history,  indigenous history is American history, Latino history is American  history, and women and LGBTQ+ history is American history.\n\nWe will not be silenced.\n\nNo illegal or unconscionable executive orders can erase American  history. No firing of generals or Federal workers, no banning of books  or threats to schools, no purge…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690193/american-history"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…King, Jr., once said: ``The arc of the moral  universe is long, but it bends toward justice.''\n\nThat arc bends when brave people stand up. It bends when people  refuse to be silenced. It bends when free nations lend their voices to  those who have been denied one.\n\nMr. Speaker, that is what we are witnessing in Iran today: a movement  not controlled by…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…just a friend. Taiwan is a self-governing  democracy, a critical economic partner, and a responsible global  stakeholder. It deserves to be seen and heard and not erased or  silenced.\n\nWhen the United States shows leadership, we know that others follow.  We must lead now before the Chinese Communist Party permanently  rewrites international norms.\n\nI thank…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…system that protects it. When one  single illegal vote is cast, a legal vote is diluted. When a foreign  national influences an election, the voice of an American citizen is  silenced. This isn't a hypothetical concern. It is a matter of  protecting the value of everyone's choice.\n\nThe SAVE America Act is guided by one simple principle: Only  Americans…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699946/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…the Constitution. Instead,  the Court invented a constitutional right grounded in a vague,  undefined concept of privacy that the Court itself struggled to  explain.\n\nRoe silenced voters, sidelined legislatures, and eroded respect for  the judiciary by turning judges into policymakers. Worst of all, it  cost millions of innocent lives.\n\nIn overturning…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…provided by foreign governments and entities of concern.\n\nStudents perform better when parents are involved in their education.  Yet, in recent years, parents have often been silenced or forced to  navigate bureaucratic hurdles just to understand what their children  are learning.\n\nThe TRACE Act ensures transparency, strengthens parental rights, and  protects…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…is happening. Since 2013, U.S. colleges  and universities have received over $1 billion from Chinese Communist  Party-affiliated sources. In return, we have seen professors silenced,  student groups threatened, and our intellectual property stolen.\n\nAt the same time, these institutions, many of which proudly divest  from fossil fuels and boycott Israel,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…to work with allies to pressure China to close these camps.\n\nIt also urges U.S. leadership at the United Nations to ensure China's  human rights abuses are not ignored or silenced.\n\nAmerica must lead with moral clarity. We must stand for human rights  and against genocide.\n\nMr. BAUMGARTNER. Mr. Speaker, I urge my colleagues to join me in  passing the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Let's be clear. Every dollar from an adversarial nation comes with  strings attached, expectations about what gets taught, which research  gets funded, and who gets hired or silenced.\n\nWe are already seeing the consequences. The committee report  accompanying the DETERRENT Act highlighted research from the Network  Contagion Research Institute, which analyzed…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…people.\n\nIf Americans live in a country where their elected representatives in  the legislature cannot or will not speak for them, it will be because  those representatives silenced themselves. They gave in. They did not  stand up and do their duty.\n\nWe can show the people that the constitutional principle of the  separation of powers still means something…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]