[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…improvement  because for the past couple of weeks in the markup hearings on their  disastrous budget reconciliation bill, they have been unwilling to  debate at all. It has just been silence from Republicans as they move  through one of the most reckless bills in American history, the same  silence as they duck their constituents by canceling townhalls and  avoiding…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…atrocities of World War II, world leaders understood that  large-scale abuses do not begin with mass violence. They begin when  governments cut off basic rights, freedoms, and silence their own  people. The declaration was an effort to build a more stable and  predictable world by setting clear rules for how governments should  treat their citizens.\n\nMore…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…to destigmatize and normatize       conversations around mental health within the Haitian       community, a community that has long been taught to endure       suffering in silence, to ``be strong,'' and to survive       without support. For many of our clients, seeking mental       health care represents a cultural and emotional rupture: the       first…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…ego. I  have never seen them leap into action so fast in my life. It was  overnight.\n\nMeanwhile, their own voters are getting hurt by this administration,  and it is radio silence. They can't even be  bothered to lift a finger or do a townhall.\n\nMr. Speaker, where is the outrage over Trump wanting to cut 80,000  jobs at the Department of Veterans Affairs?…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…not too long ago, before he was  Chairman, when Brendan Carr was singing a completely different tune. He  actually condemned perceived attempts by ``government officials to  silence political speech that they don't like.'' That is the old  Brendan Carr. He defended talk show hosts, saying:\n\nFrom internet memes to late-night comedians, from cartoons…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…right  now. This was supposed to be a moment of celebration, and instead it  became a nightmare that has rocked our community to its core.\n\nMr. Speaker, I ask for a moment of silence to honor the victims,  including Amari, Susano, Maya, Journey, and their families as they  navigate this tragedy.\n\nMy wife, Pam, and I are praying for the victims, their families,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…We are praying for her  loved ones and for all the lives who were touched by her decades of  service.\n\nMr. Speaker, I ask all of my colleagues to join us now in a moment of  silence in memory of the Honorable Carolyn McCarthy.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…died without her oxygen.\n\nI ask that this House not only reflect on the other 10,000 people in  that refugee camp who are without medical care, but I ask that we  adjourn in silence in the memory of Pe Kha Lau  who died at the hands of Elon Musk and DOGE.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688298/in-memory-of-pe-kha-lau"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…for starting the war in Ukraine. This is  something straight out of North Korea, where ``facts'' are the sole  purview of the Dear Leader.\n\nWe must also note the deafening silence from many of my Republican  colleagues. Many Republicans claimed for years to be unapologetic  supporters of Ukraine who were outraged by the perception that  President Biden…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…close collaboration on this  bill.\n\nToday, pilots and air traffic controllers who seek mental health care  are unfairly penalized by a system that perpetuates a culture of  silence. Current regulations mandate that if they seek care, then they  are immediately grounded for a minimum of 6 months, and then they are  still faced with delays, confusion,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…into law, and signed by President Biden.\n\nWe know that the National Pulse Memorial happened because this was a  national tragedy. At the time, we saw memorials and moments of silence  across the Nation, across districts, from sea to shining sea.\n\nIn remembrance of those who we lost and those who were injured and  their families, I ask my colleagues to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…democracy.\n\nMr. Speaker, some would say order is needed. Let me say something  about order. There is no order without justice, and there is no justice  when you erect barriers to silence people instead of listening to them.\n\nWe need access. We need more access, not less. We need more voices,  not fewer. We need to make voting easier, not harder; more joyful,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…strengthen democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of that for a fraction of a penny on the dollar.\n\nLet's be perfectly clear. Letting…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…cower in favor of  what they know is wrong and unjust.\n\nThis is abuse of authority, and we cannot let it go unchecked. As  much as Trump and his Department of Justice try to silence us, we must  all speak up and speak out. Democracy is a fragile and precious thing.  It lasts as long as we fight for it. That is because each time we let  ourselves be cowed…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…nothing, not one thing, to bring Kilmar  Abrego Garcia or any of the detainees home. Their families haven't  heard a word--no calls, no updates, and no proof of life, just silence.\n\nHere is what gives me hope: Yesterday, Mohsen Mahdawi, a detained  Columbia student, was released on bail. He said something we all need  to hold close: We must ``believe…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690555/stand-for-justice-bring-detainees-home"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…In good faith, small businesses dedicate precious time, money, and  resources, sometimes thousands of dollars, to just submit these  proposals. Too often, they are met with silence, confusion, or outright  cancelation of the solicitation without any explanation. That is not  just inefficient. That is unfair.\n\nAgencies right now have broad discretion…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…alone.\n\nFor every Laken Riley, there are thousands of Americans whose names  have never been spoken, whose stories have never been told, whose loved  ones have suffered in silence.\n\nThere was the 14-year-old girl in Louisiana who was brutally raped at  knifepoint by an illegal alien from Honduras and the man he stabbed in  the face during an armed robbery…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…7, is  the 84th anniversary of Pearl Harbor Day, the day that will live in  infamy.\n\nLike 9/11, we must never forget. Always prepared, always ready.\n\nI ask for a moment of silence for those whose lives were lost on that  fateful day.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…loving homes where the Divine forged an abode turned Into       blackened stones soaked from Hatred--filled wells of blood       and fire, With walls of witness wailing in silence Of strewn       bodies, young and old bonded. In death as in life, for the       land of ubiquitous. Memorials again and again and again, Till       when? Of snuffed dreams…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697096/recognizing-october-7-revisited"}, {"senator": "French Hill", "party": "Republican", "sentence": "…aspired to serve  as chair of the House Financial Services Committee, I asked my  colleagues: Can you tell me how many companies are in the Wilshire 5000  Index? There was silence in the room.\n\nMr. Chairman, there was silence in the room because it is not 5,000  companies, it was 3,700. Why? It is because we don't have enough  qualified public companies…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of life. It is important that the  people's House meets that moment. We should be unafraid to say that  every life has value and that mothers deserve our support, not our  silence.\n\nMr. Speaker, I urge my colleagues to support this rule and these pro- life, profamily priorities.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…leadership of GAO just last week and said: As  far as you know, has GAO ever--ever--declared something not a rule when  the Agency said it was a rule? And after a moment of silence, he  responded: As far as I know, GAO has always deferred to the Agencies,  until now.\n\nThey literally broke their own policy. They literally violated their  own legal counsel.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…and they deserve the support of the international  community. And the people of Iran deserve liberty.\n\nThe regime's response has been swift and ruthless. In an attempt to  silence dissent and conceal its abuses, Iranian authorities have shut  down the internet and the phone service. They have cut citizens off  from one another and from the outside world.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…representative, a Senator of Los Angeles and the State of  California--being roughly mishandled and say: Huh, too bad. At least it  wasn't me.\n\nIf we answer this moment with silence, we will be damned, and our  children and the world will say: They didn't really mean it.\n\nThe members of my family who served in the U.S. military knew that  signing on that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Month, and I rise today during National Suicide  Prevention Week to raise awareness and promote hope.\n\nSuicide affects millions of people every year, yet too many struggle  in silence. Suicidal thoughts can affect anyone, regardless of age. It  is among the leading causes of death in the United States.\n\nMental health professionals, advocacy organizations,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695065/promoting-hope-during-national-suicide-prevention-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…whistleblowers. I hope President Trump will be the first to set  this historic precedent.\n\nUnfortunately, there has been a growing trend among Federal Agencies  to unlawfully silence whistleblowers by failing to include the anti-gag  provision in their nondisclosure policies, forms, and similar  agreements. The law requires Federal Agencies to include…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…service to others. I  thank him for his service and for the impact he made on our lives. May  he rest in peace.\n\nMr. ESTES. Mr. Speaker, I ask that the House observe a moment of  silence to remember Eric Jachym.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693538/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…and  removing Delegate Plaskett from the Permanent Select Committee on  Intelligence and referring her to the Ethics Committee for further  investigation.\n\nAfter 4 years of silence on this matter, there was not a peep during  the entire Biden Administration. Let me repeat that. After 4 years of  silence on this matter about Jeffrey Epstein, House Democrats…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…to open a  bank account. Americans show an ID to enter Federal buildings and for a  host of other reasons.\n\nOf course we should expect it for American elections. It doesn't  silence voters. It empowers voters. It only ensures that Americans are  voting in American elections. For God's sake, why would anybody be  opposed to that? Think about it.\n\nMr. STEIL.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…U.S. combat  troops departed Vietnam, marking the end of direct U.S. involvement.  Yet, for too many of those who returned home, there were no parades, no  celebrations, only silence where gratitude should have been. Despite  this, they carried the burden of their service with dignity.\n\nMany were drafted, but all answered the call with honor and  distinction.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689330/national-vietnam-war-veterans-day"}]