[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…agencies across the country already  follow.\n\nI ask every Republican Senator: Go home. Ask your police officer or  ask your sheriff what rules they must abide by.\n\nThey are very similar to the rules that we are asking ICE to obey,  but right now, ICE is a rogue force. Lawlessness prevails when ICE  arrives.\n\nIf Republicans want to claim our proposals are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700064/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…It is all just a pretext to insert  Federal control over States' rights. States do have rights, and  President Trump is trying to override them roughshod.\n\nHis tactics are similar with mail-in ballots. In the 2024 election,  nearly one-third of Americans voted by mail. Mail-in voting is  instrumental in helping our troops and making sure that every…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hundreds and even thousands of  dollars every month due to the inaction of this Congress.\n\nMr. Speaker, I know that many of the people back home must be writing  to you with similar stories. We can't fail these families. We can't  turn our backs on working people who are struggling to get by.  Healthcare is a basic and fundamental human right. If we have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…described, traveling as a working mother without her  kids and being asked why she had breast milk but no children. Her  experience made it clear to many parents who have faced similar  challenges.\n\nI thank Senator Duckworth for leading the charge in the Senate and  sending us this bill so quickly as well as Representatives Salazar,  Pettersen, and Luna…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…trust.\n\nWe also oppose H.R. 884, which would repeal a 2022 law       extending voting rights in local District elections to non-      citizen residents. Non-citizens enjoy similar voting rights       in 15 other jurisdictions, including San Francisco and       Oakland, California, Montpelier, Vermont, and a number of       jurisdictions in neighboring…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…technological advancement.\n\nIt is not a stretch to say that this data can one day be used to  anticipate and prevent potentially catastrophic diagnoses in veteran  populations with similar markers. I, for one, look forward to a day  when we are preventing deaths from occupational exposures instead of  merely tracking them. This bill begins to tackle that.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…related to the  illegal biolab that was created in 2023 in Reedley, California. This  does not surprise me.\n\nWe cannot assume that communities across the country are immune from  similar risks. Many jurisdictions simply do not have the expertise or  Federal support needed to quickly identify and respond to unauthorized  biological operations. That is why I…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…by the Framers of  the Constitution to make a decision like this on his own.\n\nI will finish where I started. This is not about dissatisfaction with  President Trump. I filed similar resolutions, as my colleague from  Idaho knows, when President Obama was President. I came into the Senate  in 2013 with an absolute obsession because of the military nature…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…the Richardson Waiver,       meaning that the public will no longer have a judicially       enforceable right to notice and opportunity to comment on       such rules unless similar procedures are required by another       statute. Like the rule in Brown Express, the Policy Statement       eliminates non-agency parties' right to notice of agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…It also not only blocks the EPA from implementing the program's waste  emissions charge, also known as the methane polluter fee, but also  prevents the EPA from ever taking similar action in the future.\n\nControlling methane pollution is a win-win for all Americans. It is  unfortunate that my Republican colleagues are willing to throw all of  this away…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…1997, working primarily with  Republicans in Congress, I created federal tax incentives for  investment in D.C. by businesses and individuals. The business tax  incentives were similar to, but more generous than, those available  under the national empowerment zone program. I got the D.C. tax  incentives continuously reauthorized until 2011, when Congress…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697733/introduction-of-a-bill-to-designate-the-district-of-columbia-as-an-empowerment-zone"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Creator with certain unalienable rights,  among them life, liberty, and the pursuit of happiness.\n\nI will be voting to protect the country I love. I hope that you will  do a similar thing. If you don't vote the way I vote, just understand  this: I am not expecting everybody to vote with me, but I can assure  the public of one thing: I will be voting for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Under the guise of election integrity, the Republicans' H.R. 22 would  require Minnesotans and every American to provide burdensome  ``documentary proof of citizenship''--similar to what Minnesotans  already rejected--in order to participate in federal elections.  Standard REAL IDs, Tribal IDs and military IDs alone do not meet this  bill's extreme…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Americans, when they are in crisis, should be  able to speak to a professional counselor who understands their  experiences and is trained to communicate with people facing similar  struggles.\n\nThis is a cruel idea. For the health and safety of all young  Americans, the President must immediately reverse course on this ill- advised, cruel, and dangerous…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…threatens regional security.''\n\nI couldn't agree more. With such brazen testing of NATO defenses, one  would expect our leader, the President of the United States, to make a  similar condemnation and reaffirm the alliance's formidable defensive  capabilities.\n\nBut the response from President Trump has been silence or bizarre  musings saying maybe it was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…D.C., should be a model  for justice across our great Nation.\n\nIn no way, shape, form, or fashion should we be charging adults as  minors and allowing them to return to commit similar or more violent  crimes. The citizens, tourists, businesspeople, and every other member  of this city deserve safety and security. I urge my colleagues to  support this bill,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…of Small and Disadvantaged Business Utilization       (as defined in section 15(k) of such Act (15 U.S.C. 644(k)))       of the Federal agency for assistance in identifying similar       contracting opportunities.\n\n(b) Publication.--The information required under subsection       (a) shall be made publicly accessible on the single,       Government-wide…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Today, a Federal District Court tossed out the gerrymandered map in  Texas with an appeal headed straight to the Supreme Court. California's  gerrymandered map is facing a similar legal challenge. We don't know  how these cases will turn out, so there is uncertainty at this moment  whether the whole redistricting war is going to end as a wash or with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Trumka, a former coal miner, also signaled his skepticism       at Biden's plan to transition coal, gas and oil workers to       clean energy jobs, saying he was subject to a similar failed       policy.\n\n``You know, when they laid off at the mines back in       Pennsylvania, they told us they were going to train us to be       computer programmers,''…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…production and unleashing American energy dominance. Now  the United States is the premier oil-producing nation on this planet.\n\nToday, we find ourselves, Mr. Speaker, in a similar disadvantaged  position. An adversarial nation controls the access to key resources,  as well as retains the ability to restrict American imports at will,  threatening to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…expectations here, so  we will see what I can do.\n\nMr. Speaker, I have been in Congress now for 10 months, and this is  the second time the government has been shut down. What is similar in  them both is the reason because Democrats have put the priorities of  illegal immigrants over the priorities of the people that we swore an  oath to protect; that is,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is one in which a company offers two or more       classes of securities with different voting rights in an       election of directors.\n\nUsing information about the cost of similar rulemakings,       CBO estimates that implementing H.R. 3357 would cost $1       million over the 2025-2030 period. CBO expects the commission       would need three employees,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…House Committee on Foreign Affairs favorably marked up a version  of this bill during the last Congress, where it passed with a strong  majority, and I expect it will receive similar support today.\n\nMadam Speaker, I urge my colleagues to support this pragmatic  approach to foreign policy and support this measure, and I reserve the  balance of my time.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…increasing in the United States for the first time in over 10  years.\n\nH.J. Res. 105, sponsored by my Energy and Commerce colleague,  Congresswoman Fedorchak, would overturn a similar Bureau of Land  Management Resource Management Plan for North Dakota. Under this Biden- Harris administration rule, 4 million acres of Federal land in North  Dakota would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that the Kingdom of Saudi       Arabia can provide substantially the same degree of       protection for…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…Let me be clear: No woman should ever have to  choose between finishing her education or experiencing the joy of  motherhood.\n\nTo my colleague on the other side, I have had a similar situation  also, but I do want to thank her for acknowledging that the life within  her was a baby. Women are fully capable of raising children and getting  an education at…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…change codes. It didn't give the Federal Government  control of any square inch of my great State. It just gave a  designation--a monument designation--to that area. It is very similar  to some other places in that it is just a designation so that we will  always remember as a nation that something significant happened here.\n\nAnd it is not just about what…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…investment opportunities not       available to nonaccredited investors, such as purchasing       securities that are exempt from registration with the SEC.\n\nBased on the cost of similar provisions, CBO estimates that       implementing H.R. 3339 would cost $1 million in both 2026 and       2027. CBO expects that the SEC would need three employees, at…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…analyzing the markets, and talking to regulators.  That is how we got the CLARITY Act on the floor today. It is built on  the backs of that hard work.\n\nThis Chamber passed a similar bill in the last Congress with  exceedingly strong, bipartisan support. Since then, the CLARITY Act has  only been further refined and strengthened in terms of legal certainty…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the same terms and conditions  set forth in the 2020 IAP. Passage of S.J. Res. 80 would durably  protect against another rogue administration promulgating a  substantially similar anti-development management plan for the NPR-A as  contained in the 2022 IAP ROD.\n\nIn addition to the Trilateral, this resolution of disapproval is  supported by the Alaska…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}]