[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have real effect. It  would make the sacred act of voting exponentially more difficult for  all Americans. Over 20 million American citizens--1 in 10 voting-age  Americans--simply don't have the access to the documentation that this  bill would require to vote.\n\nVoting identification in some form ought to be required but not in  the way that this bill…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…distance.\n\nRural healthcare is not just about hospitals and doctors. Clean  drinking water, wastewater upgrades, and broadband are necessary for  health and survival. Rural areas simply don't have the tax base to  modernize these systems alone, so Congress must invest funding in rural  development, energy, and healthcare to ensure they can thrive.\n\nMr. Speaker,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…more tax cuts for  wealthy people, that would cut Medicaid and block help for families  that will go hungry so that billionaires like Elon Musk get another tax  break they simply don't need.\n\nBut that is not what I am here to talk about this evening. I am here  at this hour, or this morning, because right here, right now, in the  dead of night, Republicans…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…women in the same age  group because women pay attention to their bodies. Women go to the  doctor for regular checkups. By and large, women see physicians  regularly, and we simply don't.\n\nAccording to the National Kidney Foundation, studies show that,  although men and women may have chronic kidney disease, men are more  likely to reach kidney failure…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…many Americans watching from home, I must ask: Why does this  keep happening? Why does this keep happening?\n\nMy colleagues across the aisle either don't understand, or they  simply don't care about how a government shutdown impacts people, real  people. They seem to think that it is a tool that they can use to force  their cruel agenda onto our communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…steel, auto parts and finished vehicles, crude oil and  refined gasoline crisscrossing our northern border numerous times  before getting to its final customer. To put it simply, don't hurt  North America.\n\nThe American people cannot stand idly by while we throw out all the  hard-fought gains we have made in American manufacturing since the  1980s; and,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…backward policies and their war on cheaper,  cleaner energy. Since Trump took office, electricity prices are up 13  percent, and natural gas prices are up 8 percent. They simply don't  care. They would rather continue to push bills like this that will make  the affordability crisis even worse.\n\nMr. PALLONE. Madam Speaker, I yield 5 minutes to the gentlewoman…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…was a little  more rude in his choice of words.\n\nThe point I want to make is that this is not new. The ignorant  tariffs that he is applying come from the fact that they simply don't  get it with manufacturing because none of them--think about it. There  is no one on the Trump tariff team who has ever built anything in their  career. They are a bunch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…produce a doctor's note to receive an alternative beverage,  which places an unfair burden squarely on minority children, children  of working parents, children whose parents simply don't have the time  or the ability, because of the healthcare system crisis, to even see a  doctor, let alone get a note from a doctor.\n\nThis bill fixes that issue. It contains…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of the very last floor debates  of the year, and Republicans have decided to use it to eliminate  healthcare for millions of Americans, not by accident, but because they  simply don't care, because they are clueless. They are incompetent, and  they are unbelievably out of touch.\n\nThis Republican majority has done nothing for working people, nothing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Canada. Tariffs can be imposed in a smart and targeted approach. The  Trump tariff is nothing like that.\n\nMr. Speaker, I ask all citizens to contact the White House. Put it  simply: Don't hurt North American trade with Canada. It works. Don't  kill what isn't broken.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688376/tariffs-on-canada-are-foolish"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…coverage. This added cost is money that could be used to cover  weeks' worth of groceries, heat, rent, or mortgage.\n\nThis added cost is money that many individuals and families simply  don't have. They won't pay these prices because they simply cannot.  Instead, many will be forced to go without health insurance, which  raises the costs for everyone.\n\nVery…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…jobs across the country.\n\nThis bill is fundamentally cruel. Hardworking Americans don't deserve  to be treated this way by the Republicans in Congress, but the  Republicans simply don't care.\n\nMr. Speaker, I urge my colleagues in the strongest terms to join me  in voting ``no.''", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693185/one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…already a felony.\n\nBottom line, if you are a hardcore criminal, with or without  documents, you should be fried, period. The one thing about this bill  that is lacking is simply this: We don't talk about the big magnet.  What is the big magnet for people coming into this country? Jobs.\n\nPeople come to work. We need the workers. Wisconsin dairy farmers, up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…from the Federal  Treasury to insurance companies, and it fails to include a single  reform to stop the waste, the fraud, the abuse, or the corruption  because Democrats simply don't care.\n\nTheir fat-cat friends at the big insurance companies don't care  either because they get paid directly from the government either way,  and the Democrats want to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…meeting that demand and we are doing it in  a commonsense way by reducing those barriers to entry, whether it be  through banks, duplicate regulations, or the zoning laws that simply  don't work. This is good work by our chairman of the Committee on  Financial Services. Chairman Hill and Chairman Flood of the  Subcommittee on Housing and Insurance have really…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Democrats say would lose coverage, 4.8 million are able- bodied adults with no kids who could work, but don't. Another 1.4  million are in the country illegally and 2.2 million simply don't  qualify under the law already.\n\nMedicaid should serve the truly needy, not those who refuse to help  themselves. House Republicans don't cut Medicaid. That is not what…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692933/medicaid-should-serve-the-truly-needy"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…against H.R. 4, Democrats can only grasp at straws. Their  positions are weak, and their claims are even weaker. They will talk in  circles and just bloviate. In the end, they simply don't make any  points that are worth remembering. They will rail against H.R. 4 so  much that they say absolutely nothing.\n\nHere is the truth. If this rescissions package was…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…been laying  the groundwork for unleashing American energy. While Democrats may not  like to admit it, the United States is rapidly heading toward an energy  crisis where we simply don't have the supply to meet the demand.\n\nThe Washington Post noted last March:\n\nVast swaths of the United States are at risk of running       short of power as electricity-hungry…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Speaker, the question still remains: How many other such labs are  out there?\n\nAs my colleague from Fresno, Mr. Costa, just said on this floor, many  local communities simply don't have the ability to uncover these things  on their own. That is why we need a national framework. We need  national resources. We need more national oversight, and that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and  Florida, perhaps, as well as Virginia, Illinois, or Maryland, and  several others. It seems that hardly any State will be spared. Many  have said they wanted to but simply don't have time this year, so they  are waiting to do it until the next cycle.\n\nIt has gotten completely out of hand. It has gotten to the point  where we could get into this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…provide educational  resources and host public events that highlight the capital raising  tools available under Federal securities laws. These tools exist, but  many founders simply don't know how to use them or that they are even  an option.\n\nH.R. 3422 ensures that founders from all backgrounds and regions have  the information they need to pursue the capital…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}]