[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…to uphold the Constitution, told a reporter: ``I  don't know.''\n\nMadam Speaker, it has been 5 days of silence from my Republican  colleagues. I keep waiting to see if a single Republican will speak up  about this and denounce this horrifying remark.\n\nMy Republican colleagues: What has happened to you? You know that, if  Obama or Clinton or Biden had said…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690894/upholding-the-oath-of-office"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…and the  courts will likely tell him: You can't shut off the funding that we  appropriated and authorized.\n\nThis should matter to Republicans and Democrats. Every single one of  my Republican colleagues worked really hard to get this job, worked  really hard to become a U.S. Senator. Those of us who worked on these  bipartisan pieces of legislation worked…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this policy that  she was concerned about.\n\nIn fact, I offered an amendment to strike the awful AI provisions  from this bill. There was a debate on it, and every single one of her  Republican colleagues on the Rules Committee, every single one of them  voted against it.\n\nGet this: According to this article in The New York Times titled:  ``After Muscling…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…indication of taking.\n\nLooking at the names on the nonbinding resolution, a reason       for discouragement is that only 10 percent of House Democrats       and not a single Republican signed on. A less obvious problem       is that the signers are not speaking out for vigorous       American diplomacy to end the Ukraine war, which may be a       prerequisite…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…coordinated,  unanimous finding by the entire intelligence community. Our committee-- on a bipartisan, unanimous basis--reviewed it and validated it  extensively. Not a single one of my Republican colleagues objected to  its findings, including the current Secretary of State, then-committee  chairman Senator Rubio.\n\nAnd what did that assessment actually conclude?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…We stand union strong, labor strong, America strong, and worker  strong.\n\nMr. Speaker, I think it is notable, as we stand on this floor  tonight, that there is not a single Republican here to stand with our  workers.\n\nLet's be honest: When my colleagues across the aisle say that they  stand for American manufacturing and American jobs, they don't mean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…distraction and another smokescreen from House Republicans, who  are desperate to change the subject. I get why. After all, it was just  2 weeks ago that nearly every single Republican in this Chamber voted  for what may be the most shameful piece of legislation that this body  has produced in years, the GOP tax scam.\n\nMr. Speaker, it is bad enough…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, what we are seeing right now is nothing short  of a great betrayal. Donald Trump, president Elon Musk, and every  single Republican in this Chamber who voted to advance the Republican  budget resolution last night have been looking their constituents in  the face and lying.\n\nThey want to make cuts…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688241/republican-hypocrisy-and-gop-budget-plan"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the Inflation Reduction Act in 2022 under the Biden  administration. This law empowered Medicare to bargain for fair prices  for medications used by seniors.\n\nNot one single Republican voted for this bill in 2022. Let me say  that again. Democrats overcame the objections of congressional  Republicans and Big Pharma, who were complaining about how negotiating…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…files. I know my Republican friends are hoping  that they don't have to go on record because they don't want to get  Trump upset at them, but the bottom line is every single Republican  will go on record, and you will have to make clear whether you are on  the side of a pedophile or whether you are on the side of the victims.\n\nMr. McGOVERN.  Jayapal).…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…extend these  enhanced premium tax credits for 3 years. Despite 17 Republicans  standing up to Donald Trump and to their own leadership, I want to  point out that not a single Republican from Arizona's delegation chose  to put their constituents first and extend the lifesaving subsidies.  That is egregious, and that is unacceptable.\n\nThere is still so…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…multibillionaires are getting tax  cuts.\n\nLast night, I offered an amendment to let Trump's tax cuts expire  only for people earning more than $1 billion a year. Every single  Republican voted against it. What is that all about? Follow the money.\n\nMr. McGOVERN. Mr. Speaker, cult much? That gentleman's poster says it  all. It is not about American families.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…their last fake Epstein resolution.\n\nAll the while we already have a real, bipartisan bill to unseal all  these files. It is the Massie-Khanna bill. Last night, every single  Republican on the Rules Committee voted against that bipartisan bill,  every single one.\n\nAs if that is not bad enough, every single Republican on the Rules  Committee also voted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…freezers  and commercial refrigerators, that those bills are very important to  the House Republican Conference, that they are a top priority.  Interestingly enough, not a single Republican Member of Congress in the  last hour that we have had allocated for debate has indulged us with  their presence today to come to the floor and extol the virtues of the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…we see in Florida where I am from: poll taxes, voter roll  purges, and voter intimidation. That is what is diluting the voice of  American citizens.\n\nI haven't heard a single Republican in this debate talk about  ensuring that citizens who live in D.C. can have full representation in  Congress.\n\nWhere is that?\n\nI bring it up again. In every issue Republicans…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…applying the corporate alternative  minimum tax to partnerships. The corporate alternative minimum tax is a  fundamentally flawed, Democrat-enacted book minimum tax. Not one single  Republican voted for it.\n\nAs Republicans predicted, the book minimum tax has proven to be  highly complex and burdensome. Even President Biden's own Treasury  Department acknowledged…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…ObamaCare actually costs. You can see  it dramatically increased right about here, when enhanced subsidies-- the Biden COVID bonuses--was passed by the Democrats, with not a single  Republican vote in 2021, and then extended in 2022 and set to expire  this year. This is all of their own making.\n\nI mean, somehow, they have tried to shift the narrative here that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I will remind my colleagues across the  aisle that not a single Republican has ever voted for ObamaCare. This  is your plan. You put it into law. It was a disaster then. It is a  disaster now. It was more expensive now than it has ever been,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…were used in enrollments after the date of that  person's death, signing them up after they were dead.\n\nIt is OK with the Democrats and the ObamaCare people, but not a  single Republican voted for it.\n\nOne Social Security number was used repeatedly to enroll people into  ObamaCare policies, and the fraudsters used it 125 times.\n\nAll together, investigators,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…subsidized zero claims is fascinating. The enhanced  subsidies that came out after COVID were only supposed to be 5 years.  The Democrats voted for this. I don't think a single Republican did. It  was their plan. This was Democrat policy, and now they are acting all  uppity saying: Well, you Republicans need to fix our mistake.\n\nAlmost 11 million who were…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Reduction Act of  2023, Democrats sent temporary taxpayer-funded enhanced premium tax  credits directly to the coffers of big insurance plans.\n\nThey did this without a single Republican vote of support. On both  occasions, Democrats chose to make these COVID credits temporary. They  could have made them permanent, but they chose instead to focus on…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…era premium tax credits that are expiring at the end of this month.  Since we are talking energy tonight, we need to understand that they  were set to expire, without a single Republican vote, to expire them in  the Inflation Reduction Act, which was spent money on the Green New  Deal.\n\nSo when you put in context what President Trump said--when the  premium…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…that the Senate will move quickly to get it over the  finish line and onto the President's desk. The country cannot afford to  get this bill wrong, and I trust that every single Republican is  committed to getting it to the President as soon as possible and  helping America win yet again.                       NIH CUTS HARM OUR CONSTITUENTS\n\n(Ms. Dexter…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…listening to  President Trump's speeches saying, man, we really love government  bureaucracy and all the great things it does for the people.\n\nNobody runs on that. Not a single Republican has run on increasing  deficits. Every single Republican has run on balancing the budget. Yet,  every year, we vote for more spending. Every year, we vote for more  debt.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Monument                             Establishment Act\n\nMr. President, today, I am also disappointed. There is a bill that is  a very simple bill that literally every single Republican has released  and said: We want to be able to move this.\n\nThis is recognition of a national monument for the Historic Greenwood  District in North Tulsa. In 1921, on…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that in more than 25  districts, more than a third of the constituents rely on Medicaid. That  includes Republican Nick Begich's and  Robert Bresnahan's districts.  Not a single Republican had the courage to stand up for their  constituents.\n\nThe people are showing up in our offices to demand that Republicans  listen to them. Some are protesting in their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…on rules and trying to be able to make this Senate  work.\n\nMr. LANKFORD. Mr. President, I want to bring a unanimous consent  request, but I would say I represent--every single Republican is in  agreement to this. Every single Republican was ready today to be able  to move on what was an agreed-upon bipartisan agreement--not by all;  understanding that.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}]