[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…all to the  Federal obligation here.\n\nThe House passed the Arkansas Valley Conduit Act last July, and the  Senate passed it just 3 weeks ago, with the support of every single  Member of Congress--every Member of the House, every Member of the  Senate. There is almost nothing that ever gets through with that kind  of universal bipartisan support.\n\nRepublicans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…orders. They said ICE ``has  likely violated more court orders in January 2026 than some Federal  agencies have violated in their entire existence.'' That should give  every single Member of this House pause. It is certainly my red line,  and I think it ought to be a red line for this whole body.\n\nMr. Speaker, it is not just DHS funding. This package also…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…U.S. 1 (2009), and determined       that a minority group must be geographically compact enough       to constitute more than 50 percent of the voting population       in a single-member district to be protected under the Voting       Rights Act. See also Thornburg v. Gingles, 478 U.S. 30       (1986). Opportunity and coalition districts are premised on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…amendments anymore. They don't give people time to  write them. Everybody kind of knows that the system is rigged. It is  take it or leave it.\n\nPeople have had it. Every single Member here has ideas that maybe  could improve some of this legislation, but the whole system is rigged  in a way that you have to take it or leave it. This is not the way the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…about the importance of SNAP and feeding our young  people. We represent rural districts and urban districts, communities  of means and communities without. There isn't a single Member of  Congress who does not represent families who rely on SNAP's food  supports to make ends meet.\n\nWe all represent families that are getting squeezed by higher costs,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…hearing after hearing is: Can anybody give me a reason why  we should use our tax system and lose our tax dollars to incentivize  Americans buying Chinese stocks? And not a single member can give a  reason. Not a single witness can give a reason why we should do that.\n\nWe forgo hundreds of millions or billions of dollars in taxes on the  gains people earn…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…this country.\n\nThe reason that is happening is clear. Current veterans' benefits are  not keeping pace with the increased cost of living. That should cause  alarm to every single Member of this body.\n\nThe benefits our veterans received after they served our country are  not gifts or handouts. They are part of a sacred obligation to ensure  that those who…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…community safety groups across  America.\n\nI introduced an amendment in the budget reconciliation process in the  Judiciary Committee to restore all of that money. Not a single Member,  neither a Democrat nor a Republican, spoke against it, and my  Republican colleagues did not say a word, but they all voted against  it. They voted to uphold that nasty…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Secretary a week ago, and,  to date, he has still not provided access to all Senators.\n\nSo, ahead of tomorrow's briefing, we need to be clear about one  thing: Every single Member is entitled to see the full, unedited video  of what happened during the series of strikes on September 2. Anything  less than full access for every Senator would be unacceptable.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…on that point.\n\nWe are public servants. We are called to lead with compassion, to  feed the hungry, and to care for the sick.\n\nMr. OLSZEWSKI. Mr. Speaker, there isn't a single Member of Congress  who doesn't represent families who rely on SNAP or Medicaid to make  ends meet. It is simple. These cuts will lead to suffering, and we must  stop them.\n\nI…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691942/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…from Florida obviously understands, the issues here  are bigger than any one of these nominees. The issues are more  consequential than the career or advancement of any single member of  the Department of Defense team. This Secretary seems more concerned  with his own public image than the safety of our servicemembers because  he has violated basic…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…13th Congressional  District to lower costs, to keep them safe, and to make sure that they  had affordable, accessible healthcare coverage.\n\nMr. Speaker, I encourage every single Member of this Chamber to do  those things, not only for the people in my district but for the people  all across America who are asking and needing Congress to act.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…district  represented by the assistant Democratic leader,   Joe Neguse.\n\nKayla, I can say to you that your Congress Member is fighting hard to  protect you, just like every single member of the House Democratic  Caucus.\n\nAshley writes to us from Colorado and says: ``My life was saved by  the Affordable Care Act. Because of this act, I was able to stay on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…healthcare through  ObamaCare, which is now accepted as an important element in our  healthcare system, every person on that is in incredible jeopardy.\n\nAnd I know that every single Member of this Senate is very concerned  about access to healthcare for the people they represent. There is no  alternative for folks out there that is even being discussed if…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and over and over and talked about the  adoption of technology, about redesigning government.\n\nWe have bills that actually would save $3 trillion, and I can't get a  single other Member of Congress to sponsor them because they are hard.\n\nI will get lobbyists who will say mean things about me.\n\nSo let's keep just doing the shiny objects. Let's just keep…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…will say, one thing we know about Scripture is that we are supposed to  give honor where honor is due, and that is what we do on this side of  the aisle.\n\nI thank every single Member of the House Republican Conference for  pouring their time and their heart and their expertise and experience  into this process. I thank all of our amazing staff members,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…people.\n\nThe American people might be okay with such a regulation if it was to  have a meaningful, positive effect. Everybody wants to protect the  environment. I can't name a single Member who doesn't. As policymakers,  we have to ensure that regulations are pragmatic and balance the  inherent trade-offs. That is what policymaking is about. That is what…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…fifth generation to grow up and work on my family farm, I  understand the weight and pride our Nation's farmers have in feeding,  clothing, and fueling the world. Not a single Member in this body wants  to see people go hungry, and I am personally offended by these lies.\n\nWe want families to be able to put food on their tables. The  difference is, Mr.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and nearly unanimously  rejected by the House of Representatives. Look at the vote total. A  grand total of three people, including the author, voted ``yes.'' Every  single other Member, Democrat or Republican, over 400 Members, voted  ``no.''\n\nThis sent a very important message regarding what was being suggested  with this proposal, that one of our…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…come to our country to steal from  the American people, you ought to be deported; and if you have somehow  gained American citizenship, you should be stripped of it. Every single  Member of this Chamber should support this legislation.\n\nThe era of rampant fraud is over. Under President Trump, we are going  to continue to put the American people first.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…wouldn't be here discussing this if it wasn't  for him and his partner on the other side of the aisle, and I am so  grateful for their leadership and recommendations. Every single member  has made this bill so much better. It has shaped this bill, and I am  grateful for the contributions. I do need to thank again my dear  friend--and we have had some tough…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Atlantic Treaty in the works, the question actually got more  specific: Would the American people support ``a promise of mutual aid  from all the members of the alliance if any single member nation is  attacked''--``if any single member is attacked''?\n\nThat was a higher bar--the commitment that would become article 5-- and yet an even bigger majority of recipients…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]