[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Security, and Medicaid. Hundreds more wrote about the  rising costs of childcare and housing. Many have asked me to stop the  scourge of gun violence in our communities.\n\nNot a single person, not one, wrote about loosening regulations on  their commercial walk-in coolers and refrigerators.\n\nWhy, then, are those the bills that Republicans brought to the floor…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689192/addressing-constituents-most-important-issues"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…mosque, gonna throw some rocks . . . ; time to turn  Iran into a parking lot.''\n\nWe shouldn't premise a decision to send our sons and daughters into  war on the judgment of a single person.\n\nThe President patted himself on the back, and he compared the attack  to Hiroshima and Nagasaki. That was a most unusual--most unusual-- comparison.\n\nI haven't put all…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…going to go down and choose the path of democracy, or will we allow  ourselves to choose the low road of autocracy?\n\nI believe that this country has come too far to allow a single person  to declare war without conferring with the Congress of the United  States of America.\n\nThis is why I stand. This is what I will do, and I do it in the name  of my country…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…because we believe, as Democrats, that in the United  States of America, healthcare should not simply be a privilege.  Healthcare is a right that should be available to every single person  in the United States of America.\n\nThis bill is an all-out assault on the healthcare of the people of  the United States of America, hardworking American taxpayers. These…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…responsibility to protect that because that is not about us. It  is not about who we represent. It is about how our country can operate  with a democratic system where every single person, through their  representatives, has a seat at the table.\n\nSo I urge all of us to take a look at what our constitutional  responsibility is. Whether we agree or not on…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Affordable Care  Act expiration of those premiums--may cost American families. The  answer is, it is going to hurt a lot. The new report found that out-of- pocket premiums for a single person would more than double on average  next year if the enhanced premium tax credits expire.\n\nThat is, we have had insurance commissioners and various offices  across various…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and yet, still, we rise.\n\nBlack brilliance exists in every corner of this Nation, from the  stage to the court to the classroom to the Halls of Congress. I want  every single person, certainly every single child who calls this Nation  home, to walk into our Smithsonian museums including our beautiful  Blacksonian and see our collective history, accurate…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…children who are citizens being spirited out of the country.  This ought to be concerning to all Americans. It is not about them  anymore. It is about us. It is about every single person who is in  danger of being treated in such a way that you have no way to say to a  judge: I am a citizen.\n\nHow can you say to a judge that you are a citizen or not a criminal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…because he is insistent on extending an overreach  of the executive branch. We have the courts to safeguard that.\n\nWhat the Republicans are trying to do is to require every single  person who has been harmed in any way to file individual lawsuits,  clogging up our courts, requiring them to hire expensive attorneys,  precluding their access to the courts.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689780/role-of-the-judiciary"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…has played and to find some outside idea that he has somehow  cheated the city of Chicago or the people of the city of Chicago--are  you kidding?\n\nThere has not been one single person that has stood up in Chicago and  said that there should be some sort of punishment for our great friend.  I mean, he has been there every day of the year helping people,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…trafficking organization or involved in directly  purchasing access to young women through Jeffrey Epstein or directly  abusing young women proffered by Jeffrey Epstein--every single person,  let the chips fall where they may. No matter how rich the person is, no  matter if they held office in the past, no matter if they aspire to  office in the future or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…increase crime. The data on this is       clear. A study conducted by the DC Criminal Justice       Coordinating Council found that in a recent six-month period,       not a single person released after being charged with a       violent or dangerous crime was rearrested for a violent or       dangerous crime during their pretrial release. Similarly,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…trillion of American treasure spent.\n\nThat is why the Founders said the consequences of conflict, of  entering into war, are so significant they must never be entrusted to a  single person, not even the person who sits in the Oval Office. That is  why they wrote the Constitution, placing the responsibility for that  here where it can be wrestled with; where…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Social Security's  Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security  office is common sense, and it will enable a victim to unravel their  problems a lot sooner.\n\nI just want to make note of the fact…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…much that NICU bill was because I was one of the  lucky ones who had health insurance to cover that stay. On average, a  NICU stay is $70,000 a day. That is more than a single person who  qualifies for the enhanced premium tax credits under the Affordable  Care Act at the maximum rate of 400 percent of the Federal poverty line  makes in a year. That…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…company was under a specific contract that required it to  notify the Senate Sergeant at Arms about subpoenas related to Senators.  I think Verizon forgot that.\n\nYet not a single person at Verizon or any of the carriers lost their  job because of this. I went down the road: Has anyone been fired? The  answer was no and no and no, not a single person.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…They need our help.\n\nThis is an American problem. It will not go away. With the  advancements of technology that we are seeing today, they will reach  out and touch every single person they possibly can because it makes  them money.\n\nThis is like cancer, unfortunately. If cancer does not touch you or  your family, you don't want to recognize it. You will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…think when folks understand, the subsidies aren't going away  entirely. If a person is a low-income individual and making 100 percent  of the Federal poverty line--and for a single person, that is maybe  $15,000 or $20,000 a year--that plan will only require that person to  pay a few hundred dollars a year.\n\nJust by moving it so it doesn't go to zero dollars…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…discussion here today.\n\nMr. Speaker, I have listened to my colleagues defend the  indefensible. I have heard everything from this is old news to this is  just politics. Not a single person has disputed the key fact: written  records in Epstein's own estate documents show Delegate Plaskett sought  his input for an official hearing.\n\nThis is the issue, that…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…own  citizens.\n\nWorst of all is my own State of California, which became the first  State in the Nation, the only State in the Nation, to provide free  Medi-Cal to every single person in our State illegally.\n\nIt was recently revealed that this is costing California taxpayers  $9.5 billion this year alone. Right now, we are talking about costs  over a…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…are bipartisan, from liberal Democrats to conservative  Republicans.\n\nWe worked hard to get this bill passed for over a year, and it passed  the House by voice. Not one single person objected to this. Why?  Because why wouldn't you want to allow kids, our kids, an opportunity  to simply have the same opportunity as adults do with cancer? It is  called…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…would let my colleague know that just one-- because he said Canada plays almost no role in fentanyl deaths--one 70- pound bust of fentanyl alone was enough to kill every single person in  New York City. Again, my colleague is unwilling to acknowledge that  this is about fentanyl, because that is literally what the executive  order says, and unwilling…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…a corporate tax rate  decrease, they have shown me their books, and the areas that they  prioritized were to increase wages for their frontline workers. They  said every single person at the firm got a pay increase. They grew real  wage growth without massive inflation that takes place sometimes under  a reconciliation bill.\n\nI will point to the American…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…President can have the power to put on tariffs. It never says that.  This will be an extraordinary use of something never intended to be a  way to have--unilateral--one single person invoke a tax on the people.\n\nWith regard to tariffs, let's be very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish American  families.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…It is the flag we wear, the training we have, and the meritocracy  which should always exist. I will continue to fight for every member of  our Armed Services and every single person to know that it is the  American flag which will fly high and proud. We will defend her against  all enemies, foreign and domestic.\n\nMr. Chair, I yield back the balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…into a legal  situation involving war without the body as a whole making that  decision. But when it comes to how to use the military, when to use the  military, we have a single person who does that. That is the Commander  in Chief, and that person can be limited by Congress's ability to cut  off funding for military operations they don't approve of.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Yet, the demagoguery on this issue has really gone over the top, and  it is really frustrating, as a person who actually understands  Medicaid, that we are not cutting one single person out of that program  who truly qualifies for that program.\n\nThe only people who will be out of that program or ``lose  healthcare'' are people who lied on their applications…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…credibility of Indian Country as a whole.\n\nThe OFA has found that some petitioning groups consisted entirely of  individuals unable to demonstrate Native American ancestry, not a  single person. Recognizing these groups would be a disservice to  legitimate Tribes. In the case of the Lumbee, this amendment would in  one stroke create the largest Tribe in the country,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…hiring people based on merit,  for opening new power plants, for living in peace, for the signing of  the Abraham Accords, and for returning manufacturing to America.\n\nNot a single person stood. That is kind of the most incredible thing,  that there was a willful decision to sacrifice any individuality to the  orders being given by party leadership.\n\nIt…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]