[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…engagement, just common sense,       maximum lethality and authority for warfighters.\n\nHe then gave them an ultimatum:\n\nIf the words I'm speaking today are making your heart sink,       then you should do the honorable thing and resign.\n\nSecretary Hegseth demands military leaders conform to his  interpretation of the law or be dismissed. This is profoundly…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…firefighters. They are getting run out of town now. I  don't hear a lot about Elon Musk. He has lost some elections for my  friends across the aisle, so they are trying to let him sink into  anonymity, but he has done his damage.\n\nOver at the Department of Justice--and I have got to correct myself.  I was saying that his employee, who I can identify now as…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…move to release the Epstein files a  Democratic hoax, he said it was designed to get the American people to  focus in on something that was irrelevant.\n\nMr. Speaker, let that sink in. If you listened to the survivors who  were in front of the Capitol just a few minutes ago and listened to  their horror stories, that is irrelevant? That the President of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…told that the White House,  Stephen Miller in particular, stripped my amendment from the bill. This  means that Donald Trump does not want to protect U.S. citizens.\n\nLet that sink in, Mr. Speaker.\n\nDonald Trump does not want U.S. citizens protected from being  detained and deported by ICE.\n\nThe Trump agenda has never been about apprehending and deporting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699352/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…racial or ethnic groups.\n\nAccording to the American Cancer Association, colorectal cancer is  the leading cause of cancer deaths in men younger than 50 years of age.  Let that sink in. This is a disease that, if caught in time, doesn't  have to be a death sentence.\n\nAccording to the American Cancer Society, there are 9,720 new cases  of testicular cancer…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…children.\n\n``I wish I didn't have to worry about these things,'' the student  said. So do I and so should anybody in this body with an ounce of  compassion. These are kids. Let that sink in, and let's do what we need  to do to truly protect students.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…every day. Twenty thousand of those  families live in my district. Eighty percent of those households  include a child, a senior, a disabled person, or a veteran. Let that  sink in.\n\nSNAP isn't a luxury. It is essential. It provides $6 a day in food  assistance to hungry Americans, just $6. It is a small amount, but it  is enough to lift up millions…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…kids.\n\nThat is exactly what this program was doing before President Trump  and Elon Musk actively decided that it was not worth continuing.\n\nAll too often it is, unfortunately, sink or swim for disabled  students after high school in America. Students and their families are  left behind despite being promised that their school would get their  child on…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…hundreds more border officers and judges. It was coming through the  Senate. That was the one at the end of 2024 that was sailing through  Congress when President Trump decided to sink that legislation and  said, essentially, that he didn't want a border compromise bill for  more effective enforcement there, that he wanted a border crisis to run  against.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…on a college campus. Mia Tretta was shot as a teenager at Saugus High  School and survived, and now, she has lived through yet another school  shooting at Brown.\n\nLet that sink in: Two shootings in one lifetime, all before  graduating college.\n\nWe cannot allow ourselves to become numb to this. This level of  trauma is not normal. It is not inevitable.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698338/school-shootings-are-not-inevitable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican bill a ``disgusting abomination.'' Let me repeat that, a  disgusting abomination. He said: ``Shame on those who voted for it. You  know you did wrong.''\n\nNow, let that sink in. Let that sink in. Elon Musk, the man who spent  hundreds of millions of dollars to elect Donald Trump and other  Republicans, is now saying Members should be ashamed of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…families already struggling to put food on the table every day.\n\nMr. Speaker, 80 percent of these households include a child, a  senior, a disabled person, or a veteran. Let that sink in.\n\nSNAP provides $6 a day in food assistance to hungry Americans. It is  a small amount, but it is enough, Mr. Speaker, to lift millions of  Americans out of poverty and to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691942/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…absolutely must put a price on carbon. And so I, when I met  with the Europeans and the Brits and the Australians, said to them: You  have our last lifeboat. Don't let Trump sink it for his fossil fuel  donors. What is the last lifeboat? It is called the carbon border  adjustment mechanism. It is a global price on carbon that comes from  tariffs. It…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…are over 53 million Americans who currently  provide uncompensated care for their families, which provides an  estimated $600 billion in uncompensated care each year. Let that sink  in.\n\nBy protecting the health of caregivers, respite care decreases the  need for professional long-term care and allows individuals who require  care to remain at home.\n\nI…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to Trump's DOJ. They are losing faith because of bills like  this, which force every State in America to give their voter rolls over  to DHS Secretary Kristi Noem.\n\nLet that sink in. She is probably one of the least trustworthy people  in the country right now. I wouldn't trust Kristi Noem to tell me the  correct time, and we are asking States to turn…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…every day.\n\nMr. Speaker, during the time period of 2013 to 2021, several pipeline  projects were canceled, leading to a pipeline capacity growth of only  26 percent. Let that sink in. Meanwhile, natural gas demand has  increased by 49 percent. Do that math.\n\nThis trend will be compounded if there are not statutory reforms. It  is absolutely dishonest…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Silverman, Ellie: Washington       Post; Simao, Paul: Thomson Reuters; Simon, Erica: New York       Times; Simoni, Alberto: La Stampa; Singh, Kanishka: Thomson       Reuters; Sink, Justin: Bloomberg News; Sisk, Richard:       Military.com; Sivak, David: Washington Examiner; Slack,       Donovan: USA Today; Slater, James: Agence France-Presse;       Slattery,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the  United States of America from imminent threats.\n\nHow imminent is this threat of drugs? Mr. Speaker, 365 days a year, 7  days a week prior to President Trump starting to sink their boats that  they were bringing to the United States of America, that is as imminent  as it gets. It is as imminent as the Sun rising. That is how prevalent  that threat…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…or hoping that there will be enough other Senators who will  say: I guess we have to take it or leave it; so let's let it all pass.\n\nThey might say: Are you really going to sink all of this important  work just for one section of this much larger bill that you disagree  with?\n\nWell, look, taken to its logical conclusion and repeated, over and  over…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…United States have also been targets  of Iranian terrorists.\n\nRecently, Iran threatened to activate its so-called sleeper cells  right here inside the United States. Let that sink in. This is an  urgent reminder that national security starts with border security.\n\nUnder Joe Biden and the Democrats, more than 1,500 illegal immigrants  from Iran crossed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the next 10 years, we borrow as much as we did the previous 240 years.\n\nOkay, this has got to be the dozenth time I have said this on the  floor, and I can't seem to get it to sink in, but that is the  underlying math.\n\nWhat should also be scaring people to death, yet the hallways are  full of people coming into our offices demanding more money, the United…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fairly well, but  it is the scale of the debt because we keep spending and spending and  spending.\n\nLet's actually do some of the charts to try to see if I can get this  to sink in.\n\nNext year, for every dollar of tax collection, we are going to spend  $1.43.\n\nLet's do that again. For every dollar in tax collection next year,  starting in a couple weeks,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…``SUBCHAPTER II--NON-BARGE VESSELS       ``Sec. 4710. Definitions\n\n``In this subchapter:\n\n``(1) Abandon.--The term `abandon' means to moor, strand,       wreck, sink, or leave a covered vessel unattended for longer       than 45 days.\n\n``(2) Covered vessel.--The term `covered vessel' means a       vessel that is not a barge to which subchapter…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…difference whatsoever.\n\nThe President of the United States has ordered the troops, when they  determine that there is a boatload of these drugs headed for the United  States, to sink the boat and put it on the bottom of the ocean.\n\nNow, I am the senior Republican on the Intelligence Committee and,  obviously in this setting, I can't tell you the method or…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…for his comments.\n\nMr. Speaker, the CLASS Act prohibits K-12 schools from accepting  funds or contracting with the People's Republic of China or the CCP.  Let's just let that sink in for a second. My  honorable friend on the other side of the aisle is literally defending  the Chinese to invade our schools. That is what this is about.\n\nIt will also prohibit…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…staff, and the  public to understand the scale of what we are up against.\n\nThis basically just reiterates what I am going to show a couple of  times here because I need it to sink in. If we do the Senate  reconciliation budget with our baseline, we double U.S. debt in 10  years. I am going to say it a couple of times so it sinks in. Debt held  by the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…effective replacement for plastic lures. The worm-shaped lure, made  from a biopolymer recipe, could substitute for traditional soft plastic  lures which can break off hooks and sink to the bottom of waterways.  Mr. Albright cites his early memories of swimming and fishing on the  Susquehanna River with his father as the driving motivation for his  desire…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}]