[{"senator": "Al Green", "party": "Democrat", "sentence": "…country. His incivility is overwhelming our  civility. We cannot allow this. That act of incivility was in direct  response to the President's incivility.\n\nMr. President, you, sir, were wrong when you pointed to the Members  of Congress and called them lunatics, Democrats, I might add, you  called them lunatics.\n\nThe President hasn't been sanctioned.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…them, but I am  prepared.\n\nWe hold public trust. Those persons who participated in this coverup  are not persons worthy of holding public trust.\n\nMr. Secretary of Defense, you, sir, should not hold public trust. You  are not the person to determine whether something is classified or not.  You have demonstrated, wittingly or unwittingly, that you are not…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…He didn't do so well because he got convicted, but he is the  guy who would have to sign off.\n\nSo I will sum it up this way, Senator Merkley--and I have a question  for you, sir. My colleague from Hawaii said it perfectly yesterday.  Here is the quote:\n\nThere is enough money to bail out Argentina with $40       billion.\n\nBy the way, for people who don't…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…safeguard and not as a  constitutional role or duty of democracy but as an inconvenience of  power, an inconvenience of having the audacity to do our jobs and to  make sure, yes, sir, that you are doing yours, because that is a part  of our responsibility.\n\nIt is what we take our oath of office for. It is what the  Constitution and the Framers of the United…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692931/holding-power-accountable"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Enough moments of silence. These moments of silence don't save a  single, solitary life.\n\nNow is the moment in time that we must act to save our generations.\n\nMs. McCLELLAN. Sir'Antonio Brown, a 6-year-old killed near his Kansas  City home by guns.\n\nKing, a Georgia 9-year-old killed by another child handling an  unsecure gun.\n\nMs. McCLELLAN. Jakobe…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of violence, sedition, and treason.\n\nTrump has called those who stormed the Capitol ``unbelievable  patriots.'' Mr. Speaker, 435 of us ought to be on this floor saying:  No, sir. It was unbelievable violence and sedition.\n\nI call those unbelievable patriots what they are: criminals convicted  of such, insurrectionists, cop killers, cop beaters, and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…congratulating Patriarch Bartholomew for  receiving this year's Templeton Prize. Established in 1972, the  Templeton Prize honors individuals whose exemplary achievements advance  Sir John Templeton's philanthropic vision: harnessing the power of the  sciences to explore the deepest questions of the universe and  humankind's place and purpose within it. At…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…finish,       yes.\n\nMr. Griffith. I don't have the floor. I have been yielded       time, so I have to finish and then I yield back----\n\nMr. Carter of Louisiana. Fair enough, sir.\n\nMr. Griffith. ----to the chair.\n\nAnd so I can't speak for the administration on this. That       is a whole different ball game.\n\nBut what we are debating tonight is the bill…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeached, you ought to be convicted, and you  ought to be removed.\n\nI am one of the people. I am one of the people. We, the people of the  removal movement, believe that you, sir,  should be an example of what a righteous government will do when a  person who would subvert the Constitution has slithered his way into  office.\n\nYou, sir, should be the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…receive the Templeton Prize, the world's most prestigious international  award at the intersection of religion and science. This honor is  awarded annually to those who advance Sir John Templeton's vision of  progress in religion through discoveries and insights that deepen our  understanding across faiths. Since being elected Ecumenical Patriarch,  Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…tyrants and preserve our  Constitution.\n\nMr. Speaker, I am not sure if you found this funny or if you are  laughing at a joke that is on your phone, but this is serious business,  sir.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…authority.\n\nBut through all those unprecedented and dangerous decisions, what has  been the response from the Republican majority in Congress--both the  House and the Senate? ``Sir. Yes, sir.'' Maybe not quite, but their  silence has equaled acquiescence. Congress, under this Republican  majority, is nowhere near acting like the ``equal branch of  government''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…programs that they are going to be slashing for families. That is  outrageous, cruel, unacceptable, and we have to do everything we can as  a people to stop it.\n\nMr. BOOKER. Yes, sir.\n\nMr. BOOKER. I was reading stories, and many of them will live with  me. There is a family who is taking care of their two parents in their  nineties and their disabled adult…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…meet John Lewis for the first time in person. He called  me over to see him on the House floor. He just asked me a simple  question. He said: Are you the new guy?\n\nI said: Yes, sir, Mr. Lewis, I am.\n\nHe said: Well, we are colleagues now. You don't have to call me Mr.  Lewis. You can call me John.\n\nI said: Yes, sir, Mr. Lewis, I understand.\n\nThen he said…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…chaired by somebody who calls the opposition stupid, to hear our  motivations as we stand up for a fundamental constitutional prerogative  mocked through ad hominem attacks, shame, sir. Shame.\n\nWe are here because we are standing for our constitutional right to  be consulted on the most consequential decision that the United States  can make: whether we engage…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…do.\n\nToday, we make history as this is the first time a West Point  graduate will succeed another West Point graduate for the exact same  congressional seat, so respectfully, sir: Go Army, beat Navy.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…blue-collar Joe Bag of  Donuts, which is Youngstown and Akron and Canton and Cleveland and  Pittsburgh. These are working people that they have forgotten.\n\nThey bring up electricity, sir, but they do not allow us to address  power plants. They shut down coal plants. They put regulations on gas- powered generated plants, but then they say there is an electricity…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Mr. KNOTT. Madam Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. KNOTT. Will the gentleman yield?\n\nMr. KNOTT. The issue with your characterization, sir, is number one,  someone who enters illegally must be convicted of illegally entering  the country. Then they must be convicted of illegally reentering the  country to get a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…with  kids' lives. He is literally killing kids in front of us because of his  political movement, and it is ridiculous.\n\nMr. MULLIN. Just speaking the truth.\n\nMr. MULLIN. I am, sir.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…all honor as American patriots? The one thing that we know about the  Pride flag is that it represents only one portion of those who serve.  That is not called inclusivity, sir. That is called division. That is  why for the first time since the previous administration took over, we  have actually hit our recruitment numbers in every single branch.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…These monuments serve as symbols of all the values the Scottish Rite  stands for.\n\nI thank the generous donors: Illustrious Brother Albert Nelson, Jr.,  and Lady Nellie; Dr. and Sir Knight James Arnold and Lady Barbara;  Illustrious Brother Charles White and Lady Nordene; and Brother Morgan  Derst and Lady Pam for their kind contributions.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…a closed society. They said the  number had even jumped to 20,000 victims by 2018.\n\nAt another hearing about forced organ harvesting in China, we heard  expert testimony from Sir Geoffrey Nice, who conducted the world's  first global independent legal analysis of forced organ harvesting from  prisoners of conscience in China.\n\nSir Geoffrey Nice said…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…when it isn't.\n\nThe antics of some of Yosemite's employees dishonor the silent  majority at the park, who are genuinely devoted to public service.\n\nAs Hamilton said: ``Here, sir, the people govern.''\n\nAll 2.4 million employees in the Federal workforce exercise powers  delegated by the President through our Constitution by virtue of his  election. Any…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…say this not just for ourselves, but for the murdered, for the  lost, for the forgotten, for the unseen victims of crime across our  country.\n\nMr. HIGGINS of Louisiana. Yes, sir.\n\nMr. HIGGINS of Louisiana. Mr. Speaker, I thank the gentleman from  Texas for yielding me additional time to address these issues.\n\nOur sovereign border, Mr. Speaker, our southern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…retain some of these programs under the new banner  of national security investment programs at the State Department under  the direction of Secretary Rubio.\n\nThe bottom line, sir, is if it is not having to do with our national  security interests, we are not funding it. We fully fund CFIUS to stop  foreign threats from buying up America, keep longstanding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "Mr. HIGGINS of Louisiana. Mr. Speaker, let's have a candid  conversation if we could, sir, with my colleague across the aisle about  what is happening here.\n\nCongress and America, we need to clarify for the citizens watching,  Mr. Speaker, Congress has a unique authority,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…heard over and over was this: Keep pressing  forward, unrelenting, undeterred, and unapologetic, to advance the  America First agenda.\n\nMy response, Mr. Speaker: Yes, ma'am. Yes, sir, as sure as the Sun  rises, we are just getting started.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}]