[{"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise to recognize Sister Teresa Lynch, who  will be retiring from Santa Ana's Saint Anne School.\n\nShe served as a teacher for 31 years and principal for 19 years at  Saint Genevieve and Saint Anne…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693061/recognizing-sister-teresa-lynch"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…In With  Bishop--platforms through which he taught, encouraged, and lifted up  his community during seasons of trial and renewal.\n\nIn 2009, following the tragic loss of his sister, Bishop Williams  convened leaders at Albany State University and asked, ``What can we  do?'' Out of that conversation grew a sustained, collaborative response  to violence…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, today I rise to celebrate the 90th birthday  of Irmgard Hermann Davis.\n\nIrmgard grew up in Germany during World War II. After the war, she  came to visit her sister in Garden Grove, California, my district,  where her life changed forever.\n\nShe met Wally Davis. They got married and had seven beautiful  children. She never returned to Germany.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694152/irmgard-hermann-davis-90th-birthday"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Do not wait until the  next shooting is in your neighborhood. Do not wait until it is your  constituent, your relative, your friend, your fraternity brother, your  sorority sister, your neighbor, your colleague, your loved one.\n\nMass shooters don't care about your party. They don't care about your  socioeconomic status. Unfortunately, they often think…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the Baptist church, we have come a mighty long way. From 1971, when  13 Members sat on this House floor, 12 Black men from across this  Nation and one brave, courageous, bad sister, Shirley Chisholm. My,  have we come a long way.\n\nWe come tonight, and we speak truth to power in this most  unprecedented time in our Nation's history: a time when we are…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…we are watching, again, folks choose billionaires over  the people who elected them.\n\nWe must raise our voices, and I am glad and so incredibly happy to be  serving with my sister in service, Representative Ramirez. We must  raise our voices again because we have to defeat this dangerous  Republican budget. Again, our residents deserve better.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…journey began at Ebenezer, and  despite receiving her calling many times, she initially ignored it.  However, with strong encouragement from Reverend Dr. Albert P. Jackson,  her sister Jeanette, other family members, friends, and her late  brother, Rice, Reverend Carr became inspired and felt a strong urge to  fulfill the calling she had long ignored, thus…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…America, and ultimately,  the United States. Each chapter reflects the complex and vibrant story  of a city shaped by shifting borders and strong people.\n\nToday, Laredo and its sister city, Nuevo Laredo, form the Dos  Laredos--creating the largest inland port in both the United States and  Mexico. This dynamic economic engine is a hub for land, rail, and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Immigration Legal Services program.       Rian, formerly the Irish Immigration Center and the Irish       International Immigrant Center, was founded in 1989 by an       Irish nun, Sister Lena Deevy, and a group of volunteer       attorneys, to serve Boston's undocumented Irish community.       Over the years, Rian has transformed into a vibrant center…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…the House, which is signing their names to  that discharge petition and voting for their constituents and  healthcare that is affordable for all Americans.\n\nStansbury), my ``sister''; ``hermana.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…in her  footsteps. She was also a fierce advocate for women's equality in the  workplace and in society. She credited her mother and grandmother for  encouraging her and her sister to pursue an education and pursue  careers they could be passionate about.\n\nI have known Sepi for more than 20 years, both personally and  professionally. We collaborated on…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…are fortunate they can afford it, but that  affordability does come at a cost. Between paying for their premiums,  their son's college tuition, and caring for her disabled sister,  Deborah's husband, a dedicated public defender, now works weekends just  to keep up.\n\nAs Deborah told me: Even work you love shouldn't require you to give  up every day of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…morning, I will join with over half a dozen women who endured  unimaginable horrors because of Jeffrey Epstein. I will also join with  Sky and Amanda Roberts, the brother and sister of Virginia Giuffre, the  late Epstein survivor who spoke out on behalf of so many.\n\nI am wearing this blue butterfly to show solidarity with them.\n\nToday, we will introduce…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Turner (David Gatch) of  Prattville, Alabama, Curtis Parham ``Bubba'' Redding (Dawn) of  Cuthbert, Georgia, and John Melton Redding (Amanda) of Baton Rouge,  Louisiana; and his sister, Gail Redding Corlee (Leonard) of Georgetown,  Georgia. ``CP'' also leaves behind seven grandchildren, nine great- grandchildren, two great-great-grandchildren, and numerous…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy since the 2010 Olympics. They have really had a plan  and strategy that is remarkable.\n\nCheck out a city in Europe called Szeged, in Hungary. That is Toledo,  Ohio's sister city for 40 years.\n\nThe good news is the Trump administration appears ready to posture  across America to draw forth geothermal power, and we are interested in  doing exactly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…throughout our Armed  Forces.\n\nThey and their families deserve the same devotion to them that they  are providing to us.\n\nI come from a military family. My father, brother, sister-in-law,  uncles all served in the Army, and my father long said he first really  understood what it means to be an American when he was responsible for  others and others'…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…calling out both the Russian state and  the Russian church for the invasion of Ukraine. In Ecumenical Patriarch  Bartholomew's opinion, he says, ``This is the theology that the sister  Church of Russia began to teach, trying to justify an unjust, unholy,  unprovoked, diabolical war against a sovereign and independent  country--Ukraine.''\n\nThe Ecumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Pauline Whitener Milburn was born on March 14, 1925, and  grew up in a small textile community known as Brookford, located in  Hickory, North Carolina She had two brothers and a sister.\n\nGertrude met Bill Milburn while he was serving in the Navy during  World War II, and they married in December 1945 after his discharge.  They had two children, Patricia Milburn…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…thank the women and men across our country who  care for the sick, comfort the hurting, and keep our healthcare system  running.\n\nI began my own medical career as a nurse. My sister was a nurse, and  my husband was a nurse. I understand the long hours, emotional toll,  and deep responsibility, commitment, and gratification that come with  the job.\n\nToday,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…hurts. It leaves an  undeniable void. His legacy, one built on honor and commitment, will  live on in the hearts of those whom he had an impact on.\n\nBilly will be missed by his sister, Robin; his children, Skylar,  Caitlin, and Emery; three beautiful grandchildren; and scores of  friends and coworkers.\n\nBilly, first and foremost, was a man of service. He…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have kids? Think  of this: It may be insane--my wife is my age--but I have a 9-year-old  daughter and a 2\\1/2\\-year-old little boy we have adopted. Yes, they  are brother and sister, so that explains it.\n\nWhen my little boy is 24, 25 years old, every tax in the United  States, every tax, has to double just to maintain baseline services. We  are raising…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…on March 16, 2025, at the age of 69. He was born in  Missoula, Montana, to Robert William Fecht and Marjorie June Fehr.\n\nWhen he was a young boy, the family along with older sister Bobbi,  moved to Spokane, Washington, where the family grew to include his two  younger sisters, Rebecca and Brenda.\n\nHe went to Mead High School, where he was a standout basketball…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…veterans' memorials. His room at Maplebrook Assisted Living  was decorated in tribute to his naval service.\n\nLeroy was born August 2, 1928, in Farmington and is survived by his  sister, Barbara Cornellson, and his children, Cathy Mana, Mary  LeTourneau, Nancy Rariden, Greg Wade, Diane Byrd and stepdaughter  Kellie Grief. He is also survived by 12 grandchildren…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Creighton University, Adrian currently runs the family  business, managing more than 100 employees. He has served on the board  of trustees of the Omaha Public Library.\n\nTheir sister Lorena, a graduate of Marian High School, the University  of Rochester, and UNMC, became a surgeon specializing in oncology.  Today, she serves as a faculty member at the University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…before yourself.\n\nI want to recognize my family because when I did this opportunity,  being a good Jewish boy, my family would not send me alone. My mother,  my father, and my sister moved to Washington. My mom, who I will talk  about in a little bit, used to sit where my wife, Wendy, and my father  are. My sons are over there. I want to recognize all of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…going to be a special hour,  thanks to the gentleman from California.\n\nMr. MOORE of Utah. (English translation of the statements made in  Korean is as follows:)\n\nYoung Oak Kim Sister\n\nThank you!\n\nYou did well!\n\nYou did well!\n\nGim Yeong-ok uiwon-nim\n\nGamsahamnida\n\nSugohasyeosseumnida\n\nSugohasyeosseumnida Take that, Doug.\n\nMr. MOORE of Utah. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…vision and relentless determination, he transformed a  respected local operation into a nationally recognized infrastructure  partner. He expanded operations, acquired PennFab's sister company,  Martelli Companies LLC, and positioned both businesses as critical  players in some of the Nation's most vital sectors while keeping their  roots firmly planted in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…life and career, Mr. Murphy stayed true to his morals  and strong ethical compass.\n\nMr. Murphy is survived by his wife, Diana; daughters, Karen and  Susan; two grandsons; a sister; and three nieces and nephews.\n\nMr. Murphy will always be remembered as a humble, approachable,  gentle, and kind man.                         Recognizing Marlon Lawrence…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…husband Tim's new 6 pound, 2 ounces baby girl Carmela Gray Lolli  who was born on October 26, 2025, and wish this young family all the  best. I know Molly, Tim, and Carmela's big sister Breslin are very  proud to welcome her to the family.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…can easily  be $6,000 or $7,000 a year, provided you work and keep your income  under $17,000 or $16,000 a year.\n\nIf you do a little bit of work, unlike, say, if you had a sister who  is married to a husband with a salary, you would get free childcare,  childcare not available to a couple with two incomes.\n\nThere is a TANF program for people who aren't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]