[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, today I rise to celebrate the 90th birthday  of Irmgard Hermann Davis.\n\nIrmgard grew up in Germany during World War II. After the war, she  came to visit her sister in Garden Grove, California, my district,  where her life changed forever.\n\nShe met Wally Davis. They got married and had seven beautiful  children. She never returned to Germany.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694152/irmgard-hermann-davis-90th-birthday"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Turner (David Gatch) of  Prattville, Alabama, Curtis Parham ``Bubba'' Redding (Dawn) of  Cuthbert, Georgia, and John Melton Redding (Amanda) of Baton Rouge,  Louisiana; and his sister, Gail Redding Corlee (Leonard) of Georgetown,  Georgia. ``CP'' also leaves behind seven grandchildren, nine great- grandchildren, two great-great-grandchildren, and numerous…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…the House, which is signing their names to  that discharge petition and voting for their constituents and  healthcare that is affordable for all Americans.\n\nStansbury), my ``sister''; ``hermana.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…those at DHS and in this Chamber who have created and  rewarded a culture of murder, I ask the same question that God asked  Cain:\n\nWhat have you done? You have slain your sister who gave you no  offense. The voice of her innocent blood cries out from the ground  where it was spilled, where you try to cover and hide. But we saw what  was done.\n\nWhat…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "Mr. OSSOFF. Madam President, Evyatar David has always loved music,  singing, and playing instruments with his brother Ilay and his sister  Yaela at Shabbat dinners. Evyatar dreams of becoming a music producer  one day, and that love of music led Evyatar to the Negev Desert for the  Nova Music Festival on October…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I thank my sister in service, Congresswoman  Hayes, who has been leading this fight to protect our children,  especially making sure that we have access to public education and  quality education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Mayor Terry D'Arcy,  city manager Beth Beatty, fire chief Jeff Carey, deputy chief of health  services Aaron Kozlowski, emergency management coordinator Dr. John  Lukancic, and Sister Mary Francis Seely.\n\nI take dozens of meetings every week in my office here in Washington,  but I was struck by the remarkable work underway in Joliet. Joliet is  the third-largest…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…hard on behalf of the people  she incredibly represents, along with Emilia Sykes, Shontel Brown, and   Greg Landsman.\n\nOf course, all of us know I couldn't leave out my big sister Joyce  Beatty. I wanted to mention Joyce because this is part of the  resilience of what we have seen from House Democrats.\n\nWe saw it from Brittany Pettersen, the distinguished…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…impossible. You were finally seen by a doctor, returned to the baby  prison that is Dilley, and then mere hours later, your entire family,  your parents, and your 1-year-old sister, Mia, were forcefully deported  and left along the side of the road in Mexico.\n\nYou, my sweet boy, are precious and deserving of love and safety. No  child should endure what…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the Baptist church, we have come a mighty long way. From 1971, when  13 Members sat on this House floor, 12 Black men from across this  Nation and one brave, courageous, bad sister, Shirley Chisholm. My,  have we come a long way.\n\nWe come tonight, and we speak truth to power in this most  unprecedented time in our Nation's history: a time when we are…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…straight and walk without my wheelchair. Without my       Medicaid, I would not be able to be a full-time employee, a       full-time worker.\n\nLaura:\n\nMedicaid has provided my sister with benefits to help       support her medical and mental health issues since she       graduated high school. She is now 33 and living with me and       my husband after…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Immigration Legal Services program.       Rian, formerly the Irish Immigration Center and the Irish       International Immigrant Center, was founded in 1989 by an       Irish nun, Sister Lena Deevy, and a group of volunteer       attorneys, to serve Boston's undocumented Irish community.       Over the years, Rian has transformed into a vibrant center…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…would give anything, right? Anything. You would give  your life savings, your house. You would perhaps give your own life in  order to protect your child or your brother or sister or mother or  father from physical harm. So when you and I have sat across from the  victims of gun violence, many of whom live in your neighborhood and my  neighborhood, in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…about Rosa Parks and Dr. King.\n\nAs we honor the Emanuel Nine, we must stand up for teaching honest  Black history. I think of my friend, Representative JA Moore, who lost  his sister, Myra Thompson, today. His call is not just to remove  symbols of hate but to dismantle the systems of hate that Dr. King  talked about.\n\nLet the Emanuel Nine inspire us today…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692130/defending-black-history"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Sharon Lavonne Harris Rischer, a  beloved member of our Fort Worth community, who passed away on February  12, 2025, at the age of 70. Sharon was a dedicated daughter, mother,  sister, aunt, and friend, whose impact will be felt for generations to  come.\n\nBorn on October 7, 1954, in Fort Worth, Texas, Sharon was a proud  graduate of the Lake Como Class of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Pauline Whitener Milburn was born on March 14, 1925, and  grew up in a small textile community known as Brookford, located in  Hickory, North Carolina She had two brothers and a sister.\n\nGertrude met Bill Milburn while he was serving in the Navy during  World War II, and they married in December 1945 after his discharge.  They had two children, Patricia Milburn…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…before yourself.\n\nI want to recognize my family because when I did this opportunity,  being a good Jewish boy, my family would not send me alone. My mother,  my father, and my sister moved to Washington. My mom, who I will talk  about in a little bit, used to sit where my wife, Wendy, and my father  are. My sons are over there. I want to recognize all of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…throughout our Armed  Forces.\n\nThey and their families deserve the same devotion to them that they  are providing to us.\n\nI come from a military family. My father, brother, sister-in-law,  uncles all served in the Army, and my father long said he first really  understood what it means to be an American when he was responsible for  others and others'…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Petty's dedication exemplifies the very best of the veteran community:  leadership through service, compassion through action, and a steadfast  refusal to leave any brother or sister behind. His induction into the  Florida Veterans Hall of Fame is not only well-deserved--it stands as a  testament to what one individual can accomplish when driven by love…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697107/recognizing-captain-steve-petty"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…hurts. It leaves an  undeniable void. His legacy, one built on honor and commitment, will  live on in the hearts of those whom he had an impact on.\n\nBilly will be missed by his sister, Robin; his children, Skylar,  Caitlin, and Emery; three beautiful grandchildren; and scores of  friends and coworkers.\n\nBilly, first and foremost, was a man of service. He…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Creighton University, Adrian currently runs the family  business, managing more than 100 employees. He has served on the board  of trustees of the Omaha Public Library.\n\nTheir sister Lorena, a graduate of Marian High School, the University  of Rochester, and UNMC, became a surgeon specializing in oncology.  Today, she serves as a faculty member at the University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…veterans' memorials. His room at Maplebrook Assisted Living  was decorated in tribute to his naval service.\n\nLeroy was born August 2, 1928, in Farmington and is survived by his  sister, Barbara Cornellson, and his children, Cathy Mana, Mary  LeTourneau, Nancy Rariden, Greg Wade, Diane Byrd and stepdaughter  Kellie Grief. He is also survived by 12 grandchildren…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…thank the women and men across our country who  care for the sick, comfort the hurting, and keep our healthcare system  running.\n\nI began my own medical career as a nurse. My sister was a nurse, and  my husband was a nurse. I understand the long hours, emotional toll,  and deep responsibility, commitment, and gratification that come with  the job.\n\nToday,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have kids? Think  of this: It may be insane--my wife is my age--but I have a 9-year-old  daughter and a 2\\1/2\\-year-old little boy we have adopted. Yes, they  are brother and sister, so that explains it.\n\nWhen my little boy is 24, 25 years old, every tax in the United  States, every tax, has to double just to maintain baseline services. We  are raising…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…calling out both the Russian state and  the Russian church for the invasion of Ukraine. In Ecumenical Patriarch  Bartholomew's opinion, he says, ``This is the theology that the sister  Church of Russia began to teach, trying to justify an unjust, unholy,  unprovoked, diabolical war against a sovereign and independent  country--Ukraine.''\n\nThe Ecumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…can easily  be $6,000 or $7,000 a year, provided you work and keep your income  under $17,000 or $16,000 a year.\n\nIf you do a little bit of work, unlike, say, if you had a sister who  is married to a husband with a salary, you would get free childcare,  childcare not available to a couple with two incomes.\n\nThere is a TANF program for people who aren't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…going to be a special hour,  thanks to the gentleman from California.\n\nMr. MOORE of Utah. (English translation of the statements made in  Korean is as follows:)\n\nYoung Oak Kim Sister\n\nThank you!\n\nYou did well!\n\nYou did well!\n\nGim Yeong-ok uiwon-nim\n\nGamsahamnida\n\nSugohasyeosseumnida\n\nSugohasyeosseumnida Take that, Doug.\n\nMr. MOORE of Utah. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…vision and relentless determination, he transformed a  respected local operation into a nationally recognized infrastructure  partner. He expanded operations, acquired PennFab's sister company,  Martelli Companies LLC, and positioned both businesses as critical  players in some of the Nation's most vital sectors while keeping their  roots firmly planted in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…life and career, Mr. Murphy stayed true to his morals  and strong ethical compass.\n\nMr. Murphy is survived by his wife, Diana; daughters, Karen and  Susan; two grandsons; a sister; and three nieces and nephews.\n\nMr. Murphy will always be remembered as a humble, approachable,  gentle, and kind man.                         Recognizing Marlon Lawrence…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…husband Tim's new 6 pound, 2 ounces baby girl Carmela Gray Lolli  who was born on October 26, 2025, and wish this young family all the  best. I know Molly, Tim, and Carmela's big sister Breslin are very  proud to welcome her to the family.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}]