[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…has  provided Gold Star families with a free America the Beautiful pass that  covers entrance fees and standard day-use fees for national parks and  other Federal recreation sites.\n\nHowever, eligibility for this program is limited and leaves some  families out because of a technicality. This bill would fix that  oversight by broadening access to include…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691052/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…including U.S. military members and veterans. This legislation builds  on this framework by waiving entrance, standard amenity, and day-use  fees at over 2,000 Federal recreation sites for law enforcement  officers and firefighters.\n\nThese hardworking Americans put their lives on the line to protect  and serve our communities every day. An America the Beautiful…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…of mining  left polluted waters, poisoned land, and generations of families  feeling the health impacts, including my own. Tribal nations had their  lands stolen and sacred sites desecrated by the mining industry.\n\nSome may argue that the mining industry is different now and that our  regulations are in need of change. I agree that we are in need of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…has raided schools and farms and workplaces, including in my  State of Vermont, that sow fear and chaos on farms like the Pleasant  Valley Farm in Berkshire and construction sites in Hardwick, VT.\n\nDHS is also rounding up so many people, they literally don't have  places to put them. For the first time in our history, more than 70,000  people are in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Record links to three  articles. The first is: The American College of Obstetricians and  Gynecologists. ``Issue Brief: Crisis Pregnancy Centers.'' https:// schneider.house.gov/sites/evo-subsites/schneider.house.gov/files/evo- media-document/crisis-pregnancy-centers-rep-schneider.pdf.\n\nThe second is from the AMA Journal of Ethics: ``Why Crisis Pregnancy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Canyon, protect it from the attacks of a Trump  administration that is trying to open these lands once again to oil and  gas drilling.\n\nCan you imagine, one of our most sacred sites, which Secretary  Haaland protected in 2023, which the New Mexico delegation is trying to  permanently withdraw, a place the Pueblo leaders say holds the  footprints of their…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696913/protect-chaco-canyon"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…success of this food drive requires extensive  dedication, compassion, and community support. In the weeks and months  leading up to Thanksgiving, Terri starts setting up donation sites  throughout town, storing donations, and coordinating volunteers to  assemble baskets and deliveries. The entire community truly rallies  around Terri and steps up to ensure…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…preserved peace, stability, and a world free  from the ever-present threat of nuclear conflict.\n\nWhen the Soviet Union dissolved in 1991, it left behind 35,000  nuclear weapons at sites across the Eurasian landmass. With thousands  of nuclear-armed ICBMs in places like Belarus and Ukraine, the newly- formed Republic of Kazakhstan inherited the world's fourth-largest…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…administration to push  a revisionist history of American history, scrubbing away one plaque,  one web page, one sign, one sentence at a time.\n\nMr. Speaker, five incarceration sites are now part of the National  Park System. They are Manzanar in California, Minidoka in Idaho, Tule  Lake in California, Amache in Colorado, and Honouliuli in Hawaii.  Across…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Hanford site to produce plutonium for nuclear weapons.\n\nWhen that rush ended, we were stuck with that contamination. It took  decades for the EPA to declare the mines as Superfund sites, leaving  the land poisoned.\n\nAt the Albany Research Center, construction workers built,  maintained, and later tried to clean up the nuclear weapons complex,  often without…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…national historic site.  It has spent the ensuing 87 years preserving and interpreting over 600  years of American history. This redesignation is overdue.\n\nNational historic sites tend to contain a single historical feature  and focus on one theme or period of time, but the Salem Maritime  National Historic Site contains a dozen historical structures…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…podcaster Joe Rogan: ``. . . if the Trump administration, if  they're running and they said . . . we're gonna arrest all the people  at Home Depot. We're gonna go to construction sites and we're going to  just like tackle people at construction sites, I don't think anybody  would have signed up for that.\n\n``They said, we're gonna get rid of the criminals…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…benefit my district.\n\nOne example is the investment of $32 million awarded to the Kraft  Heinz facility in Champaign, Illinois. This was the single largest  award among the 10 sites approved under Kraft Heinz's grant of $170  million from the Department of Energy.\n\nThese funds were not wasteful. They would have been transformative,  reducing emissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…on Louisville taxpayers  and everyone who is downstream on the river.\n\nThe second article today is from The Washington Post. Mothers whose  drinking water was downstream of sites contaminated with PFOA and PFOS,  both of which are considered likely carcinogens, were much more likely  to lose their babies and more likely to have a preterm or low-weight…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…aid will be contingent on a cease- fire.\n\nLet me be clear: That is morally bankrupt.\n\nYou do not negotiate over food. You do not bargain with medicine. You  do not turn aid sites into deathtraps.\n\nPalestinians in Gaza deserve safety, dignity, and the right to self- determination, not starvation.\n\nOregonians have been clear: The United States has a moral…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…polar  and Sun-synchronous orbits. This capability is essential for Earth  observation, climate monitoring, missile defense, and reconnaissance  missions.\n\nUnlike other launch sites in the lower 48, Alaska's spaceport  benefits from minimal air traffic congestion and robust launch windows,  enabling greater efficiency and mission success.\n\nThis spaceport…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, Section 230 of the Communications Decency  Act insulates ``Big Tech'' from most liability for the digital fentanyl  promoted on their sites. Time and time again, drugs are sold, sexually  suggestive and/or explicit content is posted without consent,  algorithms promote and normalize suicide and self-harm, and chatbots…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…manufacturing at home and more American jobs--jobs that have been  shipped overseas by the Democrats in the past. More manufacturing leads  to high-paying jobs at home.\n\nConstruction sites are booming. You are seeing it there in the  construction sites. You are also seeing it in the assembly line. More  innovation, more production means prices go down.\n\nAnd small…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…intended. The availability of       the exemption should not have been delayed until all 50       states have fully implemented the requirements.\n\nThe WEC rule also disqualifies sites from using the       compliance exemption if they have a deviation. Sites should       not be disqualified from using the compliance exemption       unless and until a violation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…Air Force and Space Force both hit their 2025 recruiting goals 3  months early.\n\nIsrael is agreeing to a 60-day cease-fire with Hamas. A successful  strike on Iranian nuclear sites handles that problem. That is exactly  right. Strength is back. America is back. It has resulted now in a  cease-fire deal between Iran and Israel.\n\nThe NATO countries are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…billion dollars was stolen from child nutrition,  housing, and autism services in Minnesota, largely through Feeding Our  Future, a program that theoretically opened more than 250 sites and was  supposed to be feeding 91 million meals. It was not doing that.\n\nThere was a Medicaid program, the Early Intensive Developmental and  Behavioral Intervention program,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the  respective counties.\n\nWhile this is a straightforward bill, I think many of us can attest  to the invaluable role a burial place can play in the grieving process.  Burial sites are sacred, eternal resting places that provide closure  for the families of the deceased. Families should not be forced to  travel long distances to lay their loved ones to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…apps and websites to make connections.\n\nFor many, online dating has made it easier to build relationships.  Unfortunately, there are countless stories of criminals using these  sites for fraudulent activity.\n\nWhile it is sadly common to see users lie about things like their age  and occupation, romance scammers use fake profiles to develop  connections…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692729/romance-scam-prevention-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…certain amenities at Paterson Great Falls National Historical Park in  honor of the late Congressman Bill Pascrell, Jr.\n\nSpecifically, this bipartisan bill would rename two sites within the  historical park as the Bill Pascrell, Jr. Scenic Overlook Trail Bridge  and the Bill Pascrell, Jr. Overlook Park.\n\nPaterson, New Jersey, was home to Congressman…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691128/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…establish a strategy satisfactory to the State and Federal       agencies that are parties to the memorandum, to address water       pollution resulting from mine drainage at sites eligible for       reclamation and mine drainage abatement expenditures under       section 404, including specific procedures for--\n\n``(A) ensuring that activities carried…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…suitability and feasibility of       including in the National Park System, as part of the Salem       Maritime National Historical Park (as redesignated by section       2(a)), sites and resources in the study area associated with       the study area's--\n\n(1) maritime history;\n\n(2) coastal defenses; and\n\n(3) military history, including National Guard and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…organization, would take this Federal  taxpayer money, American taxpayer money, and go to businesses--most of  which were Somali businesses in the Somali community--and set up  feeding sites where they supposedly would take children to get a hot  meal.\n\nOn paper, it sounded great. As I say, it started out very, very  small--just a few million dollars--but eventually…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…it. He sent B-2s to Iran, and everybody thought:  Well, what is that all about? Well, they missed the other B-2s that  went to Iran and put a hurting on these three enrichment sites.\n\nTo the pilots, to the air crews, to everybody involved: Well done. I  spent 30-something years in the Air Force, and I have never been more  proud. Fly, fight, win.\n\nWhat…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the act of traveling to a State or locality to visit       historic or modern day music-related attractions, including       museums, studios, venues of all sizes, and other sites       related to music; or\n\n``(B) the act of traveling to a State or locality to attend       a music festival, a concert, or other live musical       performance or music-related…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…low-to-moderate income families throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families, at 3 of 5 Hernando preparation sites, equaling a total of 5  days a week since February (logging over 135 TD). This doesn't include  her endless hours assisting the organization with event prep,  administrative…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]