[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "…H.R. 2215, the Salem Maritime National  Historical Park Redesignation and Boundary Study Act. Salem Maritime  was established in 1938 as the Nation's first national historic site.  It has spent the ensuing 87 years preserving and interpreting over 600  years of American history. This redesignation is overdue.\n\nNational historic sites tend to contain…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…of workers to organize and have union representation wherever possible  while they are telling them that their enemy is their neighbor.\n\nToo many Democrats show up on a job site seemingly from a sense of  noble obligation with wonky academic explanations about why everything  is fine, even when everyday Americans can't make ends meet. I had an  operating…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…University of California Board of Regents, working to meet long- term enrollment demand in the San Joaquin Valley and increase access to  the UC system, selected the Merced site in 1995 for the system's 10th  campus.\n\nThe first undergraduate class arrived in the fall of 2005, officially  marking the campus's opening. In 2009, UC Merced celebrated its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…make matters worse, even  if a Good Samaritan group wants to volunteer to help clean up the  pollution themselves, current law requires them to take on full  liability for the site under the Clean Water Act.\n\nThat means raising funds to cover all the bonding and liability  costs. Even if the groups manage to do that, it is nearly impossible to  get a permit…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Location Act, which was carefully crafted to respect the  Commemorative Works Act process, honoring the legacies of our Rosies  and ensuring that the memorial may be located at a site near the  current World War II Memorial.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Nylon Capital Center will expand access to  education and workforce training with a new DelTech facility. It will  make healthcare more accessible with a new TidalHealth medical site.  Small businesses will have new space to grow, and a coworking center,  the Mill, will foster entrepreneurship. Critically, it will remain home  to the beloved Sal's Italian…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…they cut off any possibility of clean energy with renewables. Then  they say that we don't need to have any kind of restrictions whatsoever  or investigation to review when we site pipelines, but at the same time  they gut and refuse to do anything about pipeline safety in general.\n\nAgain, Mr. Speaker, this bill is a threat to our safety, and it is a…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…the labor movement with Laborers Local  264 in May 1996, earning promotions to Laborer Foreman and Crew  Supervisor. In these positions, he was responsible for managing job- site teams, ensuring safety compliance, and overseeing the timely and  effective completion of construction projects. In April 1999, Mr.  Thomas was appointed Secretary-Treasurer…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…authorize any new spending. The  Congressional Budget Office verified that.\n\nThis bill in no way bestows special treatment, as it was alleged in  the veto message, because the site wasn't authorized when it was  inhabited.\n\nOn these points, it appears the President's staff gave him bad  advice, bad facts, or both.\n\nThe reality is, the Tribe came to the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…rushed to mine uranium in  the 1950s to fuel the Cold War. Two open-pit mines outside Lakeview in  the Fremont National Forest supplied the material that went to the  Hanford site to produce plutonium for nuclear weapons.\n\nWhen that rush ended, we were stuck with that contamination. It took  decades for the EPA to declare the mines as Superfund sites,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Republican and  Democrat, should be concerned about this. Every American citizen should  be aware that DOGE has taken all of that information and stored it in a  cloud, a/k/a another site that is vulnerable, that anyone can hack  into, and that the Social Security Administration has no access to. No  one is allowed to look at that data who hasn't been vetted,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…announcement that the United States will resume  explosive nuclear testing.\n\nNevada was the focal point of nuclear development during the Cold  War. Over four decades, the Nevada Test Site, which is located just 100  miles north of Las Vegas, hosted over 900 nuclear  tests, more than any other place in the country. Throughout the 1950s,  visible mushroom clouds…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Eleventh and Front. In 1881, the  Georgia General Assembly granted land at Eleventh Street and Sixth  Avenue, leading to the church's renaming as Six Avenue Baptist Church.  This site is now occupied by Golden Foundry and Machine Company.\n\nThe current church home, located at the corner of Fifth Avenue and  Ninth Street, was established in 1915, at which time…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…media strategy. Gerard  worked on several successful efforts, including a new U.S. Courthouse,  Bruce Watkins Drive, and establishment of the Harry S. Truman National  historic site. He would serve in that role for a decade, working on  behalf of the people of Missouri's Fifth Congressional District.\n\nFollowing Representative Wheat's unsuccessful bid for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…The Trump administration's reckless actions and deliberate inaction  from Republicans in Congress jeopardize the operation and availability  of facilities that are the first site of care in the most tragic  circumstances.\n\nI have a responsibility to be abundantly clear, Madam Speaker. The  consequences of inaction and ignoring hospitals, doctors, patients,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…success on peace through strength, working together with Ranking  Member Adam Smith.\n\nI am grateful that the language that I proposed to support missions  at the Savannah River Site and nuclear modernization was included. The  two-site solution shows American commitment to peace through strength.\n\nSupport for defense programs at universities like the University…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…to 63 N., R. 11 W. Tp. 59 N., R.       12 W.; Tps. 61 to 63 N., R. 12 W.; Tps. 61 to 63 N., R. 13 W.\n\nFurther information on the project is available at BLM's       ePlanning site at https://eplanning.blm.gov/eplanning-ui/  project/2022642/510 or at the USFS Superior National Forest,       Duluth, Minnesota.\n\n2. The withdrawal made by this Order does…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…National Pollutant Discharge       Elimination System (NPDES)--this legislation would require       permit writers to tie NPDES permit conditions to what happens       on their site, rather than what happens downstream to impair       receiving waters. This approach allows regulators to explain       the measures that home builders must take to comply with…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…County Education Foundation, among others.\n\nIn his career, Mr. Oldham's company's involvement in a variety of  projects, including critical infrastructure, commercial buildings, site  development, and utility construction have been critical for the  development of North Carolina.\n\nMr. Donnie Oldham embodies the mission of Sanford Contractors to  deliver…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Interior shall--\n\n(A) designate September 17, 2026, as an entrance-fee free       date on which admission is free to all visitors with respect       to each National Park Service site that charges an entrance       fee; and\n\n(B) waive standard amenity recreation fees on September 17,       2026, for each visitor to each site managed by the Bureau of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Park--again, a commonsense proposal with  bipartisan support.\n\nThe third, from Senator Gillibrand of New York, would establish a  national historic park at Fort Ontario--the site of the only Holocaust  refugee shelter in American history.\n\nAnd fourth, from Senator Lankford of Oklahoma, would designate the  Historic Greenwood District, also known as Black…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…activities       within the NPR-A. A number of these procedures and       stipulations differ from those in the 2020 Record of       Decision.\n\nAccording to the ROD, additional site-specific analysis       will occur when BLM receives an application to approve an       action on the ground, and this will be done through       subsequent NEPA reviews and…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, wrong-patient, wrong-site, and wrong-procedure  surgeries are rare, but can be life-altering for patients. Members of  the Association of PeriOperative Registered Nurses (AORN) are committed  to safe…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692335/recognizing-national-time-out-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rising costs.\n\nThat is finally starting to change. This year, a new $6,000 tax  exemption for taxpayers age 65 and older takes effect.\n\nLast week, I visited a tax preparation site in Pasco County, Florida,  and my constituents confirmed that this provision is helping them.\n\nEnacted as part of the Working Families Tax Cut Act, this deduction  applies through…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the implementation of the Pilot Program       at each applicable Coast Guard clinic, including--\n\n(i) the number of members of the Coast Guard who received       services on site by a behavioral health technician assigned       to such clinic;\n\n(ii) feedback from all members of the Coast Guard empaneled       for their medical care under the Pilot Program;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…classified software delivery and       support; classified publications and technical documentation;       personnel training and training equipment; transportation       support; site surveys; U.S. Government and contractor       engineering, technical, and logistics support services; and       other related elements of logistics and program support.\n\n(iv)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…education, Mr. Harris has private-sector experience as a businessowner  and operator.\n\nIn his new position, Mr. Harris is charged with advancing business  recruitment, strengthening site and infrastructure readiness, and  fostering prosperity across northwest Georgia. The board of directors  noted his professionalism and commitment as key reasons for his  selection.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…years following its expiration last year. RECA authorization will  compensate Utahns who were exposed to radiation after the aboveground  atomic testing  at the Nevada Test Site. It will also extend compensation to uranium  miners and expand eligibility for downwinders across the State of Utah.  This will help relieve burdens for Utahns who were harmed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…partners  had cell phone issues on July 13. The Government Accountability Office  report found that the Secret Service didn't have a policy to assess  cellular service at the site even though communication is key during  any major event like this. This resulted in the Secret Service not  receiving real-time threat information and updates during the search…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "James Risch", "party": "Republican", "sentence": "…delivery and support;       classified and unclassified publications and technical       documentation; personnel training and training equipment;       transportation support; site surveys; warranties; U.S.       Government and contractor engineering, technical, and       logistics support services; and other related elements of       logistics and program…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}]