[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…weight of what happened.''\n\nHe said that he would do that. That was his quote.\n\nNow, in February, Attorney General Pam Bondi told FOX News that  Epstein's client list is: ``Sitting on my desk right now to review.''\n\nNow, they claim there was never a list. This weekend, Donald Trump  claimed that the files were written by Obama, Hillary Clinton, and the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…playing out during an  afternoon that we were here, working in the Senate, of another mass  shooting--this one of just unthinkable size and scope--in Uvalde, TX. I  was actually sitting in the Presiding Officer's chair when I saw word  of the shooting scroll across my smartphone screen.\n\nGratefully, in the wake of that shooting, a group of us--Republicans…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…hungry. Now, let's be  clear: The only way to ensure the SNAP benefits are issued by November  1 is for the Trump administration to release the billions of dollars it  has sitting in an account in USDA that Congress appropriated, Democrats  and Republicans working together to appropriate, to use for this  purpose.\n\nAs a matter of fact, never in the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…months since the Trump administration put a stop-work  order in place. As a result, there are thousands of boxes of lifesaving  aid meant to save the lives of starving children sitting in warehouses  in Rhode Island and Georgia instead of getting to the kids who need  them.\n\nMr. Speaker, this week, we are voting on the annual Defense bill. I  just want to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695224/restore-lifesaving-food-aid-for-children"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…benefit from what is being proposed in this particular measure.\n\nThe Great Lakes Authority was passed in both Chambers, and we are  waiting. The reason that the dollars are sitting there is because the  executive branch has not chosen a co-chair to actually stand up the  authority.\n\nSo what is it there for?\n\nFirst of all, it is to pay attention to communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Republicans.\n\nI told the Chair of the Financial Services Committee that I would  only give my consent to this hearing if Republicans would include  provisions to block Trump--or any sitting President--and his family, as  well as Members of Congress, from further profiting off crypto at the  expense of American families in his crypto legislation. That is all I…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…with it? America's credibility and global leadership must  not yield to this con.\n\nLet's get to the real waste. The real waste is incinerating 500  metric tons of expired aid sitting in warehouses meant to feed  suffering children in Afghanistan and Pakistan.\n\nThe real fraud is telling the American people that these cuts will  help them, and they won't.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid  population that are women.\n\nWho are the folks in the Medicaid expansion population? While I have  seen our Speaker say in interviews that these are single 29-year-olds  sitting at home on their parents' couch playing video games, actually,  most of them are working but earn, for an individual, $21,597 a year.\n\nSome of them may work for employers…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…that  funding for emergency food aid would be restored. They leaked a story  to FOX News about how they were restoring food aid.\n\nThe money hasn't come yet, and this is still sitting in warehouses in  Rhode Island instead of being shipped to the children who need it. It  has been 6 months. What is taking so long?\n\nWhat we need is for the Trump administration…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that promise  up for 27 years. This is the 27th year I have had that tour. I love it  today just as much as I loved it then. You learn so much. You see  people face to face. Sitting behind a desk, just answering the phone,  doesn't suffice if you want to be a good Senator. You have to get out  there, meet people, shake hands, hear about their concerns,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…health, including the  nutrition manufactured by Edesia Nutrition in North Kingstown, Rhode  Island, in my district, where thousands of boxes of emergency food aid  have been sitting in a warehouse since Donald Trump and Elon Musk froze  the program back in January.\n\nThey continue to promise that the program is going to come back  online any day now and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695582/release-food-aid-sitting-for-9-months"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…government or  the private sector. The Federal Government still does not even require  U.S. phone companies to meet minimum cybersecurity standards. So, in my  judgment, we are sitting here now recognizing that it is too late to  prevent the Salt Typhoon hack, but there sure is an urgency to prevent  the next horrendous incident.\n\n2480.", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…without a first name and a  last name, without a shield number, anonymous masked ICE agents,  patrolling our streets, pushing people up against a wall, slamming to  the ground a sitting U.S. Senator for the State of California, Senator  Padilla, slamming a woman to the ground at 26 Federal Plaza in front of  her young girl, not representing or respecting…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…fisheries and coastal storms.\n\nAll of this is happening right off of the coast of Delaware. Right  now, these vessels are often running on outdated technology, and that  makes them sitting ducks for cyberattacks from hackers and foreign  adversaries.\n\nThat is why I am proud to cosponsor the ANCHOR Act, which directs the  National Science Foundation to develop…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…when my baby came along.\n\nWell, there were some wonderful people who did some wonderful things  for our daughter, and I will never forget it. But I also never will  forget sitting in that chair wondering who would come through that door  and be my daughter's doctor. I would be meeting him for the first time.  I never felt so helpless as I did at that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…big regional  banks, in addition to the G-SIB Wall Street banks.\n\nI noticed that the CEO of a successor institution that was formed by  the merger of two regional banks was sitting right next to the CEO of  one of the largest banks on planet Earth, so I said to the CEO of one  of the largest banks on planet Earth: This gentleman who is now the CEO  of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…first  time was either Monday or--the days run together. It would have been  yesterday during votes, right before we adjourned to get ready for the  special session, he was sitting right there on the aisle on the corner,  and I shook his hand and talked to him for the first time.\n\nToday, in Energy and Commerce, there were two Members, our colleagues…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688548/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the Republicans on the Oversight Committee, there  was nothing new about the President's former relationship with Epstein  and certainly nothing scandalous. We did find two sitting Democrat  Members of Congress had communication with Epstein.\n\nFirst, it has been highly reported and debated about Congresswoman  Stacey Plaskett texting during an Oversight…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Christ.\n\nIt is not just a holiday for white lights and garland and making  merry. It is a holiday that serves as the center of who we are as a  people.\n\nAs the Speaker knows, sitting there in the Speaker's chair under ``In  God We Trust,'' it is that collective faith that we have in the Lord  Almighty and our collective belief in his Son that has served…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…insane the chart looks from the people running around  this place and saying just use current policy because it is easy and so  I don't have to say no to the army of people sitting in my office and  wanting money for whatever their cause is.\n\nMr. Speaker, you do realize when you start looking at this stuff, you  are talking about 140, 150-plus percent…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…thought that I should buy. She said: Randy you never know when you  might actually need this.\n\nNow, I bought that thing that day. I thought it was kind of crazy,  and it has been sitting in my closet for 35 years. It is in that bag  over there. It is a metal seal that says: ``Member of Congress.''\n\nWhen I leave here and I go back to my office, it will be the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that do need to be considered.\n\nThe difficulty is that when this institution, the U.S. Senate, puts  something out like this, it does have an effect on the parties that are  sitting at the table. And you don't really get to a resolution by  prodding on these kinds of things. You talk about what it takes to stop  the fighting, not what it took to get into…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tax rates, we  basically always get about 17 to 18, sometimes 18\\1/2\\, percent of the  economy in tax receipts.\n\nThere is our problem, it is that split. Right now if we are sitting  in the almost 18 percent of the economy we are taking in in taxes, but  we are spending 24--and understand, over the next few years it goes  from 24, to 25, to 26--that gap…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…had inappropriate behavior and  done it when it wasn't supposed to be done, it does not mean that we  should change the ruling or the rules of this House to allow it.\n\nI was sitting here thinking. We have all kinds of rules, rules of the  road, et cetera. Just because not everybody stops at a stop sign or not  everybody stops at a red light doesn't mean…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…resolution. They chose not to table it. They chose to refer it, which  would suggest to me that there is a recognition that something here is  not particularly good; that we have a sitting Member, in this case, a  Delegate from the U.S. Virgin Islands, who was sitting in the Committee  on Oversight and Government Reform--and I actually have particular  interest…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…without indoctrination. I would  hope my esteemed colleagues on the other side of the aisle would agree  with me on that. Cultural exchange is valuable, but it should never  mean sitting through lessons created by the CCP propagandists  attempting to rewrite history and change our minds.\n\nOur classrooms are becoming front lines in a battle of ideas, and the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and the juice that it created for our economy and the growth that it  had that was raising the tide of all income levels?\n\nThat was the concept, and 4\\1/2\\ years later, I am sitting here on  the committee particularly regarding the tax policy to be able to bring  it up.\n\nThis is a unique and really special time. We are already engaging  with the Senate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…are getting around those gaps in the wall,  smuggling in people and smuggling in drugs so our Border Patrol can  focus in on those areas.\n\nI watched members of our military sitting at a workstation with the  Coast Guard at the port area, helping monitor the different cameras  that are in our port area, looking for those jet skis and those Panga  boats…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…they are overrated  because, in today's world, with hypersonic missiles and drones, as the  Russians found out, big stationary things, even temporary stationary  things, are sitting ducks.\n\nLooking at the clock here, I think I should probably not deal with my  other issues, so I will stop speaking. I believe we have somebody else  ready to go.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…come down. Why?  Because people started thinking about, am I going to push off the dock  in this boat full of drugs and then take a Hellfire through the hull of  my vessel sitting out here in the middle of the Gulf because I am  transporting drugs to the United States of America? It dropped down to  seven, dropped down to four, and it is going to continue…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]