[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…town borrowing money it  really couldn't afford for a project that clearly was ultimately going  to be covered by FEMA, the town clerk was getting questions about, what  is the size of the gravel stones in that roadbed 12 inches down? That  makes no sense. And what happens, of course, is it creates an immense  amount of frustration.\n\nA community that goes…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…surprise when the family turned their moment of good  fortune into a lifetime of impact. It is often noted that their  generosity and values didn't change after the win, only the size of  their checks did.\n\nWith their winnings, Al and Carmen created the Castellano Family  Foundation to uplift San Jose's Latino community. Through the years,  the foundation…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…firsthand that, notwithstanding our possession  of the strongest and most courageous military in the world, America's  greatest strategic asset is not the might of our arms or size of our  aircraft carriers; it is the strength of the alliances we have around  the world.\n\nThe web of partnerships we built after World War II, NATO, our  Pacific alliances,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…with no small measure  of delight that I stand here on the House floor to celebrate my beloved  home State and the noble citizens who keep its spirit alive.\n\nWhat we lack in size, we make up for in endless discoveries. While  December 7 may technically be Delaware Day, it is always Delaware Day  in my heart.\n\nTo all Delawareans, may their Delaware Day…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…third--and this is obvious--to  prevent the loss of consumer money.\n\nVenmo is holding $7 billion of consumers' money. If you have a tiny  bank that is one-tenth or one-hundredth the size of Venmo, you have to  make sure that you have reserves. You can't take the money to the horse  races. Yet, Venmo can do anything with the money. If they lose the $7  billion,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…altitude, the jet went down just  beyond the airfield, erupting into flames as hundreds of thousands of  pounds of jet fuel ignited. The resulting fire engulfed an area the  size of nine football fields, and the thick, black plume of smoke could  be seen from anywhere in the city. I have lived in Louisville my whole  life and could never have imagined…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…government.\n\nSome critics have argued that the District Clause somehow       mandates that the District of Columbia permanently retain all       of its current territory, and that its size may neither be       increased or reduced by Congress. The plain language of the       District Clause says no such thing; it does not mandate that       the District be any…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…everything possible to combat it. In just a decade, fentanyl has  emerged as the deadliest drug in American history. All it takes is 2  milligrams--that is a fraction of the size of a penny--to cause an  overdose.\n\nBut we must do more than simply pass this bill. Since fentanyl- related substances were originally scheduled by the DEA, in 2018,  Congress…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Powers  Resolution, they are signing their name to everything that comes after,  a forever war in our own hemisphere, a quagmire the likes of Vietnam in  a country twice the size of Iraq for a length of time that is  completely unknown.\n\nHow many billions of dollars of taxpayers' money would be spent so  Pete Hegseth can play a wartime general? How many…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…environmentalists.\n\nWe go on. The Economist magazine, in an article entitled ``The Next  Housing Disaster''--there is its cover; it was about a year ago-- predicted $25 trillion as the size of the hit to the global real estate  market from this climate risk to insurance meltdown, to no mortgages,  to property values collapse cascade--$25 trillion.\n\n``Climate change,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…fact- based discretion and impose sentences that fit the circumstances of the  case, frustrating their ability to consider mitigating and complicating  factors, imposing a one-size-fits-all straitjacket that leads to often  disproportionate and inflexible prison sentences.\n\nThis is why the Judicial Conference itself opposes mandatory  minimums. This is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…scheduling fentanyl analogs, these horrific substances that  are manufactured in order to pour onto our streets. Such a small amount  of this drug--it literally could be the size of one pill--as they say,  one pill can kill. It is very important to me that we see the temporary  scheduling of this continue until the Senate finds a more wholesome  response…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Mr. Speaker, I urge all colleagues to support H.R. 4431 to make it  easier for capital to flow to startups and small businesses. This bill  does so by increasing the dollar size and number of investors for  venture funds.\n\nAdditionally, it requires the SEC to conduct a study that examines  how funds are invested across several metrics, including the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697245/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…strategic nuclear warheads at 1,550 each and  limits deployed systems for delivery to 700 per side.\n\nWithout this treaty in force, there would be no legally binding  limits on the size or composition of the U.S. and Russia strategic  nuclear arsenals. This would be the first time in over half a century.\n\nWithout limits, both countries could expand their nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…did many, many years ago on the  JOBS Act, in which we observed that the regulatory expenses faced by a  company seeking to go public were roughly $2 million to $4 million in  size.\n\nIt is also true that a small IPO, a medium-sized IPO, anything up to  about $200 million, is subject almost always to a 7 percent gross  spread. That is 7 percent of the proceeds,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Washington, he gave me a  book filled with page after page of Palau's incredible landscapes. But  beneath that beauty, lies real strategic importance. Palau reminds us  that size is not what determines strength; conviction is.\n\nGuam, home to over 150,000 U.S. citizens, is central to our Indo- Pacific posture. Together, with partners like the Philippines,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…the baby is sensitive to pain.  That is why I have cosponsored the Life at Conception Act, which  legally recognizes the life and value of an unborn child regardless of  their size or level of development.\n\nAdditionally, at the start of this Congress, I reintroduced  legislation to recognize January 22, the anniversary of Roe v. Wade, as  the Day of Tears…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…proposals the left has on raising taxes  and, step by step, here is the tax raise, the economic effects, and  what we actually take in.\n\nRemember, Mr. Speaker, our rules about the size of the economy, 17.1  or mid-17 percent of the GDP.\n\nIndividual income tax, investment tax, raising the corporate taxes,  and raising the State taxes, when you got to the end,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…this would help ensure that Congress has the necessary  data to forge another much-needed layer of defense.\n\nAs transnational criminal organizations continue to grow in both size  and sophistication, illicit cross-border tunnels along the southwest  border of the United States represent a significant and growing threat  to national security. Congress…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…emergency hospital program under Medicare. CMS  implemented this program 3 years later, in 2023.\n\nThe rural emergency hospital program allows rural hospitals to  voluntarily right-size their healthcare infrastructure, while  maintaining essential medical services for their rural communities. It  gives these hospitals the flexibility to operate without hospital…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ways,  and much more elegant, and you get the bad actors. We have actually  done some economic modeling, and it turns out we can actually add a  real pop to GDP growth, the size of the economy. GDP growth is  important because that is actually your living standard. When we grow,  you live better.\n\nIt turns out, it is not deregulation. It is smart regulation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…archeological risks, adding  millions in unnecessary costs and delays despite existing State and  Federal protections under the National Historic Preservation Act.\n\nEliminating this one-size-fits-all rulemaking will ensure that energy  production isn't bogged down by duplicative red tape. S.J. Res. 11 uses  the Congressional Review Act to nullify a rule which BOEM…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…somebody who deals with billions and  trillions of dollars up here in Washington and grows agencies by 20 to  30 percent every couple of years and just thinks if you double the size  of an agency over 5 years, somebody is going to pay for that. Do you  know who is paying for it? That hardworking family is paying for it.\n\nWe clean up waste, fraud, and abuse.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…grave risk of harming  innocent people, and I repeat, harming innocent people. When innocent  people are harmed, that is not furthering justice.\n\nWith an investigation of this size and a file that is as large as the  Epstein files and as poorly defined as that is in this petition, there  will invariably be people who are released, pursuant to this discharge…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Committee on Natural Resources up there last week, and we  had a bipartisan group there turning around and looking at all of the  many, many resources that are in Alaska, the vast size of Alaska, and  the burdens that the Federal Government has put on the State and  really, I think, fallen short of living up to the promises that were  made when Alaska became…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…done the right thing. This is about more  than just one burdensome regulation. It is about standing up for the  industries that power our economy and rejecting Washington's one-size- fits-all approach.\n\nAmerican energy solutions are climate solutions. American energy  producers are providing the solutions that are going to solve energy  needs and environmental…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "French Hill", "party": "Republican", "sentence": "…public facilities and improvements (other       than buildings) if the facilities and improvements are in       place and will be retained in the same use without change in       size or capacity of more than 20-percent, including       replacement of water or sewer lines, reconstruction of curbs       and sidewalks, and repaving of streets.\n\n(II) Rehabilitation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…South Bend, where they  welcomed us with open and loving arms. They gave her an ultrasound, and  for the very first time, we saw our child, who, at that time, was about  the size of a peanut. Half of that peanut was a heartbeat. Most  importantly, they assured us that our child was okay and would be just  fine.\n\nWhen we went to leave, I had just one…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…stretching its mandate in a way  Congress never intended.\n\nBy allowing this final rule to remain intact, we are affirming that  scale alone justifies the regulation, meaning size and scope alone  justifies the regulation regardless of the conduct, the risk, or harm  to a consumer.\n\nThis CFPB approach violates decades of balanced principles in  assessing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Coast Guard's staff shall be limited in the roles and       responsibilities of such staff to the execution of the powers       vested in the Secretary of the Coast Guard. The size of the       Secretary of the Coast Guard's staff may not exceed the size       necessary to carry out the responsibilities of the office of       the Secretary of the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]