[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…we want to go  down.\n\nI grew up in California. I have lived there since I was 11 years old.  I saw the smog days, and I knew the haze that had come to define our  cities and skies for a generation dating back to the first automobile  boom of the post-war era. I remember all the smog alerts, days you were  warned not to go outside.\n\nIt is no surprise…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Aviation safety is dependent on a stable operating environment  and technical analysis. I, for one, would like to trust the experts as  they continue their mission to make the skies safer.\n\nWhen the final report comes out and the time comes to act, I hope  that this body remembers this moment. We must do everything in our  power, working across the aisle,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…of air traffic controllers, pushing a vital workforce  to the brink.\n\nI recently toured the Philadelphia International Airport and met  directly with controllers managing the skies above Delaware. They are  working 10-hour days, 6 days a week, making split-second decisions to  monitor thousands of lives at once. The pressure is relentless, and the  margin…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…inspectors on the ground, without Iran  agreeing to reverse course. We must permanently block every path to a  nuclear weapon that Iran might have.\n\nThe 12-day war over the skies of Iran and Israel has certainly  weakened Iran's program, but we don't know without a classified  briefing if it has obliterated it, if it has defeated it.\n\nIn fact, we don't…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…travelers on the Sunday after Thanksgiving in 2024, with the 10  busiest days in TSA's history occurring last year.\n\nEach day, we depend on hardworking TSA employees to keep our skies  safe. Transportation Security officers, or TSOs, inspect travelers as  they move through checkpoints; Federal air marshals ensure in-flight  security; and canine handlers…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…lot of the commerce and the functioning of the  economy, an economy that Republicans are breaking in real time.\n\nWhat would be the Republican response to the situation in our skies?  Representative Addison McDowell of the great State of North Carolina  has a bill to designate Washington Dulles International Airport in  Virginia as the Donald J. Trump…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…her for her leadership.\n\nIt also mandates comprehensive safety reviews for all airports across  the United States, military and civilian aircraft where they share the  same skies. So not just here, but places like San Diego, Tampa, and  Norfolk, and it requires the FAA to establish an office dedicated to  FAA-DOD coordination. That is really important.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…projects on Federal public lands have brought in very  important economic revenue to these communities. They have brought in  tours from all across the country to see the darkest skies in the  country in what is an International Dark Skies Sanctuary and one of the  most breathtaking trails that one can experience in our Nation's first  wilderness.\n\nRegardless,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Back to the Bay, in the dark of the night,\n\nWent the Gaspee Raiders to set her alight.\n\nThe fire spread through the Raiders' prize,\n\n'Til a blast filled the Narragansett Bay skies.\n\nThe fire had reached the Gaspee's magazines,\n\nAnd her gunpowder blew her to smithereens.\n\nAway sped the raiders into the dark,\n\nLeaving in the embers freedom's spark.\n\n``I…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…then they are  still faced with delays, confusion, and overbroad regulation in the  process of returning to work.\n\nThis often leaves the folks who are tasked with keeping our skies  safe with an absolutely terrible choice, Mr. Speaker: Get help but put  your career and your paycheck on hold, or keep your career on track and  just hope you will get better.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…February: reinstatement of       three vital nuclear-arms pacts canceled by the US government,       the Anti-Ballistic Missile, Intermediate-Range Nuclear       Forces, and Open Skies treaties; and initiation of step-by-      step disarmament measures that can sometimes involve wise       unilateral actions by the US government, as in the case of       ICBMs.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…history.      These crowded halls move faster than my breath,      Each rushing step reminding me I'm new;      Some days my confidence feels close to death,      And I miss skies my hometown once let through       I smile, I learn, I try to stand up tall,      But still my heart aches for familiar ground.      A porchlight glow, a voice I knew to call,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…always happy. His story is one of resilience,  excellence, and service, embodying the very best of our Nation's  ideals.\n\nFrom a young age, Harold dreamed of soaring through the skies. I  don't know where he got that idea, but just at 19 years old, he turned  that dream into reality as a pilot in the legendary Tuskegee Airmen.  These were a heroic group…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Wildfire season now  stretches for much of the year. That threat has reached States that  never expected to see megafires. From the scorched hills of Hawaii to  smoke-filled skies in New York, this is no longer just a Western States  problem. It is a national emergency.\n\nMr. Speaker, I ask my colleagues to please listen to the American  West when we…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…Assault Helicopter Unit's 3rd  Platoon Mavericks during one of the most challenging conflicts in  American history. From August 1967 to June 1970, Mauro bravely took to  the skies, engaging in aerial combat operations where skill and courage  were paramount to mission success and the safety of his fellow  soldiers.\n\nAfter years of valiant service, Mauro…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…answers in this tragic  accident.\n\nThis tragedy demands a full and thorough investigation to ensure that  no family endures this kind of heartbreak again. The safety of our  skies and the trust of the American people depend on accountability,  transparency, and action.\n\nMr. Speaker, let us honor the memory of those we lost by ensuring  that such a catastrophe…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Pensacola, Florida. He was commissioned in  1982, and 1 year later in 1983, he received his wings of gold in  Beeville, Texas, marking the beginning of a distinguished career in the  skies.\n\nFor the next decade, Bruce, call sign Puppy, served with distinction  in various squadrons, including VF-124 Gunslingers, VF-111 Sundowners,  VF-126 Bandits, VF-1 Wolfpack,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…the  Kennedy Space Center in my home district. We are well on our way toward  space dominance, and we are not slowing down.\n\nIn 2025 alone, 26 additional flights have left our skies and, of  course, are orbiting around our world today, providing the  telecommunications necessary not only for commercial use but for  military use, as well, to make sure that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…that pays our  airmen in the United States Air Force, providing $38.7 billion to  support 321,500 Active-Duty airmen, 67,500 reservists, and 160,300  guardsmen defending our skies.\n\nA ``yes'' vote enables us to consider legislation that pays our  guardians in the United States Space Force, investing $1.49 billion to  support 10,400 Active-Duty guardians,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…certain that we take all the steps  necessary and to make certain for the families who remind us today, and  almost every day since January 29, about the importance of making the  skies of the United States safe for those who fly today and in the  future.\n\nThere are numerous--numerous--circumstances that led to this horrific  incident, and NTSB's critical…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…traffic  control operations, $4 billion to modernize facilities and equipment,  and additional resources to hire 2,500 new air traffic controllers.  This will help keep America's skies safe.\n\nThe bill also invests $64 billion in highway infrastructure,  including $879 million for priority needs, such as addressing truck  parking shortages and resources needed…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…answer the call to serve their community and  country at a moment's notice.\n\nFrom the footprints that mark the snows of Valley Forge to the sandy  beaches at Normandy, from the skies above Vietnam to the deserts of the  Persian Gulf, the National Guard has been there for America every step  of the way. For 389 years, these men and women have represented…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…controllers went without pay. A system stretched thinner by  the day had a new strain put on that system, which put millions of  lives at risk. Americans depend on them to keep our skies safe.  Families who rely on SNAP and WIC, parents who are just trying to feed  their kids, were left wondering how they would make it through another  week.\n\nAt the same time,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…system that  works.\n\nBut they are playing politics. They are using Federal employees and,  quite honestly, the American public right now, whose flights are being  delayed, whose skies are less safe--they are using public employees and  the American public as pawns in this grotesque display of partisanship.\n\nMy bill is very simple. It is backed by the public…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…or we would have  military families completely unpaid.\n\nWe have our air traffic controllers. Most of us flew here today,  yesterday, or in recent days. They are keeping the skies as safe as  they can, but they haven't gotten paid.\n\nWe are in this Capitol Building. We are under the protection of the  Capitol Police. They do a splendid job. They keep…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…doctors--all those who put their heart and  time and effort into making America the democracy worthy of the regard  of the world, we need to be clear that the hour is late, that the skies  are darkening, that the steady advance of the grip of state power  should alarm all of us.\n\nLincoln concluded his remarks at Gettysburg saying:\n\nWe here highly resolve that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…system of calm and confidence, helping farmers,  families, and everyone in between plan for a smooth day ahead.\n\nAs John enters retirement, the forecast looks great. I see clear  skies ahead, wind at his back, and hopefully an extended period of  sunshine.\n\nI thank John for helping us weather so many storms, and I wish him  the very best in this new season…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691313/congratulating-john-wheeler-on-his-retirement"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and providing a  well-earned pay raise to our troops; advancing lifesaving biomedical  research and critical education programs; enhancing the safety and  reliability of our skies and infrastructure; supporting small  businesses and strengthening cybersecurity; restoring American  deterrence on the world stage and reinforcing economic and community…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ability and willingness to coordinate, far fewer people  would have been helped. As the holidays came and went, Donna kept in  touch, wanting to donate her time with us in ``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS certified to assist  low-to-moderate income…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…professional repercussions.\n\nWe cannot allow these essential professionals to suffer in silence.  Instead, let's create a system that supports their well-being and keeps  our skies safe.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}]