[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Ketanji Brown Jackson to the Supreme  Court honored the history that came before it. It honored the struggles  of the past and the men and women who fought for a future where skin  color and gender are no longer a barrier to full participation in  American society, voting, or seeking the highest positions in our  government.\n\nAmerica's history is defined…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…freedoms are lost, I  dissent.''\n\nI agree and join that dissent. These raids are not about law and  order. They are about targeting immigrants because of the color of  their skin, the language they speak, the neighborhoods they live in,  and the jobs they hold. I dissent.\n\nICE is not chasing criminals. It is chasing families. I dissent.\n\nNationwide,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695282/scotus-immigration-raids-action"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…schools.\n\nMr. Speaker, this is not about targeting criminals. It is about  targeting, arresting, and detaining people because of their national  origin or the color of their skin. This ought to send chills down the  spines of everyone in this body and this country.\n\nAs someone who has dedicated years of my career to education and  striving to create…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…than ever before, they are watching us to see who we will  become.\n\nI still believe in an America where a child's potential isn't limited  to his ZIP Code, the color of his skin, their gender, or other factors  beyond their control.\n\nI believe in an America where we can acknowledge our imperfect past  while working together toward a more perfect future.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…unlikely to go anywhere else.\n\nMr. Speaker, this is outrageous and wrong. Companies should not be  able to use consumers' online history, past purchases, the color of  their skin, their income, where they work, or their ZIP Code to charge  them a higher price.\n\nSurveillance pricing will lead to increased costs for food and basic  goods. It will harm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…two of my esteemed colleagues, Mr. Clyburn and Congresswoman McClellan.  Thank you both for the strength of your convictions.\n\nMr. Speaker, today in America the color of your skin and the ZIP code  you are born into are critical determinants of health.\n\nI represent Massachusetts' Seventh Congressional District where in a  3-mile radius from Cambridge…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…weekend, North Carolinians watched in horror as masked  agents descended on our State, terrorizing communities, and abducting  people off the streets based on the color of their skin.\n\nThese immigration raids only serve one purpose: sowing fear and  intimidation.\n\nIf the Republicans cared about fixing our broken immigration system,  this wouldn't be the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697072/condemning-deployment-of-cbp-to-north-carolina"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…States who have been settled through the Catholic Relief Services, and  they have come to a place where they feel loved and cared for and safe  and welcomed. The color of their skin, the accent they use, and the  fact that they are unfamiliar with American culture might make them  feel not so welcomed in other venues, but in my church, they feel  welcomed.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…criminals they talk so much about, what is ICE doing instead? They are  out roving streets in communities across the country and arresting  people based on the color of their skin or the language that they speak  or their perceived occupation.\n\nThere is a term for this, by the way. These are now known as the  Kavanaugh stops because of Supreme Court Justice…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…any red- blooded American to hear about them, read about them, and learn about  them in the same manner that we learn about others whose contributions  were similar, but their skin color made them more worthy.\n\nWhen we hear stories of the American Revolution, we don't often hear  of Crispus Attucks, a Black man who became the first casualty of the  American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…business.\n\nOn January 9, 2019, he was terribly injured in a fire in       his home. He is still recovering physically and economically.       After losing 66 percent of his skin and getting care at a       specialty trauma unit in another part of the country, he       ended up owing over $82,000 in medical bills. The medical       debt on his credit…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…this country afraid to leave their  homes because right now ICE and Border Patrol will detain anyone who  they think they can use to meet a quota based on the color of their  skin or the accent that they are using.\n\nThis didn't have to go like this. I remind everybody who is  responsible for supersizing the ICE budget and bringing us to this  place, it…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699663/horrific-ice-abuses"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to  Republicans, Democrats, and Independents--rural, urban, and suburban-- no matter where they were born, no matter what language they speak, no  matter the color of their skin, no matter who they love, no matter how  they worship, they want three things: They want to know they live in a  thriving and healthy community. They want to know that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…ball. We have children being zip-tied, car  windows smashed, people tackled and dragged, and guns pointed at  unarmed bystanders. We have people targeted for the color of their skin  or the accents that they speak in. ICE agents are demanding entrance to  homes without warrants, and last week, an American citizen was gunned  down.\n\nAmericans know this is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698887/be-the-voice-of-moral-grandeur-and-spiritual-audacity"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…together on funding the Corporation  for Public Broadcasting.\n\nMr. GOLDMAN of New York. Mr. Speaker, this is not about actual  funding. This is caving to Donald Trump's thin skin and his inability  to deal with facts rather than to stand up for local stations, local  communities, and the First Amendment, which specifically prevents  Congress from abridging…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…insurance companies.\n\nDid you read the reports? Last year, 41 percent of those subsidies on  subsidies of the people that had the enhanced subsidies paid no  premium, so they had no skin in the game, which is not what we were  promised when ObamaCare came into existence a dozen years ago.\n\nWe actually showed an economic report. I did entire floor speeches on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…had no idea they had been signed up. It is  rampant fraud.\n\nLet's have a little more fun here.\n\nHow many who were enrolled with these enhanced subsidies ended up  having no skin in the game at all and who had no cost?\n\nLast year, 41 percent had no cost. You, as a taxpayer, Mr. Speaker,  paid for their healthcare. This year we modeled it. It is going…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…overall cancer       mortality, and increased incidence or prevalence of--\n\n(A) brain cancer;\n\n(B) colon and rectal cancers;\n\n(C) kidney cancer;\n\n(D) lung cancer;\n\n(E) melanoma skin cancer;\n\n(F) non-Hodgkin lymphoma;\n\n(G) pancreatic cancer;\n\n(H) prostate cancer;\n\n(I) testicular cancer;\n\n(J) thyroid cancer;\n\n(K) urinary bladder cancer; and\n\n(L) other cancers…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…overall cancer       mortality, and increased incidence or prevalence of--\n\n(A) brain cancer;\n\n(B) colon and rectal cancers;\n\n(C) kidney cancer;\n\n(D) lung cancer;\n\n(E) melanoma skin cancer;\n\n(F) non-Hodgkin lymphoma;\n\n(G) pancreatic cancer;\n\n(H) prostate cancer;\n\n(I) testiscular cancer;\n\n(J) thyroid cancer;\n\n(K) urinary bladder cancer; and\n\n(L) other cancers…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…those grants come with a cost-sharing requirement  usually of around 50 percent. That is important because it makes sure  that the entity that the grant is awarded to has some skin in the game,  and it also ensures the taxpayers get the best value for their dollar  when that grant is performed. However, the Department of Energy has the  ability under Federal…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688928/cost-share-accountability-act-of-2025"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…and software.\n\nRemember, it was industrial innovations that won World War II, not a  fledgling Pentagon.\n\nToday, patriotic companies across the country are putting their own  skin in the game to help our country deter, if possible, and defeat, if  necessary, our 21st century adversaries, and we must help them succeed.\n\nVote for this bill.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}]