[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Speaker, 22 million people, including 400,000 Arizonans with  marketplace coverage, are already seeing their healthcare premiums  skyrocket."}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Millions of people will  see their premiums skyrocket, and millions more won't be able to afford  any insurance at all."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is another  Republican bill that fails to address skyrocketing electric bills that  are a part of the overall affordability squeeze that is gripping the  country right now."}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Speaker, I rise to oppose this bill that allows  health insurance premiums for 22 million American families to skyrocket  and raises healthcare costs for everyone."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Slapping a hefty tariff on steel and  aluminum only exacerbates current supply chain issues and could cause  grid infrastructure costs to skyrocket."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "At the end of 2025,  Republicans let healthcare costs skyrocket, adding to the stress  Americans are already experiencing, because Republicans have done  nothing to address the high costs of housing, groceries, childcare,  utilities, and more."}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "If Republicans truly cared about pregnant women and families, we  would be debating how to undo their $1 trillion cut to Medicaid, which  rips healthcare away from millions of pregnant women, new mothers, and  children, and how to help the millions of women seeing their health  insurance premiums skyrocket due to months of Republican inaction."}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Without the ACA tax credits, costs are  going to skyrocket for the American people."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Meanwhile, millions more are about to watch  their healthcare premiums skyrocket and their local hospitals close,  not to mention the astronomical cost of living that is rising more and  more each day, thanks to Trump's tariffs."}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "Failure to extend these tax credits will cause health insurance  premiums to skyrocket all across our land."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "In fact,  90 percent of all people in Connecticut who buy insurance through the  ACA marketplace receive some kind of subsidy, and their insurance  premiums will skyrocket by 75 percent if that subsidy is ended."}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "As you know, they are set to expire at the end of the year and will  cause monthly health bills to skyrocket for millions of Americans."}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Millions of new and expecting mothers are seeing  their premiums skyrocket and they are being forced to go without health  insurance."}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "We are seeing housing costs continue to skyrocket as well."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "I heard how the one big, ugly bill is about to  make utility bills, student loans, and grocery costs skyrocket, all to  give the richest Americans more tax breaks."}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "The enemies of our country are robbing American citizens in broad  daylight, while the cost-of-living standards in our country skyrocket  higher than they should be, and healthcare premiums go up year after  year."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Are we going to do all the things  necessary to skyrocket productivity because wages--sorry."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "I must ask the question, where was the  compassion and concern while they watched prices skyrocket over our  constituents over the 4 years of the Biden administration?"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Coal is reliable and affordable, and we know we are going to need  this critical resource of baseload power as electricity demands  continue to skyrocket."}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Members sit on committees and go  to private briefings where they get privileged information from  companies informing us if the stock price will skyrocket or plunge."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "The fact that we have had  the number of children born out of wedlock skyrocket from 4 percent to  over 40 percent was an oversight."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Over the years, these programs have been exploited and expanded  beyond their initial intent, causing the cost of these programs to  skyrocket exponentially."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Their so- called Affordable Care Act has caused premiums to skyrocket."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "We have seen threats against our ICE  officers absolutely skyrocket."}, {"senator": "Rick Allen", "party": "Republican", "sentence": "It is shocking to me that House Democrats will run to the news  cameras and clamor about the cost of living while they also offered  their full support for reckless anti-domestic energy policies from the  Biden administration that caused prices to skyrocket in the first  place."}]