[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…gun violence. Americans want to send their  children to school or to the mall without wondering if they will ever  come home.\n\nThese egregious Trump administration cuts are a slap in the face to  every family and every survivor of gun violence. In many cases, these  rollbacks also make it more difficult for law enforcement to keep our  communities safe.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…criminals involved in  that insurrection carried out in his name.\n\nThis is just one action amid a comprehensive campaign to erase the  memory of what happened on that day. It is a slap in the face to law  enforcement who selflessly put their lives at risk to defend all of us.\n\nSome of them lost their lives, like Officer Brian Sicknick, a New  Jersey native,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…setting new historic  goals, Canada is, to contribute to our collective defense, planning to  triple defense spending over the next decade.\n\nSo what does this administration do? Slap them with a 35-percent  tariff. And then, just because the President woke up in the morning and  didn't like an ad that quoted a beloved Republican President, Ronald  Reagan,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…devastated by disaster. We made a  promise to North Carolina, Florida, Texas, and Maui.\n\nMr. Speaker, that promise isn't just being broken. It is being ripped  apart. What a slap in the face for those constituents when that funding  to rebuild homes, businesses, and communities gets delayed or even  withheld because the Musk-Trump administration plans…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688590/maui-minute-on-huds-office-of-community-planning-and-development"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…tariffs which act as a tax on Americans and  their businesses.\n\nAt the same time, as families struggle, Trump has increased his  wealth by billions since taking office, which is a slap in the face to  American families struggling to put food on the table.\n\nJust last week, alarming new information came to light regarding  foreign governments making business…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…This bill does not solve problems. It doesn't  tackle the affordability crisis. It makes it worse. It doesn't even  support more reliable power. Republicans are just trying to slap a new  permitting reform label on bad ideas that they have never been able to  pass into law.\n\nHere we are, the last week in session this year, Mr. Speaker, and  Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…with dignity. The  Constitution deserves to be followed. Communities deserve safety from  wildfires. First responders deserve to do their jobs unimpeded.  Anything less is a slap in the face to the values we share as  Americans.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694948/arrest-of-wildland-firefighter"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…so-called Protect Children's  Innocence Act.\n\nI have served children and their families for over 20 years, and I  find this piece of legislation to be dangerous and an absolute slap in  the face for parents and for doctors who have dedicated their lives to  caring for children and families.\n\nThis bill could put doctors behind bars for up to 10 years for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698357/protect-childrens-innocence-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…home loan assistance to veterans, even cutting  staff of the suicide crisis line that saves lives--for what? This  message does not say: Thank you for your service. This is a slap in the  face for those who have served.\n\nMy Democratic colleagues do not support these cuts, and this is an  ideal moment for bipartisanship, where our Republican colleagues…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…resolution by Senator Kaine got four  Republican votes here in the Senate. Our resolution, this resolution,  would terminate the emergency that Donald Trump has declared in order  to slap tariffs on 49 percent of products Americans buy from other  countries. It would terminate that.\n\nAgain, instead of picking a fight with the entire world, Donald Trump  should…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…to  Canada each year.\n\nThis is a longstanding trade relationship that supports more than  6,400 jobs locally and directly employs 1,400 people at Canadian-owned  businesses. Slap-shot tariff policy and volatile trade policy have put  those jobs at risk.\n\nOur manufacturers who rely on metals, equipment, and machinery are  watching the costs rise. Just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…racial wealth gap.  They impact and put a heavy burden on some of the poorest communities,  working-class folks. These are frontline workers.\n\nGutting the overdraft rule is a slap in the face of the families,  again, who are already struggling to make ends meet. This is raising  the costs for families when we don't check corporate greed.\n\nAgain, these…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689837/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…their two parents in their  nineties and their disabled adult children. They are desperately  relying on these programs. No matter what you do or say or call it or  label you slap on it, those are the kinds of Americans who are stepping  up to take care of their loved ones who will get hurt.\n\nMr. BOOKER. Yes.\n\nMr. BOOKER. Yes, Senator Schumer.\n\nTo tell…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…everything.\n\nAs hurricane season begins, it is a disgrace that Donald Trump and  his administration are proposing the elimination of FEMA. This scheme  is nothing less than a slap in the face to the western North Carolina  communities that he pledged to support.\n\nIf Trump really cares about effectively managing disaster response,  then he should submit…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…when they promised to lower costs.\n\nNow, they are even trying to rebrand their so-called big, beautiful  bill with a new name about working families. No matter what label they  slap on it, the facts don't change. Trump and Republicans' big, ugly  law makes the cost of healthcare go up and takes away healthcare from  working families.\n\nRepublicans hand out…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to turn a single asylum seeker away. We empty out our  prisons because we just can't stomach the thought of keeping anyone  behind bars.\n\nWe let violent criminals off with a slap on the wrist because we see  them as victims of socioeconomic conditions beyond their control. We  turn a blind eye to rioters who loot, steal, and burn their way through  our…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…aren't sufficient for protecting Federal military sites.\n\nThe amendment creates clear Federal authority and escalating  penalties to counter repeated or hostile intrusions. A slap on the  wrist is not enough when foreign actors surveil U.S. military bases.  Protecting our installations equals protecting readiness, our troops,  and national security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…see here--the exact location  where Islamic terrorists flew planes into the Twin Towers on September  11, 2001, killing thousands of innocent Americans. You know, this was a  slap in the face of the families of the nearly 3,000 victims who were  murdered and the thousands injured on that very, very tragic day.\n\nI never thought I would see something like…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Risch", "party": "Republican", "sentence": "Mr. RISCH. Mr. President, I rise today to oppose this unhelpful  resolution. It is a clear attempt to take a slap at President Trump and  nothing more.\n\nPresident Trump's foreign policy successes have been several and  should be celebrated not denigrated. For instance, recently his work…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…have news for the Democrats: The doctrine of nullification died  with the Confederacy. States are not permitted to obstruct the  enforcement of Federal law. In a humiliating slap-down of Mr. Newsom,  even the notoriously liberal Ninth Circuit Court ruled that the  President has the clear authority to federalize the National Guard to  restore order whenever…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "James Risch", "party": "Republican", "sentence": "…effect. It would be unconstitutional, unenforceable. But to tell him  not to do something or to stop doing something he is not doing is  nonsense.\n\nThe effect of this is to slap the President of the United States in  the face. That is the only effect that this vote can have. It can have  no practical effect because it is trying to stop something that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}]