[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "They  wouldn't look the other way when the DOE workforce is slashed without  evaluating the impacts."}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "The big, ugly bill slashed funding for Medicaid and SNAP, which  families in our community rely on to keep their kids healthy and fed."}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Make no mistake, Republicans know  that their policies are failing, that prices are going up, that jobs  are going away, that healthcare is being slashed, and that the American  people are struggling to make ends meet."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "He has slashed over a billion dollars from food programs that put  fresh produce in school cafeterias and keep food banks stocked."}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "At Trump's urging, congressional Republicans are proposing a nearly  $1 trillion cut in healthcare and have already slashed rare disease  funding by over a billion dollars."}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "It slashed over $1 trillion from Medicaid,  from children's healthcare coverage, from Medicare, and the Affordable  Care Act, adding $4.2 trillion to our national debt."}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "With up to $2.5 trillion in Medicaid cuts and $230 billion slashed  from SNAP, this budget plan would leave millions of families and  seniors without essential support."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "How do you explain to anyone that you slashed their healthcare  affordability to fund a giveaway of $20 to $40 billion to Argentina or  to fund that new ballroom?"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Making matters even worse, as prices go up, safety nets for our most  vulnerable families are poised to be slashed under this reckless  Republican budget."}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "On the contrary, the emissaries from DOGE--and  here I don't necessarily hold my colleagues accountable for this  because they didn't seem to know about it any more than we did--but the  functionaries of DOGE slashed more than $500 million that the  Department of Justice was giving to local police departments across the  country, community safety groups, and organizations assisting victims  of rape and sexual assault."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "They passed the big, ugly bill, which slashed tax incentives for  clean energy and made electricity more expensive for everyone."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Citizens United has created a system where Presidential pardons are  pay-to-play, where environmental regulations that keep us safe and  healthy are slashed, where corporate mergers are rubberstamped by  Federal regulators."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "In their  latest fiscal year 2025 budget, they slashed housing by more than $500  million, which will put at least 32 million households at risk of  eviction and homelessness."}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Slashed that funding."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Tell them you don't  want Medicaid to be slashed."}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Slashed  budgets."}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "This program has been a  lifeline to hundreds of rural counties and school districts across the  country who have seen their budgets slashed through no fault of their  own."}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "The Falcon 9 rocket, with its reusable booster system, has slashed  costs by a factor of 10."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Parents need certainty that their guaranteed deduction of $30,000  won't be cut in half and that their child tax credit won't be slashed  from $2,000 to $1,000."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "In the last 100 days, he has slashed Democrats' far-left  regulations, has unleashed American energy production, and has secured  trillions of dollars in investment to support American workers and  industry."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "It was an absurd, pathetic attempt to deflect responsibility from his  own failures, for an NPR investigation would soon find that Newsom  exaggerated the fire prevention work he had done by a staggering 690  percent and had also slashed the fire prevention budget by $150  million."}]