[{"senator": "John Mannion", "party": "Democrat", "sentence": "…administration's decisions that  undercut long-term affordability, such as blocking transmission,  canceling low-cost energy products--some of which are green energy  projects--and slowing investments that would expand supply, stabilize  prices, and give consumers the options they need and demand.\n\nRepublicans control the White House, Senate, and House, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…result will be more pollution in our Nation's rivers, streams, and  lakes, thanks to loopholes, legal shields, and limited oversight of  polluters.\n\nThird, this bill will end up slowing projects by increasing  regulatory uncertainty and delay. Democrats want to pass bills that  invest in infrastructure and get projects done faster. That is why we  passed…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…imposes  harmful mandatory minimum sentences. Decades of research shows that  mandatory minimum laws that focus solely on supply reduction and  incarceration are not effective in slowing the flow of illicit drugs  into our country or the rates of overdoses in our communities. In fact,  the current fentanyl epidemic has been found to have its roots in  crackdowns…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…electricity bills compared to the previous year. The big reason  is that the big, ugly bill added about $250 billion to Americans'  energy bills by picking energy favorites and slowing down new  technology, so energy prices continue to rise for Americans.\n\nSomething the President said is that the data centers will help lower  Americans' energy costs. One…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700227/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…recent actions to hurt, not help, the American  people, including those in Ohio's 13th. From cutting phone helplines,  to requiring certain services be conducted in person, to slowing down  processing times, and closing offices, the American people are not  getting the service they earned from the Social Security  Administration.\n\nNow, to add insult to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…businesses, and that is tariffs.\n\nEvery small business owner I talk to says the same thing: The tariffs  are killing them. The tariffs are making prices skyrocket. The tariffs  are slowing down business.\n\nThese guys don't care. They don't care. They just go along to get  along. They don't want to tick Trump off.\n\nI guess my question is: If Republicans want to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…regardless       of race, background, or party affiliation.\n\nYes, funding cuts to Agencies like NIH and the National Science  Foundation threaten to halt critical research, slowing the development  of treatment for diseases that impact millions. These cuts will push  out brilliant young scientists, many of whom have already had to fight  to get where…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…cuts to humanitarian  assistance are especially disappointing, and they are the result of the  administration effectively shutting down the U.S. Refugee Admissions  Program, slowing assistance for those impacted by conflict, and  reprioritizing funds for its own agenda. Our international broadcasting  grantees are also experiencing significant cuts even…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…new sales tax, will be a drag not just on U.S. economic growth but on  global economic growth.\n\nThis is a story from less than a week ago. U.S. manufacturing was  already slowing before the GDP numbers came out today. A larger share  of manufacturers are reporting declines in new orders rather than  increases. Some of those declines are driven because…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…justify the use of nuclear weapons to deal with a nonnuclear  threat.\n\nRemoving the specter of the U.S. using nuclear weapons first in a  conflict would go a long way toward slowing down this renewed global  arms race. I am so glad to see my colleagues here share my concerns. I  hope we can make a dent in the common sense here in this Congress.\n\nWhile…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…PEPFAR. These aren't Democratic  pet projects as some would have you believe. PEPFAR was established by  President George W. Bush and has saved more than 26 million lives,  while slowing the spread of HIV/AIDS around the world. Cutting these  kinds of funds is another death sentence for children and women who  depend upon lifesaving medication that costs us…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…intelligence Agencies: Don't bother building a career in  intelligence if you plan on telling the truth.\n\nMeanwhile, these aren't actions in a vacuum. Our adversaries aren't  slowing down. Cyber attacks, disinformation campaigns, nuclear  proliferation, terrorist attacks, transnational criminal  organizations--these threats are real, and they are not going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…shore up the workforce powering our electric supply chain.  Manufacturers in California and across the country consistently tell us  the same thing: Workforce shortages are slowing down projects, driving  up costs, and ultimately are a major contributor to higher prices for  working families.\n\nThe data is clear: Nearly 10,000 electricians retire each…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…rates, a move that the President has been  urging for months.\n\nInflation remains stubborn. Consumer prices rose by 2.9 percent in  August compared to last year. Job growth is slowing. Unemployment has  climbed to 4.3 percent, the highest in 4 years. We are now veering  toward stagflation: rising prices and a cooling job market.\n\nNo matter what you call…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695597/fed-rates-and-stagflation"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…more Americans access the high-quality affordable housing they  deserve. We have also passed legislation like the SPEED Act, clearing  away bureaucratic obstacles that are slowing down construction and  driving up costs.\n\nToday, the Housing for the 21st Century Act will help us take an  additional step forward.\n\nThis bipartisan legislation tackles some…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…works in the economy. It is like a phoenix. It is the rebirth.\n\nWhen you stop that rebirth from happening, you don't get to clean out  the legacy headwinds, the things that are slowing down the innovation.  You basically perpetuate the inefficiencies. It doesn't make you  popular telling the truth, but we all knew this.\n\nShould we have bailed out Blockbuster…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…graph, with, last year alone, 155 launches into space, 93 from the  Kennedy Space Center in my home district. We are well on our way toward  space dominance, and we are not slowing down.\n\nIn 2025 alone, 26 additional flights have left our skies and, of  course, are orbiting around our world today, providing the  telecommunications necessary not only…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economic concept I need everyone to process is to think  of a seesaw. When we see interest rates going down, yay, except the  problem is that it typically means the economy is slowing down. There  is less demand for debt in the markets, and the economy is slowing  down.\n\nWhat happens, Mr. Speaker? What happens to the U.S. Treasury? It  means tax receipts…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Speaker. That is how  you weaken it.\n\nMeanwhile, global demand for fuels is still rising and is expected to  grow as much as 20 million barrels a day by 2050.\n\nThe world isn't slowing down, Mr. Speaker, and neither should  American energy.\n\nThe REFINER Act takes a serious look at that situation, directs the  National Petroleum Council to review our refining…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the national       interest of the United States.\n\nMr. Speaker, I rise today in support of Mr. Lucas' bill, the PROTECT  Taiwan Act.\n\nMr. Speaker, China has shown no sign of slowing their aggression  toward Taiwan. The Chinese Communist Party, or CCP, continues to  threaten the people of Taiwan's independence by repeatedly holding  military drills, increasing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…tax dollars have  been wasted or ones in need have been left behind.\n\nImportantly, this bill does so without imposing new burdens on State  or local governments and without slowing down the delivery of critical  housing assistance. H.R. 225 simply ensures that HUD operates with the  openness and accountability the American people expect and deserve.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…livelihoods of those who  live and work the land.\n\nWith a significant number of these wolf packs now concentrated in  northeastern Washington and with no signs of their growth slowing,  Congress should take careful note of our ranchers' perspective. Their  continued loss, emotional toll, and frustration caused by inconsistent  State and Federal protections…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ways to support one of the  most vulnerable groups in her community--the elderly. Joan's journey  into volunteering began later in life. At nearly 79 years old, instead  of slowing down, she stepped up when she heard Gulfside needed  volunteers. In just three years, she has donated more than 3,650 hours  of her time to Gulfside Hospice.\n\nInspired by…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…duplicative  and unnecessary regulatory hurdles. Even after projects receive all  required Federal and State approvals, agencies can still demand  additional authorizations, slowing installation, maintenance, and  repair work that is critical to keeping these systems secure.\n\nWe see this pattern far too often in Washington. Projects are  approved, but…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]