[{"senator": "Al Green", "party": "Democrat", "sentence": "…authoritarianism. This President  has done so by using executive orders. He has done so by using the very  courts to move his executive orders, but by moving them such that they  move slowly and get to a final judgment that would be against him.\n\nThis President has disrespected the Federal courts. He has  disrespected the orders of the court. When the courts have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…approval of lifesaving treatments. Cancer patients will have to  wait longer for promising new treatments as clinical trials still stall  due to staffing shortages. This will slowly eliminate research and  medical intervention and weaken our standing in global biomedical  science.\n\nCuts to an already understaffed CMS workforce will hurt patient care.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…party to say that right now.\n\nOnly if we come together are we going to have a chance to save  ourselves from the fate that has befallen so many other countries that  have slowly, too quietly, seen their countries transition from real  democracy to fake democracy.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the food and medicine  they need to survive. Women waiting for C-sections are trapped in the  middle of a bombing campaign. Children are forced to watch their  mothers die slowly of cancer, with no access to medicine. The hospitals  they need are being destroyed.\n\nAt the same time, the Netanyahu government has begun a new military  operation to take…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves far too slowly for the urgency of their lives.\n\nAcross our district offices, our caseworkers hear directly from  veterans who are desperate for answers about their claims and appeals.  In…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…acknowledgement  of Huntington's Disease so we can work to improve prevention and care  of affected folks at the federal level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…deported tens of thousands of  children to be reeducated and taken away from their family. They put  the Ukrainian people in camps.\n\nRussia is basically like a boa constrictor, slowly digesting chunks  of Ukraine. If we pause now without security guarantees, they will be  back at it in a few years just like they were after Crimea, like they  were in Georgia,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…realignment that destroyed the regional nature of  college sport. For generations, the Big Ten was known as the Midwestern  Conference. In recent decades, that identity has slowly been eroded as  coastal schools were admitted in the name of more revenue and higher  profits.\n\nNow private equity is looking to buy college sports revenue streams.  If these…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…to care for our residents. Throughout COVID many of these       positions sat vacant as undesirable jobs or careers. Over the       past few years we have been able to slowly regrow our       workforce and we are not in a healthy, albeit precarious,       staffing position.\n\nNow, I am looking at losing 40% of my dietary aids and more       concerningly…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Emancipation Proclamation, Union soldiers arrived in Galveston,  Texas, with the news that the last enslaved Black Americans were  finally free.\n\nFreedom did not come easily. It came slowly, unevenly, and at a  painful cost, but it came. Along with it, generations of Black  Americans began the long, unfinished journey toward full equality  through Reconstruction,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Waters are planning to  get here in just the next few minutes to speak on the next two bills.  Since they are not here yet, it does the House no harm for me to speak  more slowly and perhaps at greater length.\n\nMr. Speaker, I rise in support of H.R. 1190, the Expanding Access to  Capital for Rural Job Creators Act, sponsored by my colleague, the  gentleman…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…performing any missions, but simply used by the President to  threaten a reign of terror in the city of Chicago. It is  unconscionable.\n\nAs of today, these troops are finally, slowly demobilizing and  getting ready to head home. But unfortunately, the presence of  militarized immigration operations is likely to continue in Chicago and  around the country,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Reising, and her family.\n\nRachel has reached out to me and asked that I join her in raising  awareness for this disease. Huntington's disease is a rare genetic  disorder that slowly damages the brain over time. There is currently no  cure. However, there is hope, thanks to Medicaid research advancements  and investments.\n\nRachel recently reached out to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691303/recognizing-huntingtons-disease-awareness-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…drafted a resolution, and I wanted to be able to get unanimous  consent tonight, but I also want it to be bipartisan. And it turns out  that sometimes the gears here move more slowly, even on simple tasks,  than one would like. But instead of asking for unanimous consent on  this resolution tonight, instead, I am going to work with a colleague  across the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…was a test to signal your willingness to be loyal. If you promise  to spread our lies, you can be on the team. It was a qualification for  being able to work on that team. Slowly, like the rot in the foundation  of an old farmhouse, it continues to let the decay set in.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…which we can arm our ally Ukraine.\n\nFor years, the Russian military has flung itself against the rock of  a country it covets and a country it dwarfs in size but moving more  slowly than nearly any military in a century. We need to show Vladimir  Putin that it is time to stop. We must not let him off the mat. We must  increase the pressure.", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…summed up the current  crisis stating: We ``have a system under pressure that now just has  another 100 pounds of weight on it.''\n\nThe failure to pass a continuing resolution is slowly crushing our  aviation system. Our system is too fragile and the stakes are too high  for us to continue operating the national aviation system in the manner  we are doing…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…including the minority whip, shamefully admitted they were  using the misery they inflicted on the American people as leverage to  achieve their leftist wish list of demands, slowly twisting the heads  of the American people in a vice.\n\nTonight, I am relieved to say the misery of the Schumer shutdown is  on our doorstep.\n\nMr. Speaker, this package proves…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696721/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…State and local tax deduction, even though Wisconsin is a mildly  high tax State.\n\nMadam Speaker, I think encouraging any more taxes anywhere in the  country hurts us all as it slowly takes away the freedoms of people in  America and makes America more of a country that you would not want to  move to start new manufacturing. That is one of the things that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…way, don't be surprised if you are arrested  and thrown into jail--and you should be.\n\nThanks to investigative reporters like Nick Shirley and folks at the  Maine Wire, we are slowly turning the tide on fraud and corruption.  Deep state and the fake news media and third-world Islamists are  eroding our country from within.\n\nWe need to wake up. American…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…allow harm to  happen to our children when there are no consequences, and these  companies walk away without responsibility.\n\nBig Tech has become a digital fentanyl that is slowly killing our  children. It is pushing parents to the sidelines. It is acting as  therapists. It is replacing relationships with robots. This must stop.\n\nParents are fighting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699340/repeal-section-230"}, {"senator": "John Thune", "party": "Republican", "sentence": "…say that the commentary has felt somewhat muted so far, and I  suspect that is because Democrats know they don't have a leg to stand  on here. After years of partisanship and slowly eroding the  confirmation process, they finally went all the way and broke it, and  they have to know that. So it is no surprise that they aren't exactly  able to mount a compelling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…are. The good news is the rate of  inflation has gone down, but we still have the higher baseline sticking  around from the Biden era. In other words, prices are rising more  slowly, but they are still high.\n\nThe good news is that Republicans have taken important steps that  will help ease the affordability crunch for all Americans, particularly  when…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch until recently has been slowly  processing eligibility applications and conveyances, leaving many  veterans in limbo. As of January 2025, out of more than 2,000 eligible  Alaska Native veterans, only 41…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}]