[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…pleased to put forward this  commonsense, bipartisan legislation that will ensure rural small  businesses can operate on a level playing field.\n\nThis bill requires the Small Business Administration to ensure that  small businesses located in rural areas have full access to SBA  disaster assistance in the wake of a natural disaster.\n\nThe SBA's disaster loan…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…challenges and the opportunities. That is not right, and it is our job  as lawmakers to correct it.\n\nIn 1990, Congress created the Office of Rural Affairs within the  Small Business Administration to tackle this problem set, but as we  have seen over the past 35 years, the office is underperforming. It  lacks experienced and accountable leadership, and the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…and bipartisan legislation, which I am proud to co-lead  with my colleague, Congressman Meuser, to bring better oversight and  real accountability to one of the Small Business Administration's most  important loan programs, 7(a).\n\nMr. Speaker, small business owners aren't asking for easy. They are  asking for a fair shake and a real shot. That is what…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…priorities at home and abroad.\n\nThis bill supports the small businesses and entrepreneurs that fuel  the American economy by providing more than $1 billion for the Small  Business Administration and increasing funding for entrepreneurial  development programs by $13 million.\n\nSmall businesses employ nearly half of the American workforce. At a  time when…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…as we have had tighter and  tighter bank regulations, banks have been reluctant to lend money to  small businesses except where their risks are guaranteed by the Small  Business Administration. SBA loans are, of course, limited.\n\nWe need BDCs to provide investment and to provide management  assistance to growing businesses that are often underserved by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…dignity, and freedom for Americans with disabilities, but  to drive economic growth.\n\nThis bill, my bill, our bill, creates an essential partnership  between the Small Business Administration and the National Council on  Disability to help individuals with disabilities pursue self- employment, dignity, launch small businesses, and thrive in the  workforce.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691779/thinkdifferently-about-disability-employment-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…hole through the deficit, $37 trillion  over 30 years, while they are trying to gut the infrastructure that  helps small businesses survive.\n\nThey have attacked the Small Business Administration. They have a  bill on the floor this week that would take SBA out of our communities.  They slashed the New Mexico Minority Business Development Agency. We  are…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691939/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Speaker, turning to our first bill, H.R. 825 will prohibit anyone  convicted of defrauding the government during the COVID-19 pandemic  from receiving an SBA loan.\n\nThe Small Business Administration disbursed approximately $1.2  trillion in economic aid during the pandemic. The vast majority of this  aid served as a lifeline, helping to keep small businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…struggled throughout the pandemic.\n\nIn Oakland's downtown, for instance, many of these institutions are  fighting day in and day out just to stay afloat. I thank the Small  Business Administration employees who work hard to support them.\n\nThese wonderful Federal employees have been connecting with small  businesses in our district with emergency assistance,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…are going to  school. Services by farmers who actually produce goods that are sold  into this agricultural program would be cut.\n\nThey are cutting funding to the Small Business Administration. Most  people in my district are interested in their hustle, their small  business that they are trying to get off the ground. I thought that was  why the SBA was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to introduce legislation to  ensure that the U.S. Small Business Administration (SBA) fully supports  our small businesses establish and maintain employee stock ownership  plans (ESOPs).\n\nESOPs offer a powerful way to ensure employees become…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…capital,  and credit.\n\nThis bill would provide a report on the availability of veteran and  reservist small business owners' access to credit. It would require the  Small Business Administration's Interagency Task Force on Veterans  Small Business Development to develop an action plan for outreach and  promotion of the many programs available to veterans…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…they foster innovation, and they drive our local communities forward.  They should be who we lift up and support, and they rightly are the  beneficiaries of many Small Business Administration programs.\n\nHowever, far too often, we have scammers taking advantage of these  worthy programs. We saw this, for example, during the COVID-19  pandemic, when the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…in our country. It  is still an epidemic.\n\nNo. 69, threatened to block a media merger if CBS didn't change its  reporting.\n\nNo. 70, gave DOGE access to sensitive Small Business Administration  data.\n\nNo. 71, Signalgate.\n\nNo. 72, abducted Rumeysa Ozturk off the streets of Somerville, MA--a  graduate student whom I just visited in prison in Louisiana.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…of  Education as part of the dismantling of the Department--I could not  resist this example--President Trump proposes to move the student loan  portfolio to the Small Business Administration, which has neither the  capacity nor the expertise needed to handle this massive program. The  SBA is one of the smallest Federal Government Agencies. How is it…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 804) to require the Administrator of the Small  Business Administration to improve access to disaster assistance for  individuals located in rural areas, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…William M. (Mac) Thornberry       National Defense Authorization Act for Fiscal Year 2021 (15       U.S.C. 9401).''.\n\n(b) Deadline.--The Administrator of the Small Business       Administration shall establish the educational resources and       modules required by section 49 of the Small Business Act (15       U.S.C. 631 et seq.), as added by this…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 788) to provide for Department of Energy and Small  Business Administration joint research and development activities, and  for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…dollars are wasted, and funding for businesses and individuals  in need of this vital support is squandered and stolen.\n\nOver the course of the COVID pandemic, the Small Business  Administration carried out an extensive effort, channeling funding to  small businesses facing unprecedented economic challenges. In total,  SBA provided over $1.2 trillion in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 828) to require the Administrator of the Small  Business Administration to report on the veterans interagency task  force, to require the Comptroller General of the United States to  report on access to credit for small business concerns…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, pursuant to House Resolution 458,  I call up the bill (H.R. 2966) to require the Administrator of the  Small Business Administration to require an applicant for certain loans  of the Administration to provide certain citizenship status  documentation, and for other purposes, and ask for its immediate…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…description of a Secretary of Education is to manage a  bureaucracy that runs a number of funding programs. By all accounts,  Linda McMahon did a great job running the Small Business Administration  in the last Trump administration. I have no reason to believe that she  cannot run the Department of Education. I think she understands the  difference between…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Mr. President, I rise today to seek unanimous consent to  confirm Casey Mulligan, the President's nominee to be the chief counsel  of the Office of Advocacy at the Small Business Administration.\n\nI will make that motion in just a moment, but first, let me explain  why I am doing this. This week is National Small Business Week, a week  to recognize the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Security death files. The oldest person in America is, what, 114  years old? We took people over 114 years old and then wondered how they  were getting loans at the Small Business Administration.\n\nForgive my math. I am doing this from memory from last week. There  were like 3,300 people who were over 114 years old who got SBA loans.  Mr. Speaker, $300 million…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Regulatory Commission, the       Securities and Exchange Commission, the Securities Investor       Protection Corporation, the Environmental Protection Agency,       the Small Business Administration, the Federal Housing       Finance Agency, and the Office of Government Ethics.\n\n(d) Index.--Not later than 2 years after the date of       enactment of this Act--…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…data on small  business loan applications, raising costs and potentially limiting  access to capital.\n\nTo ensure we are hearing directly from those affected, the Small  Business Administration has also now launched recently a red tape  hotline, giving small business owners and manufacturers a direct  channel to report excessive or unworkable Federal regulation…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1621) to require the Administrator of the Small  Business Administration to submit to Congress a report on the  entrepreneurial challenges facing entrepreneurs with a disability, and  for other purposes, as amended.\n\nThe Clerk read the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…I move to suspend the rules and  pass the bill (H.R. 825) to prohibit individuals convicted of  defrauding the Government from receiving any assistance from the Small  Business Administration, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 825\n\nBe it enacted by…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…opportunities meant  for them. That is wrong, and that is exactly the kind of Washington  loophole I am working to close.\n\nSelf-certification invites fraud. In fact, the Small Business  Administration's own inspector general has repeatedly warned about the  risks of fraud under self-certification. This was especially apparent  with the SBA's COVID-19 lending…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Sec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 2965) to       require the Administrator of the Small Business       Administration to ensure that the small business regulatory       budget for a small business concern in a fiscal year is not       greater than zero, and for other purposes.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}]