[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…managers--those are the people assigned by FEMA to serve communities as  the bridge between the local community and FEMA--they are changed  constantly. So we have had in some of our small towns--and I am talking  towns with a population of like 300--they have one program manager  after another and over the course of a year and a half might have seven  or eight…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…another.\n\nI am proud to represent Milford in Congress, and I will keep fighting  for the investments, partnerships, and policies that empower towns like  Milford to thrive. When small towns succeed, our whole State grows  stronger.\n\nCelebrating the Anniversary of the Liberation of Delaware\n\nMs. McBRIDE. Mr. Speaker, I rise today to commemorate the anniversary…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…agents that aren't just in  Minneapolis or St. Paul--that, actually, I don't think people quite  understand. They are all over our State. They are in the suburbs. They  are in small towns.\n\nThe number of calls that we get--my office is handling hundreds and  hundreds of cases right now, but the cases of just someone who is in  the store and gets stopped because…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…beautiful repeal instead.\n\nLet's pass the Protecting Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that people  in small towns and rural communities will have more access to quality  care, not less.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…a fan. I have been a fan for a long time so I will confess my  prejudice.\n\nBut I am also from Downstate Illinois. That is the part of the State  outside Chicago where the small towns and the rural areas are located.  I know what public broadcasting means to those areas. I heard firsthand  an example of what it means.\n\nA lady named Heather Norman, who…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…communities that had to rely  on bottled water or prohibitively expensive water treatment.\n\nThis area covers a quarter of the land mass of Colorado. It is  sprinkled with small towns and populated with small business owners and  farmers and ranchers who are dedicated to a rural way of life, who have  been fighting--generation after generation after generation--to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…afflicted by  asthma or needed chemotherapy, it would be critical.\n\nI won't speak for either Senator of Arkansas, but helping pediatric  cancer survivors and asthmatic kids in small towns sure seems like  something worth fighting for, and I hope the Senators from Arkansas  agree with me that this is a serious mistake for President Trump to cut  the funding…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…families--\n\nI am going to repeat that.\n\nThree million children in military-connected families, more       than 40 percent of the children living in rural areas and       small towns, patients in rural communities would be hit       especially hard as hospitals and clinics in these areas rely       heavily on Medicare funding to stay open.\n\nHere is a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…least  afford it.\n\nMr. Speaker, the cuts in this bill are not just numbers on a page.  They are empty cupboards and shuttered clinics. They are hospital wings  closed in small towns already struggling to keep their doors open. They  are parents lying awake at night wondering how they will afford  medicine for a sick child or how they will keep food…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health insurance payments were just today and  a few weeks ago. These could get raised by more than $3,000 next year.\n\nIn Jackson County, in Southern Illinois, an area of small towns and  rural areas, residents there, on average, will see their monthly  premiums go from $122 a month to $458. That is a difference of $330 a  month, a 274-percent increase.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, I rise today in opposition to Linda  McMahon's nomination to serve as the Secretary of the Department of  Education.\n\nAll across America, from small towns like Grand Marais to cities like  Grand Rapids, public schools serve as the bedrock of our communities.\n\nAs a product of Michigan public schools, the son of a public  schoolteacher,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…throughout Kent County  year in and year out, consistently standing alongside their community  and demonstrating that successful small businesses are the bedrock of  our small towns.\n\nSayers is one of many examples in Delaware and beyond that reminds us  how essential it is that we support small businesses, innovation,  entrepreneurs, and the folks…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…They have already warned us: Unless something is done, there is going  to be a lot of closures and a lot of reductions of services in these  hospitals in rural areas, in small towns, and the inner city. That is a  fact.\n\nIf you want to give tax breaks to the wealthiest people and you don't  care about the impact on the regular families of America, that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…ranking member for the time.\n\nI rise today because I believe the Federal Government has a  responsibility to stand with all communities across northwest Indiana-- big cities, small towns, and neighborhoods--that are rolling up their  sleeves to rebuild and create work and wealth for their residents. I  want to thank the leaders, Chairman Cole and Ranking…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…TV repairman jobs out there.''\n\nToastmaster is a household name. Well, they were headquartered in  Missouri, and they made their stuff in Missouri, too, with factories in  small towns all across our State; but as we welcomed China into the  world economy, Toastmaster began to feel the squeeze of cheap Asian  imports. By 2001, every Toastmaster plant in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the call--not for glory but for country.\n\nIt is not just the history books or the battlefields that define the  Army. It is the people. It is the young men and women from small towns  and big cities who raise their hands, lace up their boots, and swear an  oath to protect this Nation and its values.\n\nI have seen what that sacrifice looks like. I have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…quality, consistency, and community  support of a small business operating in a humble setting.\n\nThis commendation serves as a reminder that entrepreneurship thrives  in small towns and family-owned storefronts across America.\n\nToday, I congratulate NFA Burger for this tremendous achievement.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…unimaginable for the sport of  hockey.\n\nThose Minnesotans from my district were Buzz Schneider, Mark  Pavelich, Bill Baker, Phil Verchota, and John Harrington. Look at the  small towns where they came from: Grand Rapids, Eveleth, Babbitt,  Virginia, and Duluth. These players grew up loving the game.\n\nThey put that USA jersey on and were coached by Herb…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…changed the course of World War II and, ultimately, the course of world  history. But behind that massive operation were brave individuals like  Floyd--young Americans from small towns like Wauchula, Florida--who  answered the call to serve without hesitation. Mr. Wells' bravery, and  the bravery of all who fought beside him, helped secure the freedom…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…rapid, complete, and without any infections.\n\nMr. Speaker, I represent one of the most rural districts in America.  The long drives to a hospital faced by people living in small towns in  remote areas can make seeking care prohibitive. Hospital at home  shrinks the physical distance stopping rural patients from getting  care. Hospital at home has been…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, in small towns and communities across  America, rural hospitals are critical lifelines. They provide emergency  care, support seniors and veterans, deliver behavioral health services,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking is not just a distant overseas problem. The issue  is here. It is in our communities. It is in our small towns. It is in  our big cities.\n\nI am from Texas and Texas being a border State, we are a hot spot for  human trafficking. We lead the country in that issue. I asked our  elected…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]