[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Service to deliver their medications, Social Security checks, and other  important correspondence, along with birthday cards from Grandma. The  post remains a lifeline for small businesses, who often cannot afford  to use large for-profit shipping corporations, as well as for rural  Americans. And USPS continues to support our democracy by helping…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…thousands of companies.\n\nTake a drive through the Port of Toledo. You will see mountains of  aluminum and steel stockpiled, stalled, waiting. Waiting for what? Our  workers and small businesses are paying the price for a trade war that  didn't need to start, and we certainly can't win as a joint economy.\n\nOur region, the Great Lakes region, we share with…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…empty when they are going to  school. Services by farmers who actually produce goods that are sold  into this agricultural program would be cut.\n\nThey are cutting funding to the Small Business Administration. Most  people in my district are interested in their hustle, their small  business that they are trying to get off the ground. I thought that was  why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…portion of the Erie Canal. This is a bold vision that  connected a great ocean, the Atlantic, with the Great Lakes. It allowed  for not only the strengthening of the port of a small place called New  York--New York City--but gave birth to a necklace of communities dubbed  ``mill towns'' that became the epicenter of invention and innovation.  They not only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…single mother, working full time is  worried that her child's school won't be able to keep him safe during  recess or after-school sports practice. A landscaper, growing his small  business, was diagnosed with kidney disease in his early 30s due to  heat exposures.\n\nMembers of the Extreme Heat Caucus and I are fighting for the Federal  workforce that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginia is estimated to  cause about 330,000 Virginians to lose their health insurance. Our  population is about 8.8 million; 330,000 people losing health insurance  is not a small number. This is a big--big--deal. That number of people  who lose their health insurance is essentially what I call the top  layer of a five-layer cake of consequences to these…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…celebrate the 20th  anniversary of New Life Centers, an organization that I am proud to  represent in my district.\n\nLed by Pastor Matt DeMateo, New Life Centers started as a small group  working on community violence intervention programs and is now a  citywide movement providing our youth with mentoring, education,  sports, play, summer day camps, after-school,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…the co-lead on this  legislation, along with my friend, colleague, and fellow Air Force  veteran, Representative Downing.\n\nDuring the COVID-19 pandemic, more than 30 million small businesses  were negatively impacted. The Federal Government took action to ensure  that an unprecedented amount of money flowed into small businesses in  the form of grants…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the health insurance payments were just today and  a few weeks ago. These could get raised by more than $3,000 next year.\n\nIn Jackson County, in Southern Illinois, an area of small towns and  rural areas, residents there, on average, will see their monthly  premiums go from $122 a month to $458. That is a difference of $330 a  month, a 274-percent increase.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…families when people are already stretched thin.\n\nI have heard from families across my district who are forgoing  coverage this year because of the absurd premium increases.\n\nA small business owner in Bremerton said that her new monthly premium  for her family of three would be more than her mortgage, costing  $35,000 a year. She is now being forced to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…resolutions, and responded to more than 43,000 messages from  constituents.\n\nThese numbers are an impressive but inadequate measure of my staff's  contributions. In ways large and small--sometimes splashed on the  frontpage of the newspaper but more often known only to a single  family--they touch the lives of the people I represent.\n\nTheir service isn't just…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…push our grid toward more  expensive and polluting sources of energy at the very moment families  are struggling with rising energy bills.\n\nAcross this country, households and small businesses are seeing  electricity costs rise by hundreds of dollars. Demand for power is  rising quickly, and this year, utilities have already proposed major  rate hikes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for the last several decades. Our Nation's share of global  manufacturing activity declined from 28 percent in 2002 to just over 17  percent in 2020.\n\nInvestment in America's small and medium manufacturers, the bedrock  of our industrial might, has also declined over the last 20 years by  more than $200 billion. In that same two-decade period, our domestic…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…identify tax policy improvements, to help taxpayers  at large, and for their work to help individual taxpayers when they  need assistance with a specific problem.\n\nThe bill makes a small but important statutory clarification that the  National Taxpayer Advocate may appoint and supervise her own legal  counsel, rather than only using attorneys that report to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, we just heard all day from Republicans on the  other side of the aisle that the Tax Cuts and Jobs Act is going to lead  to helping small businesses and reducing the deficit. Yet, what we just  missed in all of this discussion was any discussion of the T-word, and  I am not talking about Trump here. I am talking…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Corps Recruit Depot Parris Island, followed by infantry training  at the School of Infantry.\n\nDuring his military career, Domenico served as an Infantry Rifleman  and later as a Small Unmanned Aircraft System Operator. He was assigned  to 1st Battalion, 8th Marines, Bravo Company, where he served as an  Automatic Rifleman and advanced to become a Senior…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…bakery. It has been a  pillar of joy in our community. Founded by Howard Smith and Roy  Balmain, the goal was simple: to provide the best baked goods possible.\n\nAs we celebrate Small Business Week, Smith's Bakeries exemplifies how  local businesses can thrive while staying deeply connected to their  customers. A key part of their success is Jim Balmain,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690793/recognizing-smiths-bakeries"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3174) to increase loan limits for loans made to  small manufacturers, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3174\n\nBe…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the risks the  U.S. Government is subjecting its citizens to. It would also allow the  public to hold the government accountable for its actions.\n\nBorder Patrol had produced small iterations on this data for 2016 to  2018 and it would be helpful to re-start this publication at a more  frequent cadence.\n\nI urge you to support H.R. 275.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Schweikert for  yielding to me.\n\nMr. Speaker, this past weekend, I had the wonderful opportunity to  stop in at Top of the Mountain Farms in Ashe County and support a local  small business selling Christmas trees and wreaths.\n\nBecky and Bill Fairchild, the owners of this Christmas tree farm,  were very welcoming. I was fortunate to meet their three daughters--…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697374/fun-with-math"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…farm in Kitts Hill and made  history as the first Miss Ohio from Lawrence County.\n\nOlivia is proud of her rural and Appalachian roots and hopes to be a  role model for other small-town girls. She is a musical theater  graduate of Oklahoma City University and is currently pursuing a law  degree at The Ohio State University.\n\nOlivia's community service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…requires this kind of time, the Senate is  no longer functioning. So what we had proposed was a pretty  straightforward proposal; that is, that we actually can move nominees  in small batches--let's say 15--once they come out of committee. So  they have had vetting in committee; they had had a hearing in  committee; they have passed out of committee; they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…isn't a partisan issue. Keeping our government open means  protecting servicemembers, honoring veterans, supporting mothers and  infants, keeping our border secure, and helping small businesses access  the loans they need.\n\nAs we approach the government funding deadline, I support this clean,  short-term continuing resolution. It prevents a costly shutdown,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695824/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…policy, but as a  matter of preparedness.\n\nTogether, we can ensure that our men and women in uniform and their  families have what they need when they need it.\n\nRight now, our small-caliber ammunition stockpiles are not where they  need to be. This is unacceptable. This bill makes critical investments  to fix that, Mr. Chair. It ensures we are getting…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…emissions. This new charge  can equate to an effective tax increase on natural gas on top of other  taxes of more than 5 percent.\n\nThis will have a disproportionate impact on small oil and gas  producers in my home State of North Dakota and across the country, many  of which already operate on thin margins and cannot afford the high  costs to comply with…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…increase the costs of an existing private-sector mandate on       entities required to pay those fees. CBO estimates that the       incremental cost of the mandate would be small and would fall       well below the annual threshold established in the Unfunded       Mandates Reform Act (UMRA) for private-sector mandates ($206       million in 2025, adjusted…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Phoenix was founded  in 1867, Boise in 1863, and Helena in 1864. Of all Western States'  capital cities, only New Mexico's, Albuquerque, is older than Salt  Lake.\n\nFrom that small beginning of 148 souls, a city and metro-area  population of over 1.2 million and a State population of over 3.5  million have grown. From that small beginning, a mighty State…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…guidance documents make up a great deal of the regulatory  activity in our country, yet the agencies themselves can't even manage  to track them down. How is an individual or a small business supposed  to find out what this particular interpretation of the law is and how  it will affect them, let alone how Congress is supposed to figure out  how the laws…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…neck,  and they tried to get him. One of these guys did that to an ICE  officer.\n\nWhere is the concern for our law enforcement? My grandfather was the  chief of police of a small town in West Texas back in the 1940s. Where  is the concern for them? My great-great-grandfather was a Texas Ranger.  I was proud to be in the U.S. Attorney's Office, proud…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…thresholds so well-run banks can focus on lending, not paperwork;  expanding community and rural banks' access to stable deposits so that  they can lend locally and support small businesses and households;  supporting rural banks; encouraging new bank formation; and providing  regulators flexibility to handle failures without hurting local access  to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}]