[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…those kids got home.\n\nIn Twisp, Washington, a small, rural town that Trump won last  November, hundreds of residents gather every Saturday to protest cuts  to Medicaid and SNAP. These are cuts that will devastate their  community. One resident, a school teacher of over 30 years, said they  protest because: ``Democracy only works if we work it.''\n\nIn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…strategy of maximum pain to magnify political  pressure.\n\nIn just minutes from now, in the U.S. Court of Appeals for the First  Circuit, this administration will argue that SNAP benefits should be  ended after the President himself promised that they would be paid in  full in compliance with the district court orders in Rhode Island and  Massachusetts.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…oppose harmful cuts to food  and health assistance.\n\nToday, I rise to share the story of Cheryl from Cleveland Heights, a  constituent whose life could be upended by cuts to SNAP and Medicaid.\n\nCheryl is a retired small business owner who ran an advertising  company with her husband for 25 years. They were forced to close that  business due to their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691428/gop-tax-scam-hurts-women-and-families"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…constituents, many of them senior citizens in my district  alone, not to mention the nearly 1 in 10 Asian Americans across our  country that rely on food assistance through SNAP and the 1 in 6 NHPIs  living in poverty.\n\nMeanwhile, the top 20 percent of income earners will get nearly 70  percent of the benefits of this bill.\n\nThere are hungry grandmas,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691503/gop-tax-scam-hurts-women-and-families"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN.  He was hungry, and I fed him.\n\nMedicare, healthcare, SNAP payments, and nutrition payments should  not be taken away from fellow passengers on this Earth.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693209/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…cuts to food assistance will mean that more people, many  of them children, will go hungry. This bill guts the Supplemental  Nutrition Assistance Program, otherwise known as SNAP, and takes away  critical food assistance from vulnerable groups, including veterans,  people who are homeless, stay-at-home parents, and youth aging out of  foster care. Now…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…America's hardworking moms and dads, who may work  multiple jobs but still don't make enough to afford groceries under  this administration, deserve to know that they can rely on SNAP during  rocky times so that their 7- and 8-year-old kids have something to eat.\n\nSeniors deserve to have full fridges and access to healthcare that  they have paid into so that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and electric bills are all soaring. The cost of beef,  coffee, and vegetables just keep climbing.\n\nPeople are really struggling to get by, yet Donald Trump continues to  block SNAP benefits to 42 million struggling seniors, parents, and  veterans.\n\nHow anyone could swipe food from the plates of nearly 20 million  children like that is simply disgusting,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…affordability crisis just to line the pockets of their billionaire  donors.\n\nThe big, ugly bill is also the largest cut to food assistance in  American history. The bill cuts SNAP benefits by 20 percent for all  participants, or roughly $200 billion, jeopardizing SNAP benefits for  more than 40 million people, including 16 million children and 8  million…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…rule XIX me or something like that.\n\nSo here is the final bipartisan poem that gets our most highest honor  here in the Senate, and it comes from Emma Ross.\n\nEmma.\n\nYou can snap for Emma before the poem, but shouldn't you wait to hear  what she wrote first? Gosh, premature ``snap-ation'' is a bad thing.\n\nHere we go. From Emma Ross.\n\nI came from quiet…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…that I hear consistently is that people are scared. These are good,  honest, hardworking Americans who in one way or another have been  forced to rely on Medicaid, Medicare, SNAP, WIC, Head Start, Social  Security, or LIHEAP in order to make ends meet for their families, and  they are rightfully scared that Republicans are planning to gut those  programs.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…in  this country that hold our Nation together with their own hands: The  working parents who will absolutely go hungry and will come home to  empty refrigerators when their SNAP benefits are cut under the  majority's big, cruel bill. Then there are those who cannot sleep at  night because their child has a rare form of cancer and are worried  about…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692264/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…needs to be done to support our workers. This is especially true  as the Trump slump threatens our tourism economy and the Trump  administration cuts vital safety nets like SNAP.\n\nThat is why I introduced the LIFT Act last year. It would raise the  minimum wage and all subminimum wages to $17 an hour over the next 3  years with annual increases after…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…McGOVERN. Mr. Speaker, it is incredible to be lectured by people  who claim they are pro-life but who vote to take food away from hungry  kids in this country, who vote to cut SNAP by $200 billion in the big,  ugly bill, who vote to cut Medicaid by $1 trillion in the big, ugly  bill. It really is incredible. It takes my breath away.\n\nBonamici).\n\nMr. McGOVERN.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Wind alone will provide hundreds of millions of  dollars each year in energy bill savings to New England.''\n\nThe ISO, the grid operator, specified that during a specific cold  snap, from December 24, 2017, to January 8, 2018--what is that?--2  weeks, basically--had this offshore wind been online during that  period, it would have ``lowered regional electricity…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…paid. Federal employees are not being paid. These  young men and women here, our pages, are not being paid. Our military  is only being partially paid.\n\nI am confused about SNAP payments. Some say the payments are being  made; some say they aren't. I don't know who is telling the truth. But  I do know this: I don't think anybody wants to see anybody…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to collect temporary assistance for needy families.\n\nThe Trump administration built on previous successful work  requirement policies by issuing a rule that would condition SNAP, or  food stamps as they are sometimes called, on similar work requirements.  After all, why should somebody be able to qualify for food stamps if  they are able to work and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…country--as a matter of fact, a  newspaper in the Senator's home State of Oregon reported:\n\nFood is the first thing to go.\n\nThe Oregon paper went on to say:\n\nOregonians brace for SNAP delays if federal shutdown drags       on.\n\nAnd still, for 34 days, Democrats have voted time and time again to  keep the government closed. If Democrats hadn't voted 13 times…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Chamber? It has also received  endorsements from stakeholders across the board, including from child  safety advocates, pediatricians, and tech companies like X, Microsoft,  Snap, and Apple, which announced its support today.\n\nIn the weeks ahead, we are going to work with our colleagues in the  House of Representatives to ensure that this vital legislation…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…leftist corporations  at the expense of the ability of the American people to have reliable  grids and affordable energy.\n\nWe were able to advance welfare and Medicaid reforms, SNAP work  requirements, commonsense work requirements for Medicaid.\n\nWe phased down the Medicaid provider tax threshold to save money and  save hundreds of billions of dollars,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…participating in the workforce and contributed to inflation.\n\nMr. Chair, we must meet the vital supplemental food needs of  Americans that Congress committed to fulfill through SNAP, and we will.  We cannot allow excess or lack of accountability within the  bureaucracy, though, to compromise fulfilling that obligation.\n\nThoughtful policies that recognize…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…continued to blatantly lie about our  legislation throughout this process. Rather than work together to get  our fiscal house back in order and ensure programs like Medicaid and  SNAP are on a sustainable path, they have chosen to misrepresent and  oppose everything we are working toward.\n\nAs the fifth generation to grow up and work on my family farm, I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, SNAP benefits have been in the news  and a topic of much discussion, and those benefits for over 40 million  Americans lapsed over the weekend because the Democrats have chosen to…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…has been stacked against them by SEC  rules that make accessing investment capital complex, more expensive,  and harder for those who don't live on the East or West Coast who snap  up the lion's share of investment dollars before it can even get to the  heart of the heartland.\n\nIowa's businesses, America's businesses, deserve an equal opportunity  to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…losing and who is setting themselves up to have the  next President or win the midterms instead of worrying about whether  the airways are safe, whether WIC is funded, whether SNAP is funded,  whether workers are funded, whether the military is funded; since we  are going to fight over who is going to win the election a year from  now, let's excuse the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…should not have to choose  between accepting the settlement trust income they are entitled to or  qualifying for Federal benefits such as supplemental security income,  SSI, or SNAP, the Supplemental Nutrition Assistance Program, as well as  housing assistance. Now, with this bill, they are not going to have to  make that choice.\n\nThe second measure is…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…homeland against new threats by  funding President Trump's Golden Dome.\n\nIt enhances the capacity of America's naval fleet.\n\nIt modernizes air traffic control.\n\nIt strengthens SNAP benefits.\n\nIt implements critical program integrity and cost-containment  provisions in Medicaid to strengthen it for future generations.\n\nIt safeguards the Second Amendment…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of Pennsylvania. Mr. Speaker, the One Big Beautiful Bill  Act marks the most significant investment in our farm economy in  decades and delivers the most sweeping reforms to SNAP since the  program's creation.\n\nWe are saving nearly $200 billion by restoring integrity to SNAP,  closing loopholes, reinforcing work, and ending unchecked State abuse,  all…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693176/one-big-beautiful-bill-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…add sugar to it? Did they add salt to it? Then I would  probably turn away from it.\n\nIt is fresh or frozen. Real food--healthy food--is fresh or frozen.\n\nI am so glad that the SNAP program is now going to require all the  grocery stores to double the amount of opportunities of choices that  you are going to have from this real food selection.\n\nReal food…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…defender of waste, fraud, and abuse in Washington, but we are cleaning  it up in this bill.\n\nUSDA has pointed out that there is about $10 billion a year in waste  just in the SNAP program because of fraud and improper payments. These  payments are not going to children that you hear about on the floor,  and not all these other people. It is going to improper…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}]