[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Edwards, Leslie, Linda B., Linda D. Lee,       Linda Oeth, Linda Richardson, Lisa Morenoff, Lore       Wintergreen, Lori Stefano, Lorraine Brabham, Lowell Palm,       Lucinda Snow, Lynette Rynders, Lynn D. Carlson, Madeleine       Straubel, Madeline Hall,\n\nMaeve Gallagher, Maggie Kelfstad, Marcia Curry, Mark       Schroeder, Marsha Davison, Marta Beresin,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…program that the most vulnerable in our communities, especially our  seniors, rely on to pay their bills. This will mean more water shutoffs  and more stories of families melting snow and harvesting rainwater to  shower and cook with.\n\nOur policy has to meet our principles. Water must be a human right in  the United States of America.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…would be incomplete without acknowledging  America's incredible postal workers. Continuing in the tradition of  President Lincoln, postal workers ensure that through rain or snow,  heatwaves and arctic blasts, Americans receive their essential mail. As  we celebrate the U.S. Post Office's anniversary, I want to extend my  sincere gratitude to postal…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…which is a critical water source in the West. It is  vital to farmers, forests, and every community I represent.\n\nThe scientist was with the Department of Agriculture's Oregon Snow  Survey.\n\nHere is what he said:\n\nMy job was to collect tangible data from the snowpack which       could be used to determine a community's yearly water budget.       I am completely…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688208/fired-by-president-trump"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "I rise in enthusiastic support of H.R. 3857, the Snow Water Supply  Forecasting Reauthorization Act, brought forward by my colleague and  fellow freshman, Jeff Hurd.\n\nThis legislation, as he described, would extend the Bureau of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…$13,000. How do you deal with that? A hit to the  margin is--no business can absorb that.\n\nVermont is also home to one of two businesses in the world that  produce these unique snow globes, and they have been in business for 25  years. It is a modest business, but it is one that was created by a  Vermont entrepreneur, and it has been really successful.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…constituents, a husband and wife who both worked for the  U.S. Forest Service. They were both let go. They both did that work and  trail maintenance. They also protected people during snow season in  snow parks. These are year-round, family-sustaining jobs, and these are  people without whom we all suffer.\n\nThere is another worker from my district who was fired…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…cosponsors, Representatives Scholten and  Representative Gillen.\n\nDeicing an aircraft is a vital part to maintaining safe flight  operations, particularly during takeoff. As ice and snow accumulate on  an aircraft's surface, particularly its wings, it can make the aircraft  much harder to control and fly. That is why operators are federally  mandated to use…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the wasteful spending priorities of President  Biden now exposed by the Trump administration: $500,000 for a Lesbian  Justice Foundation in Canada; $9.3 million to the John Snow Research  and Training Institute to advise Russian doctors on how to perform  abortions and gender analysis; $800,000 for transgender people, sex  workers and their clients…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…and efficient deicing operations are essential to keeping  passengers, crews, and cargo moving during winter months.\n\nAircraft are uniquely sensitive to any amount of ice and snow that  accumulates on the airframe, causing irregularities that add weight,  interrupt airflow, and can come loose during flight, potentially  damaging critical flight systems.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…powerful storm has  affected millions of Americans across the country, but its effects were  especially severe in the South, a region not typically equipped to  manage prolonged snow, ice, sleet, and dangerous winter conditions.\n\nThis storm was particularly devastating in Mississippi, a State that  simply lacks the infrastructure and equipment necessary…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Democrats are moving forward with a ban on natural gas and  propane hookups in new construction starting in 2026. That means  families in western New York, where winters are long, snow is great,  and it is cold and oftentimes dangerous in these terrible winter  storms, they will be denied the ability to choose the energy source  that best keeps them safe and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…stupid.\n\nSome shutdowns are based on policy. Some shutdowns are based on  politics. Some shutdowns are based on a combination of both. This one  is pure. It is as pure as Ivory Snow.\n\nThis shutdown is based on politics. Let me tell you what is going on.  I believe in the two-party system. Why? Because two parties create  competition, and competition makes…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska, as I usually do  during my ``Alaskan of the Week'' speech and just give a snapshot of  what is happening back home.\n\nIt is still pretty cold, still have a fair amount of snow. Anchorage  just got a bunch of snow that lasted a couple of days. The 53rd  Iditarod just concluded in Nome with a stunning first-time win by  Alaskan Jessie Holmes and his…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…associated with designing the new LC-130J as part of LC-130  recapitalization project.\n\nLC-130s are polar ski planes that possess the unique capability of  being able to land on snow instead of solely on a paved runway. The LC- 130 is the only plane in the world with this capability and provides  the United States with a key competitive edge in the Arctic…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…want to  do business with. In cash, that is still the case. When you hand a $20  bill to somebody for sweeping your driveway or a $100 bill for  shoveling your driveway in the snow or things like that, that is  between you and maybe the high school kid who came and shoveled your  driveway. There is no third party to get in between you and the other  person.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3857) to amend the Snow Water Supply Forecasting  Program Authorization Act, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Freelance; Jackson, Lawrence: Freelance; Jennings, Graeme:       Washington Examiner; Jiang, Haiyun: New York Times; Jimenez-      Stuard, Olga: Washington Post; Joachim, Jade-Snow: Politico;       Joseph, Marvin: Washington Post.\n\nKahn, Gregory: Freelance; Kaster, Carolyn: Associated Press       Photos; Katopodis, Anastasios: Freelance; Katz, Martin:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…themselves  in new cultures.\n\nMax, a native of Berlin, Germany, began interning on Capitol Hill  earlier this year. Before moving to Washington, D.C., he spent a  semester at Snow College in Utah.\n\nMax has spent this month helping our office with everyday operations.  Following his time in D.C., he will complete an internship in Oregon  with an energy…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700248/recognizing-congress-bundestag-youth-exchange-program"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that?\n\nWell, for sports like soccer, these are winter sports in California,  but they are quite hard to play in the winter in this part of the State  because there is a lot of snow. They are spring sports in Nevada. So in  order to allow young people to play soccer and other sports, they  compete in Nevada.\n\nHowever, the State of California has just ordered…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}]