[{"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…grown into a  thriving, two-campus district, East Leyden and West Leyden, now serving  more than 3,300 students with over 200 dedicated teachers.\n\nRooted in blue and gold and soaring under the banner of the eagle,  Leyden's commitment to academic and artistic excellence has inspired  pride, unity, and spirit across the district's communities.\n\nTrue to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…that were  used to bar coverage for so many people before the Affordable Care Act.\n\nThis is their commitment to deny healthcare, to provide no relief on  premiums that are soaring. In short, it means replacing ObamaCare with  nothingcare.\n\nMr. DOGGETT. While we are thankful for this belated decision of four  Republicans here at the last minute to join…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698310/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…vote to extend the ACA tax credits.\n\nMr. Speaker, Republicans have made life too expensive. From burger  and coffee prices to rent, home insurance, and utilities, costs keep  soaring. We can't add crushing cost burdens by forcing families to pick  between seeing a doctor and buying groceries.\n\nYes, Republicans chose to unleash this healthcare crisis, but…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…your       way . . .\n\nSo I leave you now with this final reminder: God, this       world needs to become a lot kinder.\n\nSo, when angry, when joyful, when weary or mad.\n\nWhen soaring with hope, or aching and sad.\n\nWhen lost, when certain, or when unsure of your way--\n\nWhen life makes no sense at the end of the day--\n\nChoose again. Decide again.\n\nMake it…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…patriot. He was always happy. His story is one of resilience,  excellence, and service, embodying the very best of our Nation's  ideals.\n\nFrom a young age, Harold dreamed of soaring through the skies. I  don't know where he got that idea, but just at 19 years old, he turned  that dream into reality as a pilot in the legendary Tuskegee Airmen.  These were…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…really important work. It is work that is going to help make people's  lives better.\n\nNow here we are, back at work. The first thing on the agenda in 2026  is not to lower the soaring utility bills. It is not to lower the  insurance premiums. It is not to make housing more affordable. It is  showerheads. We are out here talking about showerheads.\n\nNot a…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…credits, causing healthcare costs to go up for  everyone.\n\nOver 4 million people will be forced off their coverage next year  because it is too expensive. This is on top of soaring prices for food,  energy, and housing. That is unacceptable for the wealthiest nation in  the world.\n\nRepublicans who say they support affordable healthcare should be  standing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696726/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Speaker, in their incessant drive to impose a  national ban on all forms of abortion, Republicans continue to block  relief for millions of Americans who are struggling with soaring  ObamaCare health insurance premiums. Now, today, they offer this bill  to funnel taxpayer dollars to fake health clinics.\n\nTo deceive women, these so-called pregnancy crisis…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…seniors who are not yet eligible for  Medicare, for small business owners, and gig workers, for families who  earn too much to qualify for Medicaid but not enough to absorb soaring  premiums. Allowing these tax credits to expire was a choice, and it was  the wrong one.\n\nAmericans are being screwed by this administration. Tariffs are  screwing our farmers…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…coverage.\n\nUnder this administration, costs are up across the board. Groceries  are more expensive. Housing is more expensive. Childcare is more  expensive. Gas prices are soaring. Today, the average price for a  gallon of gas in Washington State is over $4, one of the highest in the  Nation.\n\nHealthcare costs are only one aspect of why millions of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Johnson has indicated that he will not deal with it. He has  shown no interest in holding a vote on extending the healthcare  subsidies, which would prevent monthly costs from soaring.\n\nRepublicans have tried to say they will deal with this problem their  own way, but they have no plan. They are trying to repeal the  Affordable Care Act, as they have been…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Speaker Johnson calls our soaring national  debt the ``number one threat'' to our Nation. The Republican Senate  leader says that it is a ``ticking time bomb'' just before he lights  the fuse with this sorry…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689897/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…by 13  percent under the Trump administration. Utility bills overall have  increased at double the rate of inflation.\n\nWe all know what is driving those increases. We have soaring demand  from data centers and other loads, rising prices for natural gas, and  much-needed repairs to the grid that have been put off for years.\n\nThose are all tangible, identifiable…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…rise to call for a vote immediately to save America's  healthcare.\n\nAcross our country, American families are being squeezed by high  grocery prices, high utility bills, and soaring costs for holiday  gifts. Families can't afford to pay double for their healthcare.  Republicans cut $1 trillion from healthcare to give a tax break to  their billionaire…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698390/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…periodic reports required under this bill to include a  critical assessment of advanced transmission technologies.\n\nIn my district and across the country, families are seeing soaring  energy costs brought on by load growth and extreme weather, including  wildfires. An aging and inefficient grid is bottlenecking the growing  demand for new and reliable…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…gas tax won't stop the use of all natural gas. It will  simply stop the use of American natural gas. This tax will make it  harder for hardworking Americans to pay for their soaring energy bills  and force us to utilize more natural gas and energy produced by foreign  adversarial nations  who have far inferior environmental and labor standards.\n\nA natural…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…through unnecessary and complicated red tape that  has been driving up the cost of manufactured housing for far too long.\n\nWho has ultimately shouldered the burden of these soaring costs? It  is not the manufacturers. It is the hardworking families who are simply  trying to buy a home and live the once-attainable American Dream.\n\nOwning a home shouldn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]