[{"senator": "Danny Davis", "party": "Democrat", "sentence": "Systematic inequalities in socioeconomic  status, education, food security, and access to healthcare play an  intricate role in life expectancy."}, {"senator": "Kirsten E. Gillibrand", "party": "Democrat", "sentence": "\"I am proud to sponsor this legislation calling for a transparent and inclusive academy nominations process that will help ensure every student has an equal chance to serve, regardless of race, gender, or socioeconomic status."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "The Equitable Data Collection and Disclosure on COVID-19 Act would require HHS to use all available surveillance systems to post daily updates publicly on the Centers for Disease Control and Prevention (CDC) website showing data on testing, treatment, and fatalities, disaggregated by race, ethnicity, sex, age, socioeconomic status, disability status, county, and other demographic information."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "\"[A]ny clinical trials for vaccines and therapeutic treatments of COVID-19 must include participants that racially, socioeconomically, and otherwise demographically represent the United States,\" the senators added."}, {"senator": "Mark R. Warner", "party": "Democrat", "sentence": "Similarly, we have tragically seen that COVID-19 is following and exacerbating existing health disparities and inequalities among racial, ethnic, and socioeconomic groups."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "As such, any clinical trials for vaccines and therapeutic treatments of COVID-19 must include participants that racially, socioeconomically, and otherwise demographically represent the United States,\" the senators wrote."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "It would require HHS to use all available surveillance systems to post daily updates on the CDC website showing data on testing, treatment, and fatalities, disaggregated by race, ethnicity, sex, age, socioeconomic status, disability status, county, and other demographic information."}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "They don't care about your  socioeconomic status."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "It would require HHS to use all available surveillance systems to post daily updates on the CDC website showing data on testing, treatment, and fatalities, disaggregated by race, ethnicity, sex, age, socioeconomic status, disability status, county, and other demographic information."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "I hope that by examining our government's current efforts and asking hard questions about what needs to change, I will be able to help expand access to skills training and workforce development programs that give Michigan workers and businesses the skills needed to compete and succeed.\"\n\nPeters will assess federal support for students at colleges and technical training programs, including access to federal resources across socioeconomic backgrounds."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "In addition to age disparities, it has been found that people ofcolor, people from lower socioeconomic backgrounds, and people living in rural communitiesare less likely to have access to mental health care and more likely to receive lower quality care.Further, over 20 million Americans are living with substance use disorder, including 2 millionwho have opioid use disorder."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "This situation       is the result of a legacy of Colonialism and an interaction       of internal armed conflicts, institutional collapse, natural       disasters and extreme socioeconomic conditions, which has       forced them to emigrate not only to the United States of       America, but also to several Latin American countries."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Unsafe environments, forced marriages, poor socioeconomic status, violence, and harassment are among the numerous obstacles that many women across the globe face in pursuit of an education."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "I am a colonel in the Marines, an institution I am very proud to be a  part of, an institution that--like the Army, Navy, Air Force, and Coast  Guard--at its very heart, it isn't supposed to matter what the color of  your skin is, what religion you practice, or what part of the  socioeconomic ladder you come from."}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "We let violent criminals off with a slap on the wrist because we see  them as victims of socioeconomic conditions beyond their control."}]