[{"senator": "John Larson", "party": "Democrat", "sentence": "…utilized for anything that  was unintended, let alone having been taken from its secure position in  Social Security and stored in a cloud that no one from the Social  Security Administration has access to. That makes everyone's  information vulnerable.\n\nDemocrats are calling for DOGE to come before the Committee on Ways  and Means so that they can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…like he was Elvis Presley.\n\nThe majority also doesn't want people to remember that the Trump  administration has announced plans to cut staffing in half at the  Social Security Administration, guaranteeing that services for seniors  will suffer, or that the Trump Secretary of Agriculture just went on  television and told Americans who are struggling…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…while at the  same time it appears he might be building such a deep state.\n\nFor example, the Washington Post reported that the former chief data  officer for the Social Security Administration has said that Elon Musk  and his DOGE gang copied a mainframe database containing the personal  information of hundreds of millions of Americans, including names,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trickster  Elon Musk and his flimflam government agency, DOGE, after the Social  Security database.\n\nMichelle King was the deputy commissioner for operations at the  Social Security Administration for only 28 days before stepping down  because she refused to grant the fraudsters at DOGE access to the  Social Security database and all the sensitive personal…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…slashing staff, closing 6 out of 10 regional offices, cutting  customer service operations, restricting phone service assistance, and  spreading falsehoods about the Social Security Administration (SSA),  Trump and Musk jeopardize Americans' earned benefits and security. Let  me be clear--cuts to the Social Security Administration that prevent  beneficiaries…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the new administration, as it  indiscriminately cuts services, has announced that it will not keep the  Social Security Administration's hearing office in White Plains, New  York. Closing this hearing office with no local replacement is  unacceptable to the community it serves, and it covers multiple…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…working people of your  districts who have paid into Social Security. This is their benefit  that they have earned.\n\nTell Elon Musk to get his hands off of the Social Security  Administration.         Recognizing Rhode Island State Police's Centennial Anniversary\n\nMr. MAGAZINER. Mr. Speaker, I rise today to recognize a century of  service from the Rhode…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…hundreds of staff members at the Centers for  Disease Control who protected children from lead poisoning and air  pollution, among other services. Staff cuts at the Social Security  Administration have resulted in longer wait times for seniors applying  for benefits.\n\nI have been proud to join legal briefs filed against the  administration, which are resulting…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692075/illegal-cutting-of-federal-workforce"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, there is new reporting that the Social  Security Administration has been told to cut its workforce in half.\n\nUnfortunately, I heard from a constituent who works there who was  just put on a 30-day leave with no promise to keep…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688274/cuts-to-social-security-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Documents to establish income.--To establish the       alien's income, the alien shall provide--\n\n(A) employment records that have been maintained by the       Social Security Administration, the Internal Revenue Service,       or any other Federal, State, or local government agency;\n\n(B) bank records; or\n\n(C) at least 2 sworn affidavits from individuals…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to what billionaire Elon Musk is  doing with your hard-earned Social Security benefits.\n\nMusk is coming after your Social Security. The top administrator of  the Social Security administration says that Musk's DOGE boys are  trying to break the system entirely. That will stop your hard-earned  benefits from reaching seniors and eligible recipients.\n\nSocial…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to thank me for voting for the Social Security  Fairness Act and to tell me a story of how it is going to change lives.\n\nYou can imagine my disappointment as the Social Security  Administration has taken recent actions to hurt, not help, the American  people, including those in Ohio's 13th. From cutting phone helplines,  to requiring certain services…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…bipartisan  basis we can solve problems. You always start with the little things  and work yourself forward.\n\nIf providing greater customer service through the Social Security  Administration is a goal that has strong bipartisan support, I think  that that really gives us a runway to do bigger things.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697264/social-security-child-protection-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…exception to rules that primarily focus on the internal       operations of an agency. For instance, in B-329926, Sept. 10,       2018, we found that updates to a Social Security       Administration (SSA) hearings manual governing SSA       adjudicators' use of information from the internet qualified       as a rule of agency organization, procedure, or…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…object to  any unanimous consent request to proceed to H.R. 5284, the Claiming Age  Clarity Act.\n\nI support my colleagues' efforts to simplify the language the Social  Security Administration, SSA, uses related to claiming retirement  benefits. However, I am concerned that the bill's lack of  administrative funding to implement the legislation would…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…election and just before  leaving the agency to run for chair of the Democratic National  Committee.\n\nThe deal locked in telework levels for tens of thousands of Social  Security Administration employees for the entirety of the incoming  Trump administration. To be clear, this was done specifically to Trump- proof the workforce and to force the incoming…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…exception to rules that primarily       focus on the internal operations of an agency. For instance,       in B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information from the Internet       qualified as a rule of agency organization, procedure, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…following nomination, which the clerk will report.\n\nThe senior assistant legislative clerk read the nomination of Frank  Bisignano, of New Jersey, to be Commissioner of Social Security  Administration for the term expiring January 19, 2031.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690564/executive-calendar"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…commonsense  legislation that taxpayers should not be footing the bill for people  who are deceased.\n\nThe purpose of this legislation is to permanently authorize the  Social Security Administration to share its full Death Master File with  the Treasury's Do Not Pay service. The Death Master File that is  generated by Social Security is the best, if not the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…already  enabled the Federal Government to identify, prevent, and recover  hundreds of millions of dollars of improper payments made to dead  people.\n\nCurrently, the Social Security Administration has temporary authority  to share its death data with the Treasury Department's Do Not Pay  Portal to identify, prevent, and recover improper payments. In its…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Social Security number can cause a  lifetime of harm to American children. Every year, more than a million  children become victims of identity fraud.\n\nCurrent Social Security Administration policy makes it extremely  difficult for families to get a new Social Security number for a child,  even when families know the original number was compromised…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and  pass the bill (H.R. 5345) to amend title VII of the Social Security Act  to provide for a single point of contact at the Social Security  Administration for individuals who are victims of identity theft, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…it. If you don't have an email, by definition you don't  even qualify. You will not get these.\n\nBy the way, I will note, Mr. Chairman, that the standard for the  Social Security Administration is through electronic communications.\n\nThis bipartisan bill is straightforward. It provides ample time for  transition, notices to consumers, and an ability for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Department of Justice, the Department of State, the Consumer       Financial Protection Bureau, the Department of Defense, the       Department of Education, the Social Security Administration,       and other relevant agencies to--\n\n``(A) develop a whole-of-Government view within the       Department to improve fraud prevention efforts within the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…many leaks involving stolen  Social Security numbers.\n\nCurrently, when somebody has their identity stolen, they have got to  navigate a baffling process at the Social Security Administration. The  Ways and Means Committee has heard from victims who describe the  process of regaining their identities as a bureaucratic nightmare. It  is complex. It is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…never have to  enforce, deliberately tying the hands of their successors and rewarding  union leadership on their way out.\n\nOne example is especially egregious: the Social Security  Administration deal that allows maximum telework, prohibits management  from reducing it, and applies to 98.5 percent of the agency's  workforce.\n\nMr. GILL of Texas. The Protect…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…enrollment and payment data, including APTC information, from       CMS. We also matched enrollee SSNs in the data to two       additional data sources: (1) Social Security Administration's       (SSA) full death file, a database containing records of death       that have been reported to SSA, as of November 2024 and (2)       April 2025 data from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…compensation for surviving spouses and children. That is to  better reflect the changes in the everyday cost of living and align  with the annual benefit increase by the Social Security Administration.\n\nThis adjustment allows veterans and their families to have the peace  of mind of knowing that their VA benefits will keep up with our  Nation's economy and that…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696621/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…exception to rules that primarily       focus on the internal operations of an agency. For instance,       in B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information from the internet       qualified as a rule of agency organization, procedure, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…exception to rules that primarily       focus on the internal operations of an agency. For instance,       in B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information from the internet       qualified as a rule of agency organization, procedure, or…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}]