[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…socialism in all its forms, including democratically elected officials  and governments. That includes important allies and friends of the  United States that have mainstream socialist political parties like  Albania, Australia, Denmark, Finland, France, Iceland, Luxembourg,  Montenegro, New Zealand, North Macedonia, Norway, Portugal, Romania,  Slovakia,…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I rise to oppose this cynical and silly  resolution. I am not a socialist myself, but a Tom Payne Democrat, a  champion of strong democracy, universal freedom, and equal rights for  everybody, but this resolution is ridiculous.\n\nFrom its first…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the  oil that he wants.\n\nThis is not my assertion. These are President Trump's words:\n\nWe built Venezuela's oil industry with American talent,       drive and skill, and the socialist regime stole it from us .       . .\n\nIt was the greatest theft in the history of America. They       took . . . away from us.\n\nWe're going to have our very large United States…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…book or talked to somebody,  you would know that socialism is different than communism. The chairman  and I both come out of a highly capitalist industry, banking. There are  socialist countries that have exhibited horrors, like Denmark, like  Finland, any other number of socialist countries. Communism, in fact,  if this resolution said communism, I suspect…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…altogether.\n\nWhere is the Republican plan? Where is the plan? Where is the plan to  deal with all of this? They don't have one because they think keeping  healthcare costs low is socialist.\n\nIf Republicans truly cared about denouncing authoritarian socialism,  they would start with the Trump administration. In less than 1 year,  the Trump administration has…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…policies like  defunding the police, shuttering prisons, massive unfunded spending  increases, and even government-run grocery stores.\n\nIn New York, job-killing comptroller, socialist, and reckless spender  Brad Lander refuses to condemn anti-Semitic language like globalize the  intifada, which calls for the death of the Jewish people. Many of  Mayor-elect…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…country, the United States of America,  wanted to emulate Europe?\n\nThis is America. We do it the American way, not the European way, not  the Chinese way, and not the Communist, socialist way. We do it the  free enterprise way. We do it the limited government way. We do it the  way to honor Americans' privacy through the GENIUS Act and through  private stablecoins.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…college.\n\nYou may say: Is this all on purpose? Did the government design these  programs to destroy the American family? Who would do that?\n\nLet's not forget that Karl Marx, a socialist who is looked up to in  some universities, said one of his goals was to abolish the family.\n\nMore recently, in 1960, a woman who has been described as the mother  of women's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…operate.  Democracy is just a tool to get to power, period. People who love  freedom, we are just useful fools to be used in order to get to the  business of power, which is all socialist, communist, whatever you want  to call it. If it is not democracy, freedom, and a free-market economy,  it is just a bad ideology. Unfortunately, that is what they do to…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Wherever it has taken root, it has brought economic  collapse, political oppression, and the deterioration of freedom.\n\nDespite this record, we are seeing a troubling rise in socialist  rhetoric here at home, especially among younger Americans and in major  cities like New York City where these ideas are becoming increasingly  mainstream. At the same time,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the courthouse held signs reading ``Free President  Nicolas Maduro'' and ``Hands Off Venezuela.''\n\nI guess any jurisdiction that would elect a new mayor like a  democratic socialist, Mamdani, that is probably what you would expect.  So I don't think anyone was surprised.\n\nBut the message of Operation Absolute Resolve to our allies and  adversaries around…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the arrest  of Venezuelan dictator Nicolas Maduro. Above all, there is the stark  contrast between the American socialists who are bitterly denouncing  the ouster of this socialist dictator and the masses of ordinary  Venezuelans celebrating their deliverance from him.\n\nSocialism under Chavez and Maduro utterly destroyed the prosperity  and freedom…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…resolution should be a relatively  straightforward, easy decision.\n\nIt simply states that Congress denounces socialism in all its forms  and opposes the implementations of socialist policies in the United  States of America.\n\nIt is a statement that I would hope all of our elected leaders in the  United States up and down our system of government could…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…just ask your constituents from Russia, Poland, Albania, China, Korea,  Vietnam, Venezuela, or Cuba, where my mother fled in 1959 to escape the  very things that our new socialist mayor in New York City says he  wants.\n\nHe is a socialist who says he wants to seize the means of production.  He wants to abolish private property rights. He wants government-run…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…impartial  U.S. court, they bemoan it. They call it unconstitutional, illegal,  impeachable, and fascist. They insinuate that our government is somehow  no better than Maduro's Socialist and murderous regime. That is just  nonsense. In fact, it is embarrassing for those Members.\n\nI respect my colleagues, both Democrat and Republican, who have long  opposed…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…is expensive. When it is plentiful, it is  cheap. Socialists have made housing scarce and, therefore, expensive.  Nowhere can this be seen more clearly than comparing the socialist  utopia of California with the free State of Texas.\n\nLast year, more housing permits were granted in the Houston and  Dallas metropolitan areas than in all of Gavin Newsom's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recently voted to bring  these failed policies to their own once-great city.\n\nWhile I am saddened that New Yorkers will be willing victims of  Zohran Mamdani's destined-to-fail socialist policies, I have filed  legislation ensuring not one dime goes to fund his un-American agenda.  The rest of the country should not be forced to subsidize one mayor's  destructive…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697155/denouncing-the-horrors-of-socialism"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…of the party, the loon wing of the Democratic Party or you might  call it the Bolshevik wing of the Democratic Party.\n\nI think a more accurate description is to call it the socialist wing  of the Democratic Party. I think that is fair. I am not saying that all  of my Democratic friends are socialists, but there is clearly a wing of  the Democratic Party…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…regime. To this day, tens of thousands of Korean families  remain separated by a system that tears apart communities and crushes  basic human dignity.\n\nNow more than ever, as socialist ideas gain traction here at home-- and as our Nation's largest city and financial capital has elected not  just a socialist, but a communist as mayor--we must firmly demand…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…being a much better place to live than Pakistan, but they  pointed out we are a much better place to live than Europe. They  laughed at Europe, which they referred to as a ``socialist continent''  and one in which there was  no room for people who wanted to work hard and get ahead. One more  time, we have an example of foreigners who come here from other…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…security together.\n\nWith President Trump's envoy, Tom Barrack, history is being made  today for the repeal of the Caesar Act, giving Syrians a chance after  54 years of Ba'athist socialist dictatorship, a message to the  dictators in Tehran.\n\nFinally, enhancing security ties with European allies to defeat war  criminal Putin keeps American families safe at…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]