[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…the country because we focused  on what hardworking families care about: lowering food and healthcare  prices, cutting childcare costs, and lowering utility bills.\n\nWhat do socialists stand for? Tax-raising, job-killing policies like  defunding the police, shuttering prisons, massive unfunded spending  increases, and even government-run grocery stores.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…taken the American people into  yet another war that they do not want and cannot afford.\n\nPeople are wondering and they are asking: What was it for? Was it to  remove the socialists? No, the socialists are still in power. Delcy  Rodriguez is a true believer in the same ideology and party that Hugo  Chavez and Nicolas Maduro championed.\n\nWas it to remove…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…provide as many rental units as the  population needs, while competition keeps rents low and demand keeps  units plentiful.\n\nWhat has happened? Government decided to solve what socialists viewed  as problems.\n\nTo solve suburban sprawl, the socialists began imposing severe limits  and costly fees on construction permits. Builders could no longer  profit from…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "James Risch", "party": "Republican", "sentence": "…people who very  much value human rights and value the individual way, ahead of the  state. On the other hand, you have countries like China that are  communist. They are socialists. They are not free market or capitalist  motivated. And they have no regards for human rights. The best example  of that is the genocide that they commit against the Uighur…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…historic link between socialism and state- sponsored violence.\n\nI wish the people of Venezuela well and sincerely hope that they will  not repeat the mistake of electing socialists that have plagued the  nation since the 1970s.\n\nWhether or not socialism is evil, however, is not the debate today.  The debate today is about one question and one question…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…government going.\n\nWe are almost certainly going to get people who turn America into the  countries they came from, countries in which there is socialism, in  which you have socialists; countries in which elections become contests  of who are you going to give to more? America will become not only  poorer, but America will become much less free.\n\nWe must…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…it here, and we  are going to continue it through the appropriations process.\n\nIf Democrats want to vote ``no,'' that is their prerogative. They  have become the party of socialists. Let them vote that way.\n\nWe are going to fight for those hardworking families who want to get  our great country back on track.\n\nLet's pass this bill, keep moving, and keep…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…against paying our air traffic controllers, 14 times against  Border Patrol agents, and 14 times against paying our TSA agents.\n\nThe Democratic Party has been hijacked by socialists, and now they  are holding the American people hostage. Why? Well, it is because the  Democrats have become radical and extreme. Gallup pollsters tell us  that only one in…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, there is much to unpack from the arrest  of Venezuelan dictator Nicolas Maduro. Above all, there is the stark  contrast between the American socialists who are bitterly denouncing  the ouster of this socialist dictator and the masses of ordinary  Venezuelans celebrating their deliverance from him.\n\nSocialism under Chavez…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…difference between  socialism and communism.\n\nWhere these policies were tried, yes, they failed.\n\nMr. Speaker, look at Venezuela, a nearby country where self- proclaimed socialists destroyed the richest country in South America.  They implemented these government-run supermarkets, and they have empty  shelves. Venezuelans lost an average of 20 pounds…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…think a more accurate description is to call it the socialist wing  of the Democratic Party. I think that is fair. I am not saying that all  of my Democratic friends are socialists, but there is clearly a wing of  the Democratic Party that can only be described accurately as the  socialist wing of the party. And that party is in ascendance. That  party…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Conservative.\n\nMr. Chair, 98 percent of the political donations coming from the  National Endowment for Democracy go to the Democrat Party. This is your  taxpayer dollars paying for socialists and communists to subvert the  American system, and it ought to be stopped.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699045/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]