[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this affordability  crisis in the United States of America, the majority is going to  undermine America's ability to protect our national security through  the exercise of soft power and addressing in a bipartisan way the HIV  and AIDS epidemic, a program that was first put into place by President  George W. Bush and has saved the lives of millions of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692530/rescissions-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…horrors of World War I: The war I  cannot find it to be so bad. The death of one man, that is a  catastrophe; 100,000 deaths, that is a statistic.\n\nOur global reputation and soft power around the world have suffered  permanent damage. Our ability to fight future global pandemics and  diseases has been crippled, and U.S. farmers have suffered needlessly…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…China, Russia, and Iran are working overtime to  challenge American influence, this bill says: Go right ahead. This is  China's dream come true, the U.S. pulling back our soft power from  around the world.\n\nThis is self-sabotage masquerading as savings, and it is not even a  lot of money. These slivers of our Federal budget, these dollars that  generate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of our national budget, is not charity. It is strategy.\n\nDon't take my word for it. Military leaders from both parties have  warned us for years. If we fail to lead with soft power, we will end up  paying in blood, bombs, and more boots on the ground.\n\nCutting foreign assistance will: deepen desperation, fuel extremism,  and push fragile societies toward…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…are not  just fighting hunger, we are building goodwill. We are preventing  famine. We are strengthening global stability and reducing the risk of  conflict. That is what soft power looks like. When we abandon it, we  abandon our values, our influence, and our moral leadership in this  world.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693656/foreign-food-aid-incinerated"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…die.\n\nWhen you cut money to Ukraine for food security and energy grid  resilience, more people will die in their war against the Russian  invasion.\n\nUSAID is our strongest soft power vehicle. Even if you don't care  about how many people will die, it is one of our strongest assets to  saving money by decreasing military conflict risk.\n\nI also want to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…cooperation on a huge range of diplomatic goals--be they economic;  be they trade; be they issues of national security.\n\nThat is, in fact, what is referred to as ``soft power,'' and soft  power is at risk with this strategy of canceling these programs.\n\nI think about rural Oregon, where so often the warnings on floods or  fires is broadcast over the public…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…concedes nothing without  a demand. It never did and it never will.''\n\nThe U.S. must not cede power to China or any other world power by not  curing the lapse of this vital, soft power tool.\n\nMadam Speaker, I urge support of the bill.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698907/agoa-extension-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Rubio has robbed America of centuries of their expertise  for no apparent reason at all. This destruction of the American role in  the world comes as China is bolstering its soft power everywhere.\n\nThis is a giant blow to our national security and effectiveness in  the world.\n\nI express gratitude to the patriotic men and women at the State  Department,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693533/mass-state-department-layoffs"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…and Ranking Member Lois Frankel  and their team for their hard work on this bill.\n\nAmerica is at a fork in the road in our international affairs. Over  the past year, our soft power has been decimated. Millions of people in  need have been recklessly cut off from vital assistance. Billions of  dollars in lifesaving health and food supplies purchased…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…leader of the free  world.\n\nThis legislation, this reckless Republican rescissions package,  undermines our ability to keep our people safe here and to project  America's soft power all over the globe.\n\nMr. Speaker, why would we undermine our ability to use diplomacy,  democracy, and development to protect our own national security?\n\nThe President promised…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…operatives have restricted free speech, monitored Chinese students and  faculty, and served as intelligence-gathering conduits on emerging  American technologies.\n\nThese soft power tactics are part of a broader strategy to cultivate  networks of communist influence, within the very institutions  responsible for shaping the next generation of American…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…Representative Rulli in supporting this  effort to protect our children and national security from dangerous  foreign actors.\n\nFor years, China has been attempting to exert soft power over our  country by forging ties with American schools and universities. In an  attempt to influence our future generation, the People's Republic of  China has been establishing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…abuses.\n\nThe United States must show through words and through actions that we  will have Uyghurs' backs in their fight against the CCP's tyranny. We  must leverage U.S. soft power, garner international support for Uyghurs  and other ethnic minorities, and equip the State Department with the  tools that it needs to effectively fight against Xi Jinping's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…uncertainty in commodity pricing, and market  manipulation by Communist China.\n\nA few years ago, I launched the Western Hemisphere Prosperity and  Security Alliance as a soft power alternative to China. The Western  Hemisphere Prosperity and Security Alliance could help us shed our  dependence on Communist China when it comes to these critical  resources.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…watch this last-ditch  effort by my Democratic colleagues to fight for status quo. The status  quo is a cesspool of these leftist ideological programs that they would  say is soft power for America's interests or that they would say are  lifesaving services.\n\nMr. Speaker, the American people rejected this radical agenda. They  rejected the failed policies…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…A2: AGOA offers limited tariff advantages to the mining       sector, since most minerals already face relatively low       tariffs. Its real value lies in the realm of soft power. In       June 2025, China announced that it would expand market access       by removing tariffs on all imports from 53 African nations.       If the United States were…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}]