[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Not only did they rehearse every step for every guest, but they also  made sure to document it in ``PILLARS''--the Presidential Inauguration  Line-by-Line and Relevant Seating application developed by the expert  software development team at the Senate Sergeant at Arms--so staff and  volunteers would have real-time access to the most up-to-date plan."}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "In  this role, he helped the Council remain solvent during the Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Advances in generative artificial intelligence and other photo  manipulation software have enabled the creation of digital forgeries  that place victims in sexually explicit situations that never actually  occurred but can still cause massive reputational and financial damage  to those who were targeted."}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "During  the 2024-2025 school year, 698 students participated in concurrent  enrollment, earning over 10,218 college credit hours, and 243 students  earned industry-recognized credentials in construction management,  welding, engineering, automotive technology, healthcare, food service,  and business software."}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "This engineer's job was:\n\nCo-leading a project developing software for critical       mineral and rare earth element extraction, while also playing       a lead technical role in computer modeling of desalination       and water treatment processes and supporting U.S."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The private information of the American people should not be fed into  AI software somewhere or made open for the entire internet, which is  full of hackers to access."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "The Department of Justice is also exploring whether they can bring  criminal charges against State and local officials if they believe that  those officials have not adequately safeguarded their computer systems  from harm, despite gutting CISA--the very Agency tasked with assisting  them in safeguarding their computers and software."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Regional integration is now an industrywide manufacturing  strategy--also employed in Japan, Korea, and Europe--aimed at using a  variety of high-skilled and low-cost labor markets to source  components, software, and assembly."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Talented software developers and analysts were       quick to secure high-paying jobs in the private sector, he       said--and the reduction in highly skilled staff is already       having consequences."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "She is a software engineer."}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Pranoy  lives with Down syndrome and uses an adaptive communication device with  specialized software to communicate, paid for by Medicaid."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "5457, the  Strengthening Agency Management and Oversight of Software Assets Act."}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Our company does hardware, software, sheet metal, wiring harnesses, and  customer support."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "This funding will provide the latest software and training for our  current and future cybersecurity professionals to engage with."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Thanks to the work of the Energy  and Commerce Committee and Congress, we have taken steps to remove  suspect equipment and software from American communications networks to  protect against sabotage and undue influence by our adversaries."}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "2390) to amend title 46, United States Code, to clarify that port  infrastructure development program funds may be used to replace Chinese  port crane hardware or software, and for other purposes."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Some of DOGE's findings include that the Small Business  Administration gave out more than $300 million in loans to thousands of  children 11 years and younger; Agencies were paying for tens of  thousands of unused software licenses; and the Department of Veterans  Affairs was paying $56,000 to water eight plants for 5 years."}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "as Site Conversion and  Development Lead, overseeing software conversions, and for Cooper Tire  and Rubber Company as a Systems Analyst."}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "It gives Secretary  Feinberg the ability to accelerate and find, test, and buy the tools  that warfighters want and need, both hardware and software."}, {"senator": "James Risch", "party": "Republican", "sentence": "If a technologically advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities."}, {"senator": "James Risch", "party": "Republican", "sentence": "Each transceiver is software programmable and       operates at variable frequencies and uses various standard       waveforms."}, {"senator": "James Risch", "party": "Republican", "sentence": "If a technologically advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities."}, {"senator": "James Risch", "party": "Republican", "sentence": "To       facilitate initial loading and subsequent updating of       software, all on-board missile software is uploaded via the       LwCLU after mating and prior to launch."}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "Manufacturers today produce appliances that connect to software  applications that can be set, managed, and monitored through one's  computing device."}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "Far-left radical people are using face recognition software or use  that to identify law enforcement officials and then dox them."}]