[{"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…in Peoria, the institute cares for children with both  cancer and blood disorders through world-class, family-centered care.\n\nThe OSF Children's Hospital of Illinois is the sole children's  hospital in the downstate area that offers the full spectrum of  pediatric oncology and hematology care under one roof for children and  their families. These services…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…exclusively       assigns to Congress. The Supreme Court has long, and       strenuously, avoided adjudicating disputes respecting matters       that the Constitution makes the sole responsibility of the       coordinate, elected branches.\n\nThe remaining objections to Statehood do not concern       applicable constitutional law, but rather matters of policy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…police officers from unnecessary,       protracted disciplinary procedures. However, it would reverse       common-sense disciplinary reforms adopted by the District to       the sole benefit of those few Metropolitan Police Department       (MPD) officers who engage in egregious, sometimes criminal       misconduct and seek to evade accountability.\n\nA 2022…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…to, the President could help her return to  Venezuela. It is telling that he is not.\n\nArticle I of the Constitution of the United States makes it clear  that Congress has the sole authority to declare war.\n\nThe President, in taking these actions without our consent, has  trampled on the separation of powers and taken the American people into  yet another…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I thank Congresswoman Stevens and  Congressman Subramanyam for organizing this on such an important topic.\n\nAs Congress' sole Ph.D. physicist, I spent 25 years of my life,  before coming to Congress, working at the Department of Energy Office  of Science supported laboratory. We were smashing protons…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…control agreements.\n\nI have been critical of my own party's approach to nuclear weapons.  The Biden administration, despite campaign promises, refused to adopt a  first-use or no-sole-use nuclear policy.\n\nCurrently, the U.S. President can order the launch of hundreds of  nuclear warheads within 15 minutes, with no oversight or even  conversations with the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…limits the information it requires colleges  to provide to students and the students it chooses to support.\n\nMost crisis pregnancy centers are sham organizations. They have the  sole purpose of advancing an anti-choice  agenda. They routinely engage in deceptive advertising to get people in  the doors, hold themselves out as medical clinics, and then use…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Rich about the impact  that these cost increases would have on his livelihood. I have heard  many stories, but this one really struck me.\n\nHe writes: I am the self-employed, sole provider for a family of four  where two of us have preexisting conditions. If the Republicans get  their way and remove the subsidies, my very basic catastrophe plan- style…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…outcomes of those  elections.\n\nWhat emerged from this transfer of power was an election system that  no longer depends primarily on voters but rather on outside entities  whose sole purpose is to spend unlimited money, often without public  accountability, to influence who holds power and how that power is  used.\n\nSince Citizens United, we have watched…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…means to hold polluters accountable for  contaminating our Nation's wetlands, rivers, lakes, and sources of  drinking water. The Clean Water Act, in many cases, has been the sole  reason why decades of pollution threatening the health of our  communities has been reversed and why countless bodies of water  throughout the country are now being preserved…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…files.  He is lobbying against it. What is he afraid of?\n\nTo kill the Massie bill, Republicans are pushing a resolution that  will give Chairman Comer of the Oversight Committee sole power over  what gets released.\n\nI don't know about you, but I wouldn't trust a self-proclaimed--these  are his words--Trump man to decide what to redact and what Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…from taking advantage of the little guy or  the little gal or my grandmother or your grandfather, dismantling the  Agency that protects consumers from fraud--the only one whose sole  purpose is to look out for them?\n\nDid you speak up when the President of the United States, in a way  that is so crass and craven, peddled his own meme coin and made  millions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia Attorney General       Appointment Reform Act, introduced by Rep. Fallon, that would       remove DC's elected Attorney General and grant the President       sole authority to nominate a replacement. Calendar No. 270.\n\nOPPOSE H.R. 5107/S. 2687, the CLEAN DC Act, introduced by       Rep. Clyde and Sen. Cruz, that would repeal the Comprehensive…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…reportedly said, ``If it expires, it expires.''\n\nAs the New START Treaty fades into history, one commentator has  suggested that ``one likely successor to nuclear weapons' sole  dominance on the strategic value ladder could be AI technology. . .  Either AI technology itself will become the primary strategic weapon-- or it will enable the rapid creation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…creating an  arbitrary distinction between pecuniary and nonpecuniary risk factors.  That requires investors to ignore financially relevant information that  they, in their sole discretion, believe impact long-term performance.\n\nWhy should we mandate ignorance? It is not the Federal Government's  job to tell fiduciaries what categories of risk they…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…box  that threatens the fundamental constitutional order.\n\nThe Congress is elected to make law, and the President is elected to  enforce it. The judiciary is appointed for the sole purpose of  resolving cases and controversies brought to it by individual injured  parties. Traditionally, that means an injured party seeks redress  through his local district…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…them from their peers. Through their resourcefulness and  perseverance, they embody the Girl Scout Law to truly make the world a  better place.\n\nReagan's project, ``Heart & Sole,'' in partnership with Angel's  Attic, The Out-of-Door Academy, and Woodland Community Church, was an  excellent endeavor to address clothing access for homeless individuals…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…a fact that even within the National Defense  Authorization Act that you can get language put in, provided to you by  companies that allow for certain amounts of money to be sole sourced or  in some ways appropriated to defense companies that they can then turn  around and invest in.\n\nHow is that not insider trading when it is public knowledge on what…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, as the sole Representative of Alaska in the  United States House, I rise today in strong support of H.J. Res. 131, a  resolution to overturn the Biden administration's 2024 Record of  Decision,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…these imminent threats. These cartels  that are doing this are an imminent threat. These cartels have tens of  thousands of members who wake up every day and see it as their sole  mission to flood the United States with lethal drugs. My Democrat  colleagues want to ignore that.\n\nSinaloa and Jalisco alone have 45,000 members combined. The Gulf  Cartel…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…finalists, Mr. Wallace emerged as the champion  after a series of challenges, including speed rounds, signature  cocktail pairings, and original recipe presentations.\n\nAs Georgia's sole finalist, he embraced that responsibility with  pride and excelled in all aspects.\n\nFor more than a decade, Nic has pursued this title with determination  and focus. As he himself…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…certifications:\n\n5.1.1 The personal security device was purchased by the       Member, or procured by the SAA on the Member's behalf;\n\n5.1.2 The personal security device is intended for sole use       by the Member for their own personal protection; and\n\n5.1.3 The Member, or the SAA on the Member's behalf, has       reviewed the list of permissible and prohibited…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…reporting. This isn't calling every  Chinese individual a bad actor but is acknowledging the fact that they  are our enemy and not our friend, and they want to supplant us as the  sole world power.\n\nMr. Chair, I urge adoption of my amendment, and I yield back the  balance of my time.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…traffickers in Venezuela or lose control of his territory and  allow them to run wild; he was a drug trafficker.\n\nI didn't conclude that alone. That was not President Trump's sole  decision or even President Biden's decision. That was the finding of a  grand jury made up of normal Americans, on more than one occasion.\n\nAs for the future of Venezuela,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…passion on many subjects, the only  subject before us today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act. That is the sole  question in front of us.\n\nThat measure is critically important to the safety of many law  enforcement officers retired to many law enforcement officers off duty.  The bad guys…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…investors, its overly broad definition excludes  millions of Americans who are experienced and knowledgeable enough to  invest in private markets.\n\nWealth alone should not be the sole determinant as to who can invest  in these markets. My friend from Nebraska, Representative Flood's bill,  provides a merit-based alternative by the establishment of an exam…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…recent years, Mr. Tung has focused on civil litigation and appeals  in private practice. He was appointed by the chief justice of the  California Supreme Court to serve as the sole civil appellate  practitioner on the Appellate Indigent Defense Oversight Advisory  Committee.\n\nIn every facet, Mr. Tung has been an outstanding appellate lawyer.  Based on…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "James Risch", "party": "Republican", "sentence": "…convene a hearing       by giving 4 hours notice by telephone or electronic mail to       all other members. One member shall constitute a quorum for       such a hearing. The sole purpose of such a hearing shall be       to elucidate further information about the return and to rule       on the objection.\n\n(c) Depositions.--At the direction of the committee,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…approval process and  unlock LNG's potential. My bill does exactly that. It eliminates the  politicized DOE, which was weaponized by the previous administration,  and gives FERC sole authority over that authorization process.\n\nThis is common sense. FERC already leads the review of LNG facilities  under section 3 of the Natural Gas Act. It completes the environmental…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…investigated, tried, and convicted many individuals who had been  deported 2 times, 3 times, 4 times, and some even beyond 10 times. Yet,  they continue to illegally return with the sole intent--the sole  intent--to commit crime here in the United States.\n\nThe original version of this bill, Mr. Speaker, was drafted after a  32-year-old woman, an American woman,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}]