[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Director Lakesia Toomer has worked hard with her staff to  help ensure that Next Level is a safe haven and launchpad for all  children and families that need it. It is their solemn mission to  ensure that no child is left behind, and every child is equipped with  the tools they need to succeed throughout their lives. For a quarter of  a decade, the staff…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…I am  deeply concerned that this will have a chilling effect if we don't stop  it in its tracks.\n\nAs we prepare to vote on this resolution, I come to my colleagues  with a solemn plea. Devastated by the loss of my friend and colleague  but more determined than ever with a deep love for the unrealized  promise of our country, I implore my colleagues…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…to the administration calling on them  to halt and reverse these harmful cuts to Tribal programs.\n\nThese programs are vital to Indian Country and part of the United  States' solemn Tribal trust and treaty responsibilities. Our sovereign  Tribal nations depend on these programs, and we must protect them.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, today I introduced a Resolution Affirming  the President's Promise Not to Raise the Social Security and Medicare  Retirement Age.\n\nSocial Security and Medicare are solemn promises made to generations  of American workers who have paid into these hard-earned benefits  during their working years.\n\nYesterday, Social Security celebrated its 90th…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694736/introduction-of-a-resolution-affirming-the-presidents-promise-not-to-raise-the-social-security-and-medicare-retirement-age"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…dedicated members of our community who work  to spread the Lord's message of good deeds.\n\nThroughout his 50 years of Christian ministry, Reverend Dr. Walker  has displayed a solemn commitment to the Lord which encourages all who  have known him to have faith and do all things for the glory of God.\n\nCongratulations again to Reverend Dr. Curtis Theodore…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise today to mark a solemn anniversary.\n\nFifteen years ago today, Congresswoman Gabrielle Giffords was doing  her job, holding a ``Congress on Your Corner'' event at a grocery store  in Tucson, standing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…community in Virginia, a community that has made incredible  contributions across the country in government, business, technology,  education, the arts, and more.\n\nToday is also a solemn reminder of the Korean-American families who  remain divided as a result of the Korean war, including families in my  district, whose stories I have heard firsthand.\n\nThe Korean…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "Mr. WARNOCK. Mr. President, today is a solemn day in the memory of  our Nation. May we pause at the beginning of my remarks to remember  those who passed into the light on September 11.\n\n(Moment of silence.)\n\nAmen.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that decision. It ensures  accountability. It ensures legitimacy.\n\nIf we allow these unauthorized operations to continue unchecked, we  will have surrendered Congress's most solemn constitutional duty. We  will have set the precedent that the President--any President--may  initiate military action at will, without oversight, without  transparency, and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…passed.\n\nAnd I would say to them: I don't know that to be true, and neither do  you.\n\nAnd on behalf of all those who could and would pay, we should not  allow this great and solemn power to make war to be usurped any longer.  The only way for us to know whether the United States might be drawn  into a broader conflict is if we exercise our authority to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, I stand here today to mark the most solemn  time of the year for the people of the Vietnamese diaspora. ``Black  April,'' ``Thang Tu Den,'' is not just a solemn day in history, but it  is a reminder of the day when…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…of thousands of officers wake up each  day, put on their badge, and answer the call. They do it for us, for  our loved ones, and for our communities.\n\nThis week serves as a solemn reminder of the dangers that our  officers face daily. Without law enforcement, we would not enjoy the  security we often take for granted. With courage and with bravery, our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Madam President, on January 6, 2021, a solemn  constitutional proceeding was disrupted when a mob of thugs, egged on  by President Trump, attacked and trashed the U.S. Capitol in an attempt  to overturn a free and fair…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the way a courtroom pursues  truth provides a blueprint for encouraging trustworthiness in our  public servants.\n\nAt the beginning of jury selection, potential jurors take a solemn  oath to truthfully answer questions posed by the judge and lawyers. The  selected jurors take a second oath to ``faithfully discharge the duties  of a juror and a true verdict…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…occurred on January 8, 2011.\n\nI once again thank our colleague, our fearless leader, our  distinguished champion, Congresswoman Giffords, for her presence here  today on this solemn anniversary and for her tireless, matchless,  incredible advocacy to end the scourge of gun violence in the United  States of America once and for all.\n\nI now ask everyone…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Compelling a child to destroy themselves or to  harm others is child abuse. It is criminal, and it will be prosecuted.\n\nMadam Speaker, protecting children is one of Congress' most solemn  responsibilities. H.R. 6732 is a necessary, targeted, and responsible  response to a real and growing threat.\n\nI urge my colleagues to support this bill.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and my lung  infection are going a little nuts right now--it is an opportunity to  stop our taxes from going up.\n\nWhat I am actually more interested in is what I believe are solemn  promises I got from the leadership about many of the things I have come  behind this microphone for a decade talking about as to how we can  adopt technology and how we can…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…County, Florida, and to honor the brave men  and women who made the ultimate sacrifice in the line of duty.\n\nClay County Police Memorial Day is more than a ceremony--it is a  solemn tribute, a reminder of their courage, and a commitment to never  forget their service.\n\nThese officers answered the call to protect and serve, putting their  lives on the line…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…which it is and has been for  decades. We take time to recognize not just the marines present but, in  particular, the oldest and youngest marines present.\n\nWe have a very solemn cake-cutting ceremony. In fact, after the  birthday cake is cut with a Mameluke sword, the guest of honor presents  the first piece of cake to the oldest marine present, and…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today in solemn remembrance of  those brave men and women who gave the ultimate sacrifice in defense of  the United States of America. On behalf of the United States Congress,  and the constituents…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691585/recognizing-the-service-of-those-who-gave-the-ultimate-sacrifice-memorial-day-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, this is a solemn occasion for me and for  many people I know, and I rise this evening to recognize and honor the  67 lives we lost, 1 year ago tomorrow, on January 29, 2025.\n\nOn that night,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…bearing the scars  of captivity, both visible and unseen. Behind every prisoner of war and  missing soldier is a story of sacrifice, of family left waiting, and a\n\nnation with a solemn duty to remember.Today, I rise in honor of  National Prisoner of War/Missing in Action Recognition Day to remember  the more than 500,000 POWs who endured the horrors of enemy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…working to serve our  local communities, the State of Florida, and our great country.                        Recognition of Judge Remington\n\nMr. PATRONIS. Mr. Speaker, I end on a solemn note as we honor the  life of Honorable Circuit Judge Tom Remington, who passed away on May  7, 2025, in Pensacola, Florida.\n\nTom dedicated over 60 years of his life serving…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…must be noted that the Lumbee community has no  treaties with the Federal Government, no reservation land, and no  common language.\n\nAs Members of Congress, one of our most solemn responsibilities is to  ensure that laws are applied fairly, objectively, and consistently.\n\nFor over 40 years, the Department of the Interior through the Office  of Federal…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…strength are most needed.\n\nI cannot state this strongly enough: President Trump acted entirely  within his constitutional authority under article II and in accordance  with his solemn duty to defend this Nation and to defend the American  people. Operation Midnight Hammer was a targeted, strategic, and  necessary use of force to eliminate immediate threats…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, over the weekend, we  marked a solemn day: Pearl Harbor Remembrance Day.\n\nOn December 7, 1941, our great Nation was suddenly attacked by the  Imperial Japanese Navy, killing more than 2,400 American servicemembers…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698053/pearl-harbor-remembrance-day"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…wants war, then Congress must vote on it. We are the  voice of the people. There is a reason so many of our offices bear a  Prisoner of War/Missing in Action Flag. It is a solemn reminder of the  human cost of war and our obligation, not the obligation of a single  executive or a private circle of special interests, to decide when to  go to war.\n\nEven…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…remember this day, we are more motivated than ever to  stand with Israel and the Jewish people. I am grateful to my colleagues  for joining me this evening to discuss this solemn anniversary.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank and very much  appreciate Republican Vice Chairman Blake Moore of Utah for holding  this Special Order hour.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…BABIN. Mr. Speaker, I thank the gentleman from Kansas (Mr. Mann),  my good friend, for holding this session for such a great and worthy  cause.\n\nMr. Speaker, I rise today in solemn remembrance of the lives lost in  the tragic crashes of American Eagle Flight 5342 and PAT 25.\n\nTo the families, friends, and loved ones of the 67 victims, we offer  our very…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Achievement Medal, the Army Good Conduct  Medal, the Southwest Asia Service Medal, the National Defense Service  Medal, and the Army Service Ribbon.\n\nThe Purple Heart is a solemn testament to his sacrifice in defense of  our freedom, having been wounded in action while serving his country.  The Bronze Star Medal further attests to his heroic or meritorious…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}]