[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Federal  investments in science power nearly every aspect of our modern life,  medical breakthroughs, clean air and water, accurate weather forecasts,  safe food, and real solutions to the climate crisis.\n\nThis administration has made their position painfully clear. They  simple many don't care. Instead, they are injecting partisan politics  into research,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…through cleaner, cheaper power that is waiting to  come onto the grid--wind, batteries, distributed energy sources, demand  response, grid-enhancing technologies, and other solutions.\n\nThis is an incoherent energy policy from the Trump administration.  You say you want more power. We need more power. We have AI data  centers, but let's kill the offshore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…important, he was a dear friend, husband, stepfather, uncle, and  granddad.\n\nBefore taking this office, and once sworn in, Alan provided me wise  counsel sharing pragmatic, solutions-oriented advice on how to be of  service and make change.\n\nAlan exemplified community spirit and dedication to others, business  acumen, incredible generosity, friendship,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…set patients up with  equipment so they are continuously monitored from the comfort of their  own homes.\n\nSenator Carper knows the value of providing Federal support for  solutions that help more Americans receive healthcare in the setting  they prefer: their own homes. So far, 381 hospitals across 37 States  are approved to participate in the Hospital…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…where a majority of those guns are because  of barriers that have been erected keeping criminals protected.\n\nIt does not have to be this way. We know there are commonsense  solutions to stop the gun violence and keep the American people safe.\n\nWe can start by closing the gun background loophole that allows  dangerous people to buy firearms without background…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…and the Northeast Association of  State Transportation Officials (NASTO), bringing him to Washington,  D.C. annually to advocate for nationwide transportation policy and  solutions.\n\nBill is known as a leader who is an avid listener, a bipartisan  solution finder, patient, diplomatic, and an individual from whom you  could learn countless leadership…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…few others.\n\nThe expiration of DHS' other transaction authority essentially will  mean inefficiency and waste, things that will impede the Department's  ability to develop solutions to keep our homeland safe.\n\nIt is past time, Mr. Speaker, to advance this legislation and bring  back DHS' ability to develop novel homeland security technologies.\n\nMr. Speaker,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…annually than you were 5  years ago.\n\nMadam Speaker, folks back home are really wondering: Can Congress get  its act together to help lower the cost of living and work on  solutions? I hate to report that, no, Republicans in Congress and the  Trump administration have shown no interest in doing that or in  tackling lower electric bills. In fact, they…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…rules. We should be  working together to lift these businesses up, not passing laws to  punish them.\n\nI urge my colleagues to vote ``no'' on this bill and focus instead on  solutions that will truly help American small businesses.\n\nLet me say, they brought this bill to the floor without a single  hearing, no expert witnesses, no nothing.\n\nMs. VELAZQUEZ.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…and  public health.\n\nToday, the University of Georgia School of Social Work continues its  60-year legacy of building a better world for all by seeking socially  innovative solutions to create meaningful change. Its faculty are  actively involved in issues such as child safety and family well-being,  civil rights and social justice, community health and…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…upon my colleagues in  Congress to support legislation such as the Black Maternal Health  Momnibus Act, which aims to expand access to healthcare, invest in  community-driven solutions, and promote policies that will save lives.\n\nBlack Maternal Health Week is not just a time for awareness but a  call to action. We must listen to the voices of Black mothers,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…came from the podium where Donald Trump was standing.  He gave one of the most bitter, angry, and divisive speeches ever  delivered in this room.\n\nHe offered no vision and no solutions, just grievance after grievance  after grievance. It was 90 minutes of pure propaganda. It made me sick.\n\nHe offered zero ideas to fix the egg shortage, zero solutions for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…in nursing homes.\n\nThe Republican-endorsed cuts will exacerbate Texas' healthcare  crisis, creating irresponsible, political-based policy instead of  collaborating for real solutions.\n\nIn addition to the loss of healthcare access, many of those still  with coverage will see their costs skyrocket.\n\nUnder the Republican budget they voted for just last night,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…rise for the past  decade. And last year, one-third of Americans had to cut back on  necessary spending in order to pay their energy bills.\n\nAmericans are looking for real solutions. And that is why Democrats  got to work and passed the biggest climate package in the history of  the world to unleash American innovation and to support a clean energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Another biomedical researcher in the district said it perfectly when  he said that the NIH, FDA, CDC, and NSF are making discoveries now that  will be the foundation for solutions needed in the years and decades  ahead.\n\nWe won't even know what we missed with some of these cuts. We won't  know what innovations we could have made but for these cuts.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the  door to government overreach here at home.\n\nIt would threaten individual privacy and stifle innovation by  undermining progress that we have seen from private-sector solutions  like we just talked about on the House floor, privately issued U.S.  dollar-backed payment stablecoins.\n\nThat is a continuation of the evolution of the private-sector guiding…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…improve accuracy, efficiency, and consistency while  giving USDA the flexibility to invest in critical technological  upgrades. Annual reports on technological challenges and  solutions ensure Congress remains informed and transparency is  maintained.\n\nThis bill will improve long-term financial management by allowing  user fees to be deposited into interest-bearing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…improving stress response  and cognitive performance in real time. This real-time resilience  optimization for military readiness tool could track fatigue, deliver  tailored solutions for the wearer, and integrate with military health  systems all while keeping data secure.\n\nAdopting this amendment provides a targeted solution to the  challenges we face…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…an overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met with care, professionalism, and actionable  solutions, reflecting the team's deep commitment to being a lifeline  for the community. The Pasco County Human Services Team exemplifies  what it means to serve with excellence, compassion,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interest.\n\nInterest and healthcare are the primary drivers of U.S. sovereign  debt. Will the bond market continue to finance this?\n\nWhat happens when one of your greatest solutions is: Can we actually  have honest conversations about healthcare costs? Are we willing to  legalize the very technologies and the methodologies of helping our  brothers and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…rights. This year alone, the committee has  approved several pieces of legislation giving taxpayers fairer  treatment. The Tax Court Improvement Act is another one of these  solutions.\n\nThe IRS is the most feared Federal agency for good reason, but we are  working to change that. In addition to pursuing partisan aims, it has a  long-documented history…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Transformation Program to address the rural healthcare crisis.  Instead of a top-down, Washington-dictated approach, we are giving  States the resources and the freedom to find solutions for the  particular challenges in their State and to find sustainable ways of  ensuring rural healthcare access in their communities going forward.\n\nThe response has been…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…alongside her, Melissa embodied the  spirit of the hardworking people of Minnesota. She came from a blue- collar upbringing and had a work ethic that drove her to always seek  out solutions rather than seeking out a spotlight for a political win.\n\nMelissa was a principled public servant who led by example. When  tough decisions had to be made, she put her politics…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this next little section here. I don't want  to be a jerk. I am going to hurt some people's feelings. The math is  important. Why the math is important is because there are solutions.  The reason I am doing this is, I think it was Monday or Tuesday, I had  a Member I was talking to, great Member, brilliant in their area of  specialty, really smart. I…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…We must take care of those who do so much to take care of us.\n\nThis legislation is common sense. It will gather more information to  help Congress explore the best possible solutions for our law  enforcement officers.\n\nI would like to mention that 146 of my colleagues across the aisle  voted in favor of this legislation last Congress. It is incredibly…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…government as opposed to  government that drowns out their voices and ignores their needs.\n\nMr. Speaker, I urge my colleagues to support these measures, which  offer pragmatic solutions to real challenges in Utah, throughout the  West, and throughout the whole country.\n\nMs. MALOY. It has had a negative impact on energy production--as soon  as I get in front…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the  communities that they serve.\n\nMr. Speaker, I thank Representative Schweikert for his incredible  leadership on this bill that keeps our laws on pace with real-world  solutions that reduce harm and protect our communities.\n\nMr. SMITH of Missouri.  Tenney).\n\nMr. SMITH of Missouri. Mr. Speaker, you absolutely cannot make this  stuff up that you are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the Management of       Noxious and Exotic Weeds.\n\n(I) Long-term and high-risk technological barriers in the       development of transformative science and technology       solutions in the agriculture and energy sectors, including in       collaboration with the program authorized under section 5012       of the America COMPETES Act (42 U.S.C. 16538).…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…provide  them access to care. Are they willing--no, they are not--to actually  fix this system so we are not bleeding American taxpayers?\n\nNow let's actually talk about some solutions.\n\nFirst, I need everyone to understand how perverse the system is. I  have  come behind the mike over and over and over and over and said: You have  this technology that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…drop-off among younger  veterans. This bill would bridge the gap in communication.\n\nMadam Speaker, I thank Representative Barrett for championing this  bill and for finding solutions in the technology space to ensure  student veterans and transitioning servicemembers are receiving up-to- date and timely information.\n\nMadam Speaker, this bill is in lockstep…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}]