[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…pain of a life cut short.  I know several families who have lost their children to drunk drivers.\n\nMr. Chair, these tragedies are absolutely preventable, and we know  what a solution is. The bipartisan HALT Drunk Driving Act, which was  passed more than 4 years ago, would require new vehicles to be equipped  with this new technology, and the change will…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…all proceeded to do.\n\nNow they are telling us: Vote for it today and they will repeal it  maybe next week or maybe the week after that or maybe before Christmas.  I have a solution. If Members don't like this corrupt provision, don't  vote for it today. That will work.\n\nThis is a great bill, a great bill that is if you think eight  Republican U.S. senators…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696679/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…supply makes  no sense.\n\nThe best way to cut electricity rates for consumers is to expand the  energy supply. As the rest of the world recognizes, wind has to be part  of that solution.\n\nMr. Speaker, the only suckers in this area are policymakers in  Washington who are spouting off blatantly false narratives about the  value of wind energy.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Republicans passed a partisan bill that failed to renew  the essential premium tax credits, forcing millions of Americans to pay  higher costs this year, even though a bipartisan solution is at hand.  Families, therefore, unfortunately, are left waiting.\n\nAmericans are also struggling with the rising costs of energy,  transportation, and other critical services.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…only will       H.R. 2189/S. 1283 arm adjudicated domestic abusers and others       who pose a danger to public safety, it in no way achieves its       stated goals and is a solution in search of a problem. The       federal classification of TASERs as firearms in no way       precludes law enforcement agencies from accessing TASERs,       just as it does…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…premium spikes by 80 percent, on average. It  will wipe out increases for lower income families. It will save over 5  million Americans from losing their insurance.\n\nThis is the solution. We have it in our hands.\n\nWhile this is a straightforward fix for the short term, we know that  our entire healthcare system needs to have reform so that we can  control…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…that they deserve better.\n\nWe will not stop fighting, no matter what. We are fighting not just  to pass something to keep the lights on for another few months but for  a solution that actually serves the American people, something that  makes people's lives better.\n\nDid we forget why we are here and why the people elected us? They  elected us to make…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…checks, funding and support for community  violence intervention organizations, safe storage laws to prevent  unintentional shootings, and an assault weapons ban.\n\nWe know the solution is to end gun violence, and yet the Trump  administration and this legislative body refuses to act. Instead,  President Trump and Republicans reversed the progress we have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…just remain out of touch is so painful  to people back home that they feel betrayed.\n\nEven during the Republican shutdown, was the President focused on  trying to negotiate a solution there or trying to take us out of the  healthcare crisis? No. He was giving the White House a makeover. He  tore down the entire East Wing to make way for a 90,000-square-foot,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that airports  can use AIP funds on storage facilities for aircraft deicing equipment  and fluids.\n\nBolstering airports' ability to enhance aviation safety is a  commonsense solution that we should all support.\n\nI thank Representative Wied, Representative Scholten, and  Representative Gillen for sponsoring this important bipartisan bill,  and I urge my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…one Republican here today  who would stand on my behalf and vote ``present'' on the bills coming  forward this week?\n\nI don't think so. This is why this is not a workable solution. This  is not going to address when people are unable to be here for medical  reasons and for the well-being of their kid after giving birth. While I  appreciate trying to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…enable lenders to make loans of up to $5  million to small businesses that we know often struggle to secure  financing from traditional banks.\n\nIf Republicans wanted to find a solution to bipartisan concerns about  SBA's capacity to oversee an increased number of licenses, Democrats  would have been happy to work together on this. Unfortunately, this  bill…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692070/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…nothing ``temporary'' about the life I have built here. I       have set down roots, grown a family, and built a business.       Instead of canceling TPS, we need a legislative solution that       creates a path to permanent residency for families like mine.\n\nImmigrants like myself have been the economic engine of the       United States since its founding.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…deserves but also  with a renewed commitment to make this cause bipartisan, the pursuit of  peace, support of Israel, an end to the humanitarian crisis, and a  lasting, stable solution for the Middle East.", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…breaks to the  wealthiest people? Isn't it true that John McCain saw the suffering of  people who wouldn't get healthcare and urged people to come together on  a bipartisan solution? Wouldn't it be much better if our colleagues  from across the aisle--they may not agree with us on everything--but  instead of trying to jam another bill down our throats…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…from schools in 2012, we have seen  declines in milk consumption, increased food waste, and growing  concerns about childhood nutrition. This legislation is a commonsense  solution that simply gives schools the option to serve whole and  reduced fat milk once again.\n\nI am pleased to report that the Whole Milk for Healthy Kids Act has  already made significant…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…to enable this project to move forward.\n\nI was proud to collaborate with the city of Paducah, the National  Park  Service, and local stakeholders to develop a legislative solution to  this issue. It ensures that the Federal Government's unnecessary  involvement no longer stands in the way of progress for the children of  Paducah and McCracken County.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…related to  BDCs from their AFFE calculation, while still disclosing their  investment in BDCs. This improves both accuracy and transparency. This  is a smart and bipartisan solution that removes an intended barrier to  capital formation without reducing investor protections.\n\nMr. Speaker, I urge my colleagues to support the bill, and I reserve  the balance…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…appropriations lapse. In  March of this year, I reintroduced this bill as we faced this threat of  a shutdown. This legislation is still important, but the fact is that  the only real solution here is to pass the continuing resolution.\n\nWe set out earlier this year, in a bipartisan manner, to transform  our aviation system to make it safer for everyone, but that…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…decision that moves us in  the wrong direction, that makes us sicker, poorer, and more divided.\n\nI am usually one of the first to walk across the aisle and say: Let's  find a solution. Let's find a way out of this. And I have been doing  that in recent days, talking with colleagues. But I can't see a way  forward if we can't change direction and, together,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Secondary Education,  this caught my eye.\n\nWhat they are proposing is truly beyond belief. This grading for  equity initiative in San Francisco was in a sense a brilliant solution  to San Francisco's problem of having so many failing schools. It would  simply fiat that kids would not be failed.\n\nAnyone who got an F would just magically be given a C.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…increase costs for Americans and manufacturers.\n\nAmericans deserve to choose the car of their choice. In fact, Biden  used liberal California to force a one-size-fits-all solution  nationwide. One State should never dictate national policy because I  can assure my colleagues that what works in California sure doesn't  work for the people of my great…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…know that their proposals on healthcare  won't actually lower healthcare costs.\n\nUnder Democrats' current plan, premiums still go up next year, not to  mention their proposed solution is just aimed at papering over the mess  that ObamaCare created because the facts are clear: The Affordable Care  Act did not make care affordable.\n\nAll of this seems like…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…bills that we have considered before us today because we  need to secure our elections and stand up for our police and the rule  of law.\n\nMr. Speaker, fear-mongering is not a solution to the problems that we  face today. If we are not going to find savings across all agencies by  rooting out waste, fraud, and abuse, we are not going to safeguard  these…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…colleague on the other side of the aisle has said this bill is an  assault on working families. That could not be further from the truth.\n\nH.R. 2270 is a narrowly tailored solution to the growing challenge  working families are facing when it comes to childcare. I fail to see,  again, how excluding the value of an employer-sponsored childcare  subsidy…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to $5 trillion tax increase on the  American people, and to use our resources to generate more revenue and  to cut wasteful spending.\n\nThe resolution in itself is not the solution, but it unleashes  committees to put pen to paper and craft reconciliation legislation  that fully delivers on the promises the President and House Republicans  have made…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…is right to support efforts to ensure innocent lives  are no longer lost. He is right to undertake efforts to stop the  bloodshed. As he continues to work toward a peaceful solution, we  should not remove the ability to provide what he thinks will help the  Ukrainian people to prevent further losses and use as leverage to  negotiate a peace agreement…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…growth  without the inflation that came from the American Rescue Plan, which we  saw the Democrats enact in 2021, all of that positive economic growth  is actually a very good solution.\n\nI hate that this place ends up being so partisan in these moments of  what we call the trifecta, when one party has the White House, House,  and Senate. It is just the way…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these microphones and talk about the morality  of, guys, 7 years from now, let's double senior poverty, and then,  let's do everything we can to talk about it. By the way, the solution  you get is to just raise the cap. Okay, raise the cap. Do you realize  just eliminating the cap on Social Security at that time covers only 38  percent of the shortfall?…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…can work, you  should work. It is a step that was once broadly bipartisan, but today,  our Democratic colleagues would rather let Medicaid spiral into  insolvency with no solution in sight than support a basic principle  that if you are able to work, you should.\n\nNow, Mr. Speaker, we have heard noise from across the aisle, words  like ``cruel'' and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]