[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…resolve little anomalies in tricky,  little twists and changes in revenue bills or in policies' programs. It  was always narrow. It always was honest about what it was trying to  solve and explainable to the public. It was always consistent with the  law, and it was always involving modest sums--modest by standards of  the national budget.\n\nCertainly, now,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…However, this bill just doesn't do it. As I said before, it is a  sneaky, sneaky little bill.\n\nIt was introduced the last Congress. It hasn't gone anywhere because  it doesn't solve any problem. It doesn't get to the heart of the  matter.\n\nMr. Speaker, if you look at what they want to do, they say: We are  going to amend the Department of Energy's mission…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…The firing of those who care for kids and seniors and those who work  on rare diseases and those who are bringing together our people who  work on drugs that are supposed to solve and are solving the problems  for these rare disease families and those that are doing the approvals  and those that are doing the research and the families that want to  talk…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…brute force, not from getting it from  an inheritance, but the consent of the governed to give power to the  government.\n\nWhy do they do that? It is to meet their needs, to solve their  problems. It is an idea that sparked my imagination as a child. It is  an idea that as I listened to my parents tell stories of what their  life was like growing up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…travesty in our Republic.\n\nMr. MERKLEY. That is horrific that he is flying away. He absolutely  should be sitting down right now and holding a conversation with you  about how we solve this problem for millions of Americans.\n\nMr. MERKLEY. I see my colleague from Vermont on the floor. I will  take a question if he has one.\n\nMr. MERKLEY. I will yield for a…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…family has what they need to thrive. That starts with recognizing  that caregiving matters, parenting matters, and infrastructure should  actually support it.\n\nThis bill will not solve every challenge that parents face, but it is  a meaningful step toward a more family-friendly future.\n\nMr. Speaker, I thank my colleagues on both sides of the aisle for  their…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…these 22 million people; healthcare across the  country is skyrocketing--just skyrocketing. Instead of trying to deal  with it, the Republicans are doing nothing--nothing--to solve the  problem.\n\nIt is no surprise because the Republicans have harbored an ancient  animosity toward all these Federal healthcare programs. The Republicans  voted no on Social…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…worse? Fly to my district, as the President  did, and announce the elimination of FEMA entirely, while I have FEMA  workers working 12 hours a day with my constituents, trying to solve  problems. Offer the FEMA workers, including the temporary workers, a  buyout. In any disaster we go in, we have to hire temporary workers.  They may only have a 3-month or…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…without adding a single dollar to help them  meet their obligations. Our educators deserve meaningful support, not  legislative gestures that create more problems than they solve.\n\nFor these reasons, I will be voting ``no'' and urge my colleagues to  reject this measure and refocus our efforts on policies that will  actually strengthen our public schools.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…get ahold of our hatred, then a lot of lives will be  destroyed.\n\nThat is not what Dr. King wanted. That is not what people elect us to  do. They elect us to help people and solve problems. They elect us to  focus on community. Let's not give into the chaos.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…strongest  possible words, the Trump administration to go back to the drawing  board, get some of the most experienced people--we can recommend some  to you--to figure out ways to solve the problem you want to solve, but  don't put our people out of work. Don't stop reinvestment in our  region. Don't drill down into people's 401(k)s. Don't harm the  industries…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…is to be  present in your communities to be able to listen directly to  constituents, local leaders, the folks on the ground, about problems  that you can ultimately help to solve.\n\nThis bill is a perfect example. It is a bill that has been described  well by the chairman and the ranking member that, in effect, would  ensure that a number of different…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…against challenges relating to their illegal cancelations of  projects across the country.\n\nTo bring this bill at a time when people really want to see the  Congress work to solve problems, I think, demonstrates that Members are  out of touch. It is part of a very disturbing Republican trend, led by  the President, to purge the government of real experts…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…famine  has more than doubled in the last year. Malnutrition globally is on the  rise. This is a global emergency, one that the United States has the  greatest capacity to help solve.\n\nThe burden should not and cannot fall entirely on us, but leadership  comes with a responsibility. We have the responsibility to continue to  do our part. The moment is calling…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…healthcare, education and energy costs, infrastructure and the imminent  challenges of the climate crisis--these are hard problems. Reasonable  people can disagree about how to solve them, but we can't solve them or  prepare for the problems of the future if we can't talk to each other.  We can't solve them if we treat politics as warfare rather than  negotiation.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…this--anti-Semitism  doesn't have a monopoly on either party. Both have it. My side does,  too. Yet, where we fight together to take it on and not take shots, we  actually begin to solve the problem.\n\nCommentary like that about President Trump is just not helpful  because I can say that I have seen it in my State where we don't have  many of the problems that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…forever to develop every other alternative. What we could do  now is what we have been working on for a decade. We could launch this  central bank digital currency. It will solve everything. It will keep  us safe. It will catch the tax evaders, the money launderers, and the  illicit finance.\n\nIn the hands of a good leader, it could. The reality is we…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and the best deal and the most financial inclusion possible given that  particular customer's circumstances.\n\nFar from promoting problems, this resolution will actually help solve  the problems.\n\nMr. Speaker, let me give you an example of where a merger that was  recently approved certainly doesn't hurt consumers but helps consumers  and creates more…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…mental health services.  The reality is this program is set to expire in September, and we  cannot allow this to happen.\n\nDelay jeopardizes this program. We have big problems to solve. Adding  qualified mental health providers will only help.\n\nI can appreciate the fact that the Senate has a different  perspective. However, I find their approach to be business…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we were debating legislation last year, and we were debating  bills, and what did they say? They said: Well, we have got to pass  comprehensive immigration reform in order to solve the problem and  secure the border, when it  was Joe Biden as the President and Alejandro Mayorkas as the Secretary  of Homeland Security. Now it turns out, somehow magically,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…only at  source, but downstream for every State, as well.\n\nWhile I support what the EPA is trying to do at the Federal level, I  think we all recognize that the EPA alone can't solve this. They need  help from great leaders on the ground.\n\nLet's empower locals to have the opportunity to also be part of the  solution and not turn to, as you have noted several…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…a lot of low-income people, but in any event, the way it works,  we give 70 percent of the cost of a developer's project to him in tax  credits. That seems a strange way to solve the housing crisis in this  country for a Democrat. It is even stranger for a Republican.\n\nIn any event, I think people should look at this. We are spending  $13.5 billion…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691140/low-income-housing-tax-credit"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…stop this whole process, but the Supreme Court has not  taken such action.\n\nSo it is Congress's job to legislate. So what would you expect? I am  introducing legislation to solve this problem.\n\nMy bill prevents judges from providing nonparty relief, make  temporary restraining orders immediately appealable, and reset the  separation of powers. In short,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…alone in this fight. In just the past 5 years,  over $100 billion in private capital flowed to our defense  technologies, signaling that our best innovations and our ability to  solve our Nation's largest security strategies happen not just in this  Chamber but across the whole Nation.\n\nThese new entrants need a welcoming defense environment, something…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…shifting resources to the northern border.\n\nIf we are serious about ending the fentanyl crisis in America, we  need to address the entirety of the crisis. We are not going to solve  the problem by going after just part of it. Ending this emergency  declaration will tell the cartels that they should shift their focus to  the northern border.\n\nSo I urge…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…old and joined  the Grand Forks Police Department in 1980. Promoted to sergeant in  1997, he chose to remain on patrol where each day brought the  opportunity to meet people, solve problems, and make a difference in  his community.\n\nOn behalf of North Dakota, I congratulate Sergeant Kallinen on this  incredible milestone and thank him for his decades…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695062/congratulating-sergeant-kevin-kallinen"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ability to get affordable vehicles, including, by the way, hybrid  vehicles which would be unnecessarily impacted by where California  wants to go and which we want to try to solve.\n\nMr. Speaker, I also note that California, as KTLA reported in a  January 30 article, continues to lose more people than come into other  States because of the tragic and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…first start by thanking the  chairman and the ranking member for their fine work.\n\nMr. Speaker, the ranking member already mentioned some of the issues  that we are trying to solve with this bill, and there are so many other  communities that this bill will help, including Miami Lakes, which I  have the privilege to represent.\n\nMr. Speaker, this is going…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things--just that differential is more  money than everything that is being debated here.\n\nWhen just 1 point of interest, 1 point differential here, is over $3  trillion, that would solve a lot of this debate, wouldn't it? We can  actually get those types of bond rates if we demonstrate to the world  that we are creditworthy, disciplined, sensible, seeing long…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…rejecting Washington's one-size- fits-all approach.\n\nAmerican energy solutions are climate solutions. American energy  producers are providing the solutions that are going to solve energy  needs and environmental needs for the world over. Let's encourage  investment in technology, not support regulations that make it  impossible to do business.\n\nI am…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}]