[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…headquarters in North Scituate, where they remain to this day.\n\nDuring their 100 years, they have been known for excellence in  disrupting organized crime, responding to emergencies, solving complex  financial and cybercrimes, and keeping the roads safe and traffic  moving. They also have a history of lending a hand to other States in  their times of need, including…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…immediately follow. It is unclear to me why House  Republicans would prefer that outcome, unless, of course, they are  bereft of substantive ideas and an affirmative vision for solving the  cost-of-living crisis that so many of our constituents are facing that  they have made the decision that it is better to spend their time on  disapproval of Biden administration-era…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…radically at odds with both the  Democratic Party and American values.\n\nAfter all, socialists aren't Democrats. They are socialists.  Democrats are about common sense, problem-solving ideas that promote  public safety, opportunity for all, and lower costs for all Americans.\n\nI urge all Republicans to work with us on those pressing issues.\n\nAmerica is the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…food banks are there for our neighbors on their hardest days.  Today, they are raising the alarm as they see record-high demand  alongside very low unemployment.\n\nInstead of solving this dire hunger problem, the Trump administration  is now slashing critical funds to USDA.\n\nIt is rare to have a hat trick in public policy: a program that helps  our small…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691898/food-bank-cuts"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…and  represented my office with diligence and skill at countless other  hearings, briefings, and stakeholder meetings. Regardless of what  policy issue she was tasked with solving, Aleksi approached every task  with a sense of dedication, professionalism, and passion for public  service.\n\nAs the daughter of central Illinois farmers, Aleksi brings to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…cure. Mr. Speaker, with recent cuts, you can kiss that  cure good-bye right now or any hope of her son getting that cure.\n\nRight now, there are so many cuts that we are not solving the  problems in healthcare that we need to, to keep our country healthy.\n\nFor another woman, her son had congenital blindness, and NIH was  searching for a cure for that.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…made have done so much for our society.  At Health and Human Services, that has meant eliminating diseases that  used to ravage our communities and currently means working on solving  health challenges that continue to puzzle us today.\n\nThe NIH is headquartered in my State, and I know firsthand the good  work that they do. We know all too well the significant…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…of why millions of Americans are  needlessly suffering under this administration. We don't have to keep  living like this. It is time for my colleagues to get serious about  solving the ACA tax credits, as serious as they were about extending  tax breaks for billionaires in July, and get back to delivering on  their promise to lower costs for Americans,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cooperation to function well at all. The most revered Members       of this institution accepted the necessity of compromise in       order to make incremental progress on solving America's       problems and to defend her from her adversaries.\n\nThat principled mindset and the service of our predecessors       who possessed it come to mind when I hear…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…This is an attempt to control access,  suppress oversight, and manipulate the narrative.\n\nInstead of terrorizing our communities, Trump needs to get back to  the real work of solving the affordability crisis.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699128/ice-operations"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…our national security, as well.\n\nMath skills form the basis for all the STEM disciplines, and  importantly, they also form the basis just for critical thinking and  problem-solving in general. If our students can't get ahead in school,  how will they get ahead in the STEM workforce as engineers, computer  scientists, chemists, nurses, doctors, and much…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…when we are talking about oil and gas and their  lobbyists, they are so firmly in control of the agenda here in the  United States Congress. I just think my colleagues are not solving  problems. Watching the President just remain out of touch is so painful  to people back home that they feel betrayed.\n\nEven during the Republican shutdown, was the President…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…materials, delaying projects that are already underway, and these  short-term sticker shocks will put long-term pressure on housing  affordability, making the problem worse--not solving it.\n\nJust last week, when people want to talk about GDP and where this is  going, it was amazing that the Atlanta Fed was forecasting GDP growth  over 2 percent for the first…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…me in congratulating Adelyn Kim. Adelyn is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4255. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…me in congratulating Paige Kitts. Paige is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4504. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…me  in congratulating  Reagan Graham. Reagan is a member of Girl Scouts of Gulf Coast Florida,  Troop 441 and has exemplified extraordinary leadership, innovative  problem-solving, and a demonstrated commitment to making a lasting,  positive impact, by earning the most prestigious award in Girl  Scouting, the Gold Award.\n\nGold Award Girl Scouts are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…join me in congratulating Faith McCrea. Faith is a member of Girl  Scouts of the Sierra Nevada, Troop 1306, and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…example. When  tough decisions had to be made, she put her politics aside and got the  job done for Minnesotans.\n\nAs a lawmaker, Melissa brought her roll-up-the-sleeves, problem- solving approach to almost every issue. Along with it, she touched all  of us with the witty humor that many of us will remember her for,  including myself.\n\nMelissa was a very special…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…associated with it.\n\nMr. Speaker, this bill today is about ending the misery Democrats  created on families. This is not just about funding the government. It  is not just about solving other problems that we should be working to  solve. It is about getting the government back open, while not holding  the American people hostage.\n\nThat is what has disgusted…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…me  in congratulating Dakota Partelow. Dakota is a member of Girl Scouts of  Gulf Coast Florida, Troop 608, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…ask my colleagues to join me  in congratulating Wyatt Dickinson. Wyatt is a member of Boy Scout Troop  776 and has exemplified extraordinary leadership, innovative problem- solving, and a demonstrated commitment to making a lasting, positive  impact, by earning the most prestigious rank in Scouting--the Eagle  Scout.\n\nEagle Scouts are recognized as trailblazers…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…battleground States, and this President has not  wasted a second, a minute, an hour, or a day in office because he knows  how important it is to act quickly.\n\nHe is doing that. He is solving the urgent problems facing our  Nation, what American people elected him to do, what the American  people expect, and it is what the American people are seeing. So the  President…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…2. MATHEMATICAL AND STATISTICAL MODELING EDUCATION.\n\n(a) Findings.--Congress finds the following:\n\n(1) The mathematics taught in schools, including       statistical problem solving and data science, is not keeping       pace with the rapidly evolving needs of the public and       private sector, resulting in a STEM skills shortage and       employers…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…tools for  community and neighborhood lenders, it empowers them to do what they do  best: serve local communities and help power America's housing  comeback.\n\nWe know that solving the housing crisis requires a lot of changes for  our State and local government partners, but we in the Federal  Government have a role to play as well, one where we can…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…congratulating Krysta Fowler. Krysta is an individually registered  member of Girl Scouts of Gulf Coast Florida and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…principles were violated. The gentleman  from Texas (Mr. Green) performed one of most shameful acts that I have  ever seen on this floor.\n\nAs an advocate for bipartisan problem-solving and for working across  the aisle as hard as possible to come up with solutions for the people  whom I represent and for the people whom every single one of us  represents,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…before, during, and  after this and other events, ensuring everything runs smoothly and all  volunteers and attendees have a positive experience. Cindy's leadership  and problem-solving skills shine in high-pressure situations, making  her a trusted and reliable member of the team. Beyond event  coordination, Cindy has also played a key role in furthering…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…level, and to recognize the hard work, dedication,  and innovative spirit that went into his project. As a fisherman  myself, I am grateful for Mr. Albright's contributions to solving the  pollution issue. I wish him continued success in his studies and  pursuits.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…leadership, and service in its members. The  agricultural education programs offered through FFA equip students with  the technical skills, scientific knowledge, and problem-solving  abilities necessary to meet the challenges of feeding, clothing, and  fueling our Nation.\n\nAccess to agricultural education is critical not only for our rural  communities…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…affecting domestic production of critical energy  resources and minerals and how adversarial nations seek to exploit  those markets to undermine investment in the United States.\n\nSolving this issue is paramount, and we must address it before we are  too late. Critical minerals and their supply chains are vital. We  cannot allow the prosperity of future generations…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}]