[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in Pennsylvania, last month, President Trump bragged that he had  indeed used that slur that I referred to earlier.\n\nAnd at a Cabinet meeting, last month, he publicly called Somali  immigrants ``garbage.'' The President of the United States referred to  people from Somalia as ``garbage.''\n\nJust yesterday, the administration announced the termination of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…families, and  communities to support U.S. servicemembers during the long war in  Afghanistan.\n\nAnother example: Look at the President's commentary related to  members of the Somali community. During a Cabinet meeting last month,  the President called the Somali community ``garbage,'' saying:\n\nWe don't want them in our country.\n\nI have to tell you, I believe…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…And the Latino  says, ``Yes, I am,'' and they still throw them in the car, maybe  because they could get a bounty. The number of people that were stopped  multiple times, the Somali police officers who are off duty that were  taken out of their car.\n\nThe stories go on and on. You can't have 3,000 ICE agents in a metro  area. And, again, they also went…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…The harassment is also racist, providers say--those in San       Diego who have been targeted are overwhelmingly of African or       Middle Eastern descent.\n\nSamsam Khalif, a Somali American who has been a family       child care provider in San Diego for 18 years, was frightened       last week when, as she was driving children to her home for a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…out of Muslim third world  foreigners defrauding American people of their hard-earned tax dollars.  Thanks to independent journalist Nick Shirley, more and more fraud from  Somali immigrants in Minnesota who are pretending to use the money to  feed children or help people with autism is being exposed every day  now.\n\nIn a recent hearing in the House…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…members from Venezuela and criminals instead of protecting Americans.\n\nMr. ROY. That is right.\n\nMr. ROY. And what we are talking about, again, at the risk of  repetition: A Somali illegal alien convicted of homicide, a Salvadoran  illegal alien convicted of three counts of homicide, a Mexican illegal  alien convicted of homicide, a Sudanese illegal alien…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…``Sanction Sea Pirates Act of       2025''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) In 2011, there were 212 attempted attacks against       vessels off of the Somali coast, more than 1,000 crew were       held hostage, and 35 seafarers were killed.\n\n(2) Over the past decade through the beginning of 2023,       rates of piracy in the Western…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…benefit American citizens.\n\nThat is why today I introduced a bill that would implement a Somalia  immigration moratorium.\n\nMr. Speaker, we have seen the multibillion dollar Somali fraud  scandal just in the past week, and Americans are furious. The reality  is that Somali immigration makes America less prosperous, less safe,  and less culturally cohesive.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and we don't owe anybody anything. They take advantage of our system.\n\nIf this is your attitude, we don't want you here. We want you to help  this country become better.\n\nThe Somali population in Minnesota, as we have been watching on the  news for the last few days, is an example of a group that thinks they  are entitled to take anything they want from…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…$1 billion  of American taxpayer money has been stolen--just stolen. They can call  it fraud, but a better term would be ``stealing.''\n\nThis fraud has been centered in the Somali community in Minnesota.  Now, I am not here to criticize the Somali community; I am here simply  to describe what happened. The Somali community in Minneapolis is about  80,000…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…angry constituents over  the last 2 weeks. They are angry about how expensive America has  become. They are angry, in large part, because they realize one simple  truth: The Somali pirates are not in the Horn of Africa anymore. They  are right here in our country, and their captain is Tim Walz.\n\nWhile my constituents suffer today, 81 percent of Somali…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…billion in fraud--and climbing--in one State. Well, we know the answer  to this, from what we are learning, is that most of this fraud was  committed by members of Minnesota's Somali community and that that  community is closely tied to the State's Democratic machine. It appears  that there were some Democrats who chose to look the other way, and  they…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…unflagged vessels carrying  contraband in international waters. An attack on them is not an  attack on a foreign power and, therefore, not an act of war. It is akin  to firing on Somali pirates menacing international shipping.\n\nIf the President launched an unprovoked attack on Venezuela or  Venezuelan-flagged vessels without congressional declaration, we should…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]