[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…millions of Americans  were priced out of that coverage. Families across the country have now  been hit with premium increases of $800, $900, and even over $1,000 per  month.\n\nSomebody in my State of Virginia--Kathleen, a mother of two and a  small business owner living in Newport News, saw her premium for her  family of four increase from 544 bucks a month…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Ebola when it comes here.\n\nFinally, they fired 300 people who were in charge of security of our  nuclear weapons. Oopsy-daisy, what could have gone wrong? Keep in mind,  if somebody is fired and then hired back or told they are going to be  fired but then not fired--if you say, oh, no harm, no foul, oopsy- daisy--once that happens to a person, their resume…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…States of America and grabbing people off our streets, and yet that is  the principle that Donald Trump just promoted and exemplified to the  world: We are going to go kidnap somebody we have an indictment for.\n\nAnd if it was about an indictment, then it would have ended the  moment that he was on the plane being brought to the United States. But  it doesn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…actually,  maybe you do have to go far back several Energy Secretaries--to look at  what happens when it comes to Hanford cleanup. Every time a new  administration comes in, somebody looks at the amount of money that it  takes to clean up nuclear waste that has been stored in tanks and says,  ``This costs too much. We ought to be able to do it cheaper.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…they had with  affirmative action, if you recall--they viewed it as two parallel  lines, where you took a person who was less qualified and you elevated  him to the level of somebody who was more qualified.\n\nThat is not DEI. That was not affirmative action. Instead, people  should look at it as a circle and every single person within the circle  are all…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…street, then at least invest in the root causes of violence because it  is too easy for someone desperate enough to take their life to get a  gun and do it. It is too easy for somebody who wants to start a race  war to get a gun and walk into a church where people pray with him, and  he shoots them dead. Enough is enough.\n\nMr. Speaker, I thank you for your…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…80,000 of them will make a  decision because they just simply can't afford it.\n\nBack to those numbers that were on the chart earlier: When you look  at households and incomes, somebody might say, ``Oh, well, somebody  might be able to afford $840.'' Well, not if you are a family of four  on $40,000. You are not going to afford that if you are on $75,000…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…program to create wealth, opportunities, and jobs.\n\nSo many more, dozens and dozens of these companies, have been  created, and jobs. Why destroy something that is working? Can somebody  tell me how else do we sprout and grow our local economies?\n\nI thought when the Vice President said he was coming to Toledo, he  might help announce the $20 million in Department…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…a moment about Ms. Plaskett. I have served  in this institution for 17 years, longer, I think, than most people in  this Chamber. I have not had the honor of serving with somebody with  the integrity, the commitment, and the hardworking bona fides as Ms.  Plaskett.\n\nWe can argue about the wisdom or the judgment associated with those  texts. I am told…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…life many, many       times. Without it, many people in America will die. Please,       help us.\n\nIt is underlined multiple times.\n\nHere is another scrap of paper on which somebody writes their heart  out:\n\nDear Senator Booker, when I got out of the Navy, I had       mental illness. I needed psychiatric medicine to stop going       in and out of the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…heard--first from Elon Musk--that Trump himself was in  the files, all of a sudden, we started seeing the coverup starting.  First he wasn't. Then he was. Then it was created by somebody else.  Then it is coming after him.\n\nThis is all because the President has to answer to the American  public.\n\nDid you lie for those 8 years and put all these employees, all…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…hope my colleagues will join us in demanding that he come to  Congress to ask for permission to keep that $400 million bug-riddled  airplane that he wants to fly around on somebody else's tab. It is  absurd, the lengths that they have gone to, to mangle and trample our  Constitution.\n\nLet's get back to law enforcement and the rule of law, starting with…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…protecting the sanctity of citizen voting. Like every other  issue, Republicans want our people to believe that in order to protect  us, we have to take something away from somebody else. That is how we  protect the sanctity of voting for citizens. We have to take something  away from D.C. that they voted for when, right in front of us, if we  want to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…number of people with no insurance, they go to the emergency room,  and they are not able to pay. So providers provide treatment, but then  they have to charge that off to somebody, and it tends to get charged  off to people who have health insurance.\n\nSo the combined effect of ACA premium support going away and a whole  lot of free care that has to…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…SWALWELL. The President has our troops sleeping in squalor, not  on the battlefields of Afghanistan or Iraq, but in Los Angeles. I guess  this is what you would expect from somebody who has described our brave  war dead as suckers and losers.\n\nWe were promised that the immigration policy would deport the most  violent criminals. That is something I support.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692336/troops-in-los-angeles"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…unnecessary.\n\nFurthermore, all of us here know it is not going to stop at $4  million. This commission, like all the rest, will balloon up to tens of  millions of dollars unless somebody puts their foot down. I am going to  stay on this mission to try and save the taxpayers some money.\n\nIt is great for people on the commission to be Santa Claus and hand  out…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…American Revolution, but we rarely pause to  recognize what it really was: a movement of ordinary people who refused  to accept that their destiny would be decided for them by somebody  else. They believed they had a God-given right to shape their future,  and that is precisely what the people of Iran believe today.\n\nThe parallels runs deep, deeper than…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…ago. If you make $100,000 a year, the Democrats want to  give you $13,000. Meanwhile, people who make $20,000 and are on food  stamps are not going to get food stamps, but somebody making $100,000  is going to get $13,000. That doesn't sound like the Democrats are for  the working class or for the poor. It sounds like the Democrats are for  the people…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…are all in this together. They know dang well this wasn't a  racist attack, but it was just something that they wanted to use, but  they never miss an opportunity to paint somebody a racist, you know,  when it comes to the Democrats.\n\nSo January 6 had nothing to do with racism. Let's be clear what  happened that day. Democrats and the Deep State hate…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…heating products, announced  it would be moving production from Boonville to--guess where--Mexico,  taking out another 250 jobs.\n\n``From a moral standpoint, it was kicking somebody while they were  already down,'' the head of the local chamber of commerce said as he  talked to a local newspaper.\n\nThis is not the distant past, folks. This is the reality…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…American citizens, it is the right thing to do.\n\nRepresentative Roy, when I was growing up, if there was a criminal  running down the street and an officer was chasing him, somebody would  be a Good Samaritan and stick their leg out or say: He went that way  and help out. But we are literally living in some dystopia where they  say that somehow it is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…EPA used a proxy measurement and measured carbon dioxide. They didn't  use a test to come up with this rule based on arsenic or lead. It was a  proxy using carbon.\n\nFurther, somebody said earlier, Mr. Speaker, that we were stripping  away critical regulations. I would say, Mr. Speaker, if it was so  critical, why did the Biden administration wait until…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…discourage the nuclear  family. That is why we have gone from a 4 percent rate of kids born  without a mother and father at home to 40 percent. It was like it was  by design, like somebody wanted to destroy the nuclear family.\n\nIt is important to remember that we may individually not know these  people, but there have always been people who wanted to destroy…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…billion a year in lost payments.\n\nThe Republicans want to deal with that. How we deal with it is an  increase in funding over the next 10 years of 25 percent. We just heard  somebody say we are going to gut it. Only in Washington, D.C., would  someone say an increase in spending is a cut. That is the weirdness of  this place, but this is the reality. These…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690836/increasing-medicaid-funding"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…piece of legislation, the Servicemember Residence  Protection Act.\n\nMr. Speaker, why this bill? Why do this? It is designed to help those  servicemembers that are affected by somebody squatting in their home,  trespassing, illegally staying in their home, it will help them get  those individuals out in a less costly way and a less intrusive way to  their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695472/servicemember-residence-protection-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…that didn't  happen with respect to ICE, like all other law enforcement agencies  around, was the use and implementation of body cameras so that we don't  have to rely on somebody who happened to have their cell phone and have  a good angle, whether they are accusing or defending themselves for  whatever they did. This bill funds  body cameras for ICE…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…by this body, but the agency regulations, the bureaucratic  regulations, get published.\n\nThey have the force and effect of law. They are just as burdensome  and binding on somebody running a mom-and-pop shop on Main Street in  Kansas as is a statute enacted by this body. Usually, they are  regulations adopted by an agency at the direction or, arguably,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…go to a doctor, have that doctor's  cell phone number, have a relationship with that doctor and not be put  into some complicated scheme where you have to get approval for  somebody who is in network or not in network and who may or may not be  within 100 miles of your house.\n\nWe want the American people to be empowered. We want them to be able  to go…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…similar ceremony in Baton Rouge where, across Louisiana,  people came and held a picture of their child who had died. In one  case, the young man had a hard time sleeping, and somebody at his  church gave him a pill to take. He took the pill. It was laced with  fentanyl, and he died of an overdose.\n\nThis is an incredibly powerful addictant, an incredibly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695793/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…codifies and makes permanent is to allow the people in  the small business world who are affected by regulatory decisions made  in this town, our Nation's Capital, to tell somebody who has the  ability to aggregate that information and do something about it. Let's  bring it to the attention of lawmakers that this is where you need to  focus. This one,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}]