[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…problem of  hunger.\n\nAs always, NEPM's incredible radio host Monte Belmonte led the group,  pushing a shopping cart and rallying us to keep up the fight. This  year, Monte's son Pax marched with us to support his dad and our effort  to end hunger.\n\nI was joined by my incredible family--my wife, Lisa; my son, Patrick;  Wendy, Bill, and Courtney Talcott;…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…service to commemorate his remarkable life was held  on May 15, 2025, in Eufaula, Alabama.\n\nBorn on September 8, 1932, in Hatcher Station, Quitman County,  Georgia, ``CP'' was the son of Curtis Lowe Redding and Ora Inez (Green)  Redding. He was a man of unwavering character, known for his commanding  presence, generous spirit, and fierce devotion to his family…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Stefany, and Anne, who paid a price  for Dad's absences.\n\nTo my grandchildren and great-grandchildren, for giving me great joy.\n\nTo my mother, who thankfully lived to see her son become the  president of the Maryland State Senate.\n\nTo my staff, for serving me and their Nation with great loyalty and  ability.\n\nTo my colleagues, for trusting me with leadership.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…drive again. They say that it  is painful to have to do that every morning and going back from work.  That doesn't compare to the pain of someone who loses a mother, a  father, a son, a daughter, a cousin, an uncle, an aunt, or what have  you.\n\nIf we want to deal with drunk driving, let's seriously deal with  drunk driving. This legislation is not the way…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…who fought to preserve it. The center appropriately honors the  Puller family, including General Lewis ``Chesty'' Puller, one of the  most decorated marines in our history; his son, Lieutenant Lewis  Puller, Jr., a Vietnam veteran and a Pulitzer Prize-winning author; and  former delegate and State Senator Toddy Puller.\n\nMr. Speaker, congratulations to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…neared the end of  his second term.\n\nDuring the 130 years of this tradition, seven Virginia Senators have  preceded me in reading the Address, which was written by the archetypal  son of our Commonwealth, with the assistance of close confidants  Alexander Hamilton and another Virginia native son James Madison. Those  Virginians who read the Farewell Address…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Ms. CLARK of Massachusetts. Mr. Speaker, I recently heard from a mom  in Massachusetts. I will call her Rachel.\n\nRachel's son was born 3 months early and then spent 2 years in the  hospital. He is finally home, but he needs a ventilator and a feeding  tube. Still, his mom says he is the happiest little…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691488/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…hope you will get better.\n\nIt doesn't make our skies safer, but it does lead to horrible and  avoidable tragedies.\n\nIt hit home for me when a Chicago family told me about their son who  was studying to become a pilot, and he took his own life. He knew that  he needed help, but he didn't want to be grounded. That young man would  still be here today but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…the so-called Alligator Alcatraz  to conduct oversight and work with our communities to keep our people  safe.\n\nRenee Nicole Good was the mother of three, had a daughter and a son  aged 15 and 12, and a 6-year-old with her husband who tragically died  in 2023. She was a devout Christian who participated in youth mission  trips to Northern Ireland when…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…that these public  servants have dedicated to our country. These heroes stepped up for us,  and now, we must stand up for them.\n\nThis issue is deeply personal to me. I am the son of Vietnamese  refugees who fled war and persecution in search of safety and a better  life in America. This country welcomed them and gave me the chance to  succeed.\n\nI joined…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688234/democratic-proposals"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…without-- without--a judicial warrant, a clear violation of the Fourth Amendment.\n\nIn December, our Afghan community was repeatedly targeted, including  ICE arresting a father and son after they exited a mosque following  morning prayer. People who fled the Taliban, fearing for their lives  and their families' lives, are now wondering if they will be picked…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…of  us.\n\nNo one has done more than Donald Trump. He has used the powers of his  office to hand out pardons--pardons to let people off who attacked  police officers. I am the son of two cops. He pardoned over 1,000  individuals. Many of them attacked cops in and around this building. It  is insulting to me and to law enforcement officers across our Nation.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…blacklisted firms like Huawei that are tied to the Chinese military.\n\nNow, President Trump is denying that he knew anything about the  secret deal. Oh, please. President Trump's own son signed the deal for  half a billion dollars. An initial payment of $187 million was  reportedly directed to flow to Trump family companies. Another initial  payment of $31 million…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, I rise today to honor a son of Oakland,  California, my constituent, Ryan Coogler, whose film ``Sinners'' has  earned 16 Academy Award nominations, the most of any film in Oscar  history.\n\nRyan Coogler…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700026/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…of Republican inaction in extending the  Affordable Care Act tax credits, letters like this one received by  Susan from South Kingstown. She, her husband, and her college-aged son  are going to see an increase of $1,700 a month, $20,000 a year more  that they are going to pay for their health insurance for three people  if Republicans don't do the right…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…every factory moved  to Mexico belongs to a real, flesh-and-blood American, with a life and  a family and a home. Each and every data point is a fellow citizen, a  neighbor, a son or daughter of this great Republic. Since NAFTA,  90,000--90,000--factories in our country have closed. Think about that  and what it means to those families. For the people…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…espoused  wife, being great with child. And so it was, that, while they were  there, the days were accomplished that she should be delivered. And she  brought forth her firstborn son, and wrapped him in swaddling clothes,  and laid him in a manger; because there was no room for them in the  inn.\n\n``And there were in the same country shepherds abiding in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698434/republicans-have-delivered-in-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…take their own lives each and every day. Uncle Ry,  Kendra's husband's younger brother, was just 26 when he lost his battle  to post-traumatic stress on U.S. soil. Ryan was a son, a brother, a  best friend, and an uncle.\n\nThis is why 100 percent of their shop's net proceeds of coffee,  awareness bracelets, and awareness shirts are donated to suicide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…grateful for my brother's spiritual  influence over the years and have always been inspired by his  unwavering devotion to God's Word, to God's people, and to God's only  begotten Son, Jesus, our Lord.\n\nThanks be to God for men like Yancey, pastors and preachers  throughout these United States, who have dedicated their lives to  reminding us that America…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697518/welcoming-dr-yancey-c-arrington"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…the       notorious SS officer in Jerusalem, with profound impact on an       entire mesmerized nation. I vividly recall as a teenager       living then in Israel and myself son of Polish Holocaust       survivors, the shock of the horrific events described by       shaken witnesses. The author offers us a touching       confessional of a crisis of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…speech and shared principles.\n\nAbigail Adams was an early advocate for women's rights and shaped the  second Presidency through her letters and advice to her husband. Their  son, John Quincy Adams, served as our sixth President and later was a  fierce opponent of slavery in this very body, as the only former  President to be elected to the House of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…anything else, he is always quick to pick up my call.\n\nAndy will spend his retirement days doing what he loves best:  spending time outdoors with his beautiful wife, Mary Jo; his son,  Wyatt; and his daughter, Emily.\n\nMr. Speaker, I congratulate Andy on his achievement. I thank him so  much for his service to our great country and to the beautiful State…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700233/congratulating-andy-collins-on-his-retirement"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…that puts the American people, the American workers, American families  first and in a better position. Republicans stood in agreement;  Democrats sat on their hands.\n\nAs a son of a retired factory worker--my dad worked at Dana  Corporation in Fort Wayne. He made axles. He got up early every  morning. Sometimes he worked the third shift, all night…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…taken from us far too soon  following a tragic car accident on January 30.\n\nGeorge was a 21-year-old student at the University of Georgia from  Austin, Texas. He was a beloved son, brother, cousin, and friend whose  infectious spirit touched countless lives.\n\nThrough his involvement in Sigma Phi Epsilon and Cru, a religious  organization at the University…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…military service, Mr. Drake returned home to Kentucky  and married his wife, Lina. They were married for 65 years when she  passed away in 2011. Mr. Drake is survived by his son, Sam W. Drake, as  well as two grandsons and three great grandchildren.\n\nMr. Drake began working as a registered professional engineer and had  a distinguished career for over…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to say that he had taken another  job and that his mother would take care of the 4-year-old.\n\nApproximately 1 month later, the sponsor's mother allegedly confessed  that her son was not actually the boy's real father. Instead, it was  later revealed that the sponsor allegedly colluded with the boy's  biological mother to obtain a fraudulent birth certificate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…steady presence through decades of change. He served as  fire police, EMT, and fire warden for 25 years. He even completed EMT  training alongside his late wife, Dorothy, and son Bill.\n\nHis sons, Bill and Steve, have both held leadership roles, and now  his grandson, Christopher, continues the Baker legacy. Skip has driven  nearly every apparatus the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…survived  by his brother James Danforth (Joanne), sister Joanne Smith (late Bruce  Smith), and many grandchildren who brought him great joy. He was  preceded in death by his son Thomas Danforth and his parents.\n\nJerry lived a life rich with passion and purpose--he loved fishing,  golf, entertaining with his prized green egg grill, red wine,  chocolate,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…years ago as a page in this institution, my  mom used to come and watch me every day.\n\nShe would come and sit in the gallery over there never knowing that  35 years later, her son would ultimately serve in Congress. Frankly,  had you asked me 1 year ago today, I would have told you that I would  not expect to be serving here.\n\nHowever, it was 1 year ago…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696847/serving-35-years-ago-as-a-page-on-the-house-floor"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…bought a small motorhome and  traveled the United States from Washington to Florida. Art Mortensen  passed away in 1987, in Bellingham, Washington. Margaret now lives with  her son Robert and his wife Connie, in Boise. Idaho. She is celebrating  her 108th birthday on April 21, 2025, with family and friends.\n\nMr. Speaker, I ask my colleagues to join me…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}]