[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…information politicized or bought  and sold to the highest bidder or their Social Security benefits put at  risk. It is very, very frightening, so frightening, Mr. Speaker, that  as soon as our current Treasury Secretary was brought into office, I  wanted to know what DOGE was doing and where the information was going.  I don't think we have had any conversations…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…programs closed their doors, I have heard  from hundreds of small businesses across the country that are being  forced to lay off employees, cease critical research, and may soon have  to close their doors for good. Passing H.R. 5100 is not just a matter  of policy; it is about whether small innovative companies can survive.  This is the only real path…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…will play ball with  us, but at some point the warships are going to leave. At some point,  America can't devote one-third of its Navy to the waters around  Venezuela. And as soon as we leave, the kleptocrats and the corrupt  leaders will be right back in charge. If they don't want to change  their country from within, if there isn't a viable mechanism…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…lethality that can       come with any kind of experimentation or self-medication . .       . we must have specific fentanyl education introduced to . .       . our schools as soon as possible; otherwise, more children       will . . . die.\n\nThat doesn't even cost money.\n\nWe could be doing things through the Department of Education in  supporting education…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…High School, he attended Cal Poly San  Luis Obispo, where he earned a degree in mathematics.\n\nUpon graduation, General Lopez joined the United States Marine Corps  in 1967. Soon after, he was deployed overseas for the Vietnam war,  serving as an infantry rifle platoon commander and a regimental sniper  platoon commander, as well. His service earned…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…observatory  just reached a major milestone with the installation of the Large  Synoptic Survey Telescope, the LSST, the largest digital camera ever  built. This facility will soon be ready to scan the sky for the next 10  years, creating an ultrahigh definition, time-lapsed record of our  universe.\n\nThe DOE and NSF Interagency Research Act strengthens…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…backtracking began. It  clicked again yesterday. It clicked after the same Republican leaders  who invited influencers to the White House and then passed out binders  about the soon-to-be-released client list suddenly changed their tune.  It clicked again yesterday when phase two of the binders came out, more  information released that has already been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…it is a package that once again saves  crucial investments in our communities, in our small businesses, and in  America's global leadership.\n\nI will have more to say on that soon, but I see that our chairman  Senator Collins has joined me on the floor, and I do again want to  thank her personally for all of her hard work to get this done.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…15,000 of these refugees have deportation  orders and are now being deported as they do the right thing and report  for their ICE check-ins.\n\nWe will not stand for it. I will soon be reintroducing the Southeast  Asian Deportation Relief Act, which would prevent the administration  from deporting these refugees to countries where they have often never…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Democrats will not relent on the issue of the cost of living, of how  difficult it is for Americans to pay the bills for things they  need. The topic is not going to go away anytime soon. In fact, it will  only grow in intensity over the year.\n\nBut, as everyone knows, healthcare is not the only part of the story  when it comes to lowering the cost of living.…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…when he was President of the United States  in the 1970s. Ohio's nuclear industrialized north is being positioned  to grow through fundamental modernization. That can't come soon enough  for me. We have got to replace our 50-year-old nuclear power plants  across this country.\n\nOur objective must be to make America energy independent here at home  in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…German Vazquez\n\nMr. President, finally, let's say good-bye to German Vazquez--a very  special good-bye to one of the Senate's unsung heroes, German Vazquez,  who will retire soon, after 28 incredible years of service.\n\nThe public may not know German, but every single Senator knows him.  You see his face, and you smile. You  can always find him near the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…there for the victims.\n\nAtalina is a pillar of her community and her church. She gives  everything she has to others, but even angels need help.\n\nAtalina is the mother of five, soon to be six. Her husband, who is  battling cancer and now severe back injuries, can't work consistently.  Atalina still works full time and still serves her neighbors and  community.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are going to wait until you read and hear about it in some  major newspaper that the President has metamorphosed into a dictator,  it will be too late. We have to stop him as soon as possible. As soon  as possible is the means of doing it by way of impeachment. I believe  that he will be impeached again.\n\nI also know this. If we don't, and if he continues…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…those two individuals losing their life may  not happen again because we went through that process.\n\nThe question is whether there is going to be another Alex Pretti  sometime soon, where another U.S. citizen loses their life because of  this overreach of power, because we are not investigating, we are not  protecting these civil liberties, and we are…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to ban gas-powered cars. Our cars make  wildfires worse.\n\nIt was an absurd, pathetic attempt to deflect responsibility from his  own failures, for an NPR investigation would soon find that Newsom  exaggerated the fire prevention work he had done by a staggering 690  percent and had also slashed the fire prevention budget by $150  million.\n\nNewsom's edict…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…people's mandate from  November. Just a few short weeks ago, we passed the One Big Beautiful  Bill Act.\n\nThis week, we are taking up a nearly $10-billion rescissions package,  and soon we will be moving into the appropriations process.\n\nDiscretionary waste is about to be put through the congressional  shredder.\n\nMr. Speaker, the American people demand that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…day-to-day operations of just about every aspect of Tennessee State  government.\n\nMost importantly, he is a husband and father, titles much more  important than the one he will soon have as Congressman. We are also  happy that Meg and Emilia are here, as well as so many other family and  friends joining him on this momentous occasion.\n\nMatt has lived his…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…already passed both the Senate and the Ways and Means  Committee with broad, bipartisan support. I hope the House does the  same and sends this to President Trump's desk as soon as possible.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…a revolutionary idea that  individual liberty and not government control is a source of human  achievement. They understood that when the government owns the economy,  they soon seek to own the people.\n\nI hope people who are watching right now on C-SPAN or on the news get  what is going on in this body today. This side is against socialism.  That side…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697153/denouncing-the-horrors-of-socialism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the entire Western world  and also here in the United States, we don't have enough young people.  If you look at our demographics--when you hear people talk about that,  as soon as I say ``demographics,'' I know people turn the channel.  There is a very good chance that, in the last 12 months, we had more  deaths than births. It wasn't supposed to happen…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…emergency. Josie quickly realized  something was very wrong.\n\nWithout hesitation, Josie jumped into action, calling nearby family  members for help and then contacting 911. She soon spoke with  dispatcher Brenda Dawes, who started guiding her on how to perform CPR.\n\nBrenda was able to walk Josie through the proper CPR technique while  they waited for EMTs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…applies to.\n\nIt is that particular group that are on the ObamaCare Marketplace  that are in that age bracket that are facing very high premiums that  are coming up very, very soon. It is a big deal to them, as well it  should be for any American.\n\nLet me set the context for this. The Kaiser Family Foundation lists  the average cost for healthcare insurance…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…was shocked myself to realize that one of  them sits right outside our capital city of Columbus, Ohio. This is  unacceptable.\n\nThey could be coming to a school near you very soon. That is why I  urge a ``yes'' vote from all my colleagues, especially from the other  side of the aisle. We do not want them to be labeled as pro-Chinese,  but as pro-American.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…viewpoint. The American Civil Liberties Union, they sued  so that legitimate Nazis could march through downtown Skokie. . . . Why  would the ACLU do this? Because, they said, as soon as you use the word  `hate,' that is a very subjective term because then, all of a sudden,  it is in the eyes or it is in the implementation of whomever has the  power. So here…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…operations to ``fascism'' and  claimed officers are doing nothing but ``terrorizing our communities.''\n\nSenator Bernie Sanders asked people to ``stop ICE from what they are  doing as soon as possible.''\n\nSenator Elizabeth Warren claimed ICE is ``intentionally stok[ing]  fear and tear[ing] communities apart.''\n\nSenator Ruben Gallego said ICE exists ``to scare…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…things. We need to really get stuff done here. We need  to help our farmers, and I am sure my colleague from Alabama would help  a lot of great farmers in the State of Alabama soon. We need to help  our families. We need to make American lives better and better. And in  my opinion, America needs to lead the world, and that is what we are  doing today.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…also mitigate the devastation of wildfires in our wildland-urban  interfaces through the restoration of forest health and commonsense  management. I hope the Senate will act soon so we can send FOFA to the  President's desk quickly to help our rural communities throughout  Arkansas and the Nation.\n\nIt is time to restore revenue, revitalize resilience,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Labor-Health bill, which would actually  get us up north of 75, maybe even 80 percent of the appropriations  process finished. He is ready to bring those two bills to the floor as  soon as we are open and operating.\n\nWe need to reopen the government to return to our bipartisan  appropriations work and get back to conducting the business of the  American people.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…which had flourished  through orange cultivation until the devastating freeze of 1894 through  1895. That natural disaster forced many to seek new livelihoods, and  Coleman soon emerged as a center of diverse agricultural production. In  addition to citrus, settlers in Coleman raised cotton, cattle, sheep,  and hogs, with wool even shipped to Baltimore…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}]