[{"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. Speaker, the Republican bill was put together with bubble gum and  Elmer's glue last Friday night. This isn't a plan. It sounds like their  argument that 300-year-olds are receiving Social Security benefits.\n\nFamilies are staring at massive premium hikes, and now, thanks to  four Republicans, we can…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…that this is too  important a program. They agreed that what they would do was to keep  the program intact, under the assistance of Tip O'Neill, but they  raised the age. That sounds like a reasonable compromise until you  realize that for every year you raise the age, that is a 7 percent cut  in benefits. In essence, back in 1982, there was a 14 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…professionals.  They tell her she can get so many things for free: pregnancy tests,  ultrasounds, pregnancy counseling, and, after the birth, even free  diapers and formula. It all sounds so wonderful to this woman that she  says sign me up.\n\nThey don't tell this woman that, in order to get these free services,  she has to first sit through an ideological or…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…lot of families as well. According to one  poll, 59 percent of Virginians expect to face financial difficulty in  the years ahead. This doesn't sound like the golden age. It sounds like  fool's gold.                              Merit-Based Hiring\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise in support of merit-based  hiring, especially in the Federal Government,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…off.\n\nIs that your agenda? That is it? You are going to rip off American  consumers, undermine their voting rights, undermine the judiciary, and  insult moms? Cool. Yes, this sounds like a great agenda.\n\nOh, I forgot, you are also going to tank the economy while Donald  Trump is playing golf, and you are going to try to pass a budget that  literally will…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689704/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…project would renovate a 70-year-old school building into a       community center that protects public health and provides       valuable resources for local residents. That sounds like a       home run project to me. The center would provide childcare       for up to 200 children, create an on-site learning       laboratory, and provide vocational scholarships…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…am here to beg for your consideration in support of my  amendment to address something that happened with the reconciliation  bill that changed the 1115 waiver.\n\nNow, this sounds incredibly wonky. An 1115 waiver to Medicaid is  something that we are not going to be able to go home and talk to  constituents about what we were able to do for them. Nobody…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that his  position? Is his position that anytime Jeffrey Epstein got somebody on  the phone--and he got a lot of people on the phone--that person is  suddenly guilty? That sounds like guilt by association. That sounds  like collective guilt.\n\nOur minority whip introduced a perfectly reasonable amendment to say:  Let's refer this to an Ethics Committee.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…other side. My colleagues across the aisle said at one point  it costs the Department of Energy a little over $200,000 to implement  this rule, and they have described what sounds like onerous associated  paperwork and a big administrative burden.\n\nNow, understand, that is $200,000 total, across all manufacturers  throughout the country. I mean, we are…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…to prevent the shutdown.\n\nI think, in that same interview, the President said something along  the lines of, if there is a shutdown, it is a bad mark on the  President. It sounds to me like the President should be bringing people  together.\n\nLast night, one of my constituents from Albuquerque, NM, shared with  me that she had been furloughed as a Federal…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…family only learned of his arrest after footage of the encounter  was posted on social media. His family started searching desperately to  find him in detention. Now, if this sounds like an extreme case, it is  not. It is the usual custom. The ICE agents sweep people off the  street, and they disappear sometimes for hours, sometimes for days,  sometimes…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…8-week paid vacation. Give me a break.\n\nSherrill), the next Governor of New Jersey.\n\nMr. McGOVERN.\n\nMr. McGOVERN. Mr. Speaker, let me just say that the gentleman from  New York sounds as extreme as his voting record. Mr. Speaker, I say to  the gentleman who just spoke, by supporting this bill, he is betraying  7,000 constituents in his district who rely…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…wildlife refuge. They call it all kinds of things so that they  don't have to use the phrase ``wildlife refuge.'' They will call it the  1002 area. They will call it ANWR. It sounds like someplace in the  Middle East that you would expect oil and gas production.\n\nThey don't want us to pay attention to how crazy a prospect  developing one of our last remaining…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…garbage bill. He wants fireworks, flags, and cameras,  not for this country, but for himself. He says to close your ears,  close your eyes, and vote for this bill. Honestly, it sounds more like  a cult than a Congress to me.\n\nSome Republicans promised their voters no cuts to Medicaid and no new  debt. Now, they are flipping faster than pancakes at a campaign…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…car loan since it will decrease the capital  available to private industry and slow down our economy.\n\nThis magic math goes by the name of ``current policy baseline.'' It  sounds very academic, but it is essentially the big lie.\n\nConsider this: You sign a contract to rent a home for a year, and  renting that home costs $2,000 per month so you know you…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…the funds to these Somalia criminals  and turned a blind eye.\n\nFor example, one of the scams run by the Somalia nonprofit disguised  itself as a housing assistance program. Sounds great. The initial  budget for this program was $2.6 million. However, the annual budget  quickly increased to over $100 million due to fake billing and fraud.  Whose money…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, it sounds like my case in salesmanship is  going to be modest with the support that this act enjoys from  colleagues on both sides of the aisle.\n\nI am someone who has built a business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695380/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…without the  approval of Congress, and yet here we are.\n\nAn emergency has been declared, as the Senator from Virginia  remarked, everywhere. There is an emergency everywhere. Sounds like an  emergency everywhere is really an emergency nowhere. But despite the  constitutional restraints or constraints on executive power, Americans  have now been ordered…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and thrive and  provide employment for other families.\n\nI visited another place in the Rio Grande Valley, this one called 5x5  Brewing Company. This is a veteran-owned, as it sounds, brewery which  is dedicated to brotherhood, tradition, and, yes, you guessed it, great  beer. This tradition is reflected on their menu as many of their  signature beverages…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of this resolution to  overturn the Consumer Financial Protection Bureau's deeply flawed final  rule on larger participants in general-use digital payment  applications.\n\nIt sounds complicated, Mr. Speaker, but it is not. This is a midnight  rule created by the Consumer Financial Protection Bureau. It is overly  broad, and it is imprecise. It treats a…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "French Hill", "party": "Republican", "sentence": "…1600 Pennsylvania Avenue for President  Trump to sign into law.\n\nMr. HILL of Arkansas.  I would like to address a few of those points.\n\nOne, I am so delighted to hear that it sounds as if my friend, the  ranking member from California, in fact, will now vote for the CLARITY  Act this afternoon on the House floor since she highlights some of my  suggested…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…before us today reverses perhaps the most  misunderstood rulemaking in financial services. On its face, you may  look at a proposal to cap overdraft fees and think, wow, that sounds  like a great idea. After all, who wants to pay more in fees?\n\nHowever, in reality, the CFPB's rule capping overdraft fees is  nothing more than an eleventh hour effort from…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…are not going to get food stamps, but somebody making $100,000  is going to get $13,000. That doesn't sound like the Democrats are for  the working class or for the poor. It sounds like the Democrats are for  the people making $200,000 a year to get a subsidy.\n\nBut in the midst of all this, with pressure, I think the Democrats  could be made to understand…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…cash to the  insurance companies and setting up a political timebomb right before  the Presidential election. That doesn't sound like that is actually  helping people. That sounds like that is perpetuating the same problem  that we have dealt with already. These are options that we should be  able to have grownup conversations about and resolve. There…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…that we be able to afford it. And the only  way we balance those two is if other countries pay their fair share.\n\nBut let's return to the measure at hand. The measure at hand sounds  simple. It is simple. It won't succeed. Well, it will succeed in  lowering prices temporarily, but, in the long term, it will defeat the  ability to incentivize innovation.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the dietary issues and  the food issues, trying to get young people to go exercise. Can anyone  guess?\n\nCome on, this is a play-at-home game. It was Pokemon GO. I know it  sounds crazy, but the gamification actually was the one great example  of success for the last couple decades of helping young people get  healthier.\n\nWhat if we took that knowledge…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…infections. So outbreaks in cattle herds require labor-intensive daily  inspections of livestock to make sure they have not been infested.\n\nNow, some may be wondering: That sounds pretty horrific, but what  does it have to do with me? Well, the truth is, this little pest, this  vicious pest, touches all of our lives one way or the other. If the New…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…in  the State employ 20 or fewer people. Eighty percent of them are really  small businesses. There are about 93 percent if you go under 500  employees. For a lot of us that sounds like a big number, in my part of  the world, but under 20 employees, that is a small business. Those are  the Main Street businesses we are talking about.\n\nI talk with a lot…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the ObamaCare plans.  Nearly half of all enrollees--that is, 12 million people--didn't even  file one single medical claim, not even a prescription, all year, last  year. It sounds like they didn't even know that they had insurance  through ObamaCare, but those insurance companies were subsidized,  almost half of them, on the exchanges.\n\nIf Democrats…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and local governments to raise  taxes and spend more money. I had to explain to my State legislators  these were Republicans who wanted it. They found it hard to believe. It  sounds like a tax provision that you would be more likely to hear  Democrat legislators want.\n\nIn any event, I think we have to follow the negotiations that are  going on, and we…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}]