[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…supports both science and our commercial remote sensing  industry, such as companies in my home Commonwealth of Virginia, by  augmenting scientific research with additional sources of data and  leveraging commercial capabilities.\n\nI thank the bill's sponsors for their work on the ASCEND Act and  encourage my colleagues to support this legislation, as…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700116/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…administration has proudly published the footage of countless  other strikes, including the first one from the very same day,  believing it could do so without compromising any sources or methods  used by our military or intelligence services. This followup footage  should be no different.\n\nSince the beginning of this campaign of unauthorized strikes against…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…95 percent of that new capacity was solar, batteries,  nuclear, and wind power.\n\nYet this administration has launched an all-out assault on these  lower cost, less polluting sources of energy.\n\nPresident Trump promised to lower energy prices for Americans ``in  half.'' Now, across the country, electricity prices have jumped more  than twice as fast as…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…critical role in conducting research  in energy innovation, including for wind, solar, and nuclear, and also  to ensure that we maximize the efficiency of all of our energy sources,  including oil, gas, and coal. More efficient energy production means  lower prices.\n\nIt is deeply disappointing that this measure follows the  administration's lead to abandon…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694858/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…front what costs they may face and make informed treatment  choices.\n\nWhy are we afraid to ask the drug companies to disclose a price they  publish in private--at least to some sources--and not tell the American  consumer? If they had to do that, we think the American consumer would  think twice about falling for these ads.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…absolutely  devastating news out of Texas. Access to high-quality information can  truly be the difference between life and death. Access to local news  from reporters and sources that community members trust is more  important than ever.\n\nStripping away this funding would also endanger local news that is  already disappearing in so many Wisconsin communities.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…bone allografts, which resulted in multiple deaths. The  outbreak then infected 113 patients across 18 States, and it led to at  least 3 confirmed TB-related deaths with some sources citing a total of  8 deaths.\n\nThis has to stop. Too many people get bone grafts and have no idea,  including the doctor that did a bone graft on me, that they even needed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…They are going to be consuming as much electricity as 100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can meet this demand. Trump's  sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting, they are pricey, and they are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…their quest to take away California's authority under the Clean  Air Act.\n\nThis is unacceptable. California has done nearly all it can do to  reduce emissions from stationary sources of air pollution within its  jurisdiction. Given our unique air quality challenges and the worsening  impacts of climate change, it is essential for our State to reduce  pollution…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Business Investment Company program is a multibillion- dollar investment program designed to bridge the gap between a small  business owner's need for capital and traditional sources of financing.  It achieves this purpose by partnering private and public investments  in early-stage startup businesses. It also gives America's small, high- growth companies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…spending.                         Contributions to Super PACs\n\nDuring the 2024 election cycle, shell companies and 501(c)       nonprofits that did not disclose their funding sources gave       $1.3 billion to super PACs--more than in the prior two       election cycles combined.\n\nCitizens United and later court cases led to the creation       of super…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…have the necessary expertise and staffing to  maintain reliability on their grids already. Regional operators know  that there are cheaper, cleaner, and more reliable energy sources  available, not just expensive coal and gas.\n\nThere are modern grid solutions that the committee has refused to  take up this year. That is another reason electric bills are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…doors.\n\nIn order to stabilize the balance of the fund and prevent further  cuts, H.R. 909 would add unobligated funds from actions brought under  the False Claims Act to the sources of revenue that are deposited into  the Fund. Deposits would be made into the Crime Victims Fund only after  whistleblowers and defrauded Federal agencies are paid first and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698843/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…would provide another tool to ensure San Diego does  not need to move from emergency to emergency to secure adequate funding  for the plant. If we can get money from other sources, there is no  reason not to accept it. For some reason, current law prevents us from  accepting even a donation from a nonprofit that would want to help us  with the issue.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…live in the past. We must keep inventing. We can't go back. We  have got to go forward. Our energy future is right here at home. Over  the last 50 years, new American energy sources have been invented. All  exist in our homeland, with more to come. I am just so proud of the  inventiveness of the American people. The discovery of natural gas in  the Utica…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…challenges now. The demand is going to increase precipitously  in the years to come. How do we make sure we meet that demand? How do  we make sure we have not just the generation sources in place but also  the transmission systems that work together to make sure that we are  working against any sort of large-scale failure scenarios that make a  problem for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…foreign  government or foreign entity of concern.\n\nThe bill also guarantees parents the right to know how many personnel  at their child's school are being compensated by foreign sources or any  donation of foreign transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…additional funding from other Federal and non-Federal partners to  support water and wastewater infrastructure.\n\nThis amendment will give the IBWC access to additional funding  sources, enabling it to properly maintain these assets and, in turn,  support cleaner training waters for our warfighters while strengthening  security along our southern border.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the work of this institution.\n\nFor 32 years, Jamie reported for Cox Radio, becoming a senior  Washington correspondent for Atlanta's WSB Radio and one of the most  trusted sources of news on Capitol Hill.\n\nIn 2017, Jamie was diagnosed with dystonia, a rare condition that  cost him his ability to speak. Even after that diagnosis, Jamie's  dedication…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Nuclear Energy.\n\n``(3) Leverage, to the extent practicable, the research       infrastructure of the Department, including scientific       computing user facilities, x-ray light sources, neutron       scattering facilities, and nanoscale science research       centers.\n\n``(4) Conduct research, development, demonstration, and       commercial application of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…are not, as my colleagues might try to tell us, trying to  ban electric stoves at all. Some of my colleagues on the other side  would try to abandon or eliminate certain fuel sources from being used.\n\nH.R. 4758 also repeals a section of the so-called Inflation Reduction  Act to train contractors on how to install these electric appliances.  While a contractor…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and the next-generation industries.\n\nUnfortunately, the previous administration sought to deliberately  undermine the financial viability of coal while subsidizing preferred  sources like wind, solar, and batteries.\n\nInstead of regulating one industry and subsidizing another to make it  competitive, we need to get back to making things affordable in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the       United States. NTEC is unique in that it was formed in 2013       by the Navajo Nation to ``promote the development of the       Navajo Nation's resources and new sources of energy, power,       transmission and attendant resources to develop the economic,       financial, social and cultural well-being of the Navajo       People and the Navajo…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Truth,'' published May 1, 2025. In it, the author reflects on how  society grapples with competing claims of truth and encourages readers  to return to foundational and verifiable sources--a theme with deep  implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…participating in financial contracts with the People's Republic of  China. Additionally, H.R. 1005 requires school systems that receive  sizable funds of $10,000 or more from foreign sources to disclose their  agreements to the Department of Education.\n\nAnother bill being considered under this rule is H.R. 1069, the  PROTECT Our Kids Act, led by Representative…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…matters of the Director's Initiatives Group, which       shall include: (1) a list of personnel of such group from the       date of the creation of the group; and (2) funding sources       for personnel of such group.       Report on Secure Mobile Communications Systems Used To Transmit                           ClassifIed Information\n\nThe Committees direct…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…away with unchecked pollution.\n\nMadam Speaker, I say not so. That is not so. The EPA's National  Emission Standards for Hazardous Air Pollutants would still exist. All  major sources would still have to abide by their Clean Air Act Title V  permits and various other Federal and local controls and regulations.\n\nRegardless, if Congress were to pass this…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Francisco to L.A. in 6  hours, something you can do on a plane in 1 hour today.\n\nThis project has been called a project that won't even be built  within the next century by even sources like The New York Times. I have  introduced legislation to eliminate all future Federal funding for  high-speed rail. The Governor continues to believe that Federal funding…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…including China. That is a  brilliant plan.\n\nIf we look at wind and solar, it funds wind and solar, which are  actively destroying the power grid. They are the least reliable sources  of power and the most expensive. Nobody would use them, and nobody  would produce them, if they weren't subsidized by your tax dollars. It  funds zero-emission vehicles that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Atlantic River Basin Commission, including the types of       actions taken by relevant Federal agencies in carrying out       such responsibilities;\n\n(D) describe the level and sources of Federal and State       funding received by each Mid-Atlantic River Basin Commission;\n\n(E) identify duties and responsibilities of each Mid-      Atlantic River Basin Commission…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}]