[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…credits--many of which have enjoyed broad support in Congress--to  make major investments in domestic energy production and infrastructure  for traditional and renewable energy sources alike. Both our  constituencies and the energy industry alike remain concerned about  disruptive changes to our Nation's energy tax structure.''\n\nThe letter continues toward…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…administration has proudly published the footage of countless  other strikes, including the first one from the very same day,  believing it could do so without compromising any sources or methods  used by our military or intelligence services. This followup footage  should be no different.\n\nSince the beginning of this campaign of unauthorized strikes against…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…queue, we should focus instead on  speeding up the processing of the entire queue so power plants can get  online as quickly as possible because we need more power from all  sources.\n\nWe should focus on making it easier to build the necessary grid  infrastructure upgrades so power can get online. We should do it all in  a way that is fair to American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…do not believe Mr. Hegseth. He  has lied repeatedly about this operation and others, claiming news  stories are false, only to be contradicted by the White House or other  sources. His argument boils down to: Take him at his word; trust him.  But, frankly, I cannot--not when the law is this clear, not when the  stakes are this high.\n\nShamelessly violating…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…industry.\n\nSo what is about to unfold is that we are going to see the pursuance  of a vendetta against wind and solar energy by cutting incentives for  the cleanest and cheapest sources of electricity, all to pad the  pockets of the big oil and big gas industries.\n\nThis bill eliminates the residential clean and efficient energy  incentives. Let me say that…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…gas drilling. There is no set correlation between more drilling  and lower consumer prices.\n\nWe must act now to fix our outdated electric grid to bring more  renewable energy sources online. This will make us less reliant on  natural gas prices that fluctuate.\n\nThis week, the majority brought bills before this House, claiming to  save Americans money on…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698098/functioning-in-the-face-of-an-affordability-crisis"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…farmers all across the country. So when  China stops buying, what do we do? Unfortunately, our buyers, like  China, turn to other countries, and they use those countries as sources  when they used to rely on us. That worries these farmers behind closed  doors, but they don't say much publicly.\n\nThey don't like tariffs. They tell me that behind closed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…global warming potential 80 times higher than carbon  dioxide over a 20-year period, meaning that even small leaks can erase  the climate benefits of utilizing cleaner energy sources.  Unfortunately, methane regulations have been caught in a cycle of  constant change.\n\nThe first Trump administration repealed methane regulations from the  previous administration.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…our economy, from  transportation to electricity, to manufacturing, to agriculture,  construction, and buildings.\n\nIt is that long-term vision that has diversified our energy sources  so that after seasons of extreme weather, we can still take advantage-- more importantly, take advantage--of hydropower opportunity after  rainstorms or reap the benefits…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…you are conservative or liberal, MAGA or progressive-- whatever you want to call yourself--how could you want an America with  less information and with fewer choices as the sources of that  information?\n\nThe strength of our democracy is the fact that the American people  have access to good, credible information and can make up their own  minds. They…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Florida, we anticipate that will apply to 72 more  polluting facilities that will be allowed to escape regulation and emit  cancer-causing air pollution.\n\nThese are the major sources of hazardous air pollution, the large  industrial facilities like chemical plants, refineries, and pesticide  manufacturers. It is especially troubling because--and I think…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…sectors of our economy.\n\nAs we celebrate NDEAM and disability employment, I want to recognize  the success of the AbilityOne Program, one of the largest and most  impactful sources of employment for people who are blind or have  significant disabilities in the United States.\n\nSince Congress first established the program over 80 years ago,  AbilityOne…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…power  their data centers, AI systems, and cyber missions, all by using  American energy.\n\nThis legislation, importantly, is a departure from how we regulate  all other energy sources. Sources like oil and coal, we have laws that  impose certain restrictions on exports to foreign entities of concern,  like China, Russia, Iran, and North Korea.\n\nMr. Speaker,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…$3.4 trillion.\n\nThis resolution is the latest attack from my Republican colleagues to  undercut our public lands, to prop up fossil fuel polluters, and the  expensive energy sources that they peddle and leave people out of the  decisionmaking process, all while driving up energy prices for the  American people.\n\nMr. Speaker, I urge my colleagues to join…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…close the capital gap for diverse  businessowners. Small business leaders say that it is not lack of ideas  but a lack of capital that holds them back.\n\nThis bill opens up new sources of funding from a pool of investors  more reflective of the community so that these founders can turn their  vision into jobs and economic growth.\n\nI urge all my colleagues…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…natural gas was at 10 percent. Some of my colleagues  struggle with math. I will just add that up for them. That is 88  percent of their energy production comes from hydrocarbon sources. That  means that the remaining 12 percent came from hydroelectric, solar, or  wind.\n\nWhat is interesting about this is they make it seem as though China  is just dominating…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…foreign  government or foreign entity of concern.\n\nThe bill also guarantees parents the right to know how many personnel  at their child's school are being compensated by foreign sources or any  donation of foreign transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…application, and the entity's       projection of such vacancies over the ensuing 5-year period;       and\n\n``(iv) a description of the entity's plans to identify       funding sources to sustainably continue, after the 3-year       grant period, the salary available to the eligible nursing       faculty member pursuant to the program under this subsection…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…activities of the Hezbollah terrorist organization at these       sites constitute a blatant violation of the understandings       between Israel and Lebanon.''\n\nLebanese security sources said that Israeli warplanes flew       more than 10 attacks in several eastern locations early on       Tuesday.\n\nAccording to residents, loud explosions could be heard in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…America.\n\nCurrently, China and other adversarial nations dominate the       globe in critical mineral production and processing, while       U.S. dependence on foreign sources for these materials has       recently reached an all-time high. The ban on mining across a       significant portion of Minnesota only set us further behind       as a nation.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…market capitalizations in the hundreds of billions of dollars       and with millions of U.S. consumers. Using publicly available       information and information from industry sources, CBO       estimates that the aggregate cost of the mandate would       greatly exceed the private-sector threshold established in       UMRA.\n\nIn addition, if federal financial…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…economics,       publishing, marketing, actuarial science, operations       research, engineering, and medicine, require data savvy,       including the ability to select reliable sources of data,       identify and remove errors in data, recognize and quantify       uncertainty in data, visualize and analyze data, and use data       to develop understanding…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…wrong hands.\n\nHowever, its outdated nature ends up creating the very problem that  it seeks to avoid. U.S. competitiveness is limited, as our partners  choose to turn to other sources for technologies that are too slow to  procure from the U.S.\n\nPresident Trump's April 9 executive order mandated that the State  Department review and update the foreign military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Truth,'' published May 1, 2025. In it, the author reflects on how  society grapples with competing claims of truth and encourages readers  to return to foundational and verifiable sources--a theme with deep  implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…strengthens America's economic and national security by advancing  domestic mineral production--something we didn't talk about enough  today--which reduces our reliance on foreign sources and supports job  creation here at home.\n\nFinally, a ``yes'' vote on this rule enables us to consider  legislation that preserves equal debate, protects the rights of the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Francisco to L.A. in 6  hours, something you can do on a plane in 1 hour today.\n\nThis project has been called a project that won't even be built  within the next century by even sources like The New York Times. I have  introduced legislation to eliminate all future Federal funding for  high-speed rail. The Governor continues to believe that Federal funding…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…vulnerabilities in our  supply chains. By fostering investment in domestic semiconductor  production, this bill aims to enhance supply chain resilience and  reduce dependence on foreign sources.\n\nMr. Speaker, I urge my colleagues to join me in voting in favor of  H.R.\n\nMr. BILIRAKIS. Mr. Speaker, I encourage a ``yes'' vote on this  particular bill, and I yield back…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…under chapter 8 of title 5, United States Code, of the rule submitted  by the Environmental Protection Agency relating to ``Review of Final  Rule Reclassification of Major Sources as Area Sources Under Section  112 of the Clean Air Act'', and ask for its immediate consideration in  the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. WEBER…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…(3) determine, to the extent possible, the prevalence of       and mortality from the cancers specified in paragraph (2)       among covered individuals by using available sources of data,       which may include--\n\n(A) health care and other administrative databases of the       Department of Veterans Affairs, the Department of Defense,       and the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…the previous administration on their way out the door to  further hamstring our domestic energy producers.\n\nBy permanently classifying certain industrial facilities as major  sources of hazardous air pollutants, even if they successfully reduce  emissions, the Biden administration was seemingly punishing job  creators for being good stewards of the environment.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}]