[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…of Directors and ultimately became President  of the organization in 2015.\n\nDuring her 10 years as President, Ann reimagined DARTS' vision to  best serve individuals in the southeast metro area. She invested in the  organization's volunteer program, revamped annual community and  fundraising events and led the effort to turn part of their West St.  Paul…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…degradation of habitats that are vital  to the health of our oceans.\n\nMany of these harmful collection practices occur in international  waters, particularly in regions such as Southeast Asia, where most of  the world's coral reefs are located. In many of these countries, there  are weak or insufficient regulations to prevent destructive collection  methods.…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…States. It is the  basic infrastructure of diplomacy.\n\nWhy is this bill important right now?\n\nFirst, our strategic interests in the Indo-Pacific. ASEAN, the  Association of Southeast Asian Nations, is central to U.S. engagement  in Asia. Recognizing its diplomatic status here in the United States  shows our commitment to the region's future and to working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…ages. From youth programs and senior  activities to public meetings and fitness classes, the Center has  served as a vital hub for connection and opportunity in the growing  southeast area of the Las Vegas Valley.\n\nThis achievement would not have been possible without the foresight  and commitment of the Clark County Commission, whose leadership  continues…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691298/recognizing-the-one-year-anniversary-of-the-silverado-ranch-community-center-in-clark-county-nevada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…babies, our friends, our  neighbors, our loved ones. Many of these deaths involve accidental  discharge of a firearm, often by a child, including several tragic  incidents in southeast Michigan.\n\nJust last month, Mr. Speaker, in Oakland County, a 9-year-old was  seriously injured after he was accidentally shot. First responders  found the boy bleeding from…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…followed by an       explosion of Islamist insurgency, including groups linked to       Al-Qaeda and the Islamic State, that is spreading across the       region today.\n\nTo the southeast, Haftar's troops have been accused of       aiding the paramilitary Rapid Support Forces against the       Sudanese Armed Forces in the civil war that first erupted-in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…1976.\n\nWe tell ourselves that we are the land of opportunity. We need to be  the land of opportunity, but we are seeing our economic mobility slide  behind competition, from Southeast Asia to Europe. There is a lot of  discussion these days about what the threats to our democracy are or  the fact that our democracy is threatened. I don't think there is…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and supporting local veterans'  organizations. Their commitment and dedication earned them recognition  as Unit of the Year in the tri-state (Alabama, Georgia, Tennessee)  Southeast Regiment of the Year of Division 2, and most recently,  National Young Marines of the Year for 2025.\n\nThe impact of this remarkable group extends far beyond their unit,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…workforce, our  hardworking men and women, and those large concentrations of engineers  that we have. They are from Grand Rapids, Flint, Saginaw, Lansing, and,  of course, all over southeast Michigan, from Detroit to Macomb County  and throughout Oakland County.\n\nAll of this goes hand in hand from the lab to the shop floor, to the  classroom, to the tinkering…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, I rise to speak about the ongoing and often  forgotten civil war and humanitarian crisis taking place in Burma,  which impacts the broader Southeast Asia region. We should all be  outraged by the horrific crimes against humanity perpetrated by the  Burmese military  against the Rohingya and other Burmese minority groups.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…goals  of a 50 percent emission rate reduction by 2030 and a 50 percent  carbon-free energy-generating capacity by 2030. This plant is a  cornerstone of energy resilience in Southeast Louisiana, playing a  vital role in meeting the power needs of nearly half a million  customers by providing a maximum dependable capacity of 1,152 megawatts  and contributing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…democracy award--have worked at great personal risk to defend those  basic rights. Their fight is part of a larger global struggle.\n\nFrom Eastern Europe to Latin American and Southeast Asia, the pattern  is the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and dismantle the checks meant to  hold them…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…with no due process.\n\nDays ago, we learned they deported a 4-year-old child with stage IV  cancer and a 2-year-old American citizen.\n\nWe know that they are now going after Southeast Asian refugees from  Vietnam, Laos, and Cambodia. They came here due to the U.S. depending  on them as allies during the Vietnam war.\n\nThis was the case with Chanthon Bun,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, disastrous floods, horrific floods are  devastating the lives of our residents in southeast Michigan and across  the Nation.\n\nThe dangers don't stop when the flooding ends. Too many of our  families are denied FEMA assistance because current rules and policies…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…faster permitting       processes.\n\n``In addition to growth in established markets, solar is       set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries, policymakers need to pay close…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…soil. His commitment to  conservation has earned him statewide and national recognition,  including leadership roles on the soil and water conservation state  board and the Southeast Region Hall of Fame award for the National  Association of Conservation Districts.\n\nJeff also works outside the family farm. He and his family operate  three retail markets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Hannah Dickinson. Hannah is a member of Sandy Beaches  Service Unit within Girl Scouts of Southeast Florida, and has  exemplified extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Every year,  American catfish farmer communities lose up to $64 million in stock to  the cormorants alone.\n\nFor far too long, catfish farmers in Mississippi and across the  Southeast have been weighed down by burdensome permits and processes  created by people too far removed from the realities of everyday,  working-class Americans.\n\nIt is past time we…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and women who wear the uniform.\n\nAccess to a VA facility is not a reality for some of our rural  veterans. I hear this each and every day out in my district, 24  counties southeast of Kansas City. This bill, though, ensures that they  are not forgotten. We increased access opportunities by increasing the  funds available for community care.\n\nIn a powerful…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…until 2016, until it was  vacated by a judge in response to yet another activist lawsuit.\n\nDouble-crested cormorants are waterbirds common to the Great Lakes  States and the Southeast. They are opportunistic and intelligent  predators that often feed at aquaculture facilities, where fish are  easy to catch. A variety of studies have determined that predation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…our allies that they can  rely on American energy instead of their adversaries'. Most  importantly, it reinforces a simple truth: Energy security is national  security.\n\nIn southeast Texas, we understand that better than anybody. We  produce it. We refine it. We ship it. We keep America moving every  single day.\n\nH.R. 1949 is pro-jobs, pro-growth, pro-ally,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I am proud to share that over $24  million in Community Project Funding is now coming home to southeast  Iowa, funding that has been signed into law and will soon begin making  a real difference on the ground.\n\nThis didn't happen overnight. It came after months of meetings…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…comment from the Lebanese government       about Tuesday's strikes, though the official National News       Agency reported that ``enemy warplanes launched a raid''       southeast of Baalbek, the main city in the region.\n\nThe rugged Beqaa Valley is seen as a stronghold for       Hezbollah, and had been considered a key conduit for       smuggling weapons…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…incorporated as  a city in May 1925. The City of Ocoee will host their Centennial  Celebration on Friday, May 9, 2025.\n\nOcoee was first settled in the mid-1800s, near Starke Lake, southeast  of Lake Apopka. In 1886, Dr. H.K. Clarke, Charles J. Chunn, and R.B.F.  Roper developed the Town of Ocoee subdivision, naming it after the  Ocoee River in Tennessee. The…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690916/recognizing-the-100th-anniversary-of-the-city-of-ocoee"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…world. There was no hesitation by  the people of Canada. It was only humanity. I will never forget that.\n\nI remember, after Hurricane Katrina, which hit my State, it destroyed  Southeast Louisiana--New Orleans, yes, but many other parts of my State  as well--and Mississippi. Canada was the very first country and the  people of Canada were the very first people…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Mr. SCHMIDT. Mr. Chair, I thank the chairman for his leadership on  this issue.\n\nThis is a subject near and dear to my heart. I come from a part of  the country in southeast Kansas where I have got a lot of classmates,  friends, and neighbors who have struggled with addiction over the  years. I know them personally.\n\nWhen I started in public…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…School; Lora Sevarino, McNeal Elementary School; Nicole       Yancey, Myakka City Elementary School; Kimberly Thomas,       Willis Elementary School; Suzanne Theiss, Southeast High       School; Dilcia Navarro, State College of Florida Collegiate       school.\n\nTeacher Award: Laura Redeker, Anna Maria Elementary School;       Susan Nova, Harvey…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Speaker, I rise today to recognize the  career of Doug Kennedy, who is retiring after 45 years of serving  southeast Nebraska as a radio broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station ownerships. During…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Cordele, Georgia as the  Watermelon Capital of the World, yes you heard that correctly.\n\nThis town produces a plethora of summertime fruit, supplying much of  the state and the Southeast region with a sweet, refreshing treat to  beat the heat.\n\nCordele also hosts the Watermelon Days Festival which invites  thousands of visitors each year.\n\nToday, we congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694766/cordele-watermelon"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…estimated that my bill will not result  in a measurable increase to Federal spending.\n\nH.R. 131, the Finish the Arkansas Valley Conduit Act, will help small  rural communities in southeast Colorado finally complete a Federal  water project that was authorized in 1962 under the Kennedy  administration.\n\nRadium, uranium, and other naturally occurring elements…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]