[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…sponsor, my colleague from Colorado, Ms.  Boebert; by the ranking member; and by the chairman. I think they have  ably explained why this water infrastructure project for southeastern  Colorado is so critical, a project 60 years in the making.\n\nI support it because, as was noted, there are no cogent issues with  this bill as were purportedly articulated in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "H.R. 131 seeks to address a longstanding water challenge in  southeastern Colorado. The Arkansas Valley Conduit is a 130-mile  pipeline first authorized in 1962 to deliver water from the Pueblo  Reservoir to communities facing ongoing water supply…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, in 1962, Congress authorized a 130-mile pipeline, known  as the Arkansas Valley Conduit, to deliver clean, reliable water to  communities in southeastern Colorado. More than 60 years later, the  project remains uncompleted, while communities in the region continue  to face unreliable water supplies and serious water quality challenges.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…politics.\n\nThe President's veto will inflict real harm on people in my State by  denying 50,000 Coloradans living in tiny rural towns across the  Arkansas River Valley and southeastern Colorado access to clean,  affordable drinking water. Those farmers and ranchers have been forced  to rely on unsafe, carcinogenic water for generations, despite the  Federal…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Conduit, or AVC, by easing the repayment requirements for project  beneficiaries.\n\nThe AVC is designed to provide potable water from Pueblo Reservoir to  39 communities in southeastern Colorado, many of which are dependent on  groundwater supplies that contain unacceptable levels of naturally- occurring heavy metals and radionuclides. According to the Southeastern…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Arkansas Valley Conduit Act.\n\nThis is not a symbolic vote. It is not messaging. It is not partisan.  This is a test of whether Congress keeps its word not just to  southeastern Colorado but to every community in every State and  district that depends on Federal commitments being honored.\n\nFor those of us who represent the American West, this vote is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…that was authorized in 1962 under the Kennedy  administration.\n\nRadium, uranium, and other naturally occurring elements are found in  the surface and groundwater of southeastern Colorado, and the water  quality is problematic year-round because of its salinity, selenium,  sulfate, hardness, and manganese levels.\n\nThe Bureau of Reclamation has found…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]