[{"senator": "David Taylor", "party": "Republican", "sentence": "…They are heroes,  lifesavers, and an irreplaceable cornerstone in our communities who  help Ohioans live their lives to the fullest.\n\nWith agriculture being the backbone of southern Ohio, our region is  home to countless farmers, ranchers, and producers who work hard to  secure our Nation's food supply and put food on our families' tables.  They work long…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…better citizens and stewards of their communities. America is blessed  to have an organization dedicated to helping our children become the  best versions of themselves.\n\nSouthern Ohio is so proud of Carter's accomplishment and happy to  call him one of our own. Since the Eagle Scout Award was first  introduced in 1912, only about 4 percent of Boy Scouts…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…reproductive science on the farm. Garrett is a lifelong  cattleman. He was raised on Stanfield Farms, which has been operated  for generations by the Stanfield family in southern Ohio.\n\nAmerica's cattlemen, farmers, and ranchers are the backbone of our  country. It is a great honor to advocate for them in Congress, and it  is my sincere hope that we…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690854/recognizing-garrett-stanfield"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…of the Scouts,  which is to make ethical and moral choices that contribute to the well- being of society, ultimately fostering civic engagement and love of  community.\n\nSouthern Ohio is proud of Madison's accomplishments, and we are happy  to call her one of our own. I look forward to seeing how she continues  to create positive change in Ohio's Second…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…so  much of themselves into our student athletes. The great achievements of  the Lady Indians belong to them as much as they belong to the players.\n\nMr. Speaker, all of southern Ohio is proud of our Lady Indians'  accomplishments, and I look forward to another great season next year.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693117/recognizing-hillsboro-high-school-lady-indians"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…advances that help bridge the broadband gap across rural  regions, ensuring all Americans are connected to the modern economy.\n\nMany towns and communities within my district in southern Ohio still  lack access to broadband, which, frankly, is unacceptable. Without  reliable internet access, students face challenges in completing  homework, patients can't receive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694869/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…pass the  farm on to him and future generations. With family farms making up 96  percent of all farms in my district, this is huge news for countless  farming families in southern Ohio.\n\nThrough the One Big Beautiful Bill Act, President Trump and  Republicans are investing in American manufacturing and American jobs.  I see the direct impact of this through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…programs.\n\nAccess to clean and safe water should not be determined by where you  live, Mr. Speaker. During my time in Congress, I have heard from  elected officials across southern Ohio about the difficulties they face  navigating the Federal grant process due to budgetary constraints,  insufficient time, and lack of technical expertise. This bill would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize Carl and Nancy  Schneider.\n\nCarl and Nancy taught music in southern Ohio for 43 years before  retiring at the end of the 2025 school year, leaving an indelible mark  on the arts in Ohio's Second Congressional District.\n\nCarl served as the band…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…of my wonderful  wife, Charity, to recognize Ms. Joanna Sheaf, who celebrated her 100th  birthday on March 19, 2025.\n\nBorn during the Great Depression, Joanna grew up in southern Ohio and  lived with her grandmother as her father traveled, looking for work.  Joanna raised seven sons and one daughter as a hardworking and devoted  single mother, working…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…between players, coaches, and parents. It takes teamwork to achieve  great things, and that is something I hope the girls carry with them  for the rest of their lives.\n\nAll of southern Ohio is proud of the Cougar volleyball team. I look  forward to their continued success.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…sent an estimated  10,000 packages to American troops serving all over the Middle East and  beyond. As a result, Diana and her family-style operation found their  way into southern Ohio's history books as service leaders with a  purpose.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize two of southern  Ohio's outstanding young women who have proudly made the Second  Congressional District home to both Miss Ohio and Miss Ohio's Teen:  Olivia Fosson and Allison Payton.\n\nAllison,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…to his community, the Village of Batavia is naming July 14  ``Ken Stewart Day.'' I look forward to being in Batavia next year to  celebrate. We congratulate Ken. All of southern Ohio is very proud of  him.                  Recognizing Billy Ray ``Daddy-O'' Midkiff\n\nMr. TAYLOR. Madam Speaker, I rise today to recognize Billy Ray  ``Daddy-O'' Midkiff and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Programs just like this one represent the  best America has to offer, and it is great to see them focusing their  efforts on honoring our Nation's heroes.\n\nI and all of southern Ohio are proud of Kenley.\n\nI congratulate Kenley.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694175/recognizing-kenley-juillerat"}]