[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…56-year-old  responder, was laid to rest. This champion of healing and compassion  served as a medic for 25 years and had relocated to Kyiv when Russia  invaded his hometown in the southern Kherson region nearly 4 years ago.\n\nA nurse who worked with Smolyak said, before his funeral, that he was  very kind, always calm, and even-tempered. He saved so many people.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…waivers to be able to show  leadership--for over 50 years--because Congress recognized, rightfully  so, that air quality in West Virginia or Wyoming is different than it  is in Southern California, that there are fewer cars on the road in  Salt Lake City than there are in Los Angeles, and because California  was, and still is, the center of innovation in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…pattern of unchecked  enforcement that treats border communities as if the Constitution does  not apply.\n\nLet me say this clearly. The Fourth Amendment does not disappear in  southern Arizona. Due process does not disappear because someone is a  migrant. And humanitarian aid is not a crime.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697450/fighting-dhs-immigration-raids"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…A. Aguilera of Riverside  and Lance Corporal Marcelino M. Gamino of Fresno were both killed in a  tragic vehicle accident while on deployment as part of Joint Task  Force-Southern Border.\n\nBoth were combat engineers with the 1st Marine Division at Camp  Pendleton, and both were far too young to be taken from their families,  friends, and fellow marines.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…were tobacco  and textiles. Today, it is transportation and tourism.\n\nTourism is big for my State. People are going to come to South  Carolina because of legislation on that southern campaign of the  American Revolution. They will come to South Carolina to visit the  South Carolina National Heritage Corridor. They will come to visit the  Gullah Geechee…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Lead Artist for  the Historical Mural Restoration Project.\n\nMr. Barajas is the founder of Motivational Design and has completed  more than 500 public art projects throughout Southern California. Some  of his notable works include ``The Founders Mural,'' ``No Border  Wall,'' ``Amor Si Se Puede,'' and ``Amigos Car Club,'' and many others.\n\nHe is the recipient…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…record low water projections at Lake Mead and the  increasing risk of prolonged drought due to climate change, there is no  time to waste in securing water reliability for southern Nevadans.\n\nMy bill would allow a portion of the Southern Nevada Water  Authority's Horizon Lateral water pipeline project to tunnel beneath  Sloan Canyon National Conservation…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Madam Speaker, this week marks the first anniversary  of the southern California wildfires that took lives, devastated  communities, and left families across our region displaced.\n\nWe are lucky that the damage was not worse, and that is only…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698661/firefighter-protections"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…all walks of life into your  community of faith. Ever since Rev. Moses Allen Williams organized the  First Presbyterian Church of Ashland on August 18, 1875, this church in  southern Oregon has remained dedicated to--in their own words-- ``honoring the teachings of Jesus and being a safe haven for all who  walk through its doors.'' First Presbyterian Church…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693320/recognizing-the-150th-anniversary-of-first-presbyterian-church-of-ashland"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…already  seeing the impact. It is not a hypothetical.\n\nI call your attention to my home State, the great State of  California, home to two of the largest ports in the Nation in southern  California alone, the neighboring Ports of Los Angeles and Long Beach,  that truly power our Nation's economy.\n\nIt is not an exaggeration. The Port of Los Angeles, which…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…announcement came just after that of fellow Chinese       battery maker BYD which also manufactures its own EVs that       rival Tesla's products. In March, BYD, based in the southern       Chinese technology hub of Shenzhen, said that its new       charging technology is capable of providing 250 miles of       range in five minutes.\n\nThe technologies won't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…fighting.\n\nWelcome to the debate. This is much more than just the delta smelt.  It is interesting to see my two colleagues and friends from parallel  universes--I am from a southern parallel universe--debate this because,  sometime ago when Mr. LaMalfa and I were in the California Legislature,  we thought we had put a lot of this past us when we negotiated…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the President  used military power in Iran, Nigeria, Syria, Yemen, and most  significantly, in Venezuela.\n\nAfter months of escalating military action against boats in the  Southern Caribbean, after amassing a massive military armada on the  doorstep of a foreign nation, the administration dispatched American  servicemembers to invade and arrest the corrupt…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…this  critical Special Order hour to shed light on the horrors inflicted on  immigrant communities by the Trump administration.\n\nI am proud to represent the Inland Empire of southern California just  east of Los Angeles. My district is home to a thriving immigrant  community. It has been enriched by immigrants just like so many other  communities across…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…then obtained forged identity papers and, with the help of a       smuggler, set out to cross the border from Nazi-occupied       northern France into French-controlled southern France--so-      called Vichy France--but still equally dangerous for Jews.       Instead of helping her cross the border, the smuggler       betrayed her, and she was arrested.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and Education, Advancing American  Freedom, AdvanceUSA, Concerned Women for American Legislative Action  Committee, the Coalition for Jewish Values, the Commission of the  Southern Baptist Convention, Eagle Forum, Family Watch International,  Faith and Family Foundation, Independent Women's Forum, Students for  Life Action, the Family Policy Alliance,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…will further the priorities of President  Trump, who has signed two executive orders aimed at removing  unnecessary regulations that prevent water from being delivered to  southern California.\n\nThe current paradigm of having full reservoirs in California while  many farmers are only receiving half of the water they are supposed to  be getting is unacceptable,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…laws, our  national security, and our people.\n\nDuring their time in office, President Biden and Vice President  Harris dismantled nearly every meaningful safeguard at the southern  border. Their administration presided over a record surge in illegal  immigration, over 700,000 illegal aliens were apprehended at the border  from October through December…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Joseph Hospital, Ambulance Inc. of Laurel  County, Laurel County Schools Police, London Laurel 911 Center, Phi Air  Medical Team and the AirEvac Medical Team.\n\nThe people of southern and eastern Kentucky have proven to be  resilient through every storm and I have the utmost confidence that we  will fully recover and rebuild once again.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…State of Israel, and we       will respond with maximum force against any attempt [by       Hezbollah] to rebuild,'' he added.\n\nIsrael has carried out dozens of strikes in southern       Lebanon targeting Hezbollah operatives and arms since       reaching a ceasefire with the group in November following       several weeks of intense fighting, while…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…state, with a population of just under 10,000, it boasts a  massive contribution to the region's agricultural production of cotton,  peanuts, and oddly enough watermelon.\n\nSouthern Living magazine just named Cordele, Georgia as the  Watermelon Capital of the World, yes you heard that correctly.\n\nThis town produces a plethora of summertime fruit, supplying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694766/cordele-watermelon"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…going to cut down the number of clandestine  laboratories, but it wasn't going to decrease the demand; it was just  going to increase the demand for meth to come across the southern  border, and that is what happened. They created trade routes.\n\nThen along came the 1990s and unrelated to methamphetamine, we had a  lot of big drug companies and some bad…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Quality Assurance Inspector and  Exercise Evaluation Team Member.\n\nChief Smith deployed in support of myriad missions, including  Operation Provide Comfort, Northern Watch, Southern Watch, Iraqi  Freedom, Enduring Freedom, and Unified Protector. In 2013, he completed  a tour at the Air National Guard Readiness Center as the subject matter  expert for…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…for the future.\n\nI know Presley will represent Indiana with integrity and pride. I  congratulate her family, mentors, and everyone who helped support her  along the way.\n\nSouthern Indiana is immensely proud of Presley, and we wish her all  the best as she takes on this role.                       Recognizing Starlight Distillery\n\nMrs. HOUCHIN. Mr. Speaker,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Manager in 2022. In addition to these impressive  awards, Terry served as board chair of the California Broadcasters  Association and executive committee and board chair of the Southern  California Broadcasters Association.\n\nBeyond his service to the Salem Media Group, Terry is a devoted  husband to his wife, Cindy, father to twin boys, Garrett and Brian,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Now, there are some reasons and some contributing factors to the  escalation numbers, and one of them is during the Biden administration,  basically they surrendered our southern border to cartels and gangs and  criminals and traffickers. Many of us have been to the border. We saw  what was happening on the border during the Biden years. And as a…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…improvements  to the Small Business Investment Act of 1958, allowing Small Business  Investment Companies, or SBICs, to invest more resources in Main Street  businesses across southern Minnesota and across the country.\n\nFrom Winona to Worthington, small business owners across the district  I have the honor to represent rely on early access to capital to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687920/investing-in-main-street-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…many of my  friends, many of the people that work for me, many of my staff. She  played a major role in the political evolution in Texas where Texas  went from a historic southern Democrat State to a bastion of  conservative Republican politics and a warrior for freedom across the  globe.\n\nI was proud to have her support, but more importantly, I was…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize an outstanding  young leader from southern Minnesota, Vannah Heil of St. James. This  November, Vannah will join more than 700 youth from across the Nation  at the National 4-H Congress in Atlanta.\n\nVannah is one of…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697141/recognizing-vannah-heil"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…acres of Ouachita National Forest lands to the Flatside Wilderness Area  in his district.\n\nThe Ouachita National Forest is the oldest and largest national  forest in the Southern United States, spanning nearly 1.8 million acres  across Arkansas and Oklahoma.\n\nManaged by the U.S. Forest Service, it is a true multiple-use forest,  supporting timber harvesting,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}]