[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Just say that new  members of the latest criminal organization were found crossing the  southern border."}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "In August of 2024, during President Biden's administration, there  were 107,000 encounters at the southern border, but in August of 2025,  there were only 9,000."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "military activity on the Southern Border, including the  administration's establishment of new National Defense Areas."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "In the most recent year that we had statistics, the United States  seized nearly 40,000 pounds of fentanyl on the southern border of the  United States coming from Mexico."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "It  comes across our southern border."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Gamino of Fresno were both killed in a  tragic vehicle accident while on deployment as part of Joint Task  Force-Southern Border."}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "One of them, the 101st Airborne, now has several thousand  of its troops deployed to the southern border."}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "``If Libya is stable, then there are big advantages for       Northern Africa, for Africa.''\n\nAlftise reiterated this point, arguing that, while the       Government of National Unity has so far been able to keep the       threat of Islamist militant resurgence in the west at bay,       the lack of control over the southern border and growing       jihadi infiltration of nations such as Mali, Burkina Faso and       Niger meant U.S."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Fentanyl  trafficking at the southern border was cut by more than half, saving  American lives and criminal cartels designated as terrorist  organizations were stopped and the rule of law was reinstated."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "ITS will also help ensure that NTIA,  as the Federal spectrum manager, can continue to find opportunities to  unleash commercial wireless innovation, while also ensuring military  readiness, securing our southern border, advancing scientific  discovery, and other Federal missions are successful."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "So in addition to  spending reforms and tax cuts, the Big Beautiful Bill made good on his  promise--and my promise and the promise of many of us--to take steps to  secure our southern border and to protect and to support, once again,  law enforcement rather than to make it impossible for them to do their  job."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "It was Democrats who threw open our southern border with foolish  policies that paroled over 6,000 criminals and terrorists into the  United States and lost track of over 2 million known ``got-aways.''  Those same Democrats are now criticizing efforts to remove those  threats."}, {"senator": "Eli Crane", "party": "Republican", "sentence": "Correa for co-leading with me, and I urge my colleagues  on both sides of the aisle to support this legislation for a secure  southern border."}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "There were nearly 9 million encounters at  the southern border under President Biden, more than the last 14 years  combined."}, {"senator": "John Rose", "party": "Republican", "sentence": "The Border Patrol reported a 94 percent drop in illegal  immigrant encounters at our southern border compared to the same month  last year under Joe Biden."}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "As a lifelong native of the Florida panhandle, I am ready to get to  work to support President Trump's agenda to make America first, to  protect our southern border, to make groceries affordable, to  strengthen our military, and to provide much-needed support to our  veterans."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "You can look at the southern border."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Specifically, these whistleblowers disclosed that the government wasn't  collecting the DNA from individuals encountered at the southern border  like the law requires."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Madam Speaker, since President Trump was sworn in, illegal  crossings have plummeted at our southern border."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Since he has taken  office, we have seen a control of the southern border, we have seen the  Mexican Army going after cartels who have been manufacturing and  bringing in the fentanyl, and we have seen the chemical companies in  China--which Senator Hassan and I, when we went to China last year,  specifically asked the leadership of China to control."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "His failure to secure the  southern border in Texas and in New Mexico and California and Arizona  invited the drug trafficking crisis that is continuing to have  downstream effects in our country even today."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, as we wrap up this so-called debate today, I want to  remind everyone of something that they are not seeing on the news every  day like they were several months ago, and that is hordes coming across  our southern border."}]