[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Unlike in other  States, when kids in D.C. are treated as adults, the Bureau of Prisons  ships them hundreds of miles away from their family and loved ones to  places like South Dakota or Texas. This makes rehabilitation harder and  increases the likelihood of recidivism.\n\nDon't just take my word for it, Mr. Speaker. There is a large  coalition opposing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…you all. There is a better way to do that.\n\nSo, Mr. President, in response to the request from the majority  leader--the Republican leader--on behalf of constituents from South  Dakota, constituents from New Mexico that don't--do not, so that I am  clear; sometimes people confuse my New Mexico accent--that do not want  to see their health premiums double…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Murphy, of Nebraska, to be       United States Attorney for the District of Nebraska for the       term of 4 years.\n\n18. Calendar Number 386: Ronald A. Parsons, Jr., of South       Dakota, to be United States Attorney for the District of       South Dakota for the term of 4 years.\n\n19. Calendar Number 387: Kurt Wall, of Louisiana, to be       United States…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Maritime  Commission, or FMC, an agency that plays a critical role in ensuring an  efficient, competitive, and economical maritime shipping system. As my  colleague from South Dakota indicated, it ensures that we have the  resources necessary to level the playing field.\n\nThe past several years have shown how essential it is to safeguard  our shipping.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that is working. It is popular, and it deserves our  support. I urge passage of the ESTUARIES Act, as amended, and ask all  my colleagues to do the same.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I reserve the balance of my  time.\n\nMr. FIGURES.  Bonamici).\n\nMr. Speaker, to date, the National Estuary Program has restored more  than 2\\1/2\\ million acres…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…necessary for reasonable progress. They are thus required each time new  haze plans are due unless the State can demonstrate that no action  would be the reasonable course.\n\nSouth Dakota took no action in its latest regional haze plan to  address haze pollution over the long term. It made no updates to  significantly out-of-date controls at its three major…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…people--his constituents--get their healthcare through the ACA, a  family of four in Louisiana can expect to see their premiums increase  by more than $9,000 a year.\n\nIn South Dakota, Senate Leader Thune's home State, out-of-pocket  costs for a family of four will increase by more than $13,000 a year.  Think about that. Without action, Leader Thune's…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…SOUTH CAROLINA\n\nFlorence County Sheriff's Office\n\nMoncks Corner Police Department\n\nHardeeville Police Department                                 SOUTH DAKOTA\n\nWatertown Police Department\n\nSomerset Police Department\n\nCodington County Sheriff's Office: Includes County jail       staff                                  TENNESSEE…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…this sort of thing that brings you, me, and other young people  into science. I thank Ranking Member Castro, as well as Representative  Dusty Johnson of the great State of South Dakota, who worked with me  over the last few years to ensure the success of this legislation.\n\nMr. Speaker, this bipartisan effort is an important step in  solidifying our partnership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…this legislation,  and Senators Sullivan and Whitehouse for leading it in the Senate. I  urge my colleagues to support the Save Our Seas 2.0 Amendments Act.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I reserve the balance of my  time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…standing up for the American  people. We are talking about States like West Virginia, Wyoming,  Alaska, Tennessee, Mississippi, South Carolina, Texas, Alabama, South  Dakota, and North Dakota will be the States most impacted by the lapse  in the Affordable Care Act tax credits.\n\nThis is not a partisan issue for us. It is a patriotic one, and we  will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…behalf of Ohioans and Americans as we recognize the life of an honored  and indefatigable public servant in the truest sense.\n\nSteven D. Fought was born in Rapid City, South Dakota, on June 2,  1954, and passed recently at 71 years young. He passed from this life  after a truly valiant final fight, on January 10, 2026, in Nebo, North  Carolina, surrounded…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that is the President's goal, what  is in it for farmers in Vermont? Small business owners in Ohio? For the  elementary school teacher in Texas? For a truck mechanic in South  Dakota? There is absolutely nothing in it for everyday Americans. And  we spent hundreds of millions of dollars on a mission that can only  benefit the oil industry who didn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…bipartisan legislation both here in the House, as well  as the Senate. I look forward to seeing it passed into law, and I  reserve the balance of my time.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I have no further speakers.\n\nMr. FIGURES.  Bonamici).\n\nMr. Speaker, in closing, passing this bill is an important step that  we can take right now to help…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that it would be like an impact that  ripples out throughout the State, raising costs, lowering care, hurting  Americans, hurting Nevadans.\n\nMy colleague Mike Rounds of South Dakota said:\n\nThat is not a cost-cutting measure--that's a cost transfer.\n\nHe said:\n\nAnd when you've got partnerships with the states, you       shouldn't be doing that without…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…for 1 minute.\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, may I ask how much time is  remaining.\n\nMr. THOMPSON of Pennsylvania.  He is a very busy  man.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, it has been such an honor  to work with G.T., French, Angie, Don, Brian, and so many others on  something that is real.\n\nIt is sometimes hard to separate the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…manner.\n\nAgain, I thank my colleagues, Representatives Johnson and Peters, for  this commonsense bipartisan bill. I ask my colleagues to join me in  support.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I thank the gentleman from  Colorado for yielding time.\n\nMr. Speaker, I will admit to being pretty excited that the ePermit  Act is on the floor today, not…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…that came out of  last week's markup, and that is the Agriculture appropriations bill.\n\nAgriculture is the lifeblood of our country, and in places like my  home State of South Dakota, farming and ranching are a big part of our  way of life. I know how hard American farmers and ranchers work to  deliver food, fuel, and fiber to America and to the world,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "Mr. ROUNDS. Mr. President, I rise in opposition to S.J. Res. 86. This  resolution would repeal the Environmental Protection Agency's approval  of South Dakota's Regional Haze Implementation Plan.\n\nSouth Dakota has made substantial progress toward meeting EPA's  ambitious 2064 visibility goals and has determined that no additional…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698625/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this month, I have had the privilege of  welcoming two groups of South Dakota veterans to Washington during  Honor Flight visits. I went simply to say hello and to thank these men  and women for their service to our country. This is something I have…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…retired from full-time parish ministry after       serving 17 years at First Lutheran. He continued to share the       Word by accepting an interim position in Sioux Falls, South       Dakota.\n\nAfter Fran's death in 2002, Jim continued with interim       preaching at Wahpeton, Fargo, Portland, Grand Forks, Valley       City, Horace, and Enderlin, all in North…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, as someone who grew up in rural South  Dakota, in the town of Murdo, which has a population of roughly 500-- and that would be rounding up--I know firsthand the joys of living in a  rural community. I also know some…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "John Thune", "party": "Republican", "sentence": "…dance, class reunions, fireworks, and much more.\n\nVeblen is located in Marshall County, nestled in the beautiful  rolling hills of the Coteau des Prairies in northeastern South Dakota.  The Veblen area has long been known as a community surrounded by the  natural beauty of the breathtaking Glacial Lakes Region. Home to more  than 300 people and multiple…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…McGovern-Dole Program, was established  in 2002 through the farm bill. It originated from the partnership  between Senator Bob Dole of Kansas and Senator George McGovern of South  Dakota. Since the beginning, McGovern-Dole has delivered more than 5.5  billion school meals to children around the globe.\n\nThe mission of these programs is more urgent now than…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Americans wherever they live  and whatever their American dream may be.\n\nI want to take some time today to talk about how Republicans' agenda  is at work in my home State of South Dakota, and I want to begin with  the tax relief that Republicans have delivered.\n\nWhether I am visiting a small business in Isabel, SD, or talking to  farmers at Dakotafest, higher…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Southwest Border.\n\nAs the current Field Office Director for the St. Paul Area of  Responsibility, Director Berg manages all ICE officers assigned to  Minnesota, North and South Dakota, Iowa, and Nebraska. This area spans  over 350,000 square miles, includes nearly 12.5 million people, and  includes one field office, nine sub-offices, and 2 resident officer…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "John Thune", "party": "Republican", "sentence": "…of the  Tax Cuts and Jobs Act would have expired this year, and that would have  meant a huge tax hike for hard-working Americans--some $2,500 for  people in my State of South Dakota.\n\nWe were determined not to let that happen--not next year, not ever-- and I am proud that our bill permanently extends all of the individual  tax relief from the Tax Cuts…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in a building,  outside for 2-year-olds; the EPA regulating puddles and saddling  farmers and ranchers with massive compliance laws, which we experienced  in my State of South Dakota; electric vehicle mandates. If they had  their way, by next year, 35 percent of the vehicles on the highway  would be EVs. Thirty-five percent. Do you know what that number…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…water features on private property, including  things like irrigation ditches, ephemeral streams, and even prairie  potholes.\n\nI know farmers and ranchers in my State of South Dakota would have  appreciated a seat at the table before the Biden administration  resurrected this harmful policy, and I am pleased that the Trump  administration is committed…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "John Thune", "party": "Republican", "sentence": "…those closest to the student, because they  are in the best position to do what is right for that student.\n\nWhen I met with Mrs. McMahon, we had a long conversation about South  Dakota's unique education needs, including our Tribal schools, and I  look forward to working with Linda McMahon to limit bureaucracy,  empower State and local governments, and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}]