[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…peace more than Vladimir Putin, who  has no respect for the lives of his people or the Ukrainians. They have  fought for 3 years to stay free, to stay independent, to stay  sovereign, and they have fought for years before that. The history of  their people is one of fighting for their independence. They will  continue fighting as long as peace threatens…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…caribou, not only spiritually and  culturally, but for our survival and subsistence. This action from D.C.  is an insult to the Gwich'in people and ignores those realities.''\n\nSovereign Inupiat for a Living Arctic also oppose this proposal. They  said:\n\nMany Alaska Native communities are already facing negative       health impacts from oil and gas development…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…beginning of a relentless,  tireless process that aims to get us to the two-state solution--two  states for two peoples; a safe and democratic Jewish state of Israel  alongside a sovereign state for the Palestinians that are indigenous to  the land where they now live as envisioned in the President's 20-point  plan and has been U.S. policy for over 50 years.…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Federal  Government's responsibility to ensure all of Indian Country has access  to clean, reliable drinking water.\n\nChairman Heart also understood that the strength of a sovereign  Tribal nation lies in the preservation and vitality of culture and  language for future generations. He led the effort to create the  Kwiyagat Community Academy, dedicated…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…people and hitting  the Cabinet of Ministers of Ukraine. The Tuesday before, a glide bomb  killed 23 Ukrainians. Just last night, Russian and Belarusian drones  made 19 hits in sovereign Polish airspace, scrambling NATO F-35s and F- 16s to fend off civilian casualties.\n\nIt was Ukraine's air force that alerted their neighbors in Poland to  these blatantly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to work with you. You change your rule. They are the real principal  party here; Rhode Island follows the California standard. They could  have gone and negotiated with the sovereign State of California instead  of coming here to just roll the State using a sneaky parliamentary  maneuver and choosing to go nuclear to do that.\n\nSo this is not a great day…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…approve an amendment that restates       conflict laws that already apply to the president. Namely, he       may not solicit gifts; he may not accept gifts from a foreign       sovereign; he may not sell political favors.\n\nPro-crypto lawmakers apologize that Trump corruption will       persist whether or not Congress approves crypto legislation.       We…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary Hegseth's comments about the forfeiture of Ukraine's  sovereign territory.\n\nFurthermore, the deal includes no security guarantees from the United  States, which the Ukrainians have--rightly, I believe--insisted upon.  Security guarantees…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…directly connected to the Tribe's stewardship of the Elwha River.\n\nPlacing these lands into trust is not just a procedural act. It is a  promise fulfilled. It affirms the Tribe's sovereign right to protect  and manage sacred sites for generations to come.\n\nMr. Speaker, I urge all of my colleagues to join me in moving this  bill forward so we can take the final…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…governments handle trade disputes, by  following the law, not through weird social media tantrums about  bridges and hockey trophies or through childish threats to annex a  sovereign nation and make it the 51st State.\n\nHis daily barrage against Canada does not make him look tough. It is  certainly not strategic. It is just reckless. Frankly, it is bizarre.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…tangible, bipartisan work I  believe that Congress should be doing every day: delivering real  solutions, repairing historic injustices, and strengthening our  relationships with sovereign Tribal nations.\n\nEarlier this year, I reintroduced the Quinault Indian Nation Land  Transfer Act in partnership with Senators Cantwell and Murray. I want  to recognize the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…agree. Senator Kennedy  went further, calling Russia's dictator, Vladimir Putin, a gangster  with a black heart, a figure responsible for unprovoked war and  atrocities on a sovereign nation.\n\nIt was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion and annexation of Crimea in 2014 and through the  full-scale invasion that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, Russia invaded the sovereign nation of  Ukraine. That is the cold, hard truth of it. Vladimir Putin is the  aggressor. I stand here on the floor to say that our President will not  rewrite the past.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687904/putins-merciless-war"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia,       which Maryland ceded to the federal government when the       District was established in 1791. In fact, Maryland expressly       relinquished all sovereign authority over the territory at       issue when the federal government accepted it. The express       terms of the cession state that the territory was ``for ever…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…forget, 11 years ago in Crimea.\n\nTo endorse a so-called peace deal that fulfills Russia's every wish  and forces our Ukrainian allies to bend to Putin's will by ceding their  sovereign territory is beyond disgraceful. It is disgusting, and it is  un-American.\n\nThis weekend, I was struck by the images of President Trump's private  meeting with President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…European friends have come together on a common negotiating  position centered on several key principles. Here are the key points:  Ukraine should not be forced to give up the sovereign territory it  deserves and it currently controls. Also, Putin should not achieve  through negotiation what he has not managed to achieve on the  battlefield, and there have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…rely on themselves. There was always trade, of course--this  is a natural and good privilege of productive surplus economies--but in  a republic, there was also trade between sovereign, self-sufficient  communities. The citizen of the classical republic had no need for  cheap trinkets, fashion, and sweatshops halfway across the globe. He  and his neighbors…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…the cartel of the los Soles, headed  by Maduro, fall squarely into this same category--operations against  nonstate actors and criminal organizations, not a war against a  sovereign nation or a legitimate President.\n\nThis resolution presented by the Democratic Party would tie President  Trump's hands in the fight against drug-trafficking terrorists.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of 53-1. It would be the first intensive sanctioning of the  Russian banking industry since the invasion.\n\nUnder Congressman Nunn's PEACE Act, the U.S. would take Russian  sovereign assets that have been immobilized and let the Ukrainians use  them to purchase defensive weapons.\n\nCongress should also fully consider, debate, amend, and pass the  sanction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interesting problem.\n\nThe United States and other countries are borrowing, bingeing on  debt. The United States borrows about 40 percent of all the world  capital that goes into sovereign loans. His argument is: Our problem  is, there are not enough savings in the world. We are consuming more  money; it is us, China, Europe. Now Germany is going into the debt…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reading that  headline to everyone is: Japan now is our largest individual creditor  country. When you have a country that has $900 billion, maybe a  trillion dollars of U.S. sovereign debt, and you walk in the door and  say: We want to renegotiate some of our trade pact with you or we want  to build an actual trade pact with you, they look  at you and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…financial surveillance tool that, if not  done correctly, will fundamentally alter the lives of every American.\n\nUnlike decentralized digital assets, a CBDC is a digital form of  sovereign currency that is designed, issued, and monitored by the  Federal Government. It is government-controlled, programmable money  that, if designed without the privacy protections…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…is looking for someone to blame for Sweden's and  Finland's accessions to the alliance, he can simply look in the mirror.  His own brutality has validated the decisions of sovereign nations to  join NATO and align with the West.\n\nAs for the utility of the alliance for our interests, America's  adversaries are choosing to work together. Responding by…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…media. That is  what gets people's dopamine hitting. But at some point the math is  going to win.\n\nWe have the really smart analytic firms saying they are scared about  U.S. sovereign debt. We see things happening around the world that  makes me very nervous. There is an appetite for going on the long end  of the curve.\n\nThe United States sells very short-term…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…friend of the  United States, and it is a unique friend to Arizona.\n\nThe CCP uses every tool it can, including maps, to undermine truth  and assert illegitimate claims over sovereign territory. Congress  should not fund anything that supports the CCP's disinformation  efforts, and now is the time for strategic clarity, with rising  bellicosity coming…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693690/department-of-defense-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is $1 trillion, and $2.1  trillion will just be interest. The majority of future deficits are  actually interest.\n\nInterest and healthcare are the primary drivers of U.S. sovereign  debt. Will the bond market continue to finance this?\n\nWhat happens when one of your greatest solutions is: Can we actually  have honest conversations about healthcare costs?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…because we are all citizens of the world. Borders are just  arbitrary lines on a map. That is where the modern Democrat Party is.  They don't actually believe that America, as a sovereign country,  should be able to tell people who can come and who has to leave.\n\nSo that is what this whole thing is about. It isn't about Minnesota  or some recent event; this…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…``Well,  there is all this spending in the tax bill,'' most of that hasn't  started yet. If you actually look at the breakdown of what is going on,  what the two drivers of U.S. sovereign debt are, they are the very  things that we are not allowed to talk about. It is interest and  demographics.\n\nWe are going to walk through some of the reality of the math…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…pay a subscription. We  are blessed to have a Bloomberg Terminal.\n\nYes, they got attacked by people who want to keep spending money who  said: Stop. You can't downgrade U.S. sovereign debt.\n\nThe other two rating agencies had done it years earlier. The punch  line in there is that in less than 9 years--and this was assuming  interest rates stayed stable--in…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…our incumbency.\n\nWe really are on the edge of miracles. How do I get the left and the  right to understand the math is the math? Demographics are the primary  driver of U.S. sovereign debt. It is hard to campaign against the other  side. Maybe we can take a couple of months off and actually do good,  quality policy and legalize properly vetted and properly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]