[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…way I see  them. But when you close the door and there is no press around and you  ask them what is going on, they are scared to death.\n\nThey see China stopping purchases of soybeans. Why is that important?  Illinois is the No. 1 soybean-producing State in the United States, and  it is a major cash crop for farmers all across the country. So when  China…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…helped American farmers export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have a robust export opportunity for the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…policies have killed the markets our farmers rely on to  make a living.\n\nThis is especially true for soybean farmers. China went from buying  more than $12 billion in American soybeans last year to virtually  nothing by the middle of this year. That Chinese need for soybeans  didn't disappear. Contracts went to other countries, like Argentina,  which Trump…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…body weight and healthy once again.\n\nEdesia Nutrition in North Kingstown is one of two places in the  country that produces Plumpy'Nut. All the ingredients, the peanuts,  soybeans, sugar, and dairy, come from American farms and  factories. It is manufactured here in the United States and, until  recently, was shipped around the world, reaching 400,000…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Presidential library--a  huge waste of our money.\n\nAnd this bailout for Argentina--you know, earlier I was talking to a  colleague from Washington State who said a lot of soybeans are shipped  through Washington State but they are normally bought by China. Well,  China isn't buying a single bean this year because of the tension and  the argument between…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…exactly that, particularly in manufacturing America.\n\nI am privileged to also represent a vast agricultural region in grain  drying. It is so expensive when we have to dry corn, soybeans, and so  forth. The agricultural community uses huge amounts of energy.\n\nLet's create new jobs. Let's lower the consumer's energy bills. Let's  strengthen America's energy…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Commonwealth.\n\nWhat I heard was a lot of anxiety and fear, whether it was my farmers  who because of tariff policies aren't seeing the kind of orders-- particularly for soybeans--that they used to see this time of year  going overseas. Mr. Speaker, some can't get the parts to repair their  equipment because of tariffs. Some businesses have had to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…helped American farmers export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have a robust export opportunity for the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…and manufacturers have a fair  chance to compete against international firms, they always win. Whether  it is automobiles from Ohio, refined chemicals from Pennsylvania, or  soybeans from Iowa, our products are second to none. ITA ensures that  foreign markets are open to those goods by cutting through redtape and  breaking down trade barriers. That means…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…global market.\n\nThis vital tool plays a critical role in reinforcing the strength of  our agriculture supply chain. It ensures that farmers, whether they  grow corn, sorghum, soybeans, or any other grain, receive a fair price  that reflects the quality of their crop. It allows buyers of U.S. grain  to feel confident in the safety and quality of the products…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…chose to focus on crop farming.\n\nToday, Black's Willow Run Farm is owned by Bob Black's son, Clinton,  and his wife, Jessica. Crops grown on the farm include corn, wheat,  soybeans, and alfalfa.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I offer heartfelt congratulations to all members of the Black family on  this notable…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…developing countries like Bangladesh, where  families fled ethnic cleansing and rely upon rations to survive.\n\nThrough these programs, Kansas wheat, Arkansas rice, and Iowa  soybeans are feeding the hungry around the world who are facing famine,  war, and national instability.\n\nFood for Peace also provides a critical market for our producers.  This is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…respected in the farm bureau.\n\nLocated in Nicktown, Pennsylvania, Barr Ridge Farms produces  approximately 1,200 gallons of milk every day.  The Lieb family also grows corn, soybeans, and a variety of grass to  feed the animals.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I offer my heartfelt congratulations to the Lieb family…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Johann Metz, his third great-grandfather. After more than 150  years of family farm lineage, Richard Metz took ownership in 1996.\n\nToday, the original 110 acres exist and grow soybeans, corn, and hay.\n\nMadam Speaker, I offer my sincere congratulations to Richard Metz and  his family for continuing this rich history of agriculture in  Pennsylvania.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Committee, I have been able to see this issue on both sides:  commodities versus securities, CFTC versus the SEC.\n\nIn my home State of rural Iowa, we know commodities: corn, soybeans,  hogs. The CFTC does this very well. In downtown Des Moines and on the  Main Streets of hometowns across Iowa, our banks handle stocks and  bonds, securities, those handled…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693770/digital-asset-market-clarity-act-of-2025"}]