[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…THOMPSON of California. Mr. Speaker, for folks who make the  argument that people are afraid, they want to have the newest taser  technology to keep themselves safe in the civilian space, I understand  that. They are not precluded from being able to purchase and have this  new technology in tasers. They just have to get a background check to  make sure they…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…metro area. She invested in the  organization's volunteer program, revamped annual community and  fundraising events and led the effort to turn part of their West St.  Paul space into affordable senior apartments. When the pandemic hit in  2020, Ann ensured her team and volunteers were positioned to continue  engagement with seniors in a safe way. DARTS…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Foundation for Suicide Prevention's Out of the Darkness  Fairfax Walk at the Mosaic District.\n\nThis annual event brings hope and healing to families across our  region, offering space for remembrance, resilience, and collective  action to end the tragedy of suicide.\n\nOrganized by the National Capital Area chapter of AFSP, the Fairfax  Walk has become one…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…safety. So I support more partnerships here. I also  want to highlight a key decision that Secretary Duffy made that I  believe is important to our national leadership in human space  exploration.\n\nIn September, witnesses told the Commerce Committee that the SpaceX  lunar lander would not be ready to put Americans back on the Moon,  either in 2027 or 2028.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…funded basic research plays in the discoveries driving the next  generation of science.\n\nThis includes funding for AI, for cybersecurity, for supercomputers,  fusion energy, space, ocean exploration, black holes, semiconductors,  and, last but not least, the internet.\n\nIn addition to basic research, the NSF also funds many educational  programs supporting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…National Society of Black  Engineers, Pamela's impact is far-reaching. Pamela remains a tireless  advocate  and role model, embodying leadership and a passion for justice in every  space she serves.\n\nLaw and Government Champion Award--Gray Montrose: Gray Montrose is a  leader in land use, environmental law, and conservation, with over a  decade of experience…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…I have to say.\n\nI also have to say there was some positive things this week. I got to  meet your grandson. I think he said he was 15 years old. He got to go  to the Air and Space Museum, a place that I love, a place that makes  our country stand out in the best of ways. It shows what we can do when  we work together, when we bring the full force of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…witnessed empires  rise and fall, and marked the turning points of human history, and they  rested largely unseen.\n\nIn New York, this priceless collection had few visitors, little  space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic Society has chosen Toledo, located…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Bank of Western Massachusetts to  establish the UMass Amherst Campus Pantry.\n\nLast Friday, I was proud to stand with them to officially open the  pantry, which is a welcoming space that will provide anyone in the  UMass community with a little extra help when they need it. The shelves  are stocked with nutritious food, including food grown locally by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695079/umass-amherst-campus-pantry"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…partnerships with local  businesses and sourcing ingredients from Illinois farms. Her restaurant  not only offers an upscale dining experience but also serves as a  community space that brings people together.\n\nIn addition to her entrepreneurial accomplishments, Ms. McClain is  deeply committed to her community. She previously served as the  chairperson…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…you have to have a cop on the  beat that understands the job, is focused on anticompetitive behavior,  and is driven to make sure that the free market works in the maritime  space.\n\nMr. Speaker, this bill pushes forward all of those goals. I urge  support of this bill, and I yield back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…to implement, the CHIPS and  Science Act is continuing the innovation ecosystem necessary to win  into the mid-21st century.\n\nFrom my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…Resolved, That the following named Member be, and is       hereby, elected to the following standing committee of the       House of Representatives.\n\nCommittee on Science, Space, and Technology: Mr. Menefee,       to rank immediately after Mr. Riley of New York.\n\nMr. AGUILAR (during the reading). Mr. Speaker, I ask unanimous  consent that the resolution…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699872/electing-a-member-to-a-certain-standing-committee-of-the-house-of-representatives"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…``Commercial Remote Sensing Amendment Act of 2025.''\n\nI would like to thank the gentleman from Oklahoma, Congressman Frank  Lucas, who was former Chair of the Committee on Science, Space, and  Technology where I serve as Ranking Member, for reintroducing this  legislation. I am pleased to be an original cosponsor of this bill and  continue working with Congressman…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688997/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…To me, one of the most critical aspects of this will be engaging with  the child's family, whether it is by placing foster children with  family members directly or making space for kin who can't be foster  parents to still support the child and the foster parents.\n\nLast Congress, we marked up this bill in the Ways and Means Committee  and sent it…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and the Air Force  came and said we want to increase our launch cadence at Vandenberg.  These launches are very important for a number of reasons when it comes  to innovation, space exploration and national security. That is why the  Air Force was involved.\n\nThe Coastal Commission said, no, we are not going to allow that. What  was the reason they cited?…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I thank Representative Crane for his work on this  legislation.\n\nMr. WESTERMAN. Mr. Speaker, H.R. 1829 will ensure that two rural  communities in eastern Arizona have the space to lay their beloved  community members to rest. I thank Congressman Crane for spearheading  this critical issue on behalf of his constituents.\n\nMr. Speaker, I urge adoption…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…suspend the rules and pass the  bill (H.R. 3424) to require the Administrator of the General Services  Administration to collaborate with Federal tenants with respect to  shared-space arrangements, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3424\n\nBe it enacted by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…but it  would also hinder free market innovation.\n\nDigital assets are here to stay. I agree strongly with President  Trump that the United States should be a leader in this space. However,  the last administration held a very different view. They wasted no time  exploring ways to set up a surveillance state digital currency managed  and micromanaged…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…paid fellow whose contract duration is greater than or equal       to six months, or an employee of a federal government agency       liaison office housed within Senate space. Interns, clerks,       unpaid fellows, members of the media, and other non-      government employees that provide services to the Senate are       not covered under this…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…you are not supposed to  be letting everybody know what we are doing and putting our  servicemembers at risk.\n\nLofgren), the ranking member and top Democrat on our Science,  Space, and Technology Committee.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…disagree, at its core, it is an issue where all of us  agree as Americans, regardless of our philosophy, regardless of our  faith, and regardless of our geography, that there is no space for  anti-Semitism in American public life. I come from the State of Kansas.  It was one of our favorite sons, Dwight Eisenhower, who was the Supreme  Allied Commander at the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…disaggregated by covered sector.\n\n``(d) Covered Sector Defined.--In this section, the term       `covered sector' means any of the following sectors:\n\n``(1) Aviation and space.\n\n``(2) Broadband.\n\n``(3) Carbon capture and sequestration.\n\n``(4) Conventional energy production.\n\n``(5) Electricity transmission.\n\n``(6) Forestry.\n\n``(7) Information technology…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…people and job creators nationwide.\n\nIt also advances needed government efficiencies by cutting waste,  modernizing technology and cybersecurity, and addressing unused Federal  space and buildings. Crucially, it also protects Americans from a  supercharged IRS by cutting enforcement and redirecting resources to  customer service. This is especially important…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to anyone in  need--offering not just food, but also kindness, dignity, and a sense  of belonging. For many, this meal is the highlight of their week--a  safe and welcoming space where they feel seen and cared for. In  addition to their weekly meal program, the Center runs a robust food  distribution service to combat food insecurity. Volunteers deliver…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…That is 30 extra years of potential  compounding growth that will be an absolute game changer.\n\nPlus, this has garnered an enormous amount of attention from the  philanthropic space where Michael and Susan Dell have announced a  commitment of over $6 billion that will help children ages 1 through 10  in areas that aren't as economically advantaged. That…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…NCOIC. He served in  multiple units, including the 138th Signal Battalion (Indiana National  Guard), Delta Company 44th Signal Battalion, 50th Military History  Detachment, Army Space Command, 91st Training Division, 5th armored  Brigade, 99th Regional Support Command, and the 222nd Broadcast  Operations Detachment.\n\nSFC Macleod deployed in support of Operation…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "Mr. LUCAS. Mr. Speaker, I have to acknowledge this: I can't think of  a better set of hands to have the chairmanship of this critically  important committee of Science, Space, and Technology in than Chairman  Babin and Ranking Member Lofgren and my good friend, the gentlewoman  from Michigan (Ms. Stevens) over there. The committee that the chairman…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…services. One facility was literally a  former morgue.\n\nMr. Speaker, this legislation enables something critically important,  the ability to deliver modern mental health care in a space designed  for healing and recovery.\n\nIn Alaska, we face real challenges. People dealing with serious  mental illness are being served in locations that  were not designed for…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veterans. This bill would bridge the gap in communication.\n\nMadam Speaker, I thank Representative Barrett for championing this  bill and for finding solutions in the technology space to ensure  student veterans and transitioning servicemembers are receiving up-to- date and timely information.\n\nMadam Speaker, this bill is in lockstep with the Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}]