[{"senator": "Dave Min", "party": "Democrat", "sentence": "…supporting Donald  Trump's campaign last year. In return, Trump has done all he can to  support Musk's business ventures, awarding billions in potential  contracts to Tesla and SpaceX. Trump even turned the White House lawn  into a Tesla showroom to try to boost Tesla sales.\n\nCommerce Secretary Howard Lutnick, whose investment firm owns  hundreds of millions…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689221/pure-bait-and-switch"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…the revenue generators?\n\nIt is pretty simple actually. We need to start with the Pentagon and  modernizing the Pentagon. This is what Elon Musk actually signed up to  do with SpaceX and initially with DOGE. He wanted to cut the bloated  defense contractors and the waste out of the Pentagon. We need not  cost-plus accounting. We need new competition.\n\nSecondly,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that Secretary Duffy made that I  believe is important to our national leadership in human space  exploration.\n\nIn September, witnesses told the Commerce Committee that the SpaceX  lunar lander would not be ready to put Americans back on the Moon,  either in 2027 or 2028. This would almost certainly mean we would lose  the race to the Moon to China,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…et cetera.\n\nFrom a conflict of interest standpoint, Elon Musk has vacuumed up  many billions of dollars in Federal contracts for his companies and  enriched himself. Tesla, SpaceX, Starlink have all profited under  Musk's time as a Federal employee. At the same time, he went out of his  way to kill several enforcement actions that were underway by different…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…what builds communities from Hamilton to Lincoln to FDR. We  need a government that says: If you make it in America then we will buy  it. That is what we did, by the way, for SpaceX. That is what we did  for Intel. That is what we did in World War II. We need a government  that says: If you skill the factories here we will help finance it. We  need a government…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…simply out of control. It is one of the  most out-of-control agencies in the whole country, and it has veered  far from its purpose of protecting the coast.\n\nFrom blocking SpaceX launches to obstructing fire prevention  projects, the commission has repeatedly threatened the safety of  Californians and weakened our national defense, while  needlessly…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…to support  the next wave of advancements in space travel, including reusable  launch vehicles, hypersonic testing, and deep-space exploration.\n\nAs commercial companies like SpaceX continue to push the boundaries  of what is possible, Alaska stands ready to provide essential launch  services that will further our Nation's ambitions beyond Earth's orbit.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…commercial use but for  military use, as well, to make sure that our men and women are  protected when GPS is essential.\n\nTonight, we will have yet another launch into the sky as SpaceX is  propelling this movement forward.\n\nAs we recognize, space is important for our economy, infrastructure,  and national defense. It enables modern life, from powering GPS…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with this very round number of zero new jobs  will serve as that wake-up call that can catalyze and motivate some  real reform in California.                                SpaceX Rescue\n\nMr. KILEY of California. Mr. Speaker, I would like to congratulate  and thank SpaceX and its Crew Dragon capsule for successfully returning  the two astronauts, Barry…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…certification.\n\nIt is with great pride that I recognize his exceptional achievements  in building the local talent pipeline, with graduates securing  positions at companies like SpaceX, Blue Origin, United Launch  Alliance, and others.\n\nMr. Speaker, I thank Bill for his incredible contribution to our  district.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690495/congratulating-bill-mcinnish"}]