[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Americans, not billionaire donors, but  Donald Trump and congressional Republicans are going to privatize,  drill, and destroy them for profit. That will eviscerate the very  spaces that make us America the beautiful.\n\nFinally, tucked into this bill is a 10-year block on State regulation  of artificial intelligence, which might make sense if we had policies…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…natural inclination to serve positioned her as a trusted resource and  advocate, particularly for new arrivals seeking stability and  opportunity.\n\nShe consistently creates spaces for engagement, education, and  empowerment, fostering the next generation of civic leaders. Her vision  of a more just and equitable society is not just spoken--it is actively…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…beautiful community of  Greek Orthodox constituents at St. George Greek Orthodox Church and  Annunciation Greek Orthodox Cathedral. They continuously work to create  welcoming spaces in our community by hosting celebrations such as  festivals, luncheons, and more. I am honored to keep my constituents in  mind as we welcome Patriarch Bartholomew in Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…must help seniors age with  dignity and independence. We must ensure healthcare and housing are  affordable and readily available. We must protect our air, water, and  open spaces for all to enjoy health and the joy of getting outside in  our beautiful State.\n\nA better future is possible if we fight for it. I can assure you all,  I came here to do just…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would prohibit automated traffic enforcement in DC and undo       the no-right-on-red traffic safety law. Calendar No. 293.\n\nOPPOSE H.R. 5163, the Clean and Managed Public Spaces Act,       that would prohibit camping on public property in DC and       effectively criminalize homelessness, introduced by Rep.       Timmons. Calendar No. 294.\n\nThese six…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Association, she worked  tirelessly to advocate for women's voting rights. Her activism extended  beyond the ballot box. She championed education, labor reforms, and  public spaces for children, ensuring that progress didn't just mean  progress for some. It meant progress for all.\n\nLucia Voorhees Grimes was a dedicated suffragist who played a pivotal…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…that leaves millions  disconnected and vulnerable, a crisis that fuels despair and  radicalization.\n\nWe need to invest in connection in this country: in schools, in civic  spaces, in mental health services, and in communities where people can  see one another as human beings again.\n\nEmpathy is action against the viciousness of unchecked social media.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Custodian Day was first established in 1972, when a group of  educators and school administrators recognized the vital contributions  of custodians in creating safe and healthy spaces for students to  learn. They wanted to show appreciation for the hard work and steadfast  commitment of custodial staff to their school communities.\n\nBy 1998, custodian appreciation…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…system has played a key role in that  distinction. Our community has a strong commitment to promoting and  preserving our environment, including our public parks and outdoor  spaces, as the efforts of the individuals and organizations recognized  tonight reflects. These are truly selfless actions done for the benefit  of all and merit our highest praise.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…than we will       reap the grim consequences of our failure to act on programs       which are needed now if we are to prevent disaster later.\n\nClean air, clean water, open spaces--these should once       again be the birthright of every American. If we act now--\n\nNixon said--       they can be.\n\nWe still think of air as free. But clean air is not free,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Evergreen Parent Teacher  Student Association (PTSA) mobilized to provide on-the-ground support  for the community, including mental health resources, warm meals, and  safe spaces. These community volunteers--in addition to many other  supportive groups and organizations--have played a critical role in  connecting families with needed services and ensuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…understand why my colleagues across the aisle  are so triggered, triggered by a piece of cloth. Yet, here we are for  the third year in a row voting to ban the Pride flag from spaces at the  Department of Defense.\n\nNearly half of the House Republicans' fiscal year 2026 appropriation  bills include bans on the Pride flag as well. I don't know what they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…community and ensure that other veterans receive the respect that they  deserve.\n\nAs the founder of the Hearst Community Organization, she has fought  for jobs and public spaces and to secure critical resources to help  people lead better lives. Her dedication reflects the resilience we  honor this month.\n\nMr. Speaker, Joann's unwavering service has…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…facilitator, Mrs. Baker works to make education more  accessible. As a facilitator, she focuses on addressing the challenges  Black youth face in school and on creating more equitable spaces for  young women through professional development programs and student  groups.\n\nAs Aurora Public Schools' co-facilitator for social studies programs,  she coordinates with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689665/recognizing-jasmine-baker"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…after two decades of extraordinary  leadership as Executive Director of NOVA Parks. Mr. Gilbert has  transformed our park system into a vibrant, inclusive network of  outdoor spaces that serve more than 2 million residents across Northern  Virginia. His dedicated service to our region is worth celebrating and  commemorating.\n\nMr. Gilbert became Executive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…what is happening to those who  have no such title or voice? If this gentle and decent and caring man  is treated this way, what is happening along the margins in the dark  spaces in the places we cannot see?\n\nSo I call on my Republican friends and colleagues to look hard at  this moment and say: What comes next? What comes next? Are we to be at  risk…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Washington, D.C.\n\nI am very happy to be authoring this bill in the House to make it the  policy of the United States that Federal buildings should uplift and  beautify public spaces, inspire the human spirit, ennoble the United  States, and command respect from the general public.\n\nIt declares that these buildings should be visually identifiable as  civic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…government facilities.\n\n(IV) Power plants.\n\n(V) Substations.\n\n(VI) Oil refineries.\n\n(VII) Public transportation hubs.\n\n(VIII) Healthcare facilities.\n\n(ii) Soft-targets and crowded spaces, including mass       gatherings and widely attended events such as parades,       concerts, sporting events, political rallies, holiday       markets, places of worship, public…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…shared-space arrangements;\n\n(2) work to develop a criteria that would facilitate the       expanded use of space-sharing or collocating;\n\n(3) identify how special-use spaces can be used to improve       space-sharing or collocating; and\n\n(4) establish measurable objectives, in consultation with       the tenants of federally-leased space, to quantify…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…economic development. The town earned this distinction through its  commitment to revitalizing critical infrastructure, including a new  sewer system and reinvesting in community spaces like their town park.  These efforts reflect the vision and determination of a community that  takes pride in where they live and works hard to build a stronger  future.\n\nRico…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697140/recognizing-2025-small-community-of-the-year-rico-colorado"}, {"senator": "French Hill", "party": "Republican", "sentence": "…was just like him to disagree vigorously with Senator       Bumpers on arms control, but link arm-in-arm and work for the       common good of their constituents and preserve spaces of       solitude for generations to come.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…highlight the  importance of many pieces of legislation but including the Big Bend  National Park Boundary Adjustment Act.\n\nIt is no secret that Texas is home to a lot of wide-open spaces,  beautiful terrain, and vibrant wildlife. And Big Bend is a national  treasure.\n\nThis legislation expands and preserves the park's heritage, natural  resources, and jaw-dropping…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691670/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…border, energy dominance, and economic  resurgence. We have a restoration of the American Dream and a  restoration of common sense.\n\nThere are no biological men in the private spaces of our daughters.  There are no biological men competing against girls in their sports.\n\nThank goodness we have common sense in this country once again. Thank  goodness we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…this Act, the Superintendent shall       ensure that electronic locking mechanisms installed in       academic buildings of the Coast Guard Academy, Chase Hall       common spaces, and in any other location at the Coast Guard       Academy are maintained in proper working order.\n\n(c) Access Policy Instruction.--Not later than 1 year after       the date…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…pursuit of ensuring the safe operations of  the campus, he led two expansions during his tenure that improved  infrastructure for the biotech research teams, bringing old lab spaces  up to code to ensure that the latest safety and technical requirements  were being met.\n\nThrough Mr. Kroszner's tireless efforts, the researchers of my  district are better…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…us. As we go  into the next phase of warfare that is not just on the battlefield but  is cyber war and its capabilities therein, we know that China is  aggressive in these spaces. They are in our universities. They are on  our campuses. They want to steal this information. We have to have a  mechanism of accountability and reporting so that we know…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…control.\n\nIn addition to the Cost-of-Living Adjustment Act, the Senate  Committee on Veterans' Affairs has also reported out Senator Rosen's-- the Senator from Nevada--Lactation Spaces for Veteran Moms Act, which  would make certain that each VA medical center has an appropriate space  for veteran moms to pump or to breastfeed.\n\nWomen veterans are the fastest…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696621/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…weren't able to do anything  about homelessness. The decision said you are not allowed to regulate  camping, you are not allowed to regulate homeless encampments in public  spaces, even in front of schools or in parks.\n\nWell, last year, we had a significant victory before the U.S. Supreme  Court, to overturn that lower court decision. Here is the thing:…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…establish an initiative to       support the development of emergency communication and       tracking technologies for use in locating trapped individuals       in confined spaces, such as underground mines, and other       shielded environments, such as high-rise buildings or       collapsed structures, where conventional radio communication       is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…come from luck. It came from leadership,  vision, and a community where hometown charm meets national excellence.\n\nIn Flower Mound, top-tier schools set the standard, green spaces  stretch for miles, and small businesses like Flurry's Market +  Provisions bring neighbors together. It is a town where families plant  roots, where freedom is felt, and where…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}]