[{"senator": "George Latimer", "party": "Democrat", "sentence": "…New Roc City and Cross-County Shopping  Center, and Westchester residents visit and work in Bay Plaza in the  Bronx. The Woodlawn neighborhood, with associations and clubs, spans  the line between the Bronx and Westchester. The Westchester Bee-Line  public bus system takes passengers down to Fordham Road in the Bronx  and back. The Montefiore Health…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…sacrifice zone. It is not some  untapped oil field just waiting to be developed. On the contrary, the  NPR-A is the largest contiguous unit of public lands in the United  States. It spans 23 million acres, and this area of the western Arctic  is home to a diverse ecosystem, where iconic species like wolves, polar  bears, and caribou roam. Beluga and bowhead…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to De-Escalate Act.\n\nSimply put, Mr. Speaker, this legislation will save lives. It is  supported, as my colleague has said, by an unprecedented, historic  coalition. Support spans 95 bipartisan cosponsors across 35 States,  including the Fraternal Order of Police, Major County Sheriffs,  Hispanic American Police Command Officers Association, Peace Officers…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…including Addison, Carrollton, Cockrell Hill, Dallas, Farmers Branch,  Garland, Glenn Heights, Highland Park, Irving, Richardson, Rowlett,  Plano, and University Park. Its network spans light rail lines, bus  routes, commuter-rail service (the Trinity Railway Express and as of  this weekend the new Silver Line), GoLink on-demand services, and  paratransit.…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…represent out West.\n\nMr. Speaker, as you may know, I represent Colorado's Second  Congressional District. It is an incredibly large geographical  district. It is a district that spans across more than 8,000 square  miles. It is larger than eight States on the eastern seaboard and spans  12 counties and over 55 towns.\n\nI have the privilege of representing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…a deep commitment to educational equity.\n\nWomen in Action Volunteer Award--Fatima Smith: Fatima M. Smith is a  powerful advocate, volunteer, and community leader whose work spans  anti-violence initiatives, racial justice, and philanthropy. With over  15 years of experience, she has championed child advocacy, led major  legislative efforts to protect…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…before--or said they weren't sure they believed the firm's  explanation.\n\n``But many, including Trump voters, also said they are bracing for  economic pain in the valley, which spans two counties: Lehigh, which  Democrat Kamala Harris won by less than 3 percentage points in the  fall, and Northampton, a bellwether that frequently backs the winners  of Presidential…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…process can significantly increase the cost and timeline of relicensing  these important energy sources. In fact, the average permitting length  of an original license process spans from 5 to 7 years, and the average  relicensing process takes between 7 and 10 years.\n\nTo increase transparency surrounding the status of hydropower  licensing and relicensing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…late Orange blues musician. These achievements are more than just  accomplishments, they are the foundation of opportunity for countless  Texans.\n\nHis impact on the community spans beyond Lamar State College. Johnson  began his career as an officer in the Houston Police Department, where  he served in a variety of patrol and administrative positions before…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…generosity have been nothing short of extraordinary. He has led complex  criminal investigations and tactical operations with unparalleled  precision and excellence. His expertise spans critical areas such as  counter-terrorism, crisis management, and investigations, ensuring the  safety of New York City and its residents, this, in spite of the  political…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…healthcare  professionals that call J&J home.\n\nAfter earning his bachelor's degree from Vanderbilt University,  Calvin spent fifteen years at Mars, Inc. His experience at J&J spans  many roles including: U.S. President, Internal Medicine; President,  Wellness & Prevention Inc., where he was the founding leader of Johnson  & Johnson's health and wellness…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…the way for responsible population  growth, economic development, and long-term sustainability in one of  the most arid areas of our Nation. Today, the Agency's service area  spans nearly 5,000 square miles and provides water resource management  for nearly half a million residents.\n\nOver the past 65 years, the Mojave Water Agency has distinguished  itself…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…rise today to recognize Colonel John  Peyton Swain of the Civil Air Patrol, the U.S. Air Force Auxiliary. He  is an inspiration in the world of public service, whose legacy spans  more than 60 years of volunteerism and defense of our Nation's  airspace, development of youth, and civic readiness.\n\nAs Civil Air Patrol's first director of government relations,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…suffer, along with our ability to fully engage in and sustain       our Inupiaq cultural traditions, including our vital       subsistence way of life.\n\nThe North Slope of Alaska spans an area nearly the size of       the state of Minnesota and, within that expansive area, there       are eight Inupiaq communities--Anaktuvuk Pass, Atqasuk,       Kaktovik,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…suffer, along with our ability to fully engage in and sustain       our Inupiaq cultural traditions, including our vital       subsistence way of life.\n\nThe North Slope of Alaska spans an area nearly the size of       the state of Minnesota and, within that expansive area, there       are eight Inupiaq communities--Anaktuvuk Pass, Atqasuk,       Kaktovik,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and the enduring  strength of community. We honor the people of Leeds who stood together  in times of war, worked together to build a thriving town, and created  a legacy that spans more than two centuries. Their effort and  dedication ensure that Leeds has a bright future.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Cotton Hills Farm has been in the Wilson family since 1882. That is  over 143 years ago. Originally starting with only 100 acres gifted to  Jeff by his great-grandmother, it now spans over 1,000 acres producing  a diverse array of crops.\n\nJeff's story is one of dedication not only to the land but to the  family. After serving our Nation in the Air Force…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Marshall Brachman, on the occasion of his 75th birthday on July  6, 2025.\n\nMarshall has long exemplified the best of civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success but by a  deeply rooted commitment to his community, his faith, and the  betterment…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…wife have  raised their four children in Bucks County, firmly rooting their family  in the community he has worked so diligently to serve. His public  service to the Township spans nearly 25 years, first as Township  Auditor and later as a Township supervisor, roles in which he  demonstrated integrity, responsibility, and a steadfast commitment to  transparency…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Trump and U.S. Department of Agriculture Secretary Brooke  Rollins have made defeating the New World screwworm a priority. Our  Federal Government's response to this threat spans multiple avenues,  including emergency response plans, sterile fly production and  dispersal levels, as well as targeted initiatives in surveillance and  research. I have been…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Office Director for the St. Paul Area of  Responsibility, Director Berg manages all ICE officers assigned to  Minnesota, North and South Dakota, Iowa, and Nebraska. This area spans  over 350,000 square miles, includes nearly 12.5 million people, and  includes one field office, nine sub-offices, and 2 resident officer  locations.\n\nI recently met with Director…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Against Suicide. Born out of a student movement, this charity boxing  event was created to spread mental health awareness, particularly among  young men.\n\nWhat began in Athens now spans across eight universities with the  proceeds benefiting the Sam Asbury Foundation in Atlanta Georgia, and  other local charities.\n\nSam Asbury was a proud graduate of the University…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}]