[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The operations, maintenance, and personnel costs for federalizing the  500 National Guard soldiers for deployment in Illinois reached an  estimated $20 million in a 2-month span.\n\nThat comes out to more than $300,000 per day.\n\nThat bears repeating: $20 million and 500 Guard personnel away for  weeks on end from their families, their jobs, their communities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Independent, or someone who  doesn't follow politics--to tune in to the Committee on Rules. It will  be up on our website. I will be live-streaming on YouTube. It will be  on C-SPAN. Hell, maybe even cable will carry us live.\n\nI urge Americans to watch it and judge for themselves what this bill  means for them and their families and their communities. They…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…answer. I am not playing jokes. This is  very serious. I am asking everybody, all of my Republican colleagues,  anybody who speaks, anybody, just answer the question. We are on C- SPAN. Here is an opportunity to tell the American people why the  President of the United States, for whom you say this is about drugs,  would let go of two major convicted drug…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…have been sharing the story of  Benjamin Guerrero-Cruz, a constituent of mine who is a senior in high  school. He was detained by ICE in August while walking his dog.\n\nIn the span of 24 hours, ICE shuffled Benjamin between detention  centers and across State lines without his family knowing. I visited  Benjamin at the Adelanto Detention Center and observed…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697953/benjamin-guerrero-cruz-is-home"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this, you are  not likely to get an invitation to be on their airwaves. I understand  it. They have the power to mute by simply denying you access, but I  just thank God for C-SPAN, unfiltered C-SPAN. C-SPAN does not mute. C- SPAN does not conclude that because you are a person who will speak  truth to power and about power that you shouldn't have access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…year's Fairfax Walk has raised over $125,000 to support  prevention programs, research, advocacy, and resources for those in  crisis. Local partners including Leidos, Intact, SPAN, Interstate,  Wellsourced, Dutyfirst, Columbia Mental Health, Embark Behavioral  Health, Bechtel, and the County of Fairfax joined AFSP in providing  resources and encouragement…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Congress from trading stocks. Why? Members of Congress should be  serving their communities, their constituents, and their country, not  their stock portfolios.\n\nIn that 4-year span, 48 months, 1,400 days, how many millions of  dollars have Members of Congress in this body made from trading stocks?  It is unconscionable. It is a practice that should have…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691220/stock-trading-ban-for-members-of-congress"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…phone number, but I suspect my colleagues  do. They can call him. I am sure they can get this worked out, and we  can save you, Mr.  Speaker, and the few Americans watching on C-SPAN from this stale  debate over yet another resolution of disapproval.\n\nMr. Speaker, I understand that my colleague from North Dakota  disagrees with the resource management plan.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…progressive social change.\n\nAfter earning her B.A. from City College and a Master's in Health  Services Administration from the New School, Anita began a career that  would span urban planning, public health, and groundbreaking social  advocacy. From her early work at the New York City Planning Department  and Montefiore Medical Center to her service…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…faces of those countless Americans who have suffered at the hands of  their own government.\n\nTheir stories are about brutality, lawlessness, and inhumanity. Their  stories span the Nation. They are not only about Minneapolis. All the  Nation is Minneapolis. We are all Minneapolis today, and these stories  are a national call to action.\n\nThe violence…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…things that I will call to your attention  related to impeachment. The first is this meeting in the Oval Office. I  am about to read to you something that was published by C-SPAN. If you  want the details, you can go to the actual event on C-SPAN and see what  I am telling you. This is no secret.\n\nSome of the news media has picked up on it as of late…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…who created the bill. The ghost of  Sam Bankman-Fried looms above this auditorium. He is the genius behind  this GENIUS Act, and one can only hope that he is able to watch C-SPAN  on a black-and-white television set in his prison cell.\n\nYou don't have to be a genius to know that this bill is an attack on  working families. That is why the AFL-CIO says…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…By Stephen Jiang       Gliding across the tiled floors are a hundred pairs      Of shoes like loafers and running kicks, we discern      From our vantage, but hidden when C-SPAN airs      Behold the resolute heels of Senator Blackburn!      They've traveled here from Alabama's waterfalls      Tracking dust from Jersey streets onto the blue rugs…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that people find out what is  going on here, whether they agree with us or not, is by watching us and  listening to speeches. And one of the ways they do that is where? On C- SPAN.\n\nThat is what I am here to talk about today because Senator Grassley  and I have joined together on a resolution to celebrate the years that  C-SPAN has been around in this…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…or Colorado, this is  the priority?\n\nIt is a shame, Mr. Speaker. It is deeply disappointing and  disheartening, I suspect to most Americans, to those who might be  watching C-SPAN, to learn that this august body in the world's greatest  democracy is wasting its time debating resource management plans issued  by the prior administration.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…gone, it  is $638 billion just to make up that shortfall.\n\nThis isn't a game. These are numbers that should terrify you. Yet for  anyone who is crazy enough to be watching C-SPAN, how many times have  you seen this week, last week, the week before that Members come behind  these mikes and talk to you about the real issues that will change this  Republic,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…initial leg of the system but has continued to push back the  completion date for that initial segment.\n\nThe initial segment of the system from Bakersfield to Merced would  span 119 miles. For those who are not from California, these are not  exactly population centers. They have set a deadline to complete that  by 2033. They are now saying that even…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…average  ObamaCare plan have skyrocketed much higher than traditional inflation  leaving patients with higher costs and fewer choices.\n\nIf Americans are just tuning in to C-SPAN, you might assume that  Republicans are eliminating the Affordable Care Act or ObamaCare  altogether. That is simply not the case.\n\nThe premium tax credits were developed during…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…The amendment, first, makes it easier for foreign sources to be  undetected, doubling the threshold for contracts to $100,000 and  allowing gifts under $250,000 over a 3-year span to be unreported. Bad  actors will seek any possible way to avoid transparency about their  attempts to harm America through their influence over American  postsecondary education.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…best  schools for their children by providing critical financial support for  tuition, tutoring, transportation, technology, and school supplies.  School choice opportunities span the full spectrum of educational  options, including traditional public schools, private schools, charter  schools, and home schools.\n\nMr. Speaker, I ask that my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694905/recognizing-parents-challenge"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…nearly as tight as you think it is.\n\nI am going to pass through some of these.\n\nPart of the great battle is--and Chip was basically teasing for the  14 people that watch C-SPAN. Sometimes I am worried there is not even  14--if you ever have a curiosity, if you really care about saving the  Republic, I would argue what takes us down is potentially the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…objecting to a lack of transparency when we approved packages of Biden  nominees, some of which probably did happen in the dark of night,  albeit in the full light of the C-SPAN cameras.\n\nOf course, I should also mention that, before any floor  consideration, all of these nominees will have gone through the  committee process, which will have provided…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…match of 50 to 70 percent, depending  on the jurisdiction. Is that correct?\n\nMr. ROY. Let's fast-forward. What we are really talking about--for  everybody at home watching C-SPAN, all 14 of you--we have a situation  where ObamaCare expanded the Medicaid population, and it expanded it  massively to a population that is much bigger and much more able-…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Mr. Speaker, I am prepared to close, and I reserve the balance of my  time.\n\nMr. Speaker, I know it might be hard for folks back home to follow as  they are watching this on C-SPAN, but this is about a rule to bring two  small bills to the floor of the House.\n\nI am not arguing that they are the biggest things in the world. They  are smaller bills. That…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…democracy of the United  States of America.\n\nAs detailed in DHS' 2025 Homeland Threat Assessment, the Chinese  Government poses a wide array of dangers to our Nation. These threats  span across various sectors, including public safety, border and  immigration, critical infrastructure, and economic security.\n\nThreats of this nature undermine our global competitiveness…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank my friend from Arizona, and I would  really just commend the people who watch C-SPAN, all 14 of them, the  greatness of my friend from Arizona and how much he focuses on the  spending concerns of our country and the vast amount of debt that we  are passing down…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…At the airport, I was joined by local leaders and the newly sworn-in  Secretary of Transportation, Sean Duffy. Our conversation that night  was one of many that would then span the course of the following year,  trying to understand how an accident like this could occur and how to  prevent it from ever happening again.\n\nAt the airport, we learned the…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…participate in the workforce.\n\nNow, 60 years later, still based in Placer County, they are the  leading employer in the Nation of people with disabilities. PRIDE has  operations that span across 15 different States, as well as here in  Washington, D.C.\n\nThroughout the past six decades, PRIDE Industries has remained  committed to making direct investments in breaking…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…GRASSLEY. Mr. President, I am pleased to follow up on a topic  that I discussed with my Senate colleagues. That topic was on June 2,  and it was on the 39th anniversary of C-SPAN covering the Senate. I led  the Senate with Senators Klobuchar, Young, and Wyden in passing a  resolution highlighting the importance of continuous Senate coverage  for all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694940/c-span"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…being made.\n\nSpeaking of the historic moments, it was 39 years ago today, June 2,  when C-SPAN2 started its gavel-to-gavel coverage of the U.S. Senate.  That was 7 years after C-SPAN started broadcasting live coverage of the  U.S. House of Representatives in 1979. At that time, I was a Member of  the House and appreciated C-SPAN's mission to foster civic…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}]