[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…insufficient to take on the enormous challenge of fighting fraudsters  in this country who will take advantage of those who have laid their  lives on the line for all of us.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  intend to vote ``yes.'' I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. The new  State has a larger population than two States, pays more Federal taxes  per capita than any State, and pays more total Federal taxes than 21  States.\n\nMr. Speaker, I urge Members to vote ``no'' on the D.C. CRIMES Act,  keep their hands off D.C. and free D.C.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…on  protecting healthcare, lowering costs, and addressing the real issues  that working families are facing. We would not be here today talking  about showerheads.\n\nMr. Speaker, I urge my Republican colleagues to get serious and focus  on the priorities our constituents sent us here to address. For all  these reasons and so many more, I strongly oppose…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…the San Fernando Valley in  California, I believe that the true test of how we are as a country is  how we treat our most vulnerable, and this bill fails that test.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this ridiculous  bill.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…on these new laws, and American  taxpayers will lose out.\n\nIn closing, I appreciate the bipartisan work of Chairman Williams,  and Representatives Simon and Mfume.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMs. VELAZQUEZ.  Simon).\n\nMs. VELAZQUEZ. Mr. Speaker, I gladly rise in support of this…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the $50 million and 500 beneficial  owner limit upward or downward.\n\nThe ICAN Act should help venture funds to more widely invest in small  and growing businesses.\n\nMr. Speaker, I urge all colleagues to support H.R. 4431 to make it  easier for capital to flow to startups and small businesses. This bill  does so by increasing the dollar size and number…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697245/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…the city council; and Supervisor Nathan  Magsig. All of these individuals worked together with our office to, in  fact, act on the situation in Reedley, California.\n\nMr. Speaker, I urge that we act on this legislation so that people  around the country can feel safe from any kind of illegal biological  labs that may crop up in their communities. Together,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…markup  to add language that ensures that this property continues to serve a  public purpose by the Boys & Girls Club. This is an important assurance  and guarantee.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my time.\n\nMs. RANDALL. Mr. Speaker, I urge my colleagues to support this  important legislation, and I yield back…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…individuals fleeing countries noted for persecuting  religious minorities. We can have secure borders and also have an  immigration system based in empathy and humanity.\n\nMr. Speaker, I urge this administration to uphold our Nation's legacy  as a beacon of hope and a defender of religious freedom, not a  facilitator of suffering.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…statement that we believe in a tax  system where accountability, transparency, and due process matter, not  just for the wealthy or well-connected, but for all Americans.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support H.R. 5349 and deliver on commonsense Tax Court reform.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…on.\n\nMr. Speaker, Medicaid is the foundation of our healthcare system. It  is good for business. It is good for our economy, and it is good for  the American people.\n\nMr. Speaker, I urge my colleagues on the other side of the aisle to  join Democrats in defense of this vital program.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. The new State has a larger population than two States, pays more  Federal taxes per capita than any State, and pays more total Federal  taxes than 21 States.\n\nMr. Speaker, I urge Members to vote ``no'' on the D.C. Policing  Protection Act, keep their hands off D.C. and free D.C.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…over the last decades. With new technologies like  artificial intelligence, these scams are becoming and will continue to  be ever more prevalent in the years ahead.\n\nMr. Speaker, I urge all my colleague to support this bill which will  allow the Securities and Exchange Commission to better understand and  respond to this growing crisis.\n\nI thank Mrs.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…States have tried. In all of them, a significant number of  citizens have been wrongly barred from voting. It is unacceptable. It  is voter suppression. It is wrong.\n\nMr. Speaker, I urge all of my colleagues to vote ``no'' on the SAVE  Act.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690002/safeguard-american-voter-eligibility-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…protections and forcing people into junk plans.\n\nThe only path forward is Leader Jeffries' discharge petition. It is a  3-year extension, clear and clean, bipartisan.\n\nMr. Speaker, I urge Speaker Johnson to bring this legislation up, and  I yield back the balance of my time.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…research community. H.R. 1318  will eliminate confusion around the implementation of research security  requirements and increase protections of our R&D enterprise.\n\nMr. Speaker, I urge my colleagues to support this simple and  noncontroversial bipartisan legislation, and I yield back the balance  of my time.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…truth.\n\nThis is the bill for national security. This is the bill that  President Trump signed into executive order. Today is the day that we  codify this into law.\n\nMr. Speaker, I urge all my colleagues today to have a ``yes'' vote.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…millions of  children who deserve a fair shot at success. Passing the IDEA Full  Funding Act is a step toward fairness, responsibility, and a brighter  future for all.\n\nMr. Speaker, I urge my colleagues to support this essential  legislation.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…program.\n\nI also thank the gentleman from Arizona (Mr. Hamadeh) and the  gentleman from California (Mr. Obernolte) for championing the other  provisions of this language.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nMr. VAN ORDEN. Mr. Speaker, as chairman of the Economic Opportunity  Subcommittee, it has been a great privilege to get important…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…opportunity  for States like Wyoming.\n\nI again thank Mr. Rulli for his sponsorship and Chairman Guthrie for  his committee leadership promoting strong energy policies.\n\nMr. Speaker, I urge all my colleagues to support this bill and to  support the coal industry.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Westerman, for his partnership in ensuring our  battlefields and historic sites in upstate New York and across America  are preserved and protected for generations to come.\n\nMr. Speaker, I urge my colleagues to join me in supporting this  bipartisan bill, the Strengthening America's Turning Point Act.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…gentlewoman from Washington's Eighth District and the  gentleman from Idaho's First Congressional District for their  leadership on this very important legislation.\n\nMr. Speaker, I urge my colleagues to support H.R. 3657, and I reserve  the balance of my time.\n\nMr. LATTA. Mr. Speaker, I have no further speakers on the bill. I am  prepared to close if…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…While this  bill is a step in the right direction, I hope my colleagues recognize  that there is much more work to be done to get VA to work for the  veterans first.\n\nMadam Speaker, I urge all my colleagues to support H.R. 4446, and I  reserve the balance of my time.\n\nMr. BOST. In closing, Madam Speaker, once again, I encourage all  Members to support the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695412/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…and what he is doing to  Make America Great Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to vote to adopt this  resolution to show the American people that those who colluded with Mr.  Epstein, including Members of the House, will be held…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…would reduce the financial burden on our military families  who want to visit our national parks and expand their access to the  healing powers of outdoor recreation.\n\nMr. Speaker, I urge adoption of this legislation, and I yield back  the balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…reinvigorate America's clean coal and unleash American energy, restore  strength to our energy policy, and put the needs of his constituents  and all Americans first.\n\nMr. Speaker, I urge my colleagues to support this resolution to  restore American energy dominance.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…admittedly, the most difficult part but the  most necessary, is reining in the runaway spending that is driving the  greatest country in human history off of a fiscal cliff.\n\nMr. Speaker, I urge my colleagues to reverse the curse, and I reserve  the balance of my time.\n\nMr. ARRINGTON. Mr. Speaker, after the Tax Cuts and Jobs Act, the  wages for the bottom 10 percent…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…destination for investment, innovation, manufacturing, and  deployment, the U.S. will cement itself as the global leader of the new  age of technological advancements.\n\nMr. Speaker, I urge my colleagues to join me in favor of this  particular bill, H.R. 1679.\n\nMr. BILIRAKIS. Mr. Speaker, in closing, I encourage a ``yes'' vote on  this particular bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…bright as we unleash responsible natural  resources development to meet our energy and mineral leads, to create  jobs, and to drive economic growth across the country.\n\nMr. Speaker, I urge adoption of this resolution, and I yield back the  balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]