[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…in rulemaking. Anyone in the public can  then give feedback on the information agencies use. The bill requires  OMB to report any public complaints to Congress.\n\nMr. Speaker, I encourage my colleagues to support the bill, and I  reserve the balance of my time.\n\nMr. Speaker, I thank the sponsor of this bill. This bill passed the  House  overwhelmingly…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700100/information-quality-assurance-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…biodetection  technologies fall short.\n\nAs security threats continue to evolve, it is important that Congress  support improvements in biodetection capabilities.\n\nMr. Speaker, I encourage my colleagues to support the bill, and I  reserve the balance of my time.\n\nMr. CORREA.\n\nMr. Speaker, while DHS has made tremendous efforts to enhance its  biodetection…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…of American maritime shipping, both domestically and globally,  there is no reason why the Department cannot and should not set an  example that is meaningful.\n\nMr. Speaker, I encourage my colleagues to support passage of H.R.  2035, the American Cargo for American Ships Act, and I yield back the  balance of my time.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…this  time to really protect our kids and not just act like we are protecting  them, while this Republican Congress does nothing about these tragedies  at all.\n\nMr. Speaker, I encourage all of my colleagues to oppose this bill.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…applaud Representatives Meuser and Scholten for leading this  bipartisan effort, and I thank Chairman Williams and his team for their  collaboration on this bill.\n\nMr. Speaker, I encourage my colleagues to vote ``yes'', and I reserve  the balance of my time.\n\nMr. CISNEROS. Mr. Speaker, I would like to close by once again  thanking Mr. Meuser and Ms. Scholten…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697258/investing-in-all-of-america-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…and Mr. Barr and I worked together  on several issues in this Congress. Both sides worked in good faith to  get this bill done last Congress and again here today.\n\nMr. Speaker, I encourage my colleagues to support this measure, and I  reserve the balance of my time.\n\nAs I have indicated, I support this bill because sanctions have a  role in curbing the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…no longer left behind in  the race for cutting-edge technology, driving down costs and empowering  smaller carriers to build stronger, more resilient networks.\n\nMr. Speaker, I encourage my colleagues to pass the Open RAN Outreach  Act.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…stakeholders, including U.S. airlines,  air traffic controllers and pilot unions, the general aviation and  business aviation industries, first responders, and many others.\n\nMr. Speaker, I encourage my colleagues to join us to support H.R.  2591, and I urge the Senate to quickly take up this bill to help  provide the resources our aviation workforce desperately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…for future generations. My colleagues and I are honored to  reintroduce this legislation to preserve America's working forests and  bolster our rural economies. Mr. Speaker, I encourage all members to  join us in cosponsoring this bill.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…those to be identified during  the review process. This review and remediation will lead to more  accessible, responsive, and secure discount window operations.\n\nMr. Speaker, I encourage my colleagues to support this bill.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699860/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Representatives because their Representatives  were hiding from them because they could not justify their support of  this big, disgusting billionaire bailout.\n\nMr. Speaker, I encourage my colleagues from New Jersey to listen to  their constituents and vote ``no.'' May God forgive those who do not do  for the least among us.\n\nMr. BOYLE of Pennsylvania.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…protects our national security.\n\nThis bill is a critical step in ensuring DHS upholds strong policies  and procedures to secure research and development efforts.\n\nMr. Speaker, I encourage my colleagues to join me in supporting H.R.\n\nMr. Speaker, the passage of this legislation is a key step in  protecting DHS' research and development capabilities from…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688735/research-security-and-accountability-in-dhs-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the people of Ohio's 13th Congressional  District to lower costs, to keep them safe, and to make sure that they  had affordable, accessible healthcare coverage.\n\nMr. Speaker, I encourage every single Member of this Chamber to do  those things, not only for the people in my district but for the people  all across America who are asking and needing Congress…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…also mandating  public disclosure of any private inspection contracts used by state and  local transportation departments when public inspectors are  unavailable.\n\nMr. Speaker, I encourage all Members to join us in cosponsoring the  ``Public Inspectors for Safe Infrastructure Act.'' As a senior  Democratic member of the Committee on Transportation and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…attacks like  these, to make clear that we stand with the Jewish community today and  always and that we will be there for them in the weeks and months  ahead.\n\nMr. Speaker, I encourage you, read the resolution that Mr. Evans  introduced. You will not find a single reference--not one--to the  victims' families, the people I met with over the weekend,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…amended.\n\nMr. BOST. Madam Speaker, I yield such time as she may consume to the  gentlewoman from Virginia (Mrs. Kiggans), the sponsor of this bill.\n\nMr. BOST. Madam Speaker, once again, I encourage all Members to  support this legislation.\n\nMadam Speaker, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…United States, you  do not have to show citizenship. You don't have to show identification.\n\nThe SAVE Act is required if we are going to have election integrity.\n\nMr. Speaker, I encourage my colleagues to vote for that. It will make  the Federal law in Arizona correspond to the State law. That will help  Arizona's election integrity.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689431/arizona-has-two-kinds-of-ballots"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…people might still be alive. I can  certainly say that justice would have been done.\n\nThis bill is a good first step. We need to do it. It is the right  thing.\n\nMadam Speaker, I encourage all of my colleagues to support it. Let me  just say, I hope we don't stop here. Let's put this on the President's  desk. Let's keep going and finish the job.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…restores this critical program, ensuring  that we continue to spur innovation, improve outcomes for young  patients, and close gaps in pediatric drug research.\n\nMr. Speaker, I encourage my colleagues to support this bill.\n\nMr. CARTER of Georgia.\n\nMr. CARTER of Georgia. Mr. Speaker, I apologize. I do have one other  speaker.\n\nMr. CARTER of Georgia. Mr.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…and three grandchildren.\n\nI encourage my colleagues to support this bill, and I reserve the  balance of my time.\n\nMr. GILL of Texas.  Tenney).\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Officer Anthony  Mazurkiewicz, who gave his life in the line of duty.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697616/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…hearings on and  what we won't. I appreciate the request. This is why we have these  types of hearings, and that is why we have this legislation here today.\n\nMr. Speaker, once again, I encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…seven siblings, 10 nieces and  nephews, and many friends.\n\nI encourage my colleagues to support this bill, and I reserve the  balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Jay P. Larson who served his  community with distinction as a U.S. Postal Service letter carrier.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…cheat is a core  principle. As we instill election integrity in our system, we will see  more people participating because they will have faith in our  elections.\n\nMr. Speaker, I encourage my colleagues to vote in favor of S.\n\nMr. STEIL.  Tenney), the founder and chair of the Election Integrity  Caucus.\n\nMr. STEIL. Mr. Speaker, may I inquire as to the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…is a win-win for school-age children and dairy  farmers across this country. I am proud that we now, once again, can  say loudly: ``Milk: It does a body good.''\n\nMr. Speaker, I encourage my colleagues to support this important  legislation.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…to the modern care that they have earned.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, I have no more speakers.\n\nMr. BOST. Mr. Speaker, once again, I encourage all Members to support  this legislation, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…several  months of the year. I hope that we, as Republicans, get back to  exposing where the American tax dollars have been wasted over the last  several years.\n\nMr. Speaker, I encourage people to vote for this minor cut, but a  minor cut is better than no cut.\n\nMr. HARRIS of North Carolina. Mr. Speaker, if this $9 billion House  rescissions package…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…service here. I wish her the best. Hopefully, we will  continue working together, as we still have a lot of things to get  done. This bill is a very good bill.\n\nMr. Speaker, I, once again, encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…work  and they know they may not come home. We owe these people a lot more  than just a thank you. We owe them respect, admiration, and our  unwavering support.\n\nMr. Speaker, I encourage my colleagues to do the same and to honor  the life of Deputy Sheriff Brad Reckling. May we always appreciate the  men and women in blue.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…leadership on this issue. He is a  thoughtful and dedicated patriot who is making certain that our  grandchildren are better off as a result of our efforts today.\n\nMr. Speaker, I encourage all my colleagues to support this bill.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Republicans' work to  unleash American energy and ensure that government red tape does not  stand in the way of creating jobs and growing our economy here at home.\n\nMr. Speaker, I encourage all of my colleagues to join us in  supporting S.J. Res. 31.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}]