[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…January 6th Committee, including Michael Fanone, Officer Harry Dunn,  Police Sergeant Aquilino Gonell, and Officer Daniel Hodges.\n\nIt has been more than 2 years, Mr. Speaker--take a look at this  plaque--that the other side has failed to properly honor police  officers. Yet, they stand here and want to dictate to us how supportive  they are of the men…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691171/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…earlier this year to help  accelerate the reunification of these families. This was recently  signed into law, offering these families hope for a long overdue  reunion.\n\nMr. Speaker, I look forward to continuing to work with the Korean- American community in my district and across the country to make these  reunions a reality, and I wish everyone a happy…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Minneapolis, across the country, and for my  colleagues here in Washington who somehow continue to excuse, dismiss,  and ignore the atrocities that ICE exhibits each day.\n\nMr. Speaker, do not look away. Watch as people in the freest country  on Earth get dragged from their cars down the street by masked men.  Watch as parents are pinned to the ground in the pick-up…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699124/ice-atrocities"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…have a  national debt issue right now, which we both agree on, it will get far,  far worse if the new standard becomes this phony fraud of current  policy baseline.\n\nMr. Speaker, I look forward to the rest of the debate, and I reserve  the balance of my time.\n\nMr. BOYLE of Pennsylvania. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from New Jersey…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…outrage?\n\nRepublicans can't lift a finger about any of those things, but they  sprint to the floor to censure Al Green because he hurt Trump's  feelings. It is pathetic, Mr. Speaker.\n\nNow, look, we know what this is all about. Republicans don't work for  America. They don't work for the people. They don't work for veterans,  and they don't work for the teachers…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…the concentration of wealth and power and Citizens  United.\n\nIt is why the American Dream is out of touch for the vast majority of  Americans by nearly every measure.\n\nMr. Speaker, look no further than the fact that most Americans can no  longer buy a home, and one in four Americans have zero dollars saved  for retirement.\n\nThis is a crisis and a moment…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Revolutionary War. His genius has shaped our Nation in innumerable  ways, and he deserves to be prominently displayed and honored in the  United States Capitol.\n\nMadam Speaker, I look forward to working with the Joint Committee on  the Library to obtain a new statue of Benjamin Franklin. I urge my  colleagues to support this measure, and I reserve the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Members to advocate safely for the  well-being of the communities that we represent and for prioritizing  the protection of northwest Indiana and our neighborhoods.\n\nMr. Speaker, I look forward to supporting this measure and continuing  to work with the Appropriations Committee to deliver real, meaningful  public safety investments for the people whom…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Responder Cookout, thanking them for their service.\n\nSo many students have given back to our community in many ways, and  they have left their mark on the community.\n\nMr. Speaker, I look forward to watching all they accomplish, and I  congratulate the graduates of Heritage High School's class of 2025.            Congratulating Independence High School…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…I include in the Record a link to the official report of  the names and ages of Palestinians confirmed and killed in Gaza.  https://data.techforpalestine.org/list/.\n\nMr. Speaker, look at this. I want the American people to see this.  The first 21 pages are all infants who did not live long enough to see  their first birthday.\n\nThere have been over 60,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…from those who are in the cybersecurity field. It also  ensures that our workforce is better equipped to prevent cybersecurity  threats to our key infrastructure.\n\nMr. Speaker, I look forward to working with LA Valley College to  continue paving pathways for students to access high-paying, in-demand  careers.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…when he served as the Speaker of the Little  Congress. Aarit is a shining example of why Ohio's 13th Congressional  District is known as the birthplace of champions.\n\nMr. Speaker, I look forward to all that he accomplishes in the  future, and I thank Aarit for his dedication to civics in the United  States of America.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…support tax breaks for huge, greedy  corporations. And they accuse Democrats of being in the pocket of the  insurance industry?\n\nGive me a break. Nobody believes this BS.\n\nMr. Speaker, look at your big, ugly bill. Look at all the tax breaks  that go to millionaires and billionaires and big corporations. Every  millionaire, as I stated before, because of Republicans,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…healthcare, take out the  middleman, decrease the price of pharmaceuticals, and make sure that  people have access to healthcare wherever they are in this country.\n\nMr. Speaker, I look forward to working with my colleagues on both  sides of the aisle to do that, and I encourage the Senate to take up  this bill and get it done so that we can actually…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…side of this  Republican resolution that will terminate the standards.\n\nWhy?\n\nIt is because inefficient appliances mean that gas companies sell  more gas.\n\nNow, Mr. Speaker, if you look at where the manufacturers stand on  this, three out of four major water heater manufacturers are in favor  of the standards and are opposed to this resolution. All…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and poverty around the globe.\n\nAnyone with even a basic knowledge of history knows that government- enforced collectivism always ends in poverty, death, and despair.\n\nMr. Speaker, look at Cuba, where the warmth of communism has left  people with no rights, no freedom, and driving cars from the 1940s and  1950s; or Xinjiang, China, where the Uyghurs are…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…child tax  credits. Thanks to the death tax exemption, Hoosier farmers can pass  their family-owned farms down to their children without losing most of  it to the IRS.\n\nMr. Speaker, I look forward to more opportunities to deliver tax  relief and eliminate waste and fraud for my constituents so they can  survive and continue raising their families in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695724/supporting-working-families-tax-cuts"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…defense, reinforcing global stability, and  ensuring that the United States remains ready to respond to emerging  threats with confidence,capability, and conviction.\n\nMr. Speaker, I look forward to consideration of these pieces of  legislation, urge passage of this rule, and I reserve the balance of my  time.\n\nMr. JACK. Mr. Speaker, for the Record, supporters…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…here, people who are here in this country  illegally, are on some of these programs that are going bust? Yes, they  are going bankrupt. Those aren't my numbers, Mr. Speaker. You can go  look at Biden's own actuaries on those programs. Biden's actuaries said  that those programs are going bankrupt, and the other side just wants  to demagogue and say: Leave…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…again. Now it is our job here in Congress to ensure Federal law  enforcement and prosecutors have the tools that they need to deter  further illegal immigration.\n\nMadam Speaker, I look forward to supporting this strong, commonsense  piece of legislation on the House floor this week as we continue to  work to make our Nation once again safe for all Americans.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in the Federal budget.\n\nIt is simply common sense that we focus on fiscal responsibility and  rein in wasteful spending to which Washington has become so addicted.\n\nMr. Speaker, I look forward to working with my House colleagues,  Chairman Arrington, and the Members of this body to accomplish the  President's goals by way of this reconciliation measure.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the future of  clean energy. I believe that it is upon us now, but that future is  being driven by entrepreneurs and innovators, not by vainglorious  politicians.\n\nMadam Speaker, I look forward to this resolution passing. I hope it  does with bipartisan support, so we can prevent the insanity of  California's politics from infecting the rest of the Nation.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to put pen to paper and craft reconciliation legislation  that fully delivers on the promises the President and House Republicans  have made the American people.\n\nMr. Speaker, if we look in this beautiful Chamber, I have only  located one quote from our past that is displayed here, and it is up  above you up close to the ceiling. We are getting close…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…supporting this legislative effort  including the National Fisheries Institute, the Pet Food Institute, and  the American Sportfishing Association, among many others.\n\nMadam Speaker, I look forward to seeing the full House consideration  of this important bill very soon.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…charging forward and standing up for hardworking  families and vulnerable Americans.\n\nThe legislation before us is common sense, pro-law enforcement, and  necessary.\n\nMr. Speaker, I look forward to the consideration of these important  pieces of legislation. I urge the passage of this rule, and I reserve  the balance of my time.\n\nMr. Speaker, I have said…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…productivity and continue to afford and provide the very services  we promised? No, that would require math, thinking, and policy. It is  not good storytelling, is it, Mr. Speaker?\n\nLook, it is also one of the reasons I was so enraged about the  intellectual laziness, I thought, of the Senate. Look, this is where I  am being a bit sarcastic, if not mean.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…penalties  for the criminals who are responsible for this epidemic.\n\nOur Nation cannot wait any longer as we lose thousands of Americans  every day to this poison.\n\nMr. Speaker, I look forward to supporting this legislation on the  floor, and I encourage all of my colleagues on both sides of the aisle  to support it as well.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…injuries.\n\nI do believe it is a political policy and a moral imperative to use  whatever levers we have here to remove barriers to expanding access to  this technology.\n\nMr. Speaker, I look forward to working with the administration as  well as folks on both sides of the aisle to do that because we really  do have an opportunity here to do an immense amount…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Are we paying attention?\n\nYet, the first words I will get from my brothers and sisters on the  left are: Well, just raise taxes.\n\nI will show over and over here, Mr. Speaker, that if you look at  times when we had high marginal tax rates, low marginal tax rates, we  basically always get about 17 to 18, sometimes 18\\1/2\\, percent of the  economy in tax…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…discussion for another day.\n\nI share it today because for me, at least, this brings back memories  of a time when we were wrestling with the same issue back home.\n\nMr. Speaker, how do you look a rape victim or a domestic violence  victim in the eye and tell them that the good folks in your community,  the advocates and the supporters of domestic violence…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}]