[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…operations at each of these installations proceed without  interruption.\n\nLastly, Mr. Speaker, I thank Representative Begich for his work on  this bill.\n\nMs. RANDALL. Mr. Speaker, I urge support of this bill, and I yield  back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697635/public-lands-military-readiness-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…if we just had the  experts in D.C. do it.\n\nThis is a good bill. It is a continuation of a theme on the floor  today of serious legislators doing serious work.\n\nMr. Speaker, I urge support of this bill, and I yield back the  balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…anniversary approaches, we should expand Salem  Maritime's capacity to share our region's rich history with visitors  from across Massachusetts and the country.\n\nMr. Speaker, I urge support of H.R. 2215.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…of litigation and 11 years of negotiation.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on the bill, and I  reserve the balance of my time.\n\nMs. RANDALL. Mr. Speaker, I urge support for this policy, and I yield  back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697674/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…statutory tools and enforcement authority  because we think there is a risk to the public, then the agency must be  prepared to carry out those duties.\n\nMr. PALLONE. Mr. Speaker, I urge support of this important  legislation on a bipartisan basis, and I yield back the balance of my  time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692766/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…authorizing the World War II women's memorial to be placed on or  near The National Mall, we are ensuring that the legacy of these brave  women will never be forgotten.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my time.\n\nMr. Speaker, as my colleague mentioned, I recently had a chance to go  to a 100th birthday celebration of one…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…effective and enforced without fear or favor. We  need a strong FTC.\n\nI commend Representatives Mullin and McClain for their leadership of  this issue.\n\nMr. PALLONE. Mr. Speaker, I urge support for this legislation. I do  think that from an environmental point of view and to protect our waste  treatment facilities this is important legislation, and I yield…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…both Democrats and Republicans.\n\nAgain, I strongly support this bill, and I hope to do more of this  kind of important bipartisan work in the future.\n\nMs. RANDALL. Mr. Speaker, I urge support for this legislation, and I  yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…great bill, and I support it.  I yield such time as she may consume to the gentlewoman from Ohio (Ms.  Brown), the sponsor of this legislation.\n\nMr. SUBRAMANYAM. Mr. Speaker, I urge support for this bill, and I  yield back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698151/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Importantly, this legislation will promote clean water and  the protection of our natural resources without imposing new mandates  on industry or local governments.\n\nMr. Speaker, I urge support of the bill, and I yield back the balance  of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…need of  reform. However, reauthorization is crucial to the economic growth and  stability and to protect our economic security and interests in our  hemisphere.\n\nMr. Speaker, I urge support of this legislation.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698854/haiti-economic-lift-program-extension-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…all of the members of the Adams  Memorial Commission for their dedication to this project. Hopefully, we  will all be able to visit the new memorial very soon.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my time.\n\nMs. RANDALL.\n\nMs. RANDALL. Mr. Speaker, I urge support for this legislation, and I  yield back the balance of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…urge all of my colleagues to support this timely  legislation to protect Americans from untrusted actors seeking to use  our communications networks against us.\n\nMr. Speaker, I urge support for the legislation, and I yield back the  balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the abandoned coal mine  problem. There is more to do to hold the industry accountable, but this  is a good bipartisan step to cleaner water for our communities.\n\nMr. Speaker, I urge support for this bill. I urge my colleagues to  support the legislation, and I yield back the balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…generations of Americans can learn from and enjoy.\n\nDemocrats will continue to stand up for our Federal workforce and to  fight to protect Americans' public lands.\n\nMr. Speaker, I urge support for this bill and reserve the balance of  my time.\n\nMs. RANDALL. Mr. Speaker, I am enthusiastically in support of this  policy, but I think I have to underscore, again,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…responsibilities of the  commissions.\n\nCongress has a duty to conduct oversight of these commissions, and I  thank Mr. Bresnahan for ensuring that we fulfill that role.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. Speaker, H.R. 3428, the Mid-Atlantic River Basin Commissions  Review Act, is legislation that will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…together, we can get the job done and do a great  job for the American people. I share my good friend Ms. DeLauro's  opinion in this case, that is exactly what we did.\n\nMr. Speaker, I urge support for the bill and urge its passage. I urge  my colleagues to support this, and I yield back the balance of my time.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…legislation to the floor and working with us.\n\nMr. Speaker, I ask my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. LATTA. Mr. Speaker, I urge support of this legislation, because I  know across my district--I have one of the largest farm income- producing districts in the State of Ohio--our farmers rely on this…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the One Big Beautiful Bill  Act or today's ZIP Code update, it is my mission to be a voice that  responds to the needs of my constituents.\n\nI stand here today, Madam Speaker, to urge support for this package  to ensure that communities across this country can have the clarity  that they absolutely deserve.\n\nMr. COMER. Madam Speaker, I yield 3 minutes to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…health-related special issuances for pilots and air  traffic controllers and strengthen the hiring of medical examiners to  clear the backlog of special issuance requests.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. Speaker, mental health issues are often underreported, and many  times those who do not report an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…officially name the House Press  Gallery after him. I thank the gentleman from Florida, Representative  Donalds, for his leadership on this bipartisan resolution.\n\nMr. Speaker, I urge support of the legislation and reserve balance of  my time.\n\nMr. GRAVES.  I  will take a moment to recognize someone who has made a particular  impact on myself and this body,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…would bring regulatory certainty to manufacturers,  performance effectiveness to a household appliance we all use, and  choice to American consumers.\n\nMr. Speaker, I urge my colleagues to support it, and I reserve the  balance of my time.\n\nWhen the gentleman from New Jersey (Mr. Pallone) had his poster, he  didn't actually have the poster that President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…appreciate Ranking Member Larsen, Subcommittee Chair  Ezell, and Subcommittee Ranking Member Carbajal for working to reach a  bipartisan agreement on this bill.\n\nMadam Speaker, I urge support for this legislation, and I reserve the  balance of my time.                                       Committee on Armed Services,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the TVA Transparency Act is a commonsense  bill that makes Tennessee Valley Authority more transparent while  ensuring it can serve its customers effectively.\n\nMr. Speaker, I urge support of this bill, and I yield back the  balance of my time.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692213/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Service to identify lands to be transferred to the Lower Elwha  Klallam Tribe for housing, cultural, or economic development purposes  and place them into trust.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my time.\n\nMr. CRANK. Mr. Speaker, H.R. 2388 takes approximately 1,083 acres of  National Park Service land into trust…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…fix healthcare. We are going to fix  affordability. Gas prices are already coming down. Grocery prices are  coming down. Wait until that tax cut hits in 2026.\n\nMr. Speaker, I urge support of H.R. 4593 and so should you.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance to lower costs for hardworking households.\n\nMr. Speaker, I urge my colleagues to support H.R. 3015, and I reserve  the balance of my time.\n\nMr. Speaker, we are absolutely concerned about families making ends  meet through cheaper electricity. There…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…manage what we can't measure. H.R. 3857 gives Western  communities what they need to plan ahead and protect the water  resources that sustain our way of life.\n\nMr. Speaker, I urge support for this legislation, and I reserve the  balance of my time.\n\nMr. HURD of Colorado. Mr. Speaker, this bill reauthorizes a vital  program that helps water managers…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…colleagues to vote in favor of this  legislation to help communities across the United States receive the  assistance they need to obtain water infrastructure.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. TAYLOR. Mr. Speaker, I have no further speakers, and I yield  myself the balance of my time to close.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Rouzer, leader on the T&I Committee,  for his work on this legislation that ensures Federal funds can be used  to counter threats posed by our Nation's adversaries.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. EZELL. Mr. Speaker, I am prepared to close and I yield myself the  balance of my time.\n\nMr. Speaker,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692200/maritime-supply-chain-security-act"}]