[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Guardian as one of the world's leaders in raising  environmental awareness, and recognition from Time Magazine as one of  the world's most influential people.\n\nMr. Speaker, it's my privilege to welcome the Ecumenical Patriarch to  Washington, D.C. and to congratulate him on his receiving such an  esteemed award in the Templeton Prize.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, I had the privilege last night of sitting  in this Chamber yet again, and I witnessed a lot of my colleagues  cheering as the President rattled off the numbers, the statistics, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I have the privilege of representing  thousands of 9/11 first responders and survivors who live in New York's  Fourth Congressional District.\n\nFor years, they have fought to get access…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689387/accessing-healthcare-for-first-responders-and-survivors"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Cody Thomas for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Michael Goodwin for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692478/recognizing-michael-goodwin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Kevin Vaughn for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692514/recognizing-kevin-vaughn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Gary Steele for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692592/recognizing-gary-steele"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…after being removed, and for other purposes, and ask for  its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. KNOTT.  3486.\n\nMr. Speaker, it is my privilege to open remarks on this important  legislation which holds a specific criminal category to account,  specifically those who exploit weak border policies to bring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Travis Brown for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Theodore Gomez for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692595/recognizing-theodore-gomez"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Alan Sowerby for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692461/recognizing-alan-sowerby"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Zachary LaDuke for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…leg and possibly even his life.\n\nIt is selfless acts like these that exemplify the best of our  community, and I am honored to recognize Judie's heroism today.\n\nMr. Speaker, it is a privilege to share her story, and I thank her  for her amazing service and resolve.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688226/recognizing-judie-kent"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, it is my privilege to speak in favor of H.R.  4070, the Tren de Aragua Border Security Threat Assessment Act.\n\nI thank Chairman Guest and Chairman Garbarino for their support and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to recognize  and celebrate the 100th Anniversary of the Town of Howey-in-the-Hills,  Florida.\n\nFounded by William John Howey and incorporated on May 8, 1925, as…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to recognize  and celebrate the 100 Year Anniversary of the City of Ocoee, Florida.  Ocoee officially became a municipality in 1923 and was incorporated as  a city…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690916/recognizing-the-100th-anniversary-of-the-city-of-ocoee"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to extend  warm congratulations to Sylvia Marie Thornton on the occasion of her  98th birthday. Sylvia was born in Bainbridge, Georgia, on November 29,  1927, and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Jamen Monbarren for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692647/recognizing-jamen-monbarren"}]