[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…includes provisions to increase transparency and  accountability by broadening the definition of lobbying and by also  lowering the time threshold for registration.\n\nMr. Speaker, I will close by thanking End Citizens United and its  president Tiffany Muller for all the work that they are doing to get  dark money out of politics and that we ensure a democracy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the House to immediately pass the  District of Columbia Local Funds Act, the District of Columbia Local  Funds Act has been sitting in this House for 3 months.\n\nMadam Speaker, I close by discussing democracy, or lack thereof, in  D.C. The Revolutionary War was fought to give consent to the governed  and to end taxation without representation. Yet, D.C.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Mr. Speaker, I urge my colleagues to support this bill to ensure we  give the SBA the modern tools it needs to support the success of  America's small businesses.\n\nMr. Speaker, I close by once again thanking my colleague  Representative Jack for partnering with me on this important  legislation.\n\nBy bolstering SBA's IT infrastructure, we can improve…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…foreign manufacturers of compressed gas cylinders.\n\nMr. Speaker, I support this bipartisan bill and urge my colleagues to  do the same.\n\nMr. LARSEN of Washington. Mr. Speaker, I will close by saying that I  support the Compressed Gas Cylinder Safety and Oversight Improvements  Act. I encourage my colleagues to do the same, and I yield back the  balance…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692181/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleagues to vote ``no.''\n\nMr. McGOVERN.  Adams).\n\nMr. McGOVERN.  Stansbury).\n\nMr. McGOVERN. Mr. Speaker, may I ask how many more speakers the  gentlewoman has.\n\nMr. Speaker, before I close, let's talk about what is actually in  front of us.\n\nThis rescissions package is a joke. Republicans passed a massive tax  giveaway for the rich, one of the most expensive…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…in a timely manner, if they received it at all.\n\nFor these reasons, I oppose the Small Business Regulatory Reduction  Act, and I urge my colleagues to oppose it.\n\nMr. Speaker, I will close with this: Trump's tariffs, not  regulations, are crushing small businesses. I know that it is painful  for the other side of the aisle to discuss or even debate the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…our laws to address these new and dangerous  crimes and to keep our children safe online.\n\nMr. Speaker, I encourage all of my colleagues to support H.R.\n\nMr. RASKIN. Mr. Speaker, to close, I strongly support H.R. 6719, the  Combating Online Predators Act. I encourage all of our colleagues to  support it, and I praise the gentlewoman for her leadership…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Small  Business Committee.\n\nMr. Speaker, I thank the gentleman from New York (Mr. LaLota) and the  gentleman from Texas (Mr. Williams) for their work on this bill.\n\nMr. Speaker, I close by thanking the ranking member from New York  (Ms. Velazquez) for her leadership on this bill and her many years of  work to create, strengthen, and enhance the Women-Owned…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691800/wosb-accountability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Valadao for their leadership on this  legislation.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, I will close by saying I do think this is  an important bill for avoiding fraud. I am very concerned about fraud  on these dating service apps. I commend Mr. Valadao for bringing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of your answer there because there is a lot more that is  about to come out, right? You should think about what is the principle  behind this rush to judgment.\n\nMr. Speaker, I will close just with this thought because I know there  were a lot of people in the Chamber who were here when this happened  and a lot who weren't.\n\nThere was a move to expel…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…I look forward to working with my colleagues to ensure robust funding  for the maritime industry. For this reason, I will vote ``yes'' on H.R.  252.\n\nMr. CARBAJAL. Mr. Speaker, to close, I support H.R. 252 and urge my  colleagues to do the same.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…look forward to continuing to work through with our  Senate counterparts.\n\nMr. Speaker, I support the bill, and I reserve the balance of my  time.\n\nMr. CISNEROS. Mr. Speaker, I will close by thanking the chairman for  his commitment to working on behalf of small businesses to open up  avenues of financing for small businesses hoping to contribute to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…including in rural America, in  districts, Mr. Speaker, that my colleagues on the other side of the  aisle represent. Nursing homes closing, one in four nursing homes, Mr.  Speaker, will close as a result of the attack on Medicaid and Donald  Trump's one big, ugly bill.\n\nMr. Speaker, this is extraordinary, this assault on everyday  Americans, this assault…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is a lack of respect to law  enforcement. The Republicans can't even condemn the rioters who were  here on January 6.\n\nSo what the hell is wrong with this place?\n\nMr. Speaker, I will close with this: Congress alone has the power to  declare war, not Donald Trump, not his Truth Social account, and not  his campaign donors. This administration cannot be…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…more  ways than I can describe. Their sacrifices over the last 6\\1/2\\ years  have contributed to the success of the T&I Committee and the House of  Representatives.\n\nMr. Speaker, I close by saying that anybody who has ever worked with  Jack knows that these things are very true: He is fair, he is  pragmatic, and he knows how to get the job done. The most…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…ensure that our Nation's police forces know that we have  their back.\n\nMr. FRY. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. FRY. Mr. Speaker, before I close, I yield 2 minutes to the  gentleman from North Carolina (Mr. Moore).\n\nMr. MOORE of North Carolina. Mr. Speaker, there is certainly no  shortage of us who are attorneys…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…threat. I am proud to say that enacting this  legislation, the Taiwan Assurance Implementation Act, will be a  decisive step forward to ensuring peace through strength.\n\nMr. Speaker, I close by acknowledging my close friend and co-lead of  this legislation, Congressman Gerry Connolly, for his work on this  legislation. Congressman Connolly is a respected voice…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…run by illegitimate  autocrats, is worth fighting for. Standing behind our principles, even  when it is politically inconvenient, is a posture worth fighting for.\n\nMr. Speaker, as I close tonight, I remind the American people that  this administration's law enforcement actions to bring Maduro to  justice have received the full support of Republicans in…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with great legislation, to codify our border, make sure people can  afford healthcare, make sure people can afford housing, and do the  things we said we would do.\n\nMr. Speaker, I will close with this since today is Thursday and a  week from today is Thanksgiving. I know that most of the people that I  represent are deeply thankful to be Americans and to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, sincere appreciation to the  Congresswoman. I thank her very much. That is a great way to honor  Doug.\n\nMr. MOORE of Utah. Mr. Speaker, to close, I again thank the  gentlewoman from California (Ms. Rivas) for yielding a few more minutes  to finish out these thoughts in Doug's memory.\n\nMr. Speaker, I will wanted…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…that  through approved funds, through fiduciary responsibilities of  professionals. This is the right thing to do and the right direction to  go.\n\nMr. HUIZENGA. Mr. Speaker, I will close with this. I appreciate where  the gentleman is coming from. This has been a long debate regarding  some of these issues surrounding what I believe is the core issue.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as I close, I thank my colleagues, including my ranking  member,  Bobby Scott, for this work in a bipartisan way. We have worked  to reauthorize the Congressional Award Act, including…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…me some more breath  and some more time on this planet to try to make sure that we save  this, the last great hope for mankind as President Reagan called it.\n\nMadam Speaker, I will close with this, and I will turn it over, so my  friend from North Carolina can take the floor.\n\nWe are here to represent the American people. The American people did  not…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…defend the police, not defund them.\n\nMadam Speaker, I yield 6 minutes to the gentleman from California  (Mr. McClintock), the lead sponsor of this bill.\n\nMr. STAUBER. Mr. Speaker, I will close by saying that 2 weeks ago, in  the One Big Beautiful Bill, there were 18,000 law enforcement officers  that were to be hired. Not one of my colleagues on the other…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…we can immediately  get this to the President's desk and get back to doing the business of  the people now that the government is open.\n\nMr. STEIL.  Hageman).\n\nMr. Speaker, before we close, I just want to wrap up a few things  that have been discussed today.\n\nWe were closed as a Federal Government for 43 days because Democrats  in the House of Representatives…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…actions of the President and in many cases the Court  finds the President is well within his rights in faithfully executing  his obligations.\n\nMr. ISSA.\n\nMr. ISSA. Mr. Speaker, as I close, since the ranking member so aptly  named a couple of famous quotes and famous movies, I might call  attention to the line: What we have here is a failure to communicate.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}]