[{"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, I want to speak about the extreme cuts that  have affected the Department of Health and Human Services, the Federal  Drug Administration, the National Institutes of Health, and the Centers…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…of the President's offensive and  cruel post about the tragic murders of director Rob Reiner and his  wife, producer and actress, Michele Reiner, I think it is important to  speak out.\n\nMr. Speaker, may this be the last time America elects a President  devoid of sympathy and compassion.\n\nMay this be the last time that we choose someone so heartless and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698116/president-trumps-offensive-post"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…single Member  of this body to call out and challenge these damaging policies--not  applaud them as some measure of success or even to sanction them by our  silence. We need to speak out, stand up for our veterans. Now is the  time, before the damage escalates and becomes more serious.\n\nI am absolutely anguished and furious about these cuts, which not…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…continue to try to  attempt to bully and silence me, I will remind all of them that I grew  up in Detroit. The more you try to shut us up, the louder we get.\n\nMr. Speaker, as we speak right now, the Israeli Government is moving  to exterminate Palestinians. The U.S.-backed and funded genocide in  Gaza is reaching new levels of horror every single day that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, as the ranking member of the Subcommittee on  Workforce Protections, I rise today to speak about the sweeping set of  proposals from Trump's Department of Labor that threatens worker  safety, fair pay, and basic protections for millions of Americans.\n\nThe Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Some  people think democracy began in 1776, when only White male landowners  had the right to vote. We have been a work in progress, and God is not  finished with it yet.\n\nI speak for Medgar Evers and Malcolm and Martin and for the people in  line in church basements, gymnasiums, and mobile vans who believe in  this country even when this country forgot…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…kill whoever he wants,  whenever he wants, and for whatever reason he wants, all without  accountability under the law to Congress and to the American people.\n\nMoreover, as we speak of the separation of powers enshrined in our  Constitution, over the weekend, the President unilaterally decided to  rename the Department of Defense as the Department of War…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to speak about an issue that  touches every community in this country: mental health.\n\nMore than one in five adults in the United States live with a mental  health illness. These are…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690847/mental-health-solutions"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Yesterday, at this time, Liam Ramos was at his  preschool in Minneapolis, and today, as we speak, he is in a prison  cell in Texas against the will of his parents.\n\nMr. Speaker, what are we doing here?\n\nI am a member of the Committee on Homeland Security, and under the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699355/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…not a time to put your finger up in the air and figure out  which way the wind is blowing, to try to think through what type of  reaction might come from the White House if we speak out against this.\n\nThis is a time for us to stand up together and stand up for each  other and for this institution. And not just right now. It is about:  What credibility…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…backgrounds.\n\nThrough her talent, she has brought visibility, dignity, and  complexity to the lives of Latinos and immigrant families who are too  often overlooked. Her performances speak not only to where she has been  but to who we are. We are resilient, we are proud, and full of  possibility.\n\nOn behalf of Illinois' Third Congressional District, I commend…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…that lives can be saved.\n\nThis is the 2lst time that I have spoken on the House floor demanding  that the Trump administration restore emergency food aid. I will  continue to speak every legislative day until they do it.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692483/funding-for-edesias-plumpynut"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Congress.\n\nPut simply, this bill offers clear advantages for millions of  American workers. AGOA is essential to also protecting U.S. foreign  policy interests in Africa.\n\nAs we speak, China and other U.S. adversaries are trying to undermine  the African Continent to do this kind of work. In fact, Chinese  officials seek to deepen China's commercial ties…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…stability of the West Bank.  I also urge Israel to hold Yinon Levi accountable for his crime. He  should be prosecuted to the full extent of the law. Israeli officials  often speak of their independent system of justice. Impunity for Mr.  Levi's crime and the crimes of other settlers must end. We cannot be  complacent in the face of this deadly violence…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Order hour, along with my  distinguished colleague from Virginia, Congresswoman Jennifer  McClellan.\n\nFor the next 60 minutes, members of the CBC will have an opportunity  to speak directly to the American people during this Men's Health  Month, an issue of great importance to the Congressional Black Caucus,  Congress, the constituents we represent, and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…innovation. We lose local job creation. Oftentimes, we lose a better  price.\n\nThe government should facilitate small businesses and not be a  barrier. Federal agencies should speak in terms that are clear,  consistent, and accessible to the American people.\n\nThe Plain Language in Contracting Act does just that. This bill  creates a level playing field…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691851/plain-language-in-contracting-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "Mr. MESSMER. Mr. Speaker, I rise today to speak about something very  important to me, my family, and the majority of Hoosiers in Indiana's  Eighth District: the protection of the unborn and the 2026 March for  Life.\n\nAs…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…beyond his professional endeavors. He  is a man rooted in community--his circle of friends from square  dancing, church, the fire company, scouting, and his own neighborhood  speak volumes about his caring character and connection to others. He  unites the people of this community and strengthens the bonds that make  living in close-knit towns so special.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…America that is in the womb--except those folks that will be at the  rally will be celebrating the fact that they were born, No. 1, and that  they had an opportunity to be able to speak out for the next generation  of people that so much desires to be born and to have the same  opportunities all of us in this room have: to grow, to learn, to love.  That is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I thank the gentleman from Texas (Mr. Roy) for  the opportunity to speak today, and I think 4 minutes will turn out to  be an appropriate amount of time.\n\nMy colleague on the other side talked about the nature of things  being deadly. I would like…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…weeks. As you can see, he is already distinguishing himself as a vital  voice for freedom abroad and for liberty at home. I couldn't be more  pleased to have him here today to speak on behalf of this resolution.\n\nMr. Speaker, Iran is one of the oldest and greatest civilizations in  history. It was one of the most free, advanced, prosperous, and open  countries…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…larger segment of the population works for the government.  As an elected official, I have noticed in my time that, frequently,  people who work for the government are afraid to speak openly to me  about problems in their field.\n\nMr. Speaker, I am thinking a substitute teacher would be afraid to  give me a campaign contribution because they worked for a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…today, if you are a geek and are watching the 10-year  bond--I was watching it over a period of an hour or so. I saw the 10- year bond move by about 20 basis points. Now, in geek speak, that is a  big deal. Apparently, it has been 5 years. Think about some of the  crazy things that were going on 5 years ago to see that sort of  movement. We are stressing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…foreign branch of such an entity.\n\nMr. Speaker, we gather today to confront one of the most  unconscionable human rights atrocities of our time. It is amazing that  we have to speak about this. It is the State-sponsored, forced  harvesting of human organs.\n\nInnocent people, often prisoners of conscience, are being killed so  that their vital organs can…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…here with me today.\n\nThis National Police Week, I am honored to stand behind our law  enforcement as they keep our communities safe. I am especially proud to  stand  today and speak on behalf of H.R. 2240, the Improving Law Enforcement  Officer Safety and Wellness Through Data Act.\n\nAs I read this bill, one disturbing fact caught my eye: In 2022, 30  percent…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I rise today not just as a Member of Congress  but as the father of two Jewish boys. I speak for all the Jews across  the country, millions of them, who today go to the grocery store, their  jobs, and school and live their lives afraid of what might happen to  them.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…after being in the United States for 10  years or longer. Somali men commit crimes at rates significantly higher  than Americans, and only about half of Somali immigrants can speak  English very well. Again, that is even after being in our country for  over a decade.\n\nThe reality is that Somalia's clan-based society is unassimilable  into American society.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…that the lessons of history are never forgotten.  Therefore, I am proud to recognize April 29 as #EndJewHatred Day, and I  call upon all Americans to condemn Jew-hatred, to speak out against  anti-Semitism, and to work toward a future of respect, security, and  freedom for the Jewish people.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…partnership, Lisa and her team delivered $240 million in  redevelopment that transformed outdated housing into modern  neighborhoods where military families can thrive.\n\nThe results speak for themselves. Nearly 2,000 obsolete units were  replaced, and hundreds more were renovated. New homes were built to  meet the needs of today's airmen and their families.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…wish him all the best in  his next chapter.                        Firefighters Run Toward Danger\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today with a heavy heart not  just to speak but to mourn, to honor, and to demand that we never grow  numb to the unimaginable loss suffered by those who dedicate their  lives to protecting ours.\n\nEvery day, nearly 1…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}]