[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…These are all programs that Congress authorized. Again, these are  programs that Congress authorized, yet the Trump administration is  refusing to release the funds.\n\nMr. Speaker, 10 Republican Senators were brave enough and principled  enough to request with the Democrats that the administration release  these funds for their intended purposes, yet…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Caribbean, edging us closer to a regime-change  war in Venezuela.\n\nThe Trump administration has sent the USS Gerald R. Ford aircraft  carrier, our largest aircraft carrier. Mr. Speaker, 10 percent of our  Navy is in the Caribbean, including destroyers and submarines.\n\nWe have got 15,000 troops in Florida and Puerto Rico, including  marines who are ready for…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698092/we-dont-need-another-regime-change-war"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…providers to choose between following their sworn  oath to care for patients or facing criminal charges. It caused trauma  and suffering that cannot be undone.\n\nIn fact, Mr. Speaker, a 10-year-old rape victim was denied the care  she needed and was forced to flee the State  to get the care that saved her life and her future.\n\nYet, despite all of this, the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…disorder at 18  months. Very quickly, Tiffany and her husband were overwhelmed with  medical bills, doctor visits, therapies, medical equipment, and  hospital visits.\n\nMr. Speaker, 10 hospital visits almost put them into bankruptcy.  Medicaid was a lifeline. Without Medicaid, Wylie's lifesaving  medications would cost $9,000 a month. That is $9,000.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691477/gop-tax-scam-hurts-women-and-families"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…fulfilled its responsibility  to act on behalf of its citizens.\n\nSocial Security is the number one insurance program in the country,  serving over 70 million people. Mr. Speaker, 10,000 baby boomers a day  become eligible for Social Security, and Congress continues to ignore  them and ignore their needs.\n\nShamefully, more than 5 million of our fellow…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…honored to be here tonight on behalf of  the Congressional Black Caucus to commemorate National Minority Health  Awareness Month, but I am also here for personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was  excited. I was expecting a girl. I had placenta previa, so I knew we  were going to have to schedule a C-section. We had…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reversal. The President talks about America First. This is putting  America last in my opinion.\n\nMr. Speaker, I don't know what to say. We have seen this story  before. Mr. Speaker, 10 years ago, Congress removed the ban on  exporting American crude oil. I already mentioned that. Before that, we  were only sending China 420,000 barrels of oil each year.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Security.\n\nI represent Los Angeles. People think it is flossy and glossy, I like  to say. However, I have the third highest Medicaid enrollee district in  the country. Mr. Speaker, 7 of the 10 highest Medicaid enrollee  districts in this country are in California, and some of them are  Republican districts.\n\nI think we all want to know, Black Americans, White…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…friends and  former colleagues, Brad Wenstrup and Earl Blumenauer. It is common  sense mainly because, as you heard from the chairman, chronic disease  is so common.\n\nMr. Speaker, 6 in 10 adult Americans have a chronic disease, which is  the leading cause of disabilities in the United States of America. Mr.  Speaker, 90 percent of our annual health spending…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Nation's Capital,  and when Washington moved to the President's house near Independence  Hall in 1790, he brought with him eight slaves from his Virginia  plantation.\n\nMr. Speaker, 10 years earlier, Pennsylvania had begun to abolish  slavery, allowing slaves brought to the Commonwealth by residents of  other States to claim their freedom if they lived…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, 10 years ago today, our Nation made a  remarkable step toward equality with the legalization of gay marriage.  This was a day that came after decades of advocacy by individuals…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693017/fighting-for-lgbtq-rights"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, with only 10 voting days left in this year's  calendar, Congress must act if we are to avert a full-blown healthcare  crisis. I rise today to bring attention to the affordability…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Now, we are being cruel and dismissive of their  needs.\n\nOne in five Medicaid enrollees has a disability. Two-thirds of  Medicaid enrollees do not receive SSI benefits.\n\nMr. Speaker, 10.3 million people would lose Medicaid coverage in the  next 10 years if the budget reconciliation bill of the Republicans  passes because of its punitive work requirements.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…why I am behind Maryam Rajavi. We know from our own history  that when people rise for freedom, the greatest thing the free world  can do is stand beside them.\n\nMr. Speaker, she has a 10-point plan. I will read that 10-point plan.\n\nOne, rejection of the velayat-e faqih, absolute cleric rule:  affirmation of the people's sovereignty in a republic founded…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…centers as they are looking at asylum, then they go into the  country. That means they might not have a court case for a few years.\n\nLet's just think logically here, Mr. Speaker, there are 10 million  people.\n\nHow many judges, lawyers, public defenders, bailiffs, and other folks  do you need to actually have 10 million court cases in their version of  due…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…FMF controlled 139 places of worship in France and  a further 68 affiliated--in all, around 7 percent of the total. The  organization ran some 280 associations.\n\nMr. Speaker, 7 out of 10 French voters would back a ban on the  Islamic veil in public because of what is happening in France.\n\nIn the United Kingdom, Muslims are increasingly turning to Britain's…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…as a ``Ghostbusters'' character once put it.\n\nWhat is the actual number of layoffs at Yosemite National Park that  will bring the beautiful valley to rack and ruin?\n\nMr. Speaker, 10, the number is 10 probationary employees, 10 out of  nearly 500 full-time winter employees, 25 if you include early  retirements and no firefighters.\n\nThis begs some important…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…program be healthier. The model was it was going to come  in at 95 percent of fee for service.\n\nToday, it comes in at 120 percent of fee for service. That 25  percent, Madam Speaker, over 10 years is $2 trillion. When we show a  chart like this of the transition that has been happening for  traditional fee for service Medicare to now Medicare Advantage, fine,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…petitions to the USPS that are rarely approved. If their  petition is denied, then they are forced to wait up to 10 years before  they can even reapply, 10 years, Mr. Speaker.\n\nThat is 10 years of lost opportunities, 10 years of misdirected mail,  and 10 years of unnecessary risks to public safety.\n\nThis is not the kind of government our constituents…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion over 10 years of  just interest. The theater around here is about telling stories. It is  emoting the emotion, but damn it, does anyone own a calculator?\n\nMr. Speaker, what was it, 10 days ago, 2 weeks ago, Moody's  downgraded the United States and part of the point--because I know we  all read it because it was such a big deal. You subscribe to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, on May 10, 2025, the Fourteenth Annual  Footsteps in the Sand Kidney Walk took place in Cocoa Beach.\n\nThis event this year raised $22,000 for kidney patients in need.\n\nToday, I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691332/fourteenth-annual-footprints-in-the-sand-kidney-walk"}]