[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…haven't come to Washington, D.C., he has put  banners of his picture up on Federal buildings. He is proposing to put  his likeness on gold coins.\n\nMs. CASTOR of Florida. Mr. Speaker, I think you get my drift here. It  was so galling as people are trying to pay their electric bills and  their grocery bills that the President here is bragging about how he  has…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…worker  as a tipped employee, even if they receive small or occasional tips.  This means lower wages for everyday Americans who are struggling daily  with higher costs.\n\nMr. Speaker, think of a restaurant worker who both waits tables and  covers with some back-of-the-house shifts. This legislation would allow  her employer to average her tipped wage from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…doing such a great job with efficiency, and if that was  their goal, clearly they ought to be able to come before Congress and  testify as to what they have found.\n\nMr. Speaker, I think every American should be aware that what is  really going on here is an attempt to get at your data and your  information and to further attempt to privatize Social Security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…funding that food banks  and local schools utilize to purchase food at farms, and they are  leaving our neighbors and kids with fewer healthy, affordable options.\n\nMr. Speaker, I cannot think of a more American program that serves  our communities, and that is why I will continue to fight for our food  banks and our neighbors.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691898/food-bank-cuts"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…register using those  two pieces of information. She would have to get an additional piece of  documentation to register, which is not identified in the SAVE Act.\n\nMr. Speaker, I think we have talked about it at length. This is  clearly intended to make it much more difficult. According to House  Republicans, none of these women should be allowed to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…fires back at Elon. The online battle  begins.''\n\nElon Musk says: ``Such an obvious lie. So sad.''\n\nWe are all sad, right? It is always sad when a relationship ends.\n\nMr. Speaker, I think this is when things really got heated. This is  why things are really hard when there is a breakup and there is a love  triangle with the GOP. That is these guys over…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…order  that was being led by the United States of America. So many remarkable  things came about within our own country and around the world from  American leadership.\n\nMr. Speaker, think about what we were able to do with the auto  industry, that arsenal of democracy, that engine of our military might,  the Rosies who filled in because the men were away,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…whenever final deals were made with their  Members. Yet, Republicans are deliberately choosing to meet at 1  o'clock in the morning on something this consequential.\n\nMr. Speaker, I think the gentleman thinks it is a good idea. The  gentleman says that I will use my time and try to take every moment I  can to make my points. I can say to the gentleman:…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…provide adequate treatment, and  education. It is also to prevent the drugs from coming into the country  but not just to put people in jail and throw away the key.\n\nMr. Speaker, I think House Republicans know that we can't simply  schedule our way out of this crisis, but they have refused to pass  bipartisan solutions that address prevention, treatment,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…legacy that we leave for every governing body that holds this space for  years to come.\n\nMr. MORELLE. Madam Speaker, I yield myself the balance of my time to  close.\n\nMadam Speaker, I think for all the reasons that have been described,  this is an important part of maintaining the history of the last 250  years and making certain that we preserve this so…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. Speaker, I think I have heard that story before that this is all  about drugs. If I recall correctly, the former President of Honduras  probably put more drugs in the United States than…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…offshoring  our manufacturing. This had never been an option for me, but these  changes imposed on American businesses make it extremely difficult to  manufacture here.''\n\nMr. Speaker, think about that for a moment. The President's tariff  policy, which he alleges is meant to drive domestic innovation and  manufacturing, is causing a small but mighty business…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that at this  point with the permits that have already been approved that the  Europeans or any of our allies have to worry about not getting enough  LNG from us.\n\nMr. Speaker, I think it makes sense to ask the Department of Energy  to keep an eye on this to ensure that all these exports are actually a  good thing and are in our public interest: For…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I think it is incredibly shameful that my  Republican colleagues want to gut the rule that capped most credit card  late fees at just $5.\n\nCredit card companies over the people…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689837/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…decide which residents are fit to govern on local  D.C. matters. I promise the gentleman that if he spoke with his own  constituents, they don't give a damn.\n\nNorton).\n\nMr. Speaker, I think it is interesting because the gentlewoman who  just spoke said this is about preserving ``our elections.''\n\nThis is not about our elections. It is not about my election.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I think it is important to set the scene in  contrast to some of the revisionist history that Democrats seem to be  talking about today.\n\nThe definition of a showerhead was outlined…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…nine different domestic and foreign car dealerships across east  Tennessee. At the age of 90, he still continues to go into the office  three to four times a week, Mr. Speaker. I think Congress could learn a  lot from his work ethic and dedication to his community.\n\nRoscoe is also a NASCAR fanatic and never missed a race at Bristol  Motor Speedway from…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692873/happy-90th-birthday-to-willis-roscoe-bowman"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…will allow for the deployment of undersea  cables while providing appropriate protection of our marine resources.  I urge my colleagues to support the legislation.\n\nMr. Speaker, I think it is important that we understand exactly what  is going on here. If you look at this map, this is an example along the  California coast. These pink areas are national…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you  need 104 percent of their lifetime earnings just to pay Federal pension  obligations. Those are Social Security, Medicare, military, and Federal  requirement.\n\nMr. Speaker, think of that. For a child born today, you need every  dime they will ever make in their entire life, plus another 4 percent,  to pay pension obligations. Does anyone see the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…support the passage of  the rule and then the underlying bills.\n\nMr. Speaker, first, I am going to take up the economy.\n\nDo I wish the economy were better, Mr. Speaker? Absolutely.\n\nDo I think the economy is better today than it was under the Biden- Harris administration? Absolutely.\n\nDo I think the economy is better today with the Republicans in  control…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…be 37 percent when we pass this bill.\n\nThat is not a tax cut. Get it straight. They are on the same level.  They are in a situation where they are paying high taxes. Mr. Speaker,  think about 37 percent. Thirty-seven percent of every hour and 37  percent of every dollar you earn goes to the government in that regard.\n\nThere is no tax cut for the rich.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Mr. Speaker, I view that as insane. We should be making sure that  only U.S. citizens are voting in U.S. elections. You will hear  arguments about it is burdensome.\n\nMr. Speaker, I think it is absurd that we are protecting beer more  than we are protecting ballots. You have to show a photo ID when you go  in to buy a six-pack of beer. You should have to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…significant  curtailment in production at certain facilities of tires made in the  United States. It is our job as Members of Congress to prevent this  travesty.\n\nMr. Speaker, I think that the arguments that we have made have now  worn out. We have used up the mileage on these arguments. Now, we get  to vote ``yes,'' and voting ``yes'' is where the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…birthday.\n\nHappy birthday, Joseph.\n\nMr. Speaker, I rise today to wish my incredibly talented nephew  Matthew Martino a wonderful 18th birthday.\n\nHappy birthday, Matthew.\n\nMr. Speaker, I think that is enough birthdays.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689632/birthday-blessings"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is a man who lived under  socialism. He lived through the Communist regimes of Stalin and Eastern  Europe and of Nazi Germany. He talked about the road to serfdom. Mr.  Speaker, we think of some of these policies potentially as the scenic  route to socialism.\n\nHe is someone who  understands market capitalism and a constitutional Republic like no  other…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I think it is important to hear from  legislators on the experiences they had before this week as they toured  their district and as they talked to normal people to see whether…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…around in  their Teslas. It is the rich folk who are getting their EV tax credits.  I see it. They are not in east Austin. They are out in the rich parts  of Austin.\n\nMr. Speaker, do you think that is an accident? Do you think the  hardworking plumber I represent in San Marcos, Texas, in New Braunfels,  Texas, or any other part of Texas is going to go out…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a step in that direction to support that goal. I  thank my friend from California (Mr. Sherman) for his comments in  support of the bill.\n\nThe gentleman is right, Mr. Speaker. I think we have all learned in  our lives that intelligence and wealth aren't directly correlated. This  is another example of that, where people are held back from their  ability…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…money that should have been going to people  who needed the help.\n\nLook, if we don't get an alignment of policy, the cost, and how these  things can actually work, Mr. Speaker, I think we are going to continue  to live in this world where our debates mean nothing here. They are  just based on feelings, exploitation of our voters, telling them things…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Madam Speaker, I think it is important that the Chair  and the public know that there are always debates going on in this  building that will determine how the big, beautiful bill is sent to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]