[{"senator": "Al Green", "party": "Democrat", "sentence": "…speak truth to power, to  speak it in a righteous way, to have the courage to do all that I can  to protect all of  Your creation. I ask You to give me the strength as I speak today to  talk about the circumstances that have created concerns that have to be  addressed. I beg that You would give me the strength in Your name, by  whatever name I make…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…testimony at senate global health roundtable\n\nGood afternoon Ranking Member Shaheen and members of the       Committee. Thank you for giving me the opportunity to speak       with you today about the impact of the recent terminations of       global health programs.\n\nMy name is Dan Schwarz, I grew up in a small town in       Appalachia and am a practicing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…for the fifth time to bring  attention to the Trump administration's failure to restore funding for  food aid for malnourished children, despite their promise to do so.\n\nI speak today about the biology of hunger. A 2-year-old child may  weigh the same as a newborn. Their bodies stop growing. Their immune  systems shut down. They lose the ability to walk…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…could be spending       on other things that are actually, hopefully, much more       productive.\n\nI could not agree more with what President Trump said. It is why I  want to speak today about the soon-to-expire New START treaty and the  very real possibility of a new nuclear arms race, something that  neither the President, the Vice President, nor any other…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I rise to speak today on important  public policy issues related to my State's economy and appreciate the  opportunity to follow our senior Senator, Senator Murray, who is  articulating the impact…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "Mr. MANNION. Mr. Speaker, I thank Representative Rivas for her  leadership on affordability and giving me the opportunity to speak  today.\n\nAcross central New York and the Mohawk Valley, people are worried,  and they have every reason to be. Grocery prices are going up.  Healthcare costs are rising. Energy…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…ideals of equality, justice, and the pursuit of  liberty.\n\nWe are at a crossroads, a critical juncture where the direction we  choose will define the future of this Nation. I speak today about the  persistent and harmful attacks on diversity, equity, and inclusion  policies and how these attacks, particularly under the leadership of  the President of the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I thank my generous colleague for allowing  me to speak today.\n\nAs Members of Congress, we are elected to champion the voices of our  people and pass legislation to make their lives better. Instead, House  Republicans are using their…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690938/gulf-of-america-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…tragedy that has had a profound and lasting impact on our community and  our Nation.\n\nThis week, the families of the victims are here on Capitol Hill, and  I got to speak with them today. They have one message for us: Pass the  ROTOR Act.\n\nThe ROTOR Act addresses the glaring holes in aviation safety around  DCA that allowed this completely preventable…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the members of the Committee on the Judiciary  for unanimously supporting this bill in markup. I am grateful for my  colleagues who have all risen to speak today and to the ranking member  and leadership on the other side that have worked together with us.\n\nMr. Speaker, I urge swift passage of my legislation, the Child  Predators…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "Mr. HICKENLOOPER. Mr. President, I speak today to echo the sentiments  of my fellow Members of the caucus. This is a moment where, at least in  Colorado, we hear stories every day of people faced with the challenge…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…businesses alike miserable. The cost of living  is climbing already, and the economic stability many workers have  worked so hard to achieve is being undermined, as I speak.\n\nNow, today's news that the stock market took a major nosedive across  the board is serious. The Dow is down 900 points, the worst market  outcome of this year. But it isn't just…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…dangerous, dangerous ambition  because our country deserves better than this administration's  recklessness and our children surely do as well.\n\nThank you for allowing me to speak here today, and I hope this will  be a moment when we come together and fulfill the demands that our  Constitution requires of the people fortunate enough to serve in this  body.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…as to what the Trump administration is going to do from one moment to  the next. I am going to talk about this plane from Qatar toward the  end.\n\nMr. Speaker, I want to speak today about my deep concern about the  appropriations and budget processes as established by the Constitution  because they are broken. I rise out of deep concern for our  institution,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…as committed to free  speech as we might be. But, historically, we have not persecuted and  jailed those journalists who dared challenge the government.\n\nAnd so I chose to speak today partly because of the event of Jimmy  Lai being sentenced and partly because of a growing concern that we are  at risk of wasting, of watching slip from our grasp, that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…When my birth mother became pregnant with me, she faced an incredibly  difficult choice--a choice that I know thousands of women across our  Nation are facing even as I speak today. Her husband had passed away,  and she was already raising two young boys. After starting a new  relationship, she found herself pregnant with me. Money was tight. She…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…a member of the Committee on Education and  Workforce.\n\nMr. WALBERG. Mr. Chair, I thank the gentleman for his comments.\n\nMr. Chair, I thank my colleagues who have come to speak today on such  an important matter regarding not just higher education but national  security.\n\nInternational collaboration is not inherently bad, but foreign  nations have been…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, eastern Washington and Spokane are home  to many heroes and champions, but I would like to speak today of one  particularly exceptional young man, Brycen Phillips of Mt. Spokane High  School.\n\nBrycen was named a two-time U.S. Paralympics Track and Field High  School All-American,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…about these issues because they create peace and security in  the Middle East. Ultimately, that leads to peace and security here in  the United States.\n\nIt is my honor to speak here today to support the gentleman and his  resolution. We must do everything we can to get these lunatics out of  power and allow the great Persian people, where many say civilization…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I thank the gentleman from Texas (Mr. Roy) for  the opportunity to speak today, and I think 4 minutes will turn out to  be an appropriate amount of time.\n\nMy colleague on the other side talked about the nature of things  being deadly. I would like…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]