[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I congratulate the 451 graduates of  John Champe High School's class of 2025.\n\nThis class has a lot to be proud of. In their time as Knights, the  girls' soccer team made history…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…citizens, for  the community of the City of Orange. I congratulate him on a well- deserved retirement, and I look forward to seeing the next chapter in  his life.\n\nMr. Speaker, I congratulate Tom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694968/recognizing-tom-kiesla"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…of running with her already busy life as an  occupational therapist, wife, and mother of two. I am truly amazed by  Leslie's dedication, stamina, and drive.\n\nMadam Speaker, I congratulate Leslie on this remarkable achievement.  She has made our district proud.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694050/congratulating-leslie-rook"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…leadership when they see it. Chief  Stephens' service reflects the very best of Delaware: commitment to  neighbors, courage under pressure, and a heart for giving back.\n\nMr. Speaker, I congratulate Chief Stephens and thank him for stepping  up, once again, this time to lead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…celebration.\n\nThis win is not just a triumph for the team; it is a moment of pride  for owner Art Silber, his family, and the entire Fredericksburg  community.\n\nMr. Speaker, I congratulate the Fredericksburg Nats on the  unforgettable season and championship well earned.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690055/congratulations-to-the-fredericksburg-nationals"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Orange County.\n\nDuring Small Business Week, I am honored to congratulate him on this  well-earned award and recognize him as this week's Constituent of the  Week.\n\nMadam Speaker, I congratulate Joe and offer my best wishes to him on  continued success.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690866/constituent-of-the-week-joe-clontz"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I congratulate Dearborn's Divine Child High  School for winning the Division 4 State championship with a thrilling  23-22 win.\n\nAfter a dominant season, they rose to the moment at…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…partnerships  that benefit Charlotte and North Carolina.\n\nI am also proud to see her work recognized as Charlotte Business  Journal's 2025 Business Person of the Year.\n\nMr. Speaker, I congratulate Chancellor Gaber and the entire UNC  Charlotte community on the transformative impact the university has had  on Charlotte-Mecklenburg and our State.\n\nThis is a proud…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699375/recognizing-chancellor-sharon-gaber"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate BAPS Charities  and the BAPS Temple in Chantilly for hosting its annual walkathon at  One Loudoun in Ashburn.\n\nThe walk, which I was proud to join, was a huge…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691837/congratulating-baps-charities-and-baps-temple-walkathons"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…this  year's competition.\n\nIt was such a joy to meet many of California 31st District's bright  young artists and hear about the impact art has on their lives.\n\nMr. Speaker, I congratulate Marely again and all the students who  submitted their artwork. I am so proud of each and every one of them.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…first-ever division championship. Thanks to their strong  defense, aggressive offense, and dedicated coaching staff, the  Colonists again earned a well-fought victory.\n\nMr. Speaker, I congratulate Anaheim, which has again made us proud.                     Recognizing Max Madrid's Retirement\n\nMr. CORREA. Mr. Speaker, today, I rise to celebrate the retirement…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…ensured the readiness of the West Covina Fire  Department and made the firefighters and the community a top priority.  That community is safer because of his work.\n\nMr. Speaker, we congratulate Mr. Fountain on an incredible career and  a well-deserved retirement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…From working  with local Scout groups to supporting investments in our future water  supply reliability, MWDOC has truly impacted every life in Orange  County.\n\nMr. Speaker, I congratulate MWDOC on its 75th anniversary.                          recognizing le dinh luong\n\nMr. CORREA. Mr. Speaker, today, I rise to recognize the birthday of  Vietnamese…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…dedication to his community's safety.\n\nChief Colucci is a true public servant. Indiana Township and western  Pennsylvania were lucky to have his decades of service.\n\nMr. Speaker, I congratulate Chief Steven Colucci on his well-deserved  retirement. I wish him the best in his next chapter and thank him for  his service.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…need to improve public safety, create well-paying jobs, and expand  economic opportunity for Elmwood Park and across Illinois' Third  Congressional District.\n\nMr. Speaker, I congratulate Elmwood Park for these 111 years of  community. I look forward to many more years of partnership and to  continue to fight in the Halls of Congress for every constituent…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…safe  haven in Venezuela.\n\nSpeaker Pelosi in 2019 ended her round table comments with a  resounding: ``It is clear Maduro must go, the sooner the better.''\n\nMadam Speaker, you should congratulate President Trump. Instead, what  did she say: ``Venezuela is ruled by an illegitimate regime, but the  administration has not made the case  that an urgent threat…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…respect, and devotion to duty. I am incredibly proud to  represent them and PSU 308 in Congress. Their service makes our Nation  stronger and our Gulf Coast proud.\n\nMadam Speaker, I congratulate and thank BM1 Walker and MK1 Lang for  their service.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690914/recognizing-bm1-bradley-walker-and-mk1-james-lang"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Farris is not only a great businessman; he is in my  fraternity, Sigma Chi. He is also even a better member of his  community, helping anyone and everyone he can.\n\nMr. Speaker, I congratulate my dear friend, Johnny Wayne Farris, and  thank him for all that he has done for east Tennessee and me and my  family.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698413/recognizing-johnny-wayne-farris"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mary were integral to our victory, as they worked  tirelessly to support men on the front line and ensure the American war  machine operated at peak efficiency.\n\nMadam Speaker, I congratulate Ms. Fine on her birthday and thank her  for her service.\n\nMadam Speaker, I rise to recognize the 20th Anniversary of the USS  Razorback SS 394 being docked on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…has implemented state-of-the-art security  systems.\n\nThroughout his career, he has exemplified what a true healthcare  administrator brings to the equation.\n\nMadam Speaker, I congratulate John on his retirement.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…for carrying out this mission. Their dedication to teaching Fort  Wayne's next generation of leaders is incredible, and our community is  extremely appreciative.\n\nMr. Speaker, I congratulate Carroll High School on this  accomplishment, and I am excited to see the future achievements of  Carroll High School students.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…spirit of service alive.\n\nThe Leechburg Rotary Club has helped build more than infrastructure.  They built a sense of community, and for that we are grateful.\n\nMr. Speaker, I again congratulate Leechburg Rotary on a century of  service.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692828/leechburg-rotary-club-celebrates-100-years-of-service"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I congratulate President Trump for his  successful State of the Union Address last night.\n\nWith Republicans' help here in Congress, we have worked nonstop to  bring down costs and…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700206/congratulating-president-trump"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Berry College exhibits the best of private education, providing  students with limitless opportunities to pursue their academic and  professional aspirations.\n\nMr. Speaker, I congratulate Berry College for elevating the standard  of higher education in Georgia.            Recognition of NFA Burger, the Best Burger in Georgia\n\nMr. CARTER of Georgia.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…victory. It is a legacy, and it speaks to  what young women in sports can accomplish when they believe in each  other, never give up, and have a level playing field.\n\nMr. Speaker, I congratulate Coach Elizabeth Maus, the players, and  the entire Davenport Assumption community. They have made their sport,  their school, and their State proud.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…unwavering support for small businesses  across the Nation.\n\nPennWest Clarion SBDC continues to be a significant force for growth,  innovation, and local prosperity.\n\nMr. Speaker, I congratulate the entire team on their well-deserved  recognition and continued service to the Commonwealth of Pennsylvania.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Association, and the Georgia Department of  Natural Resources. His commitment to education and fondness for  learning has made a lasting difference in Savannah.\n\nMr. Speaker, I congratulate Mr. Eswine on a well-earned retirement.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and upholding tradition.\n\nThis club is a shining example of the best that North Carolina has to  offer. Its 100-year history is a testament to that simple fact.\n\nMr. Speaker, I congratulate the Leakesville Garden Club and its  members on this historic milestone. Here is to another 100 years.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688345/recognizing-leakesville-garden-clubs-centennial"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…follow.\n\nOn behalf of the community and as his Congressman, I commend Marlon  Lawrence for his exceptional contributions, and I thank him for the  example he sets.\n\nMr. Speaker, I congratulate Marlon on this well-deserved recognition.                   Honoring the Life of Ms. Elizabeth Pryor\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Patrick  Greisen, who set the Division 2 record for total passing yards in a  championship game, an extraordinary achievement on an already memorable  day.\n\nMr. Speaker, I once again congratulate the team on this  accomplishment, and I look forward to seeing many more championship  wins in their future. I am proud to recognize this talented team, and I…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}]