[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…player  until gun violence took his life at 11.\n\nZahmire Lopez, he had dance moves and rap skills until gun violence  took his life at 8.\n\nMrs. WATSON COLEMAN. Mr. Speaker, I thank my colleagues for co- anchoring this very important Special Order hour.\n\nMr. Speaker, every 7 hours, a child is killed by gunfire in the  United States. Thus far in 2025, nearly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Madam Speaker, I thank my colleagues for their words of  support today for the FAST VETS Act.\n\nMadam Speaker, I rise today to speak in strong support of the FAST  VETS Act, Focused Assistance and Skills…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…stand united with our allies,  uphold our commitments to global peace and stability, and lead with  strength, diplomacy, and integrity.\n\nMs. HOULAHAN. Mr. Speaker, I very much thank all of my colleagues for  joining us and meeting here tonight.\n\nThis evening, we heard about the damage that President Trump's  actions have done to our Nation's security.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, I thank my colleagues for supporting this  legislation, especially my good friend and workout buddy from Arkansas.\n\nI urge support for my bill, H.R. 2215, the Salem Maritime National…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…longer happen again. It protects  taxpayer dollars, ensuring that they go where Congress intended: only  to the legitimate small businesses of our country.\n\nMr. Speaker, I thank my colleagues for bringing this forward.  Government efficiency is a good thing, but there is a right way to go  about it and a legal way to go about it. This bill is a great…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…made for our country, but as Congress, it is our  responsibility to make sure we do all we can to ensure that they have  what they need when they return home.\n\nMr. Speaker, I thank my colleagues of the Congressional Black Caucus  for their commitment to supporting our  Nation's veterans and for recognizing the role that Black veterans play  in American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…should  actually support it.\n\nThis bill will not solve every challenge that parents face, but it is  a meaningful step toward a more family-friendly future.\n\nMr. Speaker, I thank my colleagues on both sides of the aisle for  their support of this bill. In particular, I thank the gentleman from  New Jersey (Mr. Van Drew) for working to introduce it with…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…We absolutely and collectively all must have the oversight and the  understanding of what is going on in Venezuela and the attacks in the  open Caribbean.\n\nMr. Speaker, I thank my colleagues for the opportunity to serve.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Ms. KELLY of Illinois. Mr. Speaker, I rise today in recognition of  Minority Health Awareness Month.\n\nMr. Speaker, I thank my colleagues, Congressman Clyburn and  Congresswoman McClellan, for holding this Special Order hour to bring  attention to our country's health disparities.\n\nAs chair of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…STEVENS.  1534.\n\nMs. STEVENS. Mr. Speaker, I also have no further requests for time to  speak on this bill, and I yield myself the balance of my time to close.\n\nMr. Speaker, I again thank my colleagues from the committee, Mr.  Miller and Mrs. Foushee, for their work on this bill. I urge a ``yes''  vote on H.R. 1534.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I thank my colleagues for considering my important  legislation, the Great Lakes Mass Marking Program Act, today.\n\nI thank my friends, Representatives Huizenga and Walberg, for their…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank my colleagues of the  Congressional Black Caucus for their remarks on an issue that is  pressing and timely for all of us. I really appreciate the ways in  which so many of you…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Madam Speaker, I thank my colleagues, Ms. Stevens and Mr.  Subramanyam, for hosting this Special Order hour. Their leadership is  much needed, and I appreciate them.\n\nMadam Speaker, I rise today because…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Speaker, I thank my colleagues for their kind words of  support. I, too, am rising today in support of this bill, H.R. 972,  that I brought before you. It is the Sloan Canyon Conservation and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…as he may consume to the  gentleman from Florida (Mr. Fine).\n\nMr. SCHMIDT. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I thank all of our colleagues who have engaged in this  discussion today on both sides of the aisle for their remarks. This is  an issue that, although we go off on particulars from time…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…burden on our Nation's power grid. By passing the MERICA  Act, we would take the commonsense step to utilize Federal lands to  their full and utmost potential.\n\nMr. Speaker, I thank my colleagues very much for their consideration.  For the sake of America's security, I urge all of my colleagues in this  august Chamber to support H.R. 3872.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…construction and development loans. That means lower home prices, more  homes, and more access to the American Dream of homeownership for the  American people.\n\nMr. Speaker, I thank all of my colleagues--most of my colleagues for  supporting this bill tonight, the Housing for the 21st Century Act.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…officer, or go into the military, but that game  changed my life. I made a lot of money. This Congressional Gold Medal  will be the cherry on top for our team.\n\nMr. Speaker, I thank my colleagues for their unwavering support to  get this across the finish line. It was 40-plus years since they did  that, and 3 weeks, 2\\1/2\\ weeks before these games, the Soviets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…harmful practice.  I am pleased with the widespread and bipartisan support for it, and I  urge my colleagues to support the Combating Online Predators Act.\n\nMr. Speaker, I thank my colleagues for their thoughtful debate and  for their support on this important issue. This legislation addresses a  clear and dangerous gap in Federal law that predators…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addressing the serious fire  hazards they pose.\n\nTragically, defective batteries, particularly those imported from  China, have already claimed too many lives.\n\nMr. Speaker, I thank my colleagues, Representative Torres,  Representative Langworthy, Representative Clarke, and Representative  Garbarino, for their bipartisan leadership to protect consumers and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690261/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…The report would also require the VA to publish the total number of  prevalent causes and manners of death among these veterans to better  identify trends.\n\nMr. Speaker, I thank my colleagues for their work to ensure that the  VA continues to develop the tools it needs to effectively deliver  benefits. I urge all of my colleagues to support H.R.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I rise in support of H.R. 3351, the  Improving Access to Small Business Information Act.\n\nMr. Speaker, I thank my colleagues on both sides of the aisle,  Representatives Kim and Gottheimer, for their work on this commonsense,  bipartisan piece of legislation that will give Americans,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…tools to keep our communities  safe and our first responders out of harm's way.\n\nInnovation should be rewarded, not stifled, and this bill does just  that.\n\nMr. Speaker, I thank my colleagues, Congressman Correa, Congressman  Schweikert, and Congressman Stanton, for their leadership on this issue  over the last two Congresses.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…neighbors, and House Republicans  are continuing to pass legislation to support and equip our law  enforcement officers to best serve our families and communities.\n\nMr. Speaker, I thank my colleagues for joining me tonight to talk  about these important topics.\n\nTo do that, I will kick it off right by yielding to the gentleman  from Utah (Mr. Owens), my good…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. I have no more speakers, Mr. Speaker, and I continue  to reserve the balance of my time until the gentleman yields back his  time.\n\nMr. BAUMGARTNER. Mr. Speaker, I thank my colleagues, Representative  Castro and Representative Kim, for introducing this important bill. I  urge my colleagues to support it, and I yield back the balance of my  time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…global threats are ever-present, particularly in the  Arctic, Congress must ensure our military can train as they fight. H.R.  5131 accomplishes exactly that.\n\nMr. Speaker, I thank my colleagues on both sides of the aisle for  their support, and I urge all Members to join me in voting ``yes'' on  this important legislation.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…an enormous amount of global  headquarters for big, multinational firms. It is a ton of small  businesses. I thank the gentleman for highlighting that.\n\nMr. Speaker, I thank my other colleagues for being here to discuss  the goings-on for this week. We have heard so much about the  reconciliation process and the dangers of not getting this done. There…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…representing that amazing State. I thank him for his shared words.\n\nYes, we know the horses. We get it. There are horses. It is a big  thing down there.\n\nMr. Speaker, again, I thank my colleagues for being here to share  their perspectives as we look back on some of the significant wins that  we have experienced over the course of the last year. I wanted…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}]