[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise to voice a concern from my  constituents, Jeff and Bev.\n\nLast week, Trump's billionaire Commerce Secretary was speaking with  another billionaire about how only fraudsters would complain about  missing a Social Security check. Trump's billionaire Commerce Secretary  said that if Social Security…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689244/millions-depend-on-social-security"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…conversation that you are having  on behalf of the American people, I want to say thank you. Thank you  for your courage, for your conviction, and for your tireless leadership  in speaking up today on behalf of all that is going on across America  and around the world but especially what is impacting your  constituents.\n\nIf I am not mistaken, Senator Merkley,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleagues to join us in opposing these nominees. Mr. Bove  should not be before this body, and I hope my colleagues will recognize  the importance of standing strong and speaking out and voting against  his nomination and the others that have been made.\n\nMr. President, I yield to the senior Senator from Illinois, the  ranking member of the Judiciary…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…first 100 days of the second Trump  administration, and on behalf of my constituents in Georgia and an  ever-growing number of American people, I am here tonight to continue  speaking out against the chaos, the division, and the indefensible  hatred that is being sown by this President and this administration.\n\nJust over 100 days in and the American people…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…sure that the money reaches frontline organizations that are  doing the hard work on the ground. This is lifesaving work that they  are doing, with efficiency and integrity.\n\nSpeaking as a beneficiary of the good works done as a result of the  existence of the Crime Victims Fund and a proud cosponsor of H.R. 909,  there is truly an urgent need to pass this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…explain  that. But I just want to tell you what John Lewis said. It is a quote  so many people know. He really spoke not to Members of the Senate or  the Congress; he was really speaking to Americans. He said:\n\nGet in good trouble, necessary trouble, and help redeem the       soul of America.\n\nJohn Lewis died in 2020, in July, at a time that--it was Donald…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…home State of Massachusetts in reducing the  number of opioid-related deaths. We can point directly to some of these  programs that have made a real difference, but as we are speaking right  now, these things are being undermined. That is what has us so upset.\n\nI mean, let's make no mistake about it. We, in a bipartisan way,  moved these programs forward…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…protesters in Los Angeles or when he similarly threatened  Chicago and Portland before he was stopped by the courts. We have even  seen it in this Capital City, where I am speaking today, when  he forced troops to carry rifles around the quiet streets of our  Nation's Capital.\n\nNow we are witnessing it stretch from DC to the Caribbean Sea as  Trump is,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…place for       family, friends, food, laughter, and memories made. She was a       surrogate mother for the phalanx of people who always walked       through her front door. Speaking for my cousin Nina and I, we       so wish we could have been flies on the wall at one of those       legendary gatherings.\n\nIt is said that there's a special place in heaven…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…jobs in the Tri-Cities to get  this post-World War II job done.\n\nWhen Secretary Wright testified in the Senate Energy and Natural  Resources Committee, he said, ``Senator,'' speaking to me, ``I can't  overstate how critical I think it is to finish the job, finish the  cleanup at Hanford. Hanford gave a lot to this country, and we left a  mess that needs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…incredible injuries that none of us-- none of us can imagine what it is like.\n\nYou are so special.\n\nIt is amazing to be her colleague, isn't it? It really is.\n\nBut what you are speaking about is so profoundly moving to me because  you understand better than any of us ever can how significant a  decision it is to go to war. You experienced it. You have seen,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…when I  say Congress, I really mean my Republican colleagues. Democratic  colleagues, please understand this does not refer to you.\n\nMy Republican colleagues know that I am speaking the truth. They know  that the President should not be declaring war without us. Maybe there  would be a majority of us who would say yes, let's go to war. Until  that happens,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the content of their  programming. It declares that no American--whether a comedian, a  journalist, an ordinary citizen--should ever have to fear government  retaliation for speaking their mind. And it doesn't make any difference  whether you are a Democrat or Republican, whether a Democrat doesn't  like what a Republican said, whether a Republican doesn't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…been censured. Censured, but not silenced.  Censured, but not silenced.\n\nI am proud today to take up this cause of Black history in Black  History Month.\n\nMr. Speaker, in speaking of legacies that have been stolen, we  annually honor General Gordon Granger for going into Galveston and  informing the enslaved persons there that the Emancipation Proclamation…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Look, I don't know what all happened, but Federal  agents took him down--took down a U.S. Senator--saying that they are  doing their job.\n\nWhy aren't more people down here speaking up about this nonsense?\n\nThis is ridiculous. I would use some other language, but I would  probably get tossed off the floor right now.\n\nGrowing up on a small farm and cleaning…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…refused to surrender to hopelessness. He spoke  truth when others stayed silent. He strengthened resolve when others  faltered. He understood that a single courageous leader speaking  plainly, boldly, and without apology could ignite the moral energy of  millions.\n\nWe are seeing that in Maryam Rajavi right now, and I will talk more  about that in just…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…will end either with  thousands, perhaps millions, dead in a terrible war or with a  successful revolution and the long-overdue collapse of this regime.\n\nThe President is speaking out forcefully, and he is acting  decisively. So must Congress.\n\nH. Res. 166 has 224 cosponsors, representing both political parties.  It expresses support for the Iranian…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, William Shakespeare asked: ``What's  in a name? A rose by any other name would smell just as sweet.'' He may  have been speaking about the flower, but, Mr. Speaker, he could very  easily have been talking about the One Big Beautiful Bill Act because  no matter what you call it, its impact is just as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…President Trump and the  DOGE team to identify and eliminate wasteful government spending.                       End Misuse of Emergency Spending\n\nMr. STUTZMAN. Mr. Speaker, speaking of spending, outside of wasteful  spending on international aid and public media, Congress has another  problem contributing to the national debt: emergency spending.\n\nOver…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…apparently  means nothing to him.\n\nMr. MAST. Mr. Speaker, I thank Representative Issa for his remarks,  and I believe there will be another Representative from California  speaking on the other side. I will be curious if that Representative  will acknowledge the thousands of deaths from fentanyl in California  being an emergency.\n\nMr. MAST. Mr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…dedication to our community. In fact, Bill  is known for not being able to say no to any charitable cause where he  can make a difference.\n\nHe has been a familiar voice emceeing, speaking, or judging countless  local fundraisers and events for charitable organizations, including  the CP Telethon and Make-A-Wish's Gourmet Wishes. Throughout his  career, it is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688600/recognizing-bill-jartz-the-voice-of-lambeau-field"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…extraneous material in the Record. I guess they are  taking me up on it.\n\nMr. ISSA. Mr. Speaker, perhaps you can just consider that every time  the other side speaks, they will be speaking in violation of our rules  about disparaging the President, and you need not say it each time, I  trust.\n\nMr. ISSA.  Boebert).\n\nMr. ISSA. Mr. Speaker, I note that what the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…The Freedom of Information Act is one of the strongest tools we have to  ensure that our government is doing what it should be doing and in ways  that are best for us.\n\nAnd speaking of records, a large part of my oversight work includes  publicly releasing documents to hold current and former government  officials accountable. To accomplish that, I often…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the State of New York since 2018. They are time-tested  and proven, and they have been stable.\n\nIt is long overdue for us to provide Federal legal clarity here, so  why am I speaking in opposition to it? My Republican colleagues are  exactly right about the stablecoins and the need for regulation. That  is why we passed the STABLE Act, but my Democratic…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…helping to oversee  the bookkeeping and finances to fundraising, Frank does not stop.  Frank's commitment to promoting the many services offered by the  pregnancy center and speaking so highly of the services provided to  those seeking pregnancy and relationship related decisions, is truly  admirable. Not a week goes by without the center feeling the positive…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690690/recognizing-frank-cassara"}, {"senator": "James Risch", "party": "Republican", "sentence": "…special interest group in the field of foreign relations or       allow their names to be used by any such group; and\n\n(B) members of the staff shall not accept public speaking       engagements or write for publication in the field of foreign       relations.\n\n(2) The staff shall not discuss their private conversations       with members of the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in the future when they fail to  secure the border, a monumental change in allowing States to defend  themselves against the abuses that we saw under Biden and Mayorkas.\n\nSpeaking of the border, perhaps the most comprehensive and  consequential policy achievement under President Trump has been  securing our border. With the leadership of Tom Homan,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…aftermath, Jon Zumkehr, an 18-year veteran of the Federal  Bureau of Prisons, reached out to Haley and invited her to Thomson. She  shared her own journey of survival and hope, speaking openly about her  struggles and recovery and the realities that far too many correctional  officers face in silence, many of whom are former military veterans.\n\nOn August…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…public service allows our constituents to see  the swearing-in of newly elected Members, watch all-night sessions  during vote-aramas, and tune in to history being made.\n\nSpeaking of the historic moments, it was 39 years ago today, June 2,  when C-SPAN2 started its gavel-to-gavel coverage of the U.S. Senate.  That was 7 years after C-SPAN started broadcasting…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Humanitarian Service Medal.\n\nAfter retiring, LTC MacMillan continued her commitment to service,  joining the Fort Cavazos Retiree Council and working with  The Caring Place, speaking to schools about selfless service and  visiting veterans at homes and local events. LTC MacMillan works  tirelessly for youth in her community, both as a Scout leader for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}]