[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, Donald Trump and Republicans control the  entire government.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, Donald Trump says that he isn't sure if  he needs to uphold the Constitution.", "title": "Holding This Administration to Account", "date": "2025-05-06"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Speaker, after Donald Trump and his co- president Elon Musk took office on January 20, Democrats in Congress  realized that we were engaged in a multifaceted struggle to protect and  defend everyday Americans from the harm being inflicted by this  reckless and cruel administration.", "title": "Attacks and Threats on Democracy and Rule of Law", "date": "2025-04-29"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Speaker, Donald Trump promised that he would cut  prices.", "title": "No Funding for Ice", "date": "2026-02-03"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Speaker, Donald Trump's threats to invade Greenland  have destroyed the world order.", "title": "Might Does Not Make Right", "date": "2026-01-21"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, that Donald  Trump made to the American people last year.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Speaker, Donald Trump said the cost- of-living crisis is fake news, ``a con job by the Democrats.''\n\nMr.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Speaker, Donald Trump was elected with a mandate to  improve the lives of hardworking Americans, to lower housing costs, to  make groceries, childcare, and medicine more affordable, and to help  our seniors get the care they need.", "title": "Ending Pay-For-Play Political Gifts", "date": "2025-05-14"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Speaker, while Donald Trump gives billions of  dollars to Argentina and gets rich selling cryptocurrency to criminals  and foreign agents, millions of Americans are facing financial ruin  from rising health insurance costs.", "title": "Extend the Tax Credits", "date": "2025-11-19"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, Donald Trump's war on science is putting  our country and our economy in peril.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Speaker, Donald Trump's tariffs are the biggest tax increase on  the middle class in this country in generations.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Speaker, while Donald Trump and congressional  Republicans spend time building a billion-dollar ballroom, bailing out  Argentina, and lavishing tax cuts on billionaires, Rhode Islanders and  Americans continue to struggle with the high cost of healthcare.", "title": "Recognizing Sarah Dully, Rhode Island Teacher of the Year", "date": "2025-12-03"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Speaker, Donald Trump has been a failure.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Speaker, Donald Trump is not the Republican President.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}]