[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…ancestry. For those of us who still face       skepticism about our place in military leadership, his       technical brilliance offers a powerful reminder that       competence speaks louder than prejudice.\n\nThe Army's unprecedented decision to name Fort Gregg-Adams       after him in April 2023, making him the first living Black       leader to receive…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…legislature together. A lot has been said about his sense of humor,  which is also very, very true. I want to just share something that I  always think of with Doug because it speaks to the type of humor which  is really, I think, something that tells you about the man. There are  plenty of people who have a great sense of humor at other people's  expense.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…stop doing that. Then they reversed it when Stephen  Miller got involved. I think now the agriculture interests are getting  involved. They should get the policy together.\n\nIt speaks to an underlying problem here, which is that the  overwhelming number of arrests now are not of people who are criminal  suspects for anything. Mr. Speaker, 65 percent of the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…chapter president  of the National Honor Society, a varsity chess team member and part of  the Royal Strings ensemble. His involvement in multiple activities and  honor societies speaks to his well-rounded excellence. After graduating  high school, he hopes to attend Harvard and study law. Any school would  be lucky to have such a bright young mind.\n\nWhat…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688149/recognizing-the-perfect-sat-score-of-sahli-negassi"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…enriched uranium.\n\nThe 60 percent enriched uranium that Iran has a significant inventory  of is perfectly usable even for a simple Hiroshima-style gun-type  device. Our leadership speaks in apparent ignorance of that fact,  beating their chest and saying we set them back by decades, when that  is not the case.\n\nJust to give a sense of the scale, the 400 kilograms…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…``There is still tremendous hardship all across  the country, but there is a sense that we are making progress because  of you. But even before this crisis''--he, of course, speaks about the  Great Recession. ``But even before this crisis, each and every one of  us knew there were millions of people across America who were living  their own quiet crises.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…community, and I think these express the basic  motivations for his actions. There is a beautiful phrase in the New  Testament that says: From the fullness of the heart, the mouth speaks.  On this topic, the President has a very full heart, and he has spoken  very plainly about his motivation.\n\nIn the speech marking the beginning of his campaign in 2016, day…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…every participant to register--just       as a driver secures a driver's license--much of this problem       would abate. That the bill sponsors resist this simple policy       speaks grimly about whom they are serving with this       legislation.\n\nFinally, bill sponsors claim they promote this bill to keep       crypto innovation American and provide long…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…messages and content we all receive on a daily basis and that  there are penalties for the abuse of this very powerful technology.\n\nThe second amendment I want to highlight speaks to a deeply  disturbing issue that we all, both Republicans and Democrats, should be  horrified by. This is about the Trump administration's deportation of  veterans and servicemembers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695106/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…are beginning to see what this really means. It is an  economic crisis that would be rolled upon States and rural areas and  communities and cities. It is a moral crisis that speaks to the soul of  our Nation.\n\nIt is a deliberate, calculated--and being calculated right now--it is  a deliberate and calculated attack on healthcare for Americans in  order,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…the highest order. When hundreds of survivors are  denied justice to protect one man's reputation, that is a crime against  the very idea of democracy.\n\nThe majority often speaks about morality. We are told about  protecting children, about being pro-life, and standing up against  human trafficking. So I ask my colleagues on the other side: Where is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Ken  Jenkins to bring attention to the Trump administration's proposed 25  percent cut in funding the Amtrak Northeast Corridor service. This is a  bad business decision that speaks more to politics than any objective  analysis of what will grow the economy and jobs.\n\nIn the congested corridor between Boston and D.C., where major  businesses are headquartered…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692196/northeast-corridor-amtrak-cuts"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…reputation as a nonpartisan, fact-driven organization that represents  many diverse viewpoints embedded across our staunchly independent  States. That is to say: when the Council speaks as one, we know the  issue reflects consensus and is in service to its mission to promote  New England's economic growth and safeguard a high quality of life for  all New Englanders.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…only way I can access essential  healthcare. It protects me from financial hardship and ensures I can  get the care I need to live and thrive.''\n\nVictoria isn't alone. She speaks for millions who rely on Medicaid  for basic services like birth control and cancer screenings. In fact,  the Congressional Budget Office warns that this bill would cause at…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691437/trumps-one-big-ugly-bill"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…seen it again and again  and again, no matter how many doubts my colleagues may have--to toe the  line in thrall of President Trump or in fear of him. But the record  here speaks powerfully--or it should--to our conscience and conviction.\n\nThis nominee epitomizes the Trump demand for loyalty and fealty above  all else to him, a sense that he has the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Valencia Abbott, of  Rockingham Early College High School, who was recently named the 2025  National History Teacher of the Year.\n\nThis is a monumental accomplishment and one that speaks volumes to  Ms. Abbott's passion for education and her dedication to the students  she serves.\n\nNot only is Ms. Abbott the 2025 National History Teacher of the Year,  but she…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…has devoted over 100 volunteer hours to BMS,  significantly impacting our programs and outreach efforts. Her  willingness to invest her time and talents into the organization speaks  volumes about her love for Brooksville and her desire to see it thrive.  She embodies the spirit of volunteerism, demonstrating a deep sense of  responsibility and pride in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Capitol Hill  Challenge.\n\nOut of hundreds of teams from across the country, this remarkable  group finished in the top ten. This is a truly impressive  accomplishment that speaks to their academic excellence and their  strong grasp of financial markets, economics, and civic engagement.  These students demonstrated exceptional teamwork, discipline, and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692339/recognizing-the-capitol-hill-challenge"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…year after  the heartbreaking loss in last year's State championship.\n\nComing back just 1 year later, rising to the challenge, coming back,  and securing the ultimate victory speaks volumes about the character  and the commitment of this team.\n\nThe road to a championship is never guaranteed. It is earned through  hard work in the gym, trust in one another,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Jeffries.\n\nIt ends with a number for Jeffrey Epstein to call to go to the dinner  and ``get an opportunity to get to know Hakeem better.''\n\nHere is the evidence. The email speaks for itself. The only stone- cold liar in this debate is Hakeem Jeffries.\n\nMadam Speaker, I ask Mr. Minority Leader to take a deep breath, chill  out, stop lying, stop with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…residents, but by other  leaders in Pennsylvania. He was honored by the Pennsylvania State  Association of Township Supervisors and inducted into its Hall of Fame  in 2025, which speaks broadly to his leadership abilities and legacy.\n\nMr. Speaker, I am honored and privileged to recognize Chairman  Jonathan Holmes for his selfless, tireless, and dedicated service…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…one-half of that of a man. Non-Muslims living in majority Islamic  societies are second-class citizens with few rights and little  protection under the law.\n\nThe Sixth Amendment speaks of an impartial jury, but the testimony of  a non-Muslim is deemed inadmissible. In an Islamic sharia court, the  only testimony allowed is that of a Muslim. That is hardly…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…SCHMIDT. Mr. Speaker, I thank the distinguished ranking member  for his argument and advocacy today.\n\nI would just point out to the body that while my distinguished  colleague speaks with his usual passion on many subjects, the only  subject before us today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…have experienced many ups and downs in the cause for  life, one thing has never changed: We have never given up.\n\nThe fact that the March for Life has endured for 53 years speaks  volumes about our Nation's heart and soul. Deep down, we know that  protecting those who cannot defend themselves is the foundation for  every meaningful cause in today's…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…survival, but he did. As an  adult, he works to still help and serve others.\n\nRebecca, she was rescued from the rubble at 2 years old. She now has  a family of her own. She speaks powerfully, still, about forgiveness  over bitterness.\n\nThey were some of those miracle babies that survived. Many of the  children around them did not.\n\nThis past week, it…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…have experienced many ups and downs in the cause for  life, one thing has never changed: We have never given up.\n\nThe fact that the March for Life has endured for 53 years speaks  volumes about our Nation's heart and soul. Deep down, we know that  protecting those who cannot defend themselves is the foundation for  every meaningful cause in today's…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…powerful and much needed message for our  young people to hear.\n\nThere is so much more I could say about Charlie, but I think the  outpouring of love and support after his death speaks for itself. If  you notice, there haven't been riots this past week. Businesses have  not been forced to board up their windows. Instead, prayer vigils have  been held for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…William will continue the  family tradition as the Under Secretary of Commerce for International  Trade.\n\nHowever impressive Mr. Kimmitt's family might be, his personal career  speaks volumes to the type of man he is. He served as counselor to  then-United States Trade Representative Bob Lighthizer and helped  implement the historic USMCA. William defended…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Country Championships, the SLCC Bruins made  history by sweeping both the men's and women's races, capturing  national titles on both sides. This remarkable accomplishment speaks to  the extraordinary talent and dedication of the student-athletes and  coaching staff.\n\nThe women's team claimed its second consecutive national  championship, dominating…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…determination required to perform at the  highest level under rigorous testing conditions.\n\nMadeline's dedication to learning and pursuing the highest standards  of performance speaks to both her exceptional aptitude and her strong  character. Achievements of this caliber do not occur by chance; they  are the result of sustained hard work, personal sacrifice,…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}]