[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…and childcare centers.\n\nThe same bill also directed that the Energy and Commerce Committee  make at least $880 billion in cuts. This would require deep cuts to  Medicaid specifically, which helps provide coverage for over 40 percent  of births in the United States.\n\nThis administration can try to erase the word ``women'' from  government, but it will…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689289/women-will-not-be-erased"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…affordable  options, ASCs can help to reduce health disparities and improve overall  community health.\n\nI want to acknowledge the following physicians for their exemplary  work specifically, Christopher J. Vesy, M.D. (Founder), W. Gregory  Hodges, M.D. (Founder), Rajeev Jain, M.D. (Founder), Michael J. Nunez,  M.D. (Founder), Kimberly M. Persley, M.D. (Founder),…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…confirmed by the  adoption of concurrent resolutions.\n\nThis bill would also codify Congress' exclusive authority to remove  the Librarian of Congress and the GPO Director. Specifically, their  removal would only occur by an affirmative vote of three-fifths of the  Members of the Senate and House, and clarify that the executive branch  has no role in these…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Well, the simple fact is, on the streets in those neighborhoods,  there is no threat of violence that justifies these kinds of police  state tactics. The court in Oregon specifically found that in the last  weeks and couple of months, there has been no violence on any  widespread scale. The same findings more or less have been done by  courts in other…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…These       principles should apply to the more than 700,000 people who       call Washington, DC home, just as they do for your       constituents across the country.\n\nI specifically want to call attention to the significant       incursion on local self-governance reflected in two bills,       the District of Columbia Attorney General Appointment Reform…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…radioactive waste and blocks clean  energy initiatives. My four amendments support essential funding for  our National Labs and our continued goal to restore the Chesapeake Bay.  Specifically, three of my amendments support the Continuous Electron  Beam Accelerator Facility and the High Performance Data Facility at the  Thomas Jefferson National Accelerator Facility,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…debt before it is too late.\n\nSo as we end the year, I am back on the floor today to remind my  colleagues of the dire financial situation we currently face and to  focus specifically on the harmful consequences that it has on the  everyday lives of hard-working Americans.\n\nLet's first take a quick bird's eye view of the situation. At the  start of 2025,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of the bill beyond year 10; and pillar 3: use  honest numbers from the Congressional Budget Office. That pillar has  survived since 1974. We even put that pillar into law specifically in  1985 in a bipartisan way. We wanted to emphasize how important that  was.\n\nJust think about how much more important this process of deficit  reduction, special rule…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…problems highlighted in recent D.C. Auditor's       report of officers being rehired despite being previously       terminated for police misconduct or criminal conduct.       Specifically:\n\n1. H.R. 2096 would reinstate the ineffective, slow, and       costly arbitration process for handling cases where officers       are accused of crimes or police misconduct…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…the highway, she saw a sign for a  pregnancy resource center in Rolla, Missouri, my congressional  district.\n\nWhile sharing her initial visit, Faith said that the center  specifically told her: ``Anything you need, we will help you get it.''  She was shunned by her family and pressured by her fiance to abort  their unborn child.\n\nAfter being shunned,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…inspired me and a  number of other committed advocates to write and advance Timothy's Law  in New York State, one of the first mental health parity laws in our  country.\n\nSpecifically, Timothy's Law required parity in insurance plans  between mental health and general health benefits.\n\nPassing Timothy's Law gave me the drive to improve the way that we…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginia are immigrants; our Main Street business owners, nearly 30  percent. Sixteen percent of our workforce is immigrant.\n\nLet me tell you about a couple of industries, specifically, and give  you some Virginia statistics: 34 percent of our chefs are immigrants;  44 percent of our computer engineers are immigrants; 28 percent of our  childcare workers…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…to know, Mr. Speaker, that  it has been over 50 years since Congress has enhanced Social Security  on behalf of  its recipients. That is why I have introduced legislation specifically  to address this issue.\n\nYet, Mr. Speaker, at the same time, we see that Mr. Musk has been  charged by the President of the United States to cut $2 trillion from  the budget.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…because of the bill that we passed.\n\nBut this progress is in threat of being interrupted, and the reason  is that the Trump administration has reversed course. I want to talk  specifically about how they are undoing the progress of this bill, but  their attempt to try to reverse the broader progress that we have made  on reducing gun violence is pretty comprehensive.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Biodetection Improvement Act.\n\nThis legislation is essential in advancing the Department of Homeland  Security's efforts to protect Americans from emerging biological  threats. Specifically, it seeks to enhance biodetection capabilities  within DHS by requiring the Secretary to assess how the Department can  leverage the research and development of the Department…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…readily discoverable by investors, and they have  the choice whether or not they want to invest in a multi-class  structure.\n\nI will tell you, Mr. Chair, this section 307 specifically targets  directors, director nominees, named executive officers, and any holder  with 5 percent or more of total combined voting power. It requires  their share ownership…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…bipartisan vote.\n\nI want to thank and commend our subcommittee chairs and ranking  members as well as their staffs, who labored over the holidays to  finalize this package.\n\nSpecifically, I want to thank Senators Murkowski and Merkley of the  Interior Subcommittee, Senators Moran and Van Hollen of the CJS  Subcommittee, and Senators Kennedy and Murray of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…idea, but I don't know if right now is the time. Okay, but let's have  the conversation.\n\nLet's take ROIs, what we call resolutions of inquiry, a tool in which  we can specifically go ask for specific information. We have engaged in  that effort. I certainly have. For over 600 days in the 116th and 117th  Congresses, ROIs, these resolutions of inquiry,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Representatives,  Republican and Democrats, are rightly checking the Senate.\n\nThere is one last really important piece to this which is the Arctic  Frost investigation itself, which specifically targeted United States  Senators in an egregious abuse of power. It was targeting those  Senators for their information and their records. That is something  that is an…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…That outdated  and absurd classification has driven up costs, created delays, and made  it harder for law enforcement agencies to access less-than-lethal tools  designed to specifically de-escalate situations and to save lives.\n\nDemocrats are calling that clarity a loophole. In reality, the only  thing that this bill closes is the gap between outdated law…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…well-being.\n\nHigh deductible healthcare plans are already a popular option for  employers to offer their workers. Expanding what services can be  provided under these plans, specifically to help treat chronic  diseases, will only make this a more affordable and useful health  coverage choice for patients.\n\nI encourage my colleagues to support the passage…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Senate amended and adopted H. Con. Res. 14, and on April 10,  the House agreed to the amended resolution without changes. As such, I  am submitting the required filing.\n\nSpecifically, section 4002 of the fiscal year 2025 congressional  budget resolution requires the chairman to file an allocation for  fiscal year 2025 for the Committee on Appropriations…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Maryland, and the University of Delaware were found to not have  disclosed foreign funding from Chinese sources, just to name a few  examples. Reporting in-kind support specifically for a researcher's  grant is critical, but deterrent provisions also cover other ways our  adversaries can influence faculty.\n\nDemocrats also continue to falsely claim that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…conduct a study on the effect of the       amendments made by section 2 on the businesses and startup       entities in which qualifying venture capital funds invest,       specifically including, with respect to such businesses and       startup entities, changes or trends relating to--          (A) the geographic distribution of capital to portfolio…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. But, Mr. President, I come to the floor today to talk  about a different topic, and that topic is coal--and, specifically,  Wyoming coal, which is world-class coal, clean coal, low-sulfur coal.\n\nThis is Wyoming coal. We need more of it--not less of it--to power  our Nation. It is available,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…million acres contained in the NPR-A were set aside       by the federal government in 1923, and directed by Congress       in the Naval Petroleum Reserves Act of 1976, specifically for       natural resource development, balanced with conservation, to       promote America's national security through energy resources,       and it is an asset to the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…3486 will help discourage the most dangerous criminals       from trying to enter, or re-enter, our country by increasing       severe criminal and financial penalties. Specifically, the       bill would raise the maximum penalty from two years to five       years of imprisonment for any illegal alien convicted of       reentering the United States.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…2030--\n\n``(1) $19,500,000 to the Under Secretary; and\n\n``(2) $8,000,000 to the Administrator.''; and\n\n(2) by adding at the end the following:\n\n``(c) Transfer Authority.--As specifically provided in       advance in appropriations Acts, the Under Secretary or the       Administrator may transfer funds made available to carry out       this title to the head…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…2024. All of that without Congress lifting a finger. It is  clear that the accomplishment was because of the clear leadership of  President Donald J. Trump.\n\nIn Tennessee specifically, President Trump's tariffs and economic  policies have brought about millions of dollars in new investment and  countless new jobs. Cra-Z-Art is moving manufacturing equipment…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…designees and provides one motion to recommit.\n\nThis rule advances a motion to concur in the Senate amendments to  H.R. 7148, the Consolidated Appropriations Act, 2026. Specifically, the  Senate amendments to H.R. 7148 strike the Homeland Security  Appropriations division, replacing it with a CR through February 13,  2026, and make other conforming…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]