[{"senator": "Mark Takano", "party": "Democrat", "sentence": "Speaker, I rise to address the House for a Special  Order hour with my Congressional Progressive Caucus colleagues.", "title": "Trump Immigration Policies", "date": "2025-04-30"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Speaker, why I had booked the Special Order Hour last week was  because my father was visiting.", "title": "Reflecting on America's History", "date": "2025-04-08"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "As part of the  program, loans are guaranteed for so-called special use properties like  amusement parks, car washes, bowling alleys, and gas stations.", "title": "Main Street Parity Act", "date": "2026-01-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Speaker, and still I rise, and I rise today  to initially extend greetings to all, especially those who are  traveling over this season of resurrection.", "title": "Protecting the American Dream", "date": "2025-04-10"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "That is why I am grateful to my colleagues, Representatives  Kamlager-Dove and Brown, for leading this Special Order hour.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "And I will include the Coast Guard,  too, because we like to count the Coast Guard, especially when they  partnered with us on things that really mattered to the United States.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "I applaud, again, Representative Deluzio for hosting this Special  Order about economic patriotism, taking on corporate power, as well as  for all his work supporting the right to organize, creating well-paying  union jobs here in America.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "McClellan), my co-anchor of this Special Order hour.", "title": "Better is Possible", "date": null}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Slashing Medicaid means ripping healthcare from the youngest, the  oldest, and the special needs communities, the most vulnerable members  of our community.", "title": "Medicaid is A Lifeline", "date": "2025-06-23"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "To get there, we have to transform the Democratic Party into a party  that fights for working people first no matter what and into a party  that is willing to stand up to the powerful special interests that are  screwing over working people because, if we love our country, we have  to be willing to fight for the people who make it work.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "It is  no secret that Black students--especially those attending public  schools in underserved communities--are already facing systemic  barriers to educational opportunities.", "title": "Ending of Dei Programs Through Executive Order", "date": "2025-04-29"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Speaker, it is with great honor that I rise  today to coanchor this Congressional Black Caucus Special Order hour,  along with the gentlewoman from Ohio (Ms.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Speaker, I thank the gentlewoman for her  leadership in these Special Order hours.", "title": "Healthcare Affordability Crisis", "date": "2025-12-15"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "I am going to hold a competition, and the  people who buy the most of this product, a crypto coin, would be  invited to a very special dinner at my golf club, where I will be  present, and you will have access to me.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Special commendation goes to pitcher Lilah Deavers, a Division I  commit and first-team all-State, and to catcher Madalyn Wolfe, also  first-team, All-State, whose leadership anchored the team throughout  the season.", "title": "Congratulating Parry McCluer Boys' Cross-Country Team", "date": "2025-12-02"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "She co-founded the  Adelanto Elementary School District's first Special Education Parent  Advisory Committee, served two terms on its Governing Board, and has  devoted herself to volunteerism, philanthropic writing, and foster  parenting--particularly for infants prenatally exposed to illicit  drugs.", "title": "Recognizing the Service of Debra Jones on Her Retirement", "date": "2025-10-21"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "Speaker, I congratulate Angela on her remarkable achievement, and  a special thanks to her parents for nurturing her in her educational  journey.", "title": "Recognizing Angela Flores", "date": "2026-02-02"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District.", "title": "Special Recognition of Hunter Spangler for Winning the Division III State Track and Field Title for Shot Put", "date": "2025-07-10"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "This is especially concerning since I have also found that  insurance agents are also using targeted internet ads to fraudulently  enroll consumers with false income.", "title": "-9999", "date": "2025-07-30"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "President, as I travel in Iowa throughout the year,  I meet some very special people.", "title": "2026 Iowa Teacher of the Year", "date": "2025-12-01"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "And I hope some  of my colleagues on the other side of the aisle will join Senator Kaine  and many of us in recognizing it is ludicrous to use the special  emergency powers that Congress gave to the President assuming he would  only do so in a case of war or active open hostility, not in the case  of one of our trusted and loyal partners and allies, the great and kind  people of Canada.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "It is a solemn reminder of the  human cost of war and our obligation, not the obligation of a single  executive or a private circle of special interests, to decide when to  go to war.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2026-01-22"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "As June 14th approaches, the community  comes together to reflect on this special milestone and honor the  dedication of the men and women who have spent decades working to keep  West Amwell safe.", "title": "Recognizing the West Amwell Volunteer Fire Department on Their 75th Anniversary", "date": "2025-05-05"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Yet, what  makes this occasion truly special is not only the years Mr.", "title": "Recognizing Edmund Good on the Occasion of His 100th Birthday", "date": null}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Let us stop pretending like the internet is new, novel, and worthy of  special treatment when 96 percent Americans access it.", "title": "True Cost of Big Tech", "date": "2026-02-03"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "I give special recognition to one of my constituents, Patrick Danen  of De Pere, who was a key member of this team and brought the gold  medal home to Wisconsin's Eighth District.", "title": "Congratulating Usa Men's Deaf Basketball Team", "date": "2025-12-15"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I thank the gentleman for  yielding and for hosting this Special Order Hour.", "title": "How Republicans Have Delivered for Americans", "date": "2026-01-14"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Together, they have raised two sons and a  daughter, all of whom have excelled in their respective fields:  nursing, aerospace engineering, and special education.", "title": "Recognizing Neshaminy School District Core Creek Elementary School Principal Brian Kern for 32 Years of Service", "date": "2025-08-15"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Haridopolos, for organizing this Special Order.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}]