[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "The rule detailed how the agency would       collect fees from certain energy-related facilities whose       methane emissions exceed a threshold specified by law."}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "3187--Conveyance of specified  Forest Service property to Perry County, Arkansas (Rep."}, {"senator": "Al Green", "party": "Democrat", "sentence": "14,       with the Senate amendment thereto, and to consider in the       House, without intervention of any point of order, a motion       offered by the chair of the Committee on the Budget or his       designee that the House concur in the Senate amendment with       the amendment specified in section 2 of this resolution."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "(c) Quarterly Briefings Required.--Not later than 60 days       after the date of the enactment of this Act and on a       quarterly basis thereafter until the date specified in       subsection (b), the Administrator shall provide to the       Committee on Small Business of the House of Representatives       and the Committee Small Business and Entrepreneurship of the       Senate a briefing on the implementation of the requirements       of this section."}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Section 70508 of title 36, United States Code, is amended       by striking ``the District of Columbia,'' and inserting ``a       United States location decided by the board of directors and       specified in the bylaws,''."}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Selected from over 1,000 entries from across the Nation, the students  qualified as national finalists after designing, building, flight  testing, and launching their rocket under highly specified requirements  to target an impressive 790 feet and land while keeping the rocket's  payload intact."}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "2.0 Definitions--For purposes of these regulations, the       following terms shall have the meaning specified."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(5) Communications network.--The term ``communications       network'' means any of the following:\n\n(A) A system enabling the transmission, between or among       points specified by the user, of information of the user's       choosing."}, {"senator": "French Hill", "party": "Republican", "sentence": "(6) Illicit use.--The term ``illicit use'' includes fraud,       darknet marketplace transactions, money laundering, the       purchase and sale of illicit goods, sanctions evasion, theft       of funds, funding of illegal activities, transactions related       to child sexual abuse material, and any other financial       transaction involving the proceeds of specified unlawful       activity (as defined in section 1956(c) of title 18, United       States Code)."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "354\n\nResolved, That upon adoption of this resolution it shall be       in order to consider in the House any joint resolution       specified in section 2 of this resolution."}, {"senator": "James Risch", "party": "Republican", "sentence": "The committee, by majority vote, or the chairman, with the       concurrence of the ranking member, may limit staff attendance       at specified meetings or hearings."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Each such       further amendment may be offered only in the order printed in       the report, may be offered only by a Member designated in the       report, shall be considered as read, shall be debatable for       the time specified in the report equally divided and       controlled by the proponent and an opponent, shall not be       subject to amendment, and shall not be subject to a demand       for division of the question in the House or in the Committee       of the Whole."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "(a) No member of the Committee or of the Committee       staff shall disclose, in whole or in part or by way of       summary, the contents of any classified or committee       sensitive papers, materials, briefings, testimony, or other       information received by, or in the possession of, the       Committee to persons outside the Committee, except as       specified in this rule."}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "The amendment specified in the report of the Committee on       Rules accompanying this resolution shall be considered as       adopted in the House and in the Committee of the Whole."}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "5371) making       continuing appropriations and extensions for fiscal year       2026, and for other purposes, with the Senate amendment       thereto, and to consider in the House, without intervention       of any point of order, a motion offered by the chair of the       Committee on Appropriations or his designee that the House       concur in the Senate amendment with the amendment specified       in section 2 of this resolution."}]