[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Speaker, I thank Congresswoman Beatty for joining me in this  Special Order hour."}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Speaker, I thank Representative McClellan  for running point on this Special Order hour for the CBC."}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "McClellan) for yielding, and I thank the gentlewoman for anchoring this  Special Order hour tonight on behalf of the CBC."}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "Speaker, I thank Congresswoman Kaptur for  cohosting this Special Order hour alongside me today."}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Speaker, I thank Representative Rivas for  organizing today's Special Order hour."}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "McGovern for hosting this Special Order hour  tonight and for his years of principled leadership on this issue."}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Speaker, I thank the gentlewoman for the Special Order."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Min for convening this  Special Order hour."}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Today, in our Special Order hour, I am going to be yielding to my  colleagues who will highlight stories of victims of Trump's enforcement  overreach, discuss our ongoing work to hold the administration  accountable, and uplift how we are pushing back against the abuses of  this President, Secretary Noem, and of the entire administration."}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Speaker, I rise for this Special Order because here we are, now  151 days since the beginning of this 119th Congress, and American  families have seen zero relief."}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Speaker, I thank my illustrious colleague of  the great State of New Jersey for being the lead for tonight's  Congressional Black Caucus Special Order hour to talk about the  government, money, funding, keeping this government open, and about why  we come here every single day of each week and why some of us are  fighting for the American people while others of us are fighting for  Donald Trump."}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, it is with great honor that I rise today  to anchor this Congressional Black Caucus Special Order hour."}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "Speaker, I thank Congresswoman McClellan and  Congressman Carter for anchoring this Special Order hour to bring  attention to one of the most pressing and pervasive challenges  confronting our Nation."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Subramanyam, for hosting this Special Order hour."}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "I listen to   David Schweikert every closing afternoon during his  Special Order hours."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Speaker, I thank my good friend from Utah for  organizing this Special Order."}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Speaker, I thank Representative Kennedy for  yielding and for leading this important Special Order tonight to talk  about all the wins in the One Big Beautiful Bill Act."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Madam Speaker, I thank Chairwoman McClain for the  opportunity to speak in this Special Order hour."}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Speaker, I thank the gentleman for holding this Special Order  hour."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Speaker, I am glad to be joined by my  colleagues for this Conference Special Order to talk about ways we have  delivered for all Americans through our legislative action, committee  work, and much more."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Speaker, I am glad to be joined by my  colleagues in this Conference Special Order."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Madam Speaker, I am glad to be joined by several  of my colleagues for this last Conference Special Order of the year to  talk about ways we have delivered for all Americans through our  legislative action, committee work, and more."}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Speaker, I again thank the gentleman from Florida for this  Special Order tonight."}, {"senator": "John Rose", "party": "Republican", "sentence": "Speaker, I thank the gentleman from Utah for yielding  and for arranging this Special Order."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "(b)(2) A motion to discharge the Committee on Rules from       consideration of a resolution providing a special order of       business for the consideration of a bill or resolution that,       by relating in substance to or dealing with the same subject       matter, is substantially the same as House Resolution 23       shall not be in order."}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Haridopolos, for organizing this Special Order."}]