[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…and for the rest of the agricultural supply chain.\n\nThe inspections provided by the Federal Grain Inspection Service  define and classify grains, as well as assign grades to specify weight  and quality requirements.\n\nThese inspections provide a gold standard assurance backed by the  U.S. Federal Government to both grain buyers and grain sellers.\n\nI proudly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…reporting, or disclosure requirement       contained in a rule of general applicability is deemed to       involve ten or more persons. In addition, OMB's regulations       specify separate procedures for agencies to use when an       information collection is contained in a proposed rule or       current regulations. Those procedures expressly provide…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Congress.  That is why right now it is so important that we end that slush fund  authority and reassert our power as lawmakers by passing these full- year spending bills that specify exactly how funds are to be spent,  just as we had always done until last year.\n\nSo with the next funding deadline coming up, it is crucial that we  pass these bills, protect…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that the  math error assessment be reversed.\n\nThis bill…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…unmarked cars that occurred just recently  at an apartment building in Chicago, taking citizens as well as  immigrants out of their apartment.\n\nWe are here because of the need to specify in the Insurrection Act  when it can be invoked, and this measure that I have reintroduced would  very simply create checks and balances and limit the Executive's  authority…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…thousands of sailors and marines. This  is not a limited operation; this is a major military buildup. To what  end? The administration will not say. Against what enemy? They won't  specify. For how long? They refuse to answer.\n\nThese operations risk destabilizing the region and provoking direct  confrontation with Venezuela. We could be stumbling into another…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…asked two simple  questions: First, ``provide Congress with an official correspondence  confirming that Operation Absolute Resolve has ended''--first request-- and second, specify ``that U.S. military personnel are no longer  involved in hostilities in Venezuela.''\n\nTwo simple questions. I don't know that those questions would have  been sufficient…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Defense upon       written notification to the confessional defense committees:       Provided further, That any notification of funds made       available in this section shall specify an estimated timeline       for the delivery of defense articles and defense services       provided and shall identify if any equipment provided       requires enhanced end-use…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and prevent them from obtaining any immigration benefits.\n\nThese laws were designed to apply broadly to any individual or  organization engaged in terrorism without having to specify them by  reference to specific historical events or attacks.\n\nUnder sections 212(a)(3)(B) and 237(a)(4)(B) of the INA, any  noncitizen who has engaged in any terrorist activity,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…really matter to their communities.\n\nDecimate our Federal investment in public transit? Not on my watch.  Instead, we secured $1.7 billion for CIG, and we took new steps to  specify which projects to fund at which amounts. For example, this bill  sets aside $100 million for light rail on the I-5 bridge for the  Interstate Bridge Replacement Program and…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…achieved a  93.7 graduation rate, and eliminated all D-rated schools in the county.  Her innovative approach of focusing on college and career technical  pathways programs, which specify teaching students practical skills for  their next steps, has paid dividends for the education of all Volusia  County students.\n\nMr. Speaker, Superintendent Balgobin is committed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, pursuant to House Resolution 988, I call up  the bill (H.R. 2988) to amend the Employee Retirement Income Security  Act of 1974 to specify requirements concerning the consideration of  pecuniary and non-pecuniary factors, and for other purposes, and ask  for its immediate consideration.\n\nThe Clerk read the title…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3301) to amend the Securities Exchange Act of 1934 to  specify certain registration statement contents for emerging growth  companies, to permit issuers to file draft registration statements with  the Securities and Exchange Commission…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…(A) to include an equity security issued by a qualifying       portfolio company, whether acquired directly from the company       or in a secondary acquisition; and\n\n(B) to specify that an investment in another venture       capital fund (as defined in paragraph (a) section 275.203(l)-      1 of title 17, Code of Federal Regulations) is a qualifying…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…adoption of this resolution it shall be       in order to consider in the House the bill (H.R. 2988) to       amend the Employee Retirement Income Security Act of 1974 to       specify requirements concerning the consideration of       pecuniary and non-pecuniary factors, and for other purposes.       All points of order against consideration of the bill…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Committee and the Ranking Minority Member of the Subcommittee       shall be kept fully apprised of the authorization for the       taking of depositions. Such notices shall specify a time and       place of examination, and the name of the Subcommittee Member       or Members or staff officer or officers who will take the       deposition. The deposition…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3351) to amend the Securities Exchange Act of 1934  to specify that actions of the Advocate for Small Business Capital  Formation are not a collection of information under the Paperwork  Reduction Act, as amended.\n\nThe Clerk read the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…appropriate       and broken down by credentials, experience, and levels of       education of the individual nurses, in accordance with such       requirements as the Secretary may specify;\n\n``(ii) an attestation of the average nursing faculty salary       at the school of nursing during the most recent 3-year period       prior to the date of application, adjusted…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…audience attending.\n\nThe unfortunate truth is that regulations handicap us from  understanding the needs of small businesses.\n\nMy bill is very simple. The legislation would specify that activities  like conducting field surveys carried out by the Office of the Advocate  for Small Business Capital Formation are not a collection of  information under the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…striking a person while       removing the bungee tie-downs for the cover of the awning.\n\n(b) CPSC Determination of Scope.--The Consumer Product       Safety Commission shall specify the types of retractable       awning devices within the jurisdiction of the Commission that       are within the scope of subsection (a) as part of a standard       promulgated…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Staircase RMP affirms the Proclamations' directives and       implements measures to protect the GSENM. The Grand Staircase       RMP provisions that acknowledge GSENM and specify its       boundaries simply reflect the legal status of the land as       established by the President under the Antiquities Act. Some       directives of the Proclamations…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…handled by military or civilian authorities.\n\n``(c) Mitigating and Aggravating Circumstances.--In issuing       the policy under subsection (a), the Commandant shall specify       mitigating circumstances that decrease the gravity of minor       collateral misconduct or the impact of such misconduct on       good order and discipline and aggravating…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3343) to amend the Federal securities laws to  specify the periods for which financial statements are required to be  provided by an emerging growth company, and for other purposes, as  amended.\n\nThe Clerk read the title of the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693855/greenlighting-growth-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…determines there is good cause, an inspection under that       section shall be carried out annually for such duration as       the Secretary determines appropriate;\n\n(2) to specify that a refusal of inspection under that       section shall result in a loss of the status of in good       standing;\n\n(3) to allow the Secretary to request, at the discretion…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}]