[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…reflects a fundamental misunderstanding of  Tribal Nations and the obligations that the United States has to those  sovereign governments. Let me be clear: Tribes are not special  interests. They are not seeking special treatment. They are sovereign  nations with legal and moral responsibilities to protect the well-being  of their citizens, their homelands,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…ruling in Citizens United v. Federal Election Commission. As you know,  Mr. Speaker, that decision overturned longstanding precedent and limits  on political spending by special interests.\n\nThe decision created a dark money system, where money speaks louder  than everyday Americans. It has shifted power and influence away from  everyday Americans, from…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699238/restoring-election-integrity"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…has done nothing for working people, nothing  to lower costs, nothing to make life more affordable, but, boy, have  they delivered for billionaires, corporations, and special interests.\n\nThey have spent an entire year screwing over the people they  represent. They are betraying the voters who sent them here.\n\nThey are pretending like Trump's economy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…these forests. But I am not only  defending our forests. In fighting for the roadless rule, we are  fighting for protections for our roadless areas and against putting  special interests first. We are fighting for stronger local economies  for all and against industrial development for a wealthy few.\n\nGifford Pinchot was the first Chief of the U.S. Forest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…bill, the more and more  they despise it. It steals their Medicaid. It jacks up their premiums.  It takes away their jobs. And it gives trillions away to billionaires  and special interests. This is a nonsense and destructive piece of  legislation, and it makes no sense for Republicans to scramble to pass  it.\n\nThere is nothing inherently critical about…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Donald  Trump on Inauguration Day earlier this year. The driving force behind  this entire legislative effort has been to grant handouts to those same  billionaires and special interests all at the expense of hardworking  families.\n\nMr. Speaker, I hope my colleagues on the other side of the aisle will  stop and think again before voting for the worst…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693236/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…don't want bills like this that  say you will pay more and our Big Oil friends are going to make more on  their bottom line.\n\nPeople are tired of being ripped off by the special interests and  politicians who all have too much power here in Washington, D.C. This  bill is another example of that. Republicans want to make it harder for  businessowners to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electric bills, but also their grocery bills and  everything they buy.\n\nWe have a responsibility in this House to look out for the people  back home rather than serve the special interests. This Congress has  been all about serving the special interests, and that includes the  folks who really are pushing this bill.\n\nIt is not about critical minerals. If…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…States Supreme Court's Citizens United decision, a decision that  disfigured our political landscape, reorienting power away from voters  and toward corporate and wealthy special interests.\n\nIn Citizens United, a 5-4 conservative Court majority endorsed almost  unlimited political spending by corporations and wealthy individuals,  and alongside several…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…time, every  Republican, every Democrat. It is a clear divide, a clear difference  between us. And the public is with us. The public is infuriated that  big, secretive special interests can control our politics from behind  the scenes with massive dark money contributions.\n\nLast point. If you can make an enormous dark money contribution, you  can threaten…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…betrays every rural community from the benefits  of good-paying energy jobs. Republicans' supposed signature bill  betrays everyone outside of the billionaire class and the special  interests.\n\nNow, Republicans are going to spin the mother of all propaganda jobs  to sell this ugly bill to the American people. But today's report  reminds us of something: Facts…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693882/budget"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…vulnerable in America.\n\nI believe we need judges on the bench who follow the law and the  Constitution, not politicians in robes who rule in favor of the  President and wealthy special interests.\n\nFinally, I would like to note that Ms. Hermandorfer's academic  record, although impressive, and legal record, although extreme, is  short. She graduated from law school…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…keep fighting for what the people  of Ohio's 13th Congressional District made clear when they sent me here  because this Congress does not belong to party leaders or special  interests. It belongs to the people.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…another rescissions package in the  near future.\n\nThen, there is Donald Trump's ``Big Ugly Betrayal''--a purely party- line vote, a partisan giveaway to billionaires and special interests-- paid for with the biggest cuts to healthcare, food funding, and good- paying energy jobs we have seen in our lifetimes.\n\nLeader Thune says he wants to see bipartisanship.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…behind the scenes here in Washington, D.C. I have to say I  think my Republican friends are out of touch with working people.\n\nPeople are tired of being ripped off by special interests and  politicians in Washington. This resolution is another example of that.  This makes it harder for small business owners to save money through  energy-efficient appliances.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…hopefully, we will  be having hearings on this topic as we delve into whether people would  adopt this lifestyle in the first place if there weren't so many  powerful special interests that encouraged people to adopt this  lifestyle.\n\nMr. Speaker, my final point, when we come to our big, beautiful bill,  a lot of it is going to have to do with taxes.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…Prisoner of War/Missing in Action Flag. It is a solemn reminder of the  human cost of war and our obligation, not the obligation of a single  executive or a private circle of special interests, to decide when to  go to war.\n\nEven the executive branch knows that Congress had the authority, not  them.\n\nDo you remember the night of the invasion, Mr. Speaker?…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…families, revenue that  funds our schools, and power that keeps America moving forward.\n\nUnfortunately, President Biden, in his very last week of office,  chose to put special interests above all of that.\n\nMr. Speaker, North Dakotans saw the Biden administration's plan for  exactly what it was. It was a backdoor attempt to shut down fossil  fuels in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Vietnam who takes  the job that once belonged to an American. Do you know who I blame? The  people in power who allowed them to do it.\n\nI blame the corporate bosses, the special interests, and, yes, the  politicians who sold our country out for a seat at the table of the  globalist banquet.\n\nI blame the ideologues of the status quo, the international elites,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disgraceful that almost 20 Democrats just  didn't even vote at all. They abstained. They knew it was terrible, but  they didn't want to go against their party, the Governor, or special  interests. They simply abstained from the vote.\n\nThis is a measure that absolutely cannot be allowed to pass. It still  needs to go through the California State Senate, but I would…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]