[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…in accessing capital for the development of major fixed  assets like land, buildings, equipment, and machinery. As part of the  program, loans are guaranteed for so-called special use properties like  amusement parks, car washes, bowling alleys, and gas stations.\n\nWhen the special use designation was created in 1996, Congress  required businesses developing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699165/main-street-parity-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Florida can access the Osceola Camp, a  historic Tribal village that was, unfortunately, excluded from the  original reserved area, without requiring the Tribe to obtain special  use permits.\n\nH.R. 504 would also direct the Department of the Interior to  implement needed flood control measures to protect homes and structures  within this village.\n\nFor…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…bill would do, we have created a regulatory  sacrifice zone.\n\nHouse Republicans can't even identify which licenses and permits  would qualify in this bill in lieu of the special use permit process  that would ordinarily apply.\n\nMr. Speaker, how can we look the American people in the eye and  assure them that no environmental safeguards are going away…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…sanctuary. That means  protecting the sensitive areas of the seafloor and avoiding cultural  and historic sites.\n\nSecond, require public comment as is currently the practice with  special use permits.\n\nThird, require these companies to carry liability insurance for the  project. We don't want to see another disaster like we saw off the  coast of Oregon, a Meta…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…States is one of the most difficult countries in the world  to lay and operate undersea cables. This is a national security  liability.\n\nThere is simply no reason to require a special use permit for an  undersea cable because there is absolutely zero--and I say ``zero''-- environmental impact.\n\nIt is time for Congress to pay more attention to the critical…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699958/undersea-cable-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…This Act may be cited as the ``Fire Safe Electrical       Corridors Act of 2025''.       SEC. 2. PERMITS AND AGREEMENTS WITH ELECTRICAL UTILITIES.\n\n(a) In General.--In any special use permit or easement on       covered Federal lands provided to an electrical utility, the       Secretary concerned may provide permission to cut and remove       trees or…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Creek Reservoir and the surrounding timbered  area, is located on both City-owned and federally managed Forest  Service lands.\n\nThe City operates these facilities under a special use permit, which  is inefficient and costly and limits the City's ability to  expeditiously expand and modernize this water supply.\n\nThe City of The Dalles is a growing City.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…which have provided reliable and  affordable power to Californians over a century.\n\nThe bill authorizes the Secretary of the Interior to issue four 10- year renewals for a special use permit for the Kaweah Hydroelectric  Project, thereby extending the project's life for up to 40 additional  years.\n\nThese hydroelectric dams, located on the Kaweah and East…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…agencies around       shared-space arrangements;\n\n(2) work to develop a criteria that would facilitate the       expanded use of space-sharing or collocating;\n\n(3) identify how special-use spaces can be used to improve       space-sharing or collocating; and\n\n(4) establish measurable objectives, in consultation with       the tenants of federally-leased space,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…facilitating trillions of dollars in global financial transactions.\n\nThe Undersea Cable Protection Act of 2025 eliminates the requirement  for undersea cables to obtain a special use permit under the National  Marine Sanctuaries Act as a condition to route these projects through a  national marine sanctuary.\n\nUndersea cables are and will continue to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…large Federal footprint, both communities have struggled to expand  their respective cemeteries, which are currently located on U.S. Forest  Service land and operated under a special use permit. If the cemeteries  are not expanded, families will be forced to travel long distances to  distant cemeteries to visit their deceased relatives.\n\nTo address this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…southern Florida. Following Federal recognition of the Tribe in  1962, the Miccosukee's northernmost villages within what became  Everglades National Park were managed under a special use permit until  1998, when Congress placed that permit framework with the MRAA,  authorizing the Tribe's use of the area and noting it as Indian  Country.\n\nThe original law…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…U.S.  Forest Service land to the City of The Dalles, Oregon.\n\nThe area encompassed by the legislation includes a dam and reservoir  that the City currently operates under a special use permit from the  Forest Service.\n\nThe Crow Creek Reservoir, located in the Mount Hood National Forest,  is key to providing clean water for drinking, residential, and  commercial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}]