[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…families  and fans together, create new economic opportunities, and further  solidify Colorado's reputation as a premier destination for  professional sports. I also want to specifically commend the  organization's investment in a state-of-the-art performance center in  Centennial, purpose-built for the unique needs of professional women  athletes. This…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694256/recognizing-denver-summit-fc"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…standard  merger application to ensure they had enough information to weed out  harmful mergers.\n\nThird, the rule provided guidance, something industry often asks for.  Specifically, the OCC provided guidance on how they would consider  statutory factors when reviewing an application, making the process  more transparent.\n\nRolling back these reforms…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…confirmed by the  adoption of concurrent resolutions.\n\nThis bill would also codify Congress' exclusive authority to remove  the Librarian of Congress and the GPO Director. Specifically, their  removal would only occur by an affirmative vote of three-fifths of the  Members of the Senate and House, and clarify that the executive branch  has no role in these…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…did. Rather than have a punitive program, we have  $1.5 billion to assist industry with reducing current and legacy  methane emissions. Mr. Speaker, $700 million of that is specifically  set aside for small producers, which I know there are a lot of those in  the district of the gentleman from Texas.\n\nUnfortunately, much of that $700 million to help the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…uninsured patients will wait to see a doctor until they are so sick  they have to go to the ER, which costs more. This will lead to  increased costs across the board.\n\nSpecifically, it is estimated that 5.4 million Americans will incur  medical debt because they will become uninsured, and the total medical  debt that Americans owe will increase by…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…and childcare centers.\n\nThe same bill also directed that the Energy and Commerce Committee  make at least $880 billion in cuts. This would require deep cuts to  Medicaid specifically, which helps provide coverage for over 40 percent  of births in the United States.\n\nThis administration can try to erase the word ``women'' from  government, but it will…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689289/women-will-not-be-erased"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…undermining the values upon  which this Nation was built.\n\nMore profoundly, these attacks are not merely political, but they  represent a direct assault on civil rights. Specifically, they started  by targeting African Americans, and they threaten to undo the hard- fought progress that has been made over generations.\n\nDEI, at its core, is not just a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…diverse air pollution challenges facing each  State.\n\nWe would also have a chance to understand how so many innovations  have occurred not only because of the law broadly but specifically  because California has been able to pursue more protective standards.\n\nThe process that has resulted in us debating this resolution today is  all wrong, but it is also…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…support of my bill, the Securing the  Cities Improvement Act, a critical piece of legislation designed to  help us build and maintain our Nation's security capabilities.\n\nSpecifically, this bill provides participating cities with more  reliable guidance and support from the Department of Homeland  Security's Securing the Cities program, which seeks to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…wanted that erased along with everything  else. And now, they are attempting to ``rewrite history'' with the  latest executive order targeting the Smithsonian Institute.  Specifically, the Executive Order singles out the African American  History Museum for its ``corrosive ideology.'' Before these relatively  recent attacks, diversity itself had been…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to daycare, left the  motor running in his car and took the little toddler into daycare. He  came out the door and was arrested and detained and removed from that  scene, specifically, while the motor was still running in his car. That  is the kind of thing that is happening. It isn't as if they are  targeting criminals; they are going after people who…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…tirelessly alongside  some of the most dedicated and passionate advocates to ensure everyone  has a fair and just opportunity to prevent, detect, treat, and survive  cancer.\n\nSpecifically, he has worked to advocate for better screening to  prevent late-stage diagnosis, improving access to health care and  treatment, clinical trials, and funding for research…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the UAE and, most especially, Qatar have been allies  of the United States. We have worked together in our efforts, for  instance, to combat terrorism in the region. Qatar specifically has, at  times, been a heroic partner of the United States. We would never have  been able to rescue thousands of Americans and American allies from  Afghanistan without…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…as a guarantor of peace but as a threat to international stability.\n\nThe NDAA is one of Congress' best opportunities to rein in these  kinds of abuses of military power, specifically abuses by this  President in his role as Commander in Chief. Unfortunately, this bill  misses that mark. It lets the President get away with starting illegal  wars and committing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…and for his willingness to advocate for so many Americans, including  his own child. It takes tremendous strength and courage. I thank the  gentleman for working with me specifically on this important bipartisan  piece of legislation to ensure that this Congress and the SBA do right  by Americans with disabilities.\n\nMr. Speaker, entrepreneurship is the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…personnel, and surrounding communities.\n\nThese critical provisions would ensure our servicemembers and their  civilian counterparts have the resources they need for success.  Specifically, my amendments will improve healthcare access for Navy  personnel at Naval Air Weapons Station China Lake, strengthen the  readiness of the Naval Air Warfare Center Weapons…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Representative Sylvia Garcia of Texas.\n\nThis bill would create coordinators within each of the Veterans  Integrated Service Networks to help veterans navigate cancer care.  Specifically, this bill aims to improve care coordination for common  cancers in women.\n\nNo person wants to hear that they have or that their loved one has  cancer. Having the resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…shouldn't  be Republican versus Democrat--this should be legislative prerogative  versus Presidential prerogative, and it should be about the  Constitution.\n\nThe Constitution specifically, thoughtfully, vested the power of  initiating war and declaring war to Congress. They talked about it.  They talked about it in the Constitutional Convention. They wrote…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…if I can call him that, who wrote ``Wealth and Poverty''  in 1980. He looked at single-parent families to see if he had any  observations. The families he looked at were specifically from the  poorer parts of Albany, New York. At the time a woman got pregnant, if  the family was not a married group, they began to collect benefits, and  it was not a panic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that  will not be possible if the commission is allowed to continue operating  as it has been.\n\nJust to give you a couple of examples of some of its abuses, one of  them is specifically related to fire.\n\nIn 2019, the L.A. Department of Water and Power began replacing  nearly 100-year-old wooden power line poles that are cutting through  Topanga State Park.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Representatives,  Republican and Democrats, are rightly checking the Senate.\n\nThere is one last really important piece to this which is the Arctic  Frost investigation itself, which specifically targeted United States  Senators in an egregious abuse of power. It was targeting those  Senators for their information and their records. That is something  that is an…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…community located within       the Arctic National Wildlife Refuge (ANWR), and KIC holds       significant ANCSA lands within the Coastal Plain lands that       Congress specifically conveyed to our people so that local       Inupiat not distant federal agencies, would have a central       voice in decisions about our homeland.\n\nFor decades, KIC has…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "French Hill", "party": "Republican", "sentence": "…building will require many significant repairs, but the county  does have that repair budget appropriated. Once restored, the facility  will support many local programs. Specifically, the University of  Arkansas extension program, the Perry County Conservation District,  and, importantly, it will serve as a meeting place for our 4-H youth  development…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…floor about a way, a process, a  dialogue that needs to be had with our colleagues on the other side of  the aisle.\n\nSo there are a few bills that we are looking at today specifically,  but I think it goes to a bigger concern that needs to be addressed in a  way that is going to work for other Members who are also trying to  advance their bills into full…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the safety of life and property       on, under, and over the high seas and waters subject to the       jurisdiction of the United States, covering all matters not       specifically delegated by law to some other executive       department.\n\n``(C) Aids to navigation.--Develop, establish, maintain and       operate aids to maritime navigation to promote…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the entire Nevada  delegation that would streamline permitting in the Apex Industrial Park  in North Las Vegas to encourage new business development and economic  growth.\n\nSpecifically, the legislation authorizes the Secretary of the  Interior to grant utility and transportation rights-of-way to the Apex  Industrial Park Owners Association, the city of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…readily discoverable by investors, and they have  the choice whether or not they want to invest in a multi-class  structure.\n\nI will tell you, Mr. Chair, this section 307 specifically targets  directors, director nominees, named executive officers, and any holder  with 5 percent or more of total combined voting power. It requires  their share ownership…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…designees and provides one motion to recommit.\n\nThis rule advances a motion to concur in the Senate amendments to  H.R. 7148, the Consolidated Appropriations Act, 2026. Specifically, the  Senate amendments to H.R. 7148 strike the Homeland Security  Appropriations division, replacing it with a CR through February 13,  2026, and make other conforming…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…for working with me to  ensure that my community, El Paso County and Colorado Springs, isn't  swept up in the radical sanctuary policies coming out of Denver,  Colorado.\n\nSpecifically, I thank the gentleman for accepting our amendment to  ensure that communities like mine, which are fighting back against  criminal-coddling politicians, remain eligible…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I include in the Record a letter from the  Inupiat Community of the Arctic Slope, ICAS, the North Slope Borough,  and the Arctic Slope Regional Corporation, ASRC, that specifically  states BLM failed to engage in meaningful government-to-government  consultation with ASRC, the Borough, and ICAS.\n\nThis admission contradicts Federal consultation requirements…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}]