[{"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Recently, for example, Trump tried to take advantage of the shutdown  to illegally fire hundreds more workers from the Education Department,  including the Office of Special Education and Rehabilitative Services  and the Office for Civil Rights.\n\nEducation Secretary McMahon--herself one of Trump's billionaire  buddies--has made the preposterous claim…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and local officials in  Virginia and across the country are worried that they do not have the  funding or the staff to handle the workload, especially in the area of  special education, especially in our rural areas.\n\nThe block grant funding that the Trump administration keeps promising  comes with little accountability, making it unclear whether those…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…They have fired or placed on leave  Education Department staff. These are hard-working Americans dedicated  to everything from protecting the civil rights of students to special  education, to student aid. And they are making it clear that this is  just the beginning.\n\nPresident Trump has bragged that he actually wants to eliminate the  Department of Education,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…right now fear that local agencies and the Virginia Department of  Education will not have the funding or the staff to handle the  workload, especially in areas like special education.\n\nThe block grant funding that the Trump administration promises comes  with little accountability, making it unclear whether the funds will  actually reach the students…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…promise was never kept. The  Federal share is now less than 12 percent.\n\nAccording to the Autism Alliance of Michigan, Michigan ranks among  the lowest in the Nation for special education outcomes, due to massive  underfunding by our Federal Government. Students with disabilities in  Michigan are twice as likely to drop out of school as their peers. Only…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Third. We stand to lose  $109 million per year in basic public school funding that keeps  students learning and teachers employed. We also stand to lose $21  million in special education support, and $19 million for school  meals--because no child should be too hungry to learn. More than 1,300  teaching jobs are on the line.\n\nAll of this--to make billionaires…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Georgia.  We need to do more for our children here at home. I fail to see how  cutting the Department of Education, canceling grants, some of them in  my district for special education teachers, ending the AmeriCorps help  that our schools were getting with many students having someone to sit  with them and help them with extra one-on-one for reading…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…almost a quarter-million students would be denied  an adequate education.\n\nMy district, New Jersey's 10th Congressional District, receives $98  million in title I and special education grants. How will our schools  support these students without these funds?\n\nAs a former education administrator, I know firsthand the impact IDEA  funding makes on students…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…MOORE of Wisconsin. In the middle of the shutdown, was it true  that the Trump administration tried to fire nearly everyone in the  Department of Education's Office of Special Education and  Rehabilitation Services?\n\nMs. MOORE of Wisconsin. The Office of Civil Rights was put in there  through the Civil Rights Act of 1964. This office is responsible for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…fellow policymakers to oppose all cuts to the Medicaid       program as it is a lifeline for individuals with       disabilities. Oppose all cuts or caps. I was a special       education teacher for 30 years, and after I retired, I       volunteered as a special education advocate for 10 years. I       had the privilege of advocating for many disabled…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…Department of Education, with no regard for the impacts on programs,  school districts, students, and families whom they serve.\n\nSadly, these firings have reached the Office of Special Education  Programs, which administers IDEA, as well as the Office for Civil  Rights, which investigates cases of disability discrimination. Without  these agencies and their dedicated…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…loud and clear.\n\nThat is why I am honored that Susan will be my guest at the  President's joint address because we should all hear her voice, too.\n\nSusan is a retired special education teacher from Fauquier County.  Her husband is a retired Postal Service employee of 44 years, worried  about his retirement benefits getting cut. Her son has cystic fibrosis,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688360/dont-underestimate-susan-perri"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…meaningful education.\n\nThe Federal Government committed to funding 40 percent of the cost to  school districts of implementing the IDEA, but Congress has never fully  funded special education. Right now, the Federal Government is only  covering 12 percent of the tab, and that is unacceptable.\n\nNow President Trump and Education Secretary Linda McMahon are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…generations.\n\nInstead of tackling our affordability crisis, instead of fighting the  climate crisis, instead of protecting healthcare programs or fighting  for the needs of special education students, this is what Republicans  want to work on--an attempted favor for Big Oil executives.\n\nThis CRA resolution would jeopardize the Arctic Refuge--the greatest…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…centers deprived of funding, NIH research  grants for curing cancer, for diabetes or hypertension canceled or  frozen; in education, the uncertainty and loss of funding for special  education and other programs that benefit children and the neediest and  most vulnerable of our districts, in rural areas as well as urban; and,  of course, the damage to our fundamental…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…addition to her work in public office, Debra has been deeply  involved in education and community service. She co-founded the  Adelanto Elementary School District's first Special Education Parent  Advisory Committee, served two terms on its Governing Board, and has  devoted herself to volunteerism, philanthropic writing, and foster  parenting--particularly…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…going to look back at this point down the  road and say that this was a key part of why we were able to better  fund schools that are in tough communities, to better fund special  education needs, and to make sure that we are still fulfilling all of  the FAFSA and student loan requirements that we currently do.\n\nMr. Speaker, let's give this an option. If…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Madam Speaker, I rise today in honor of Tiffani  Jaseph, who was honorably named the 2026 Arizona Teacher of the Year.  Tiffani serves as a special education teacher at Copper View Elementary  School in the Sahuarita Unified School District.\n\nTiffani received her bachelor of arts and masters from the University  of Arizona…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…facing persistent vacancies,  especially in low-income, urban, and rural areas. The districts request  TFA core members for hard-to-staff subjects like STEM, special  education, and bilingual education. In fact, in this last school year,  over 75 percent of TFA teachers served in title I schools.\n\nThe organization is recruiting motivated and talented young…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, as chairman of the House Merit Caucus, I am  proud to recognize a Utah educator who embodies excellence, Ms. Lacey  Anderson.\n\nLacey is a special education teacher who refused to accept low  expectations for neurodivergent students. Instead, she founded Autism  Solutions Academy in West Jordan, Utah, becoming a board-certified…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691347/recognizing-lacey-anderson"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Europe together this fall. Together, they have raised two sons and a  daughter, all of whom have excelled in their respective fields:  nursing, aerospace engineering, and special education.\n\nPrincipal Brian Kern is truly a remarkable figure in our district. We  commend him on his retirement after 32 years of dedicated service to  public education in Neshaminy.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "John James", "party": "Republican", "sentence": "…and support students who need services, including children  experiencing homelessness and those attending private schools.\n\nFor 50 years, IDEA has been the backbone of special education,  ensuring access, accountability, and equality for millions.\n\nAs we honor IDEA's 50th anniversary, I am proud to introduce the  IDEAL Act, a bill that fully funds and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…problem. The drug problem is  certainly not exclusive, but it is a strong element of the family  breakdown problem. In talking to teachers, particularly in the area of  special education, frequently the problems stem from a breakdown in the  family.\n\nWe have to do something to remove these horrible marriage penalties.  I really don't think America is…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and dedicated employees. The Child  Development Center's Senior Leadership team includes: Alisha Rone,  executive director; Lori Kapeles, program director; Jan Hinz, special  education director; Geoff Dean, finance director; Shannon Hillibush,  human resources director; and Renate Pullen, compliance director.\n\nMembers of the CDC Board of Directors are:…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with Disabilities Education Act  in 1975, it was a landmark step toward educational equity. The Federal  Government pledged to cover 40 percent of the excess costs of special  education services.\n\nYet, for decades we have fallen short of promised funding levels,  which have hovered around 13 to 15 percent, leaving States and local  school districts struggling…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…across various school settings for the last  three decades. Kimberly also works with preservice teachers and as a  mentor for new classroom teachers. She holds a BS in Special Education  (College of Saint Rose) and a MS in Inclusive Education (Nazareth  College). Kimberly is certified in Elementary Education, Exceptional  Student Education (K-12), and…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}]