[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…instead made life less affordable. He has taken away  people's healthcare, launched costly trade wars on our allies abroad  while making everything more expensive at home, and has spent his days  flattering himself, putting his name on buildings and constructing  monuments in his own honor.\n\nAre we really surprised that a man who tried to overturn the will…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Madam Speaker, I rise today to say as clearly as I  possibly can: Politicians have no role in the medical exam rooms.\n\nAs a physician who spent 20 years caring for patients, I know  responsible care requires building trust and understanding between a  patient, their parent, and their physician. I never consulted a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698347/protect-childrens-innocence-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…her  people.\n\nMillie was born in New York City, the daughter of Miguel and Cruz  Ortiz. She graduated from Baruch College where she met her husband,  Francis. Together, they spent over 40 years married, with two children  and four grandchildren.\n\nMillie was a school psychologist with over 30 years of experience in  the Greenburgh Central School District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…of mass  destruction.\n\nIt was Donald Rumsfeld all those years ago who falsely claimed there  was ``bulletproof evidence linking Saddam Hussein to al-Qaida.'' Marco  Rubio has spent the past few months accusing Maduro of leading a cartel  that even our own DEA doesn't recognize.\n\nJust like the Bush administration insisted earlier on that oil  revenue,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…business  and sell our goods across the seas and to our friendly neighbors like  Canada.\n\nLet me start with Canada. As the head of the Inter-Parliamentary  Group with Canada, I spent a lot of time working with the Canadians. It  was one Embassy, years ago, when America was disliked by a lot of  countries, that displayed on their Embassy huge banners that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…against me. That is not a reason for anybody to impose violence  upon him.\n\nHe had every right to do these things and walk away and go back home  to his family. He should have spent the night either with his family or  knowing that his family was secure and they knew that he was secure. He  had every right to raise those babies.\n\nThis was a wrong that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…for any  discrepancies.\n\nAll election officials and judges with access to the tabulation  process must pass a Colorado Bureau of Investigation background check.  Colorado has spent years implementing top-tier cyber security measures  and audits to prevent hackers from interfering with our electoral  process.\n\nWe have one of the most secure election systems…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…our Strengthening Science Through  Diplomacy Act which simplifies our scientific collaboration with CERN,  the European Organization for Nuclear Research.\n\nAs a physicist, I spent more than two decades working with colleagues  from around the globe at Fermilab in Illinois where international  scientific collaboration allowed us to better understand each…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…appropriators.\n\nAnd then, on top of all that, we started to build up more and more  national debt, and so all the money that went to interest on that debt  is money unavailable to be spent on basic programs of healthcare,  housing, education, investments that create good-paying jobs across  America, infrastructure, security. That money isn't so available  because…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…crypto to the benefit of himself and his own family, specifically his  son, who is trying to make deals overseas.\n\nOur Secretary has strong ties to the stablecoin Tether. He spent 40  years as CEO and chairman of Cantor Fitzgerald, one of Tether's key  investors. He is using his and his family's weight to pitch Tether to  foreign governments across the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692975/leadership-of-blockchain-technology"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…resulting chaos has left us weaker and more vulnerable. Like       all of my colleagues, I have always supported reforming       government and making sure our tax dollars are spent wisely.       But this administration has ignored U.S. laws enacted by       Congress--cutting foreign assistance programs and USAID staff       that are essential for our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and service sector workers could become uninsured under  the simply ``Make sure they are going to work'' plan. Who thinks that  is a good idea?\n\nYesterday, House Republicans spent Mother's Day scheming on how to  advance these Medicaid cuts, finally releasing a copy of their  legislation so we could see the detail. It is as catastrophic as we  feared.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…waiver  process.\n\nI watched my mom being churned in and out of the ER, being kept alive  in the ICU in critical condition. The State of Colorado and the Federal  Government spent over a million dollars in one year keeping her alive  in the ER while denying her access to the care that she so desperately  sought.\n\nI was finally able to go through a very…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…values.\n\nThis bill says that our commitment to this Nation's victims is not  just a line in a budget subject to prosecutorial trends.\n\nI would like to say when my family and I spent the 2\\1/2\\ years in  court that we did in Jacksonville, Florida, when my son was murdered in  November of 2012, the Crime Victims Fund of Florida helped to support  the representative…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…out the hypocrisy on the  other side and to point out people's inconsistencies when their own  party is in charge. Yet, I can't ignore the irony that the Republican  Party has spent my entire life railing about Big Brother when Democrats  want to put simple things like energy standards on appliances.\n\nFor the last 4 years, the majority has gone on and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the portion of the       employee's job function that is based out of facilities of       the Department other than the Central Office shall be       proportionate to the time spent at those Department       facilities.\n\n``(C)(i) Not later than one year after the date of the       enactment of the Protecting Regular Order for Veterans Act of       2025,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Children's Healthcare of  Atlanta.\n\nThe daughter of a United States Marine, Pam is a longtime advocate  for our military, as well as our local community, and our children. Pam  has spent more than a decade with Children's Healthcare of Atlanta,  caring for families in their time of greatest need.\n\nA rock of her community, Pam was recognized in 2018 with the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691682/recognizing-pam-younker-on-her-retirement"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Rabbi Dr. Israel Zoberman is founder of Temple Lev Tikvah in Virginia  Beach. He was born in Chu, Kazakhstan (USSR) to Polish Holocaust  survivors who had met in Siberia. He spent his early childhood in  Poland, Austria and Germany before moving to Israel in 1949.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…city's businesses  and the citizens, create an event where love, joy, and peace are  expressed.''\n\nMr. Speaker, the spirit of the holidays is about generosity, service,  and time spent with loved ones. The Family Christmas Extravaganza  reflects those values and highlights what is possible when a community  comes together in the service of others. I ask my…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…and  sponsoring the resolution.\n\nMr. JORDAN. Mr. Speaker, let's be clear: Republicans honor local law  enforcement, Democrats defund them. Five years ago this summer, they  spent the whole summer doing that. That is all you would hear from  Democrats, got to defund the local police. We have been consistent. We  have condemned violence every single time…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…it was not bringing in great revenues to the college.\n\nThat is why this bill says that if you are going to be doing this,  Mr. Speaker, then some of these revenues have to be spent to keep other  sports going as well. We are trying to make sure that there is some  recognition of the Olympic sports, and we are trying to make sure that  there is recognition…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…exceptional  public servant, David McMahon, whose career reflects unwavering  leadership, unwavering patriotism, and a true commitment to the  security of America.\n\nDave has spent much of his life and service to the State of South  Carolina. He grew up in Charleston and today oversees the TSA  operations at the Charleston International Airport along…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…another championship team in East Lansing.\n\nThis championship is the result of countless hours of practice and  years of hard work, and it serves as a capstone to all of the time  spent perfecting their craft, playing as a team, and working under the  leadership of head coach Ray Mitchell.\n\nA sincere congratulations to each and every one of them. This is a…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…who served in World War II and in Korea, devoted his career to  Senator Mike Mansfield and ultimately served as Secretary of the Senate  from 1977-1981. His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional life to serving  six different…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…1871 to 1875, he reported on the House and Senate  action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours writing and studying right here in the House Press  Gallery. Even after his tenure in the gallery, he often would return to  the Capitol.\n\nCongress has honored…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about our brothers and sisters?  Those of us who are baby boomers with gray hair have changed the math  in our country. When I was a kid in the 1970s, for every dollar that  was spent on people 65 and up, there was $7 spent on young people.  Today, that is reversed. Today, we spend $1 on young people and $7 on  those over 65. It is the deal. It is part of…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…decades of distinguished service  as a well-respected and remarkable advocate for the general aviation  industry.\n\nMary's forty-four-year career in general aviation has been spent  mostly on the ground supporting those who do fly. Those contributions  to her industry have been recognized by the high honors of the  industry's ``Distinguished Service''…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…strong footing.\n\nWhat else it does is it produces incredibly needed savings, Mr.  Speaker, savings that the American taxpayers want, as well. They want  their tax dollars being spent better. They want to see this Congress  find a way to get back to balanced Federal budgets.\n\nWhy don't we all work together to do that? We are here working  together to do…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Shockingly, money used on emergency spending is rarely  paid back and most is never used for actual emergencies.\n\nFor example, emergency spending during the COVID-19 pandemic spent  $70 million on tourism marketing campaigns in Puerto Rico and another  $6 million to replace irrigation systems at two golf courses. Other  emergency spending bills have dished…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Ken Stewart.\n\nKen is a proud resident of Ohio's Second Congressional District and a  former firefighter with the Batavia Fire Department. Ken spent over  four decades with the department, working his way up from lieutenant to  chief.\n\nThis past summer, at the age of 85, Ken participated in the 2025  World Police and Fire…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}]