[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…my colleagues to listen to his message of peace, environmental  stewardship, and the importance of bridging the divides between  religions, nations, and all groups who spend more time on the things  that divide us than those that should bring us together. We will gain  from his return if we have the wisdom to listen.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…the  price to be cheap. Energy producers want the price to be high.\n\nIf you work in the energy industry as long as I have or even if you  worked there for 35 seconds, you spend time talking to consumers and  producers. The debate that is going on here in this body is not what is  in consumers' interest, what is in producers' interest, but what is in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…60-vote margin,  filibuster proof. If we get 60 votes, the bill passes. If not, it goes  down. Let's do it before the end of the year.\n\nI happen to think that we ought to spend whatever time is necessary  on this bill. But I understand that leadership is concerned about time.  And so my proposal strips away all the time-consuming procedural  stuff--I have…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Republican colleagues are having in the middle of the night after  promising the American people that Medicaid will be safe from deep  cuts.\n\nRepublicans have spent time and will spend time delivering a bill  that will devastate--again, Mr. Speaker, will devastate Medicaid  enrollment rates. This, again, will happen in the middle of the night.  They are scheduled…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Company, a respected  think tank, predicts that the shortage will grow to 400,000 by the end  of this decade.\n\nMadam Speaker, Members of this House don't really need to spend much  time reading these reports to know that that shortage is real. Just go  to any hospital, nursing home, or health clinic in your district, and  you will hear the same thing:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…the special areas of the western Arctic in the  great State of Alaska.\n\nLet me tell you a little bit about this special place, a place in  which I have had the privilege to spend time. The Arctic refuge, the  homeland of Gwich'in and the Inupiat people, offers unmatched, truly  wild fishing and hunting opportunities for all Americans.\n\nIt is the only national…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…ideas and an affirmative vision for solving the  cost-of-living crisis that so many of our constituents are facing that  they have made the decision that it is better to spend their time on  disapproval of Biden administration-era rules.\n\nThat is the only conclusion I am left with.  Dexter).\n\nMr. Speaker, unless I can convince the chairman to have a final…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…require extra care and attention. It is my life's mission to       bring what I know to those who want to learn it. I love the       job I do. I love that I get to spend time with those who need       it most and deliver care and education. The job that I do       helps my students live more independently and achieve richer       and more fulfilling…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…wish him a very happy  retirement.                    Concerns Over High Cost of Healthcare\n\nMr. MAGAZINER. Mr. Speaker, while Donald Trump and congressional  Republicans spend time building a billion-dollar ballroom, bailing out  Argentina, and lavishing tax cuts on billionaires, Rhode Islanders and  Americans continue to struggle with the high cost…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…the  most dangerous of places, your country will have your back.\n\nI have spent my time on this House floor urging for the reversal of  harmful cuts just like these, and I spend my time in committee  questioning Secretary Hegseth as to why this policy was ever changed in  the first place. Today, I am glad to report that 8 days after the  hearing with Secretary…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694036/safe-kits"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…for offering inconvenient assessments, then we will only get  intelligence the White House wants.\n\nImagine the consequences if our intelligence community is forced to  spend its time chasing down conspiracy theories instead of monitoring  terrorist networks, cyber threats, or foreign adversaries. Imagine if  analysts stop flagging real dangers because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…That is not bad luck. That is not happenstance. That is  because, in America, we decide to have a ton of weapons in the hands of  very dangerous people. We also don't spend enough time trying to unwind  some of the reasons young people, in particular, get into lives of  really risky and potentially violent behavior.\n\nSo we came together in 2022, and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…debate on Thursday on those three bills.\n\nI suspect that the folks who are watching this debate, Mr. Speaker,  would agree with me that there are better things for us to spend our  time on here in Washington, D.C., than debating walk-in refrigerators.  Seriously? I don't know, maybe for Madam Chairwoman it is really  important to the people of North Carolina.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…Women's Leadership  Board.\n\nWith retirement, Carol will have the time to continue doing what she  loves: travel around the world with her husband Rodney, gardening, and  spend time with her cats, Rosie and Elvis.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…unprotected. Terminating these  critical programs and offices just puts millions of lives battling  substance abuse in jeopardy.\n\nMr. Speaker, I wish my colleagues would spend time on these issues of  protecting public health and coming up with solutions instead of  retreading a bill that prioritizes this criminal justice approach,  which I think doesn't…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…and leadership have left a lasting impact on the company  and his many colleagues across the enterprise.\n\nCollis and his wife Stefanie, who also recently retired, plan to  spend time traveling, enjoying family and friends, and perfecting their  golf game. I wish Collis, Stefanie, and their daughter, Camryn, all the  best in the years to come.", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have Pell grants--and I will tell you a story about that in a  minute--a program that gives free college to a family without a working  person.\n\nNot surprising, if you spend some time talking to people who aren't  at your country club fundraiser, spend some time talking to people who  are not lobbyists, you will be surprised how many young people today…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…creditworthy, disciplined, sensible, seeing long term, and  actually understanding the honesty of our demographics.\n\nInstead, a bunch of the brain trusts here in Washington spend their  time attacking Moody's for downgrading us and telling the truth. The  problem is, if you actually read their document, it is the truth.\n\nFor everyone out there who thinks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. FITZGERALD. Mr. Speaker, I will spend the time I have remaining  responding to a few points made by my colleagues.\n\nFirst of all, the U.S. States and territories already criminalize the  misuse of less-lethal devices…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…solution  to that, eliminating ridiculous regulations that really impede  manufactured housing.\n\nMr. Speaker, as chairman of the Subcommittee on Financial  Institutions, I will spend my time here tonight highlighting the  section of the bill that provides regulatory relief for community  banks.\n\nTo drive down costs, we need to make it easier for those community-…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…while, you sit in these committee hearings and hear the problems of  high crime and murders and such, and people have suggestions as to how  to deal with them, but we don't spend enough time pointing out that one  way that would certainly reduce the crime rate, maybe back down to  where it was in the 1950s, is to do what we can to build up the  traditional…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a strong sense of mission  throughout the organization, and strengthened the relationship between  UWPC and its many partner agencies. Charles retired 2 months ago to  spend more time with his family, and he leaves behind a stronger, more  resilient UWPC prepared to meet future challenges.\n\nIt is clear Charles Anderson has made a profoundly positive…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…come from provisions governing the use of official time,  which is when Federal employees are paid by taxpayers to do union  business.\n\nIndeed, many Federal employees spend all their time doing union  business. More than 3 million Federal employee work hours were spent  doing union business time in 2024 alone, according to the OPM report.\n\nThe cost to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…time. You would rarely see Thunberg syndrome in, say,  somebody with four kids, because four kids is very time-consuming. You  have to earn money to take care of the kids, spend time with the kids.  That is a purpose in life.\n\nI think, as we have more and more young, single people not having  children in the West, you have more and more people looking…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Bend, Hutch to WaKeeney, Hoxie to Jetmore, Hays to Hill  City.\n\nIt is the honor of my life to represent the Big First District of  Kansas in Congress, and I was grateful to spend time with Kansans while  I was able to be home. For the fifth year in a row, I visited all 60  counties in the Big First District, and I had the chance to hear about  the impacts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Chairwoman McClain for the  opportunity to speak in this Special Order hour.\n\nWhen I was back home for a big portion of August, Madam Speaker, I  had a great opportunity to spend time with small business owners and  individuals trying to understand the difference between an invest  America Trump account versus a 529 and going through a lot of these  details.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Americans are preparing to celebrate the  250th birthday of the United States in 2026.\n\nHow do you properly celebrate 250 years of freedom? One very uniquely  American way is to spend time in what Wallace Stegner called ``the best  idea we ever had,'' our national parks.\n\nNational parks provide our connection to history, nature, and shared  heritage, including…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…today to recognize and thank the brave men and  women of the South Carolina National Guard who are currently deployed  here in Washington, D.C.\n\nI have been fortunate to spend time with these young men and women on  several occasions during their mission. I have shared a meal with the  guardsmen. I visited as they prepared for patrol. I have seen them…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…currently spend 750,000 hours engaging not in  care for veterans but in union activities. That is every single year.  The President's executive order will lead VA employees to spend more  time helping veterans and less time in union activities.\n\nIt goes even further. This bill forbids the Trump administration from  unwinding any collective bargaining agreement…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are new citizens.\n\nThat is not including the approximately 10 million people who are  here on student visas, work visas, or tourist visas. As far as people  who want to spend a short time here, particularly to work, we are even  more generous that way. I have heard of no strong efforts being made to  greatly reduce these numbers.\n\nAgain, we have to remind…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]