[{"senator": "Dave Min", "party": "Democrat", "sentence": "…Speaker, I want to continue back to Elon Musk. Whatever side is  taken in this debate, we cannot forget that Elon Musk, again,  repeatedly violated the law. He made illegal spending cuts. He tried to  eliminate agencies created by Congress. This was not jaywalking. We are  talking about serious crimes against the Constitution of the United  States.\n\nHis…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…children, from small businesses, and from  communities in every part of the country.\n\nAs the courts have repeatedly concluded, this administration's  disregard for our Nation's spending laws and Congress' power of the  purse has harmed every corner of our country. Children in elementary  schools have been denied resources they need to succeed. Farmers in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…businessowners, I  don't think the gentleman knows what he is talking about.\n\nThis is outrageous. I have the bills that we are considering here  today, and the reason I am not spending much time talking about them is  because they suck. They are awful. It is pathetic. One creates a  hotline that already exists. Mr. Speaker, you can go online and call  the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…who is all about  workers first, which is why I had to drive down to the city to the  Department of Labor and see the President's face on the big, old  banner.\n\nWhy are we spending money on these banners but cutting money to  farmers? Because dismantling USAID and cutting USAID is more than just  what is happening in other countries. You are actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and  hardworking American taxpayers in the great State of Connecticut, and  all across America.\n\nMr. Speaker, I rise today in strong opposition to this woefully  inadequate spending bill that fails to decisively address the  Republican healthcare crisis and fails to extend the Affordable Care  Act tax credits for tens of millions of Americans.\n\nMr. Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…plan is  her only real option.\n\nIn this, the richest country in the world, the richest country in the  history of the world, this is simply unacceptable. No one should be  spending nearly all of their waking hours working multiple jobs and  still unable to afford basic healthcare coverage for themselves and  their family members. Yet this is the painful…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…government'' and ``relieve Congress of the  burden of legislating upon essentially local District matters,'' yet  the House today is denying D.C. residents local self-government and  spending its time on local D.C. matters.\n\nMr. Speaker, I remind my Republican colleagues what Republican  President Richard Nixon said when he signed the Home Rule Act: ``One of  the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…have sustained America's economy for generations, and in  my home State of Florida, they make up over 30 percent of our workforce  and contribute more than $170 billion in spending power.\n\nMany industries, such as construction, agriculture, hospital, and  healthcare, are already suffering severe worker shortages.\n\nEnding TPS for nearly one-half million…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698089/immigration"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise in opposition to this year's  massive $900 billion military spending bill.\n\nThis legislation gives more money to the so-called Department of War  than to our Department of Education, Transportation, and Health and  Human Services combined.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698052/opposition-to-the-military-spending-bill"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…claimed that vulnerable populations who need  Medicaid will not be harmed by provisions in this legislation, but we  saw this play out before.\n\nIn 2011, when States had to cut spending to comply with Federal  requirements, many people with disabilities were hit hard and fast by  the loss of services.\n\nI implore every one of my colleagues: Do not be complicit…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…unauthorized war.\n\nThis administration is out of control and Congress must act.  Republicans can't keep their heads in the sand. They have already  failed to protect core Article I spending authorities, the power to  make appropriations and the power to declare war. Continued inaction  will only allow more power grabs by this White House to occur.\n\nAt every turn,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…demanded five reasons they deserve  to keep it.\n\nLet's turn that around. Here are five things the world's richest man  did just last week:\n\nOne, DOGE deleted the five biggest spending cuts it bragged about  just last week, because nearly one-half of those savings don't exist.  The receipts didn't add up.\n\nTwo, more than 20 employees resigned from DOGE,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…floodgates to unlimited corporate money in our  elections and fundamentally distorted our democracy.\n\nBy discarding decades of precedent, the Supreme Court declared that  unlimited spending in elections poses no threat to our democratic  system and that corporations are entitled to the same political rights  as the people whose lives are governed by the outcomes…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Congressional Budget Office says will take healthcare away from an  additional 100,000 Americans a year.\n\nWe need to make healthcare more affordable for all Americans. Despite  spending 18\\1/2\\ percent of our GDP in the United States on healthcare,  we have the worst outcomes: the highest mortality rate, life  expectancy, and acuity.\n\nWe need to make it more…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Development and Related Agencies  Appropriations Act for Fiscal Year 2026, and in opposition to the  underlying bill.\n\nThe bill itself cuts over $750 million from the FY25 spending levels,  revokes $5 billion from the Bipartisan Infrastructure Law, zeroes out  Army Corps programs that clean up radioactive waste and blocks clean  energy initiatives. My…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to support the bill, and I reserve  the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate on this bill.   EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION OF THE RULES IN THE HOUSE OF                                     REPRESENTATIVES WEEK OF FEBRUARY 9, 2026 ----------------------------------------------------------------------------------------------------------------…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…two-thirds majority vote.\n\nAt the request of the Majority Leader and the House       Committee on the Budget, CBO estimates the effects of those       bills on direct spending and revenues. CBO has limited time       to review the legislation before consideration. Although it       is possible in most cases to determine whether the       legislation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…history, putting  $4.5 trillion in Americans' pockets instead of in the government's  coffers. It delivers permanent tax relief, begins to rein in  Washington's out-of-control spending, makes historic investments in  border security and national defense, and restores the kind of  commonsense priorities people in my State of North Dakota live by every  single…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it turns out that if you actually read those MedPAC  reports--these are the auditors who do the modeling, and we are talking  something that is almost a trillion dollars in spending last year, so  we are talking about something that is stunning amounts of money--last  year, Medicare Advantage came in at 120 percent of fee-for-service.\n\nMr. Speaker, just…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…funding bill really carries out our Nation's foreign  policy in a historic way in so many different aspects. First and  foremost, the bill restores fiscal sanity by reducing spending by 16  percent, which is nearly a $10 billion cut, in recognition of the  President's and the Secretary of State's effort to make the Department  of State, frankly, more efficient,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…passed both the House and Senate unanimously. The nonpartisan  Congressional Budget Office has estimated that my bill will not result  in a measurable increase to Federal spending.\n\nH.R. 131, the Finish the Arkansas Valley Conduit Act, will help small  rural communities in southeast Colorado finally complete a Federal  water project that was authorized…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reconciliation process  is a part of the Budget Control Act, which basically gives us the  ability to reconcile current policies with what we are dealing with,  with respect to our spending, debt, and deficits. We have to make that  all add up, and we are supposed to do that in a way that would yield  deficit neutrality or deficit reduction. That is the general…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…feeding our men and women. How disgusting does that sound?\n\nWith a national debt of over $37 trillion, we can't afford to litter  sensible appropriation bills with wasteful spending.\n\nAn October 20 press release revealed BioMADE received $87 million in  Federal dollars under the Biden-Harris administration to produce lab- grown meat to reduce carbon emissions…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…payments, lowering ACA premium costs for all in the  marketplace by 11 percent. This policy alone results in an average  premium savings of $900 nationally, while reducing Federal spending,  saving taxpayers $36 billion.\n\nContrary to what we hear from my colleagues on the other side of the  aisle, the premium tax credits continue and revert back to their 2021…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…on Energy and  Commerce, to unleash American energy, promote innovation, and protect  healthcare for the most vulnerable Americans.\n\nWe claw back wasteful and unnecessary spending. We unleash affordable  and reliable American energy. We support technological innovation by  reauthorizing the spectrum auction authority. We secure Medicaid for  those who…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Government is laying out.\n\nRight now, as a matter of fact, the money is so great, even though  new projects are spread out or the tax credits are spread over nine  years, we are spending over $13 billion a year on this method of so- called creating workforce housing or low-income housing.\n\nI will also point out that there are some people who would say this…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…dollar of your money, it delivers value.\n\nCritics argue that some government contracts canceled by DOGE haven't  led to immediate savings. Isn't canceling wasteful government spending  before it can be renewed a step in the right direction?\n\nShouldn't we be cleaning house rather than just accepting bad deals  because they are already in motion?\n\nLet's put…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…crossover with Sesame  Street which, again, leveraged taxpayer dollars to concentrate wealth  to private individuals.\n\nIt is clear that we must slash this tranche of wasteful spending and  continue down a path to fully restore fiscal sanity in our Nation.\n\nOnce again, I need to set the facts straight. Our colleagues keep  flip-flopping on their characterization…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually gotten right.\n\nThe one thing I wish I had gotten wrong was the debt and deficit  projections. For the trolls out there who immediately say, ``Well,  there is all this spending in the tax bill,'' most of that hasn't  started yet. If you actually look at the breakdown of what is going on,  what the two drivers of U.S. sovereign debt are, they are…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…single investment in border security and  national defense; the most significant commitment to unlocking  America's energy resources; and the largest reduction in mandatory  spending in the history of the United States by twofold.\n\nIt is beautiful, Mr. Speaker, because of the tangible benefits these  policies will provide to our fellow Americans.\n\nDuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}]