[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today with a heavy heart to honor the  memory of a loving husband, dedicated father, outstanding Man of God,  devoted spiritual leader, gifted musician, astute entrepreneur, and  dear friend of longstanding, Overseer Roosevelt Carter, I, who passed  from labor to reward on June 15, 2025. A funeral…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "Ms. LEE of Pennsylvania. Mr. Speaker, I rise today to welcome His  All-Holiness Ecumenical Patriarch Bartholomew, Archbishop of  Constantinople-New Rome and spiritual leader of more than 300 million  Orthodox Christians worldwide, to Washington, D.C.\n\nThis week, His All-Holiness is visiting our Nation's Capital to  receive the Templeton…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, I rise today to welcome to Washington, DC,  next week His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of Orthodox Christianity.\n\nHis All-Holiness is a guiding light for the 300 million Orthodox  Christians, including many thousands across California, from San Diego…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise today to welcome the All- Holiness Ecumenical Patriarch Bartholomew, the Ecumenical Patriarch of  Constantinople and the spiritual leader of Orthodox Christianity  worldwide.\n\nAt 85 years old, All-Holiness Ecumenical Patriarch Bartholomew  remains at the forefront of the global struggle for religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…in 1990, Metropolitan of  Chalcedon. Finally, he was elected in October of 1991 as the 270th  Archbishop of the 2000-year-old Church founded by the Apostle Andrew.\n\nAs the spiritual leader to 300 million Orthodox Christians worldwide,  Ecumenical Patriarch Bartholomew is known as a transnational  figure who has focused on organizing international and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…people of different faiths together  to discuss how they could be good stewards of the Earth, and he made  caring for the environment a central commitment in his role as  spiritual leader. In 1997, the Patriarch even received the  Congressional Gold Medal, the highest honor awarded by this body.\n\nOn behalf of the vibrant Greek Orthodox community in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…profound honor to recognize His  All-Holiness Ecumenical Patriarch Bartholomew, known throughout the  world as the ``Bridge Builder'' and the ``Patriarch of Peace.'' As the  spiritual leader of over 250 million Orthodox Christians, he has  dedicated his life to the pursuit of reconciliation, understanding, and  human dignity. Despite enduring decades of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…benefits, native plants are  foundational to the cultural heritage of many indigenous communities,  who have long depended on these plants for food, medicine, shelter and  spiritual practices.\n\nIn my home state of Hawaii, our kuleana (responsibility) is to care  for over 1,400 native plant species, nearly 90 percent of which are  endemic, meaning they…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to extend a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of the world's Orthodox Christians and the head of the  Ecumenical Patriarchate of Constantinople.\n\nAs the spiritual leader of the second-largest Christian Church…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Jewish American  Heritage Month to pay tribute to a remarkable spiritual leader and  community advocate from Rochester, NY: Rabbi Alan Katz.\n\nRabbi Katz served with grace and wisdom as the rabbi of Temple Sinai  from 1986 to 2020, and now holds…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691618/recognizing-rabbi-alan-katz"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department reorganization plans that will gut the funding and experts  working to address…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the Hellenic Caucus and  a proud Greek-American, I rise today to welcome His All-Holiness  Bartholomew I, Ecumenical Patriarch of Constantinople, to the United  States, the spiritual leader of the Orthodox Christian community around  the world. His All-Holiness's visit to Washington, D.C. and New York is  yet another demonstration of his commitment to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Mr. KELLY. Mr. President, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to Washington, DC. He is the spiritual  leader of Orthodox Christianity, the second largest Christian Church in  the world, with more than 250 million members worldwide and over 1  million here in the United States.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today to honor and welcome His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C. He serves  as the spiritual leader and Primus inter Pares (First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people.\n\nLater this month, His All-Holiness will visit the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…From its earliest beginnings in the aftermath of the Civil War  to its continued presence today, the church has grown alongside  Stockton, adapting and expanding to meet the spiritual and civic needs  of its neighbors.\n\nWhat began as a small gathering of individuals committed to living  out their faith in community has become one of the city's enduring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Mr. MARSHALL. Mr. President, I rise today to welcome to our Nation's  capital His All-Holiness Ecumenical Patriarch Bartholomew, the  Spiritual Head of the second-largest Christian Church in the world. His  All-Holiness serves as the current Archbishop of Constantinople and  leads over 300 million Orthodox Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…sign of a threatened\n\nCovenant renewed, to protect me always with a Tallit\n\nOf reaffirmed life even if God's blessing would not.\n\nRabbi Dr. Israel Zoberman is the founder and spiritual       leader of Temple Lev Tikvah as well as Honorary Senior Rabbi       Scholar at Eastern Shore Chapel, both in Virginia Beach.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…hope, and  love--guiding generations through times of challenge and celebration.  Their commitment to spreading the Gospel, serving the Gulf Coast  community, and nurturing spiritual growth has made a lasting impact.\n\nThis milestone is not just about looking back--it's a powerful  reminder of the faithfulness of God and the strength of a community  rooted…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691555/special-recognition-of-150-years-of-first-baptist-church-of-biloxi"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…mission is to ``educate children to       become scholars and form them to become saints,'' reflecting       a dedication to nurturing both intellectual excellence and       spiritual growth in every student;\n\nWhereas, Holy Family Catholic Academy is devoted to forming       virtuous young leaders, instilling in its students the values       of virtue,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "Mr. ISSA. Mr. Speaker, I rise today to extend a warm welcome to the  Ecumenical Patriarch of Constantinople, His All-Holiness Bartholomew,  the spiritual leader and ``First Among Equals'' of more than 300  million Orthodox Christians worldwide. During this historic visit to  the United States, His All-Holiness will receive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, on behalf of my constituents at St. John the  Baptist Greek Orthodox Church in Omaha, I would like to welcome their  Spiritual Leader, the Ecumenical Patriarch of Constantinople, His All  Holiness Bartholomew, to the United States. He is visiting the United  States next week to meet with the president…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…ask you to join me in  taking a stand against the Chinese Communist Party's systematic  persecution of Falun Gong practitioners.\n\nSince the early 1990s, the Falun Gong, a spiritual practice rooted in  the principles of truth, compassion, and tolerance, has been targeted  by the Chinese Communist Party. By 1999, Mr. Speaker, an estimated 70  million…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Teresa Home in  Western New York.\n\nThe Saint Gianna Molla Pregnancy Outreach Centers have a tangible  impact on our community, providing important material, emotional, and  spiritual support during and after pregnancy. This life-affirming work  has saved lives, eased the transition into motherhood, and directly  impacted over 1,500 families each year.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689281/recognizing-cheryl-calire-for-her-steadfast-service-and-dedication-to-the-saint-gianna-molla-pregnancy-outreach-center"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…churches in Colorado  Springs are joining the international and ecumenical emphasis of prayer  between the Jewish holidays of Rosh Hashanah and Yom Kippur. These  significant spiritual days are being recognized by daily prayers in a  variety of churches and ministries in Colorado Springs.\n\nI thank The Road Church, Gateway Prayer Garden, World Prayer Center,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "Mr. HAMADEH of Arizona. Mr. Speaker, I rise today to offer a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of 300 million Orthodox Christians throughout the  world and the current Archbishop of Constantinople, serving in one of  the oldest sees in Christendom. This month,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, I rise today to welcome to America His  All-Holiness Ecumenical Patriarch Bartholomew, the spiritual leader of  the world's second-largest Christian Church--Orthodox Christianity-- which encompasses over 250 million faithful worldwide.\n\nWe in Louisiana take particular pride…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Washington, D.C., from September 15 through  September 17.\n\nFor many Greek Orthodox faithful in my district, His All-Holiness is  more than a religious leader. He is their spiritual father. He is a  voice of compassion, a symbol of faith that has been carried across  generations of families who came to America in search of freedom of  opportunity. His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Blessed Virgin Mary (BVM)  Parish in Feasterville, Pennsylvania. This year, Assumption BVM  celebrates its 75th Anniversary, an exceptional milestone that reflects  decades of spiritual dedication and charitable impact. It is my honor  to commend the parish on this remarkable achievement.\n\nSince its founding on November 3, 1950, Assumption BVM has dedicated…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, I rise today to welcome His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C.--the  spiritual leader and Primus inter Pares (First among Equals) of more  than 300 million Orthodox Christians worldwide. For decades. he has  been a tireless voice for religious freedom,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to welcome Ecumenical Patriarch  Bartholomew, the Spiritual Head of the second largest Christian church  in the world who is visiting our Nation's Capital this week. Back home  in Colorado's 5th Congressional District, Archangel Michael…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695657/welcoming-ecumenical-patriarch-bartholomew-to-america"}]