[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Mr. Speaker, this shows what Trump had to say about  crypto before he learned he could make money from it.\n\nThe bills we have allow the President and the Vice President to  sponsor crypto. It means they can print their electronic monopoly  money. China is buying $300 million, and Abu Dhabi has agreed to buy $2  billion of Trump coin or Trump stablecoin.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…over trade--the Senate  Committee on Finance and House Committee on Ways and Means--can  likewise provide valuable oversight. I look forward to working with my  colleagues who sponsor this bill to bring those trade interests into  the fold. In addition, I look forward to working to clarify the  definition of ``ally or key international partner nation''…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692998/promoting-resilient-supply-chains-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…strong opposition to H.R. 6359, a bill  that claims to protect pregnant students but actually mandates that  they get less, not more information about their rights.\n\nIf the sponsor of this bill and the majority party actually believed  in supporting student parents, then they would take real action, not  just grandstand on the House floor because the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…professionalism, with  extraordinary precision--or their views of its effectiveness--and I  hope and pray the mission was effective--Iran is a malevolent regime,  it is the paramount sponsor of terrorism in the world, and it must  never be allowed to obtain the bomb.\n\nRegardless of whether you support the President's decision to engage  in preemptive strikes in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…support of this legislation and moving it forward. Certainly, I thank  the lead sponsors, Representatives Alford and Davids, for their  gracious support of me and for helping to sponsor this bill and move it  forward.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…screenings for America's seniors, ensuring Medicare coverage for these  emerging tools once they become FDA approved.\n\nI am immensely grateful that this bill was led by Republican sponsor,  Congressman Jodey Arrington, and the many organizations and patient  advocacy groups who helped us push this bill across the finish line. I  am giving a big shout-out to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…goals or when setting energy plans for installations.\n\nIt is hard to look at that language and consider this amendment with  a straight face. I would be curious to know if the sponsor talked to  the agriculture community. I am sure they would have concerns about the  attacks on biodiesel and ethanol. This attack is actively harmful, and  it sets us backward,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tensions, and advanced cooperation. We  were on the road to helping create a new future for Cuba.\n\nHowever, Trump takes us backward. He unjustifiably added Cuba to the  state sponsor of terrorism list, purely for political reasons. They  ought to be removed from that list. He banned travel and blocked  remittances. He has cut off our ability to negotiate…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…consideration, and  reach a decision that is best suited to their jurisdictions.'' Unlike  D.C., 2 percent of local police departments prohibit vehicular pursuits  altogether. The sponsor of this bill, who is from Louisiana, thinks he  knows better than D.C. how to strike the proper balance in D.C.\n\nI will read for my Republican colleagues part of the signing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…gun powder to a gun that is going to be able to shoot bullets.  Then, within months, people would be able to purchase the same parts  online or in their local gun store.\n\nThe sponsor of this bill says that it makes it possible for law  enforcement to obtain tasers. They don't need this bill to do that. In  fact, this bill isn't even tailored specifically…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…matter  our politics, we all want the same thing: the ability to feed our  families, put a roof over our heads, and find a job with dignity.\n\nThat is why I am proud to be a sponsor of legislation that would  restore some common sense by banning the President from imposing  tariffs without congressional approval, capping the cost of childcare,  expanding…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…This is legislation, and it is a law--it is not a rule--it is a law  that we passed in 2017 during the first Trump administration. I know  because I sponsored it. The House sponsor was our current Secretary of  Homeland Security Kristi Noem. It had support from our current National  Security Adviser, former Congressman Waltz, and it was bipartisan  legislation.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…The longstanding success of Art on  the Avenue has been made possible by Pat's vision and commitment.\n\nI also want to offer special recognition to the local businesses that  sponsor the festival each year, and to the hundreds of volunteers whose  steadfast efforts ensure its continued excellence and vitality.\n\nIn commemorating this milestone anniversary,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696005/recognizing-30-years-of-art-on-the-avenue"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…commonsense bill to ensure the Federal Reserve improves its  discount window to provide emergency liquidity to banks when they need  it.\n\nI appreciate that the chairman and sponsor worked with Representative  Waters and Representative Foster to include our amendments to help  ensure that we learn how technology may require faster emergency  liquidity…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…leaders.\n\nIt is all about teamwork, a true community effort. From dedicated  coaches and supportive parents to local businesses and volunteers who  maintain the fields and sponsor teams, everyone plays a role.\n\nCongratulations to the Burbank National Little League on 70  incredible seasons and over 80 league local and national championships.  Here is…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Department officers the due process they need to  confidently do their job.\n\nMr. COMER. Madam Speaker, I yield 3 minutes to the gentleman from New  York (Mr. Garbarino), the sponsor of the bill.\n\nMr. COMER. Madam Speaker, before I reserve, I want to make sure that  my colleagues across the aisle know what bill we are actually debating  on the floor, that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…the Memphis area, including the world-class  Memphis Zoo.\n\nMemphians can also thank Fred Smith for saving the FedEx St. Jude  golf tournament when it lost its previous title sponsor.\n\nYesterday, when discussing the life of Fred Smith, I talked with my  good friend, Chris Richards. She was the general counsel at FedEx and a  close adviser to Fred Smith.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…them two times over because of our State's  very poor policies when it comes to forest management, which goes to  the insurance issue, as well.\n\nThat is why I am very proud to sponsor the Fix Our Forests Act, which  allows for more effective forest management which will stop  catastrophic wildfires and will make it so we don't have to keep  raising the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Take foreign money first, ask  questions later is not the way to go.\n\nMr. WALBERG. Mr. Chair, I yield 3 minutes to the gentleman from  Washington (Mr. Baumgartner), who is the sponsor of this legislation.\n\nMr. WALBERG. Mr. Chair, I appreciate the concerns of my colleague,  but my committee has worked very closely with the Select Committee on  the Strategic…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…deserve.\n\nMr. BIGGS of Arizona. Mr. Speaker, I commend law enforcement for  their tireless work of protecting children, and I commend the work of  this committee and the lead sponsor of this bill, Mr. Harris.\n\nMr. Speaker, I urge my colleagues to support H.R. 6715 so that every  child predator is fully held to account. Let's do this today. Let's get  it…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…closely with the  Peltz family, veterans service organizations, the Department of  Veterans Affairs, and my colleagues on both sides of the aisle,  including the lead Democrat sponsor, Congressman Ro Khanna, to craft  this legislation to correct this moral wrong.\n\nThis bill eliminates the burden on a veteran's surviving family by  ensuring that the veteran…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…concerns of various  localities and establishes new ZIP Codes for communities across the  Nation.\n\nMr. Speaker, I thank the gentleman from Florida (Mr. Diaz-Balart),  the bill's sponsor, for putting this bill together.\n\nMr. COMER.  Hageman).\n\nMr. COMER. Mr. Speaker, I urge passage, and I yield back the balance  of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…working with my colleagues in the  Senate to get the bill signed into law.\n\nMadam Speaker, I yield such time as he may consume to the gentleman  from Arizona (Mr. Ciscomani), the sponsor of this bill.\n\nMr. BOST. Madam Speaker, I have no additional speakers.\n\nMr. BOST. Madam Speaker, once again, I encourage all Members to  support this legislation, and I yield…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…our  Federal lands, especially in an area that when it was established, part  of its goal was to be able to provide off-road vehicles a place to  recreate.\n\nMaloy), the lead sponsor of this legislation.\n\nI appreciate the gentlewoman for her efforts on this legislation and  for being a voice for her constituents. She talked about the county  governments…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Representative Gerry Connolly  of Virginia, who we sadly lost earlier this year. Representative  Connolly not only sat on the Adams Memorial Commission but also was the  main Democratic sponsor of this legislation and a champion for the  Adams Family Memorial.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nJust down the hall from this Chamber,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…GROUNDS FOR NATIONAL PEACE                     OFFICERS MEMORIAL SERVICE.\n\n(a) In General.--The National Fraternal Order of Police and       its auxiliary shall be permitted to sponsor a public event,       the 44th Annual National Peace Officers Memorial Service (in       this resolution referred to as the ``Memorial Service''), on       the Capitol Grounds,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…law enforcement partners to stay ahead of these emerging threats and  safeguard our most vulnerable.\n\nI urge my colleagues to join me in voting in favor of S. 146. The  House sponsor is the gentlewoman from Florida (Ms. Salazar). She is a  great friend of mine. Let's get this done. We need to be protecting our  children.\n\nMr. BILIRAKIS.  Salazar), the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…source. H.R. 131 will ensure this  project can finally be completed.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. GOSAR.  Boebert), the lead sponsor of this bill.\n\nMr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue water  infrastructure improvements in rural…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…reserve  the balance of my time.\n\nMr. BOST. Mr. Speaker, at this time, I yield such time as he may  consume to the gentleman from Wisconsin (Mr. Van Orden), who is the  chief sponsor of the bill.\n\nMr. VAN ORDEN. Mr. Speaker, I thank the chairman for yielding me  time.\n\nMr. Speaker, I rise in support of my legislation, the Veterans  Education Transparency…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Enhancement Act, which was signed into law earlier  this year.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. WESTERMAN.  Stefanik), the lead sponsor of this bill.\n\nMr. WESTERMAN. Mr. Speaker, this bill by Representative Stefanik  acknowledges a significant site for its pivotal role in American  history as we approach our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}]