[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…private messages once encryption is breached. Doing so threatens the  privacy and security of every single law-abiding American.\n\nLast Congress, I made progress with the bill's sponsors to address  some of these concerns. Indeed, I compromised on a version of this bill  and had agreed to remove my hold to let that version pass by unanimous  consent. It is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…provocations toward Taiwan with increasingly  hostile rhetoric and actions. This includes military incursions into  Taiwan's airspace and territorial waters. Thus, I agree with the  sponsors of this bill that Congress must stand up for Taiwan and its  people as they confront this threat.\n\nThis is especially true, given the Trump administration's naive,  waffling…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…easier chance of applying for a contract with the  Federal Government.\n\nI am hopeful when this legislation is implemented, it will contribute  to that goal. I thank the bill's sponsors.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691849/plain-language-in-contracting-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…of H.R. 909,  there is truly an urgent need to pass this legislation. Without Federal  funding, critical victim services are simply going to vanish.\n\nI am grateful to the sponsors of this bill and to all of our  colleagues for their bipartisanship in doing what is right to help our  victims and for their efforts.\n\nMrs. McBATH. Mr. Speaker, I have no…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…The pastor for the last 13 years, Reverend Erwin Lee Trollinger, has  been a true leader for the people of faith both inside and outside the  church family.\n\nCalvary Baptist sponsors weekly worship services, Bible study, Sunday  school, and external outreach to assist the needy of the community.  Pastor Trollinger and the team of ministers work tirelessly…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…issues of the day, the  Scarsdale Forum.\n\nThe organization traces its roots back over 120 years to 1904, with a  charitable and educational mission at its core. The forum sponsors  events and seminars addressing the issues, choices, and solutions that  directly impact the community. The floor committees study substantive  issues, produce reports for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…officers encounter put them, as  we all know, at an increased risk of developing mental health  disorders, including PTSD, depression, and anxiety.\n\nThis Police Week, I thank the sponsors of the bill, my colleagues  across the aisle, for introducing H.R. 2240, the Improving Law  Enforcement Officer Safety and Wellness Through Data Act.\n\nI did offer an amendment…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691322/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…remains competitive. I applaud Mr. LaLota, Dr. Morrison, and  Mr. Thanedar for their bipartisan work.\n\nMs. VELAZQUEZ.  Morrison).\n\nMs. VELAZQUEZ. Mr. Speaker, I thank the sponsors of the bill, and I  yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687906/doe-and-sba-research-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…to suicide each year than to car accidents, and the need for  accessible, compassionate support is urgent.\n\nThanks to the dedication of volunteers, community partners, and  sponsors, this year's Fairfax Walk has raised over $125,000 to support  prevention programs, research, advocacy, and resources for those in  crisis. Local partners including Leidos,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…amended, final  version of the bill includes this negotiated rule of construction to  prevent State consumer protection laws from being preempted, as  intended by the bill's sponsors and supporters.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692635/genius-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…long. On behalf  of my constituents in New Hampshire's 1st Congressional District, I  thank Ms. JerriAnne Boggis, her staff, and the tour guides, volunteers,  board members, sponsors, and supporters of the Black Heritage Trail of  New Hampshire for their commitment to bringing Black history to light  and ensuring that these stories are never forgotten.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…sickle cell, and tropical diseases have all seen medical breakthroughs  during this program.\n\nGive Kids a Chance will also reauthorize the FDA to take action  against drug sponsors that fail to comply with pediatric study  requirements. Thus, ensuring that patients get the latest and best  treatments that they require. As Dr. Benjamin Ebert, President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…cancer. She was a fierce fighter for this bill. She talked to all of  us, and we all sent videos to her. Unfortunately, she died on October  30.\n\nHer mother told all of us, the sponsors and the cosponsors of this  bill, that we gave her reason to live, and she hopes that other  children will not die at her age and that this bill will help save  lives.\n\nShe…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…industrial-scale operations--massive drill rigs, heavy  machinery, and construction fleets--all without the environmental  review that everyone else would have to undergo.\n\nThe sponsors insist that these undersea cables are just little  needles in a haystack, and they will probably hold up a little segment  of one of these cables to try to suggest these are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…entrepreneurial goals.\n\nI thank Chairman Williams and Ranking Member Velazquez for their  support of this legislation and moving it forward. Certainly, I thank  the lead sponsors, Representatives Alford and Davids, for their  gracious support of me and for helping to sponsor this bill and move it  forward.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of the community in Lock Haven.\n\nThe club has 43 members, and it works to help children by improving  literacy rates, health, and educational outcomes.\n\nLock Haven Kiwanis sponsors two Key Clubs, one at Central Mountain  High School and the other at Jersey Shore High School. It awards annual  scholarships to Key Club members at both schools.\n\nThe club…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "…Canada and the western United States, not in-State emissions. This  resolution substitutes Washington mandates for State-level expertise,  dictating decisions on a State the sponsors do not represent and  unnecessarily constraining South Dakota's economy.\n\nFor these reasons, I urge my colleagues to vote against this  resolution.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698625/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…of the enactment of this Act, the President shall submit to       the appropriate committees of Congress a list of each person       that the President determines funds, sponsors, or otherwise       facilitates forced organ harvesting or trafficking in persons       for purposes of the removal of organs.\n\n(b) Imposition of Sanctions.--The President…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…amendment that targets Israel and hurts  American interests.\n\nMr. WALBERG. Mr. Chair, I appreciate the concern and the passion of  my colleague from Michigan. I concur that I and sponsors and cosponsors  of this bill believe in First Amendment liberties and freedom of  expression.\n\nThis bill is about specific concerns, not all of the countries of the  world.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deserve easier  tax filing. With tax day in just a few days, we must look for  commonsense, bipartisan ways to make filing and paying taxes less of a  hassle.\n\nI thank both sponsors of this legislation for leading on this issue  on behalf of the people they represent and all Americans.\n\nEveryone knows the Washington bureaucracy doesn't always move  quickly,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…``Ask a Lawyer''  program. In this role, she engaged with the public on law-related  questions, providing invaluable support to individuals, families, and  businesses. Kathy sponsors a legal aid paralegal membership for the  West Pasco Bar Association and has worked to expand membership for  legal services staff. Kathy Logue's dedication, compassion, and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…I  hope it will--that we pass this bill out of the House. This bill has a  Senate companion, and, Mr. Speaker, it is a bipartisan Senate  companion. I want to mention the sponsors: Senator Rick Scott, Senator  Joni Ernst, and Senator Alex Padilla.\n\nIt deals with a lot of issues that we have already heard about, but  it is important to note that those…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…want only citizens to vote and don't like  voter ID.\n\nMr. Speaker, I am about to yield 2 minutes to my friend from Arizona,  but I will just note that, as one of the lead sponsors of the  legislation to deal with prohibiting Members of Congress from engaging  in the act of trading in stocks, we are working on a bipartisan basis.  We have legislation…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…consider  resolutions that overturn rules finalized by Federal Agencies, like the  Biden EPA's decision to approve California's EV mandate. The CRA's  rationale--as explained by sponsors Don Nickles, Harry Reid, and Ted  Stevens--was to allow Congress to efficiently stop rules it finds ``too  burdensome, excessive, inappropriate, or duplicative.'' Every one…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…beatings, but I am sure they are coming.\n\nWe are functionally the only country left in the industrialized world  that uses a familial-based immigration system. It is, your family  sponsors the next person, the family sponsors the next person, and so  on. Canada, Australia, New Zealand, Great Britain, everyone else has  gone to a talent-based system to maximize…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Secretary Adams, and Director Salazar of  the Office of Refugee Resettlement.\n\nAs the record states, this administration has made efforts to expand  DNA testing to help ensure sponsors are, in fact, who they claim to be.  In addition, fingerprinting checks should reveal if new sponsors have a  criminal or a violent past.\n\nIt is pretty simple: Get the background…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Act may be cited as the ``ePermit Act''.       SEC. 2. FINDINGS.\n\nThe Congress finds that--\n\n(1) coordination between Federal, State, and local agencies       and project sponsors is critical to ensuring the timely and       effective completion of environmental reviews and       authorizations, including through the sharing of relevant       information,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…up  sooner, and there was real concern that if the shutdown dragged on, VA  might not have had the staff in place to implement the COLA on time.\n\nMr. Speaker, I thank the sponsors of this bill, Senators Moran and  Blumenthal, for their bipartisan work on this vitally important bill to  ensure our veterans get their benefits. I also thank Representative…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696763/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…is the toughest, longest, greatest race in the world, the Iditarod. It  occasionally starts in Fairbanks, but it did this year at Pike's. And  as I mentioned, he regularly sponsors the Iron Dog snow machine race  that, yes, is the toughest, longest, roughest snow machine race in the  world.\n\nJay also had a successful political career, serving three terms…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…friend and  colleague, my Western Caucus chair, but today was a special day for us.  We had lunch today as California members, and Doug paid for it because  every week somebody sponsors it. His death was so sudden that it  literally had been prepaid. It arrived, and we sat there thinking of  the person who had the best joke every week, who had a constant,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698722/9999"}]