[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…going to grammar school, and I  looked forward to milk. We had milk breaks, and it made a difference to  pay attention in those afternoon classes and to be active in your  sports activities right after that.\n\nThe second reason is that the dairy farming industry is not so much  an industry as it is a way of life, and in Vermont, the hardest working…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…university  programs. They just keep getting it done.\n\nCoach Hurley, who coaches the men's team, was rooting on Geno and the  women as loudly as anyone. It is a great university sports program that  brings everybody together. We are so proud of them, particularly in the  Second Congressional District. I have the honor to represent the  amazing university…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…them what to do. It is also because we can put  partisanship aside and play a good game for a good cause.\n\nTogether, we raised a whopping $2.8 million which will go toward  sports scholarships, local girls' and boys' clubs, and other youth  charities. That is something I think we can all be proud of.\n\nAgain, I congratulate Coach Williams and his team.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694188/republicans-win-record-setting-game"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…everyone has a  pathway to a quality career in the trades.\n\nOver the last 50 years, BIG STEP has been essential to creating  Milwaukee landmarks, from our skyscrapers to our sports complexes.  After helping tens of thousands of people take their first steps into  the trades, BIG STEP has served Wisconsin's workforce by building  courage, innovation, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…Mr. Tanner's son, Jack  Tanner, became the Pacific Northwest's first Black Federal judge in  1978. This is generational success and wealth.\n\nErnie Tanner broke barriers in sports and labor. On behalf of his  community, it is appropriate that we recognize his life and legacy  today. Happy Black History Month to everyone.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…disruptions disrupt agriculture. Some of it comes through construction  costs as climate disruptions disrupt lumber markets and supply chains.  Some of it comes through outdoor sports industries--hunting, fishing  and scuba and skiing--as climate disruptions disrupt the natural  environments that they need.\n\nThe first biggest shock will come through insurance…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…recognizing National Caribbean American Heritage Month. Caribbean  Americans have enriched our nation through their contributions in the  arts, sciences, education, business, sports, military, and government.\n\nSince before our nation's founding, millions have emigrated from the  Caribbean to the United States. Today, more than 8 million Americans  are…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…incubator, and center to teach people about trading  and investing as a means to building economic wealth in the community.  He envisions museum exhibits highlighting Akron sports legends,  scientists, and artists like LeBron James, Gus Johnson, Rita Dove, and  Woodrow Nash.\n\nHe said this project is not just a project for Black people. This is  a project…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…As a lifelong baseball fan, there is nothing quite like watching  young players take the field. Their energy and determination fill me  with joy and hope for the future.\n\nSports are more than just games. They are a powerful tool to help our  children build confidence, discipline, and a strong sense of teamwork.\n\nBurbank National Little League's mission…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise today to recognize West Salem High  School for its commitment to inclusivity in sports.\n\nThe Titans recently earned two national awards for their inclusive  basketball program. In addition to being named a Unified Champion  School by the Special Olympics, West…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689229/recognizing-west-salem-highs-inclusive-sports-programs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…This is the highest  civilian award, and it makes that award to the members of the 1980 U.S.  Olympic men's ice hockey team, whose victory marked a pivotal moment in  American sports history.\n\nOn February 13, 1980, the U.S. hockey team historically defeated the  Soviet Union 4-3 at the Lake Placid Winter Games. Prior to their  victory, the talented, yet…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Why is it an insult to learn about Chappie  James?\n\nWhy is it okay for everybody to enjoy the baseball skills of Jackie  Robinson? It is all right to put his contributions to sports in books.  Before Jackie Robinson ever set foot on Ebbets Field, he was in the  military. He served honorably in the United States military, and that  has been recognized by…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…of the sport.\n\nBy nurturing discipline and pride within a diverse community, Mr.  Choi has built a lasting legacy. His work during the 23rd Annual Korean  American National Sports Festival is a testament to his enduring  commitment to cultural celebration and civic unity.\n\nWe commend Mr. Choi for using sport as a bridge across generations  and communities.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692596/recognizing-myoungsub-choi"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…young athletes. From his  high school days at South High School to coaching and mentoring  multiple children and young athletes at various schools, Carter's  influence in the sports world has been profound.\n\nCarter's contributions extend far beyond the court, as well, proving  that mentorship and investing in young athletes can transform lives. He  was…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…electric  bills or keep the AC running. A single mother, working full time is  worried that her child's school won't be able to keep him safe during  recess or after-school sports practice. A landscaper, growing his small  business, was diagnosed with kidney disease in his early 30s due to  heat exposures.\n\nMembers of the Extreme Heat Caucus and I are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…that has gone above and beyond  the call of duty in service to both our community and our country. It  is with great respect and admiration I recognize the Ukrainian American  Sports Center Tryzub's 75th anniversary.\n\nSuch honorable individuals are not defined by titles or accolades but  by the quiet power of their actions. They are distinguished by their…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…and K. It is also packed  with protein that helps keep the student full all the way through those  long afternoon math classes and then on through gym and on through  their sports activities, until they get home at night for dinner.  Simply put, it is one of the healthiest--it is the healthiest--option  in the cafeteria.\n\nBringing whole milk and nutritionally…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…individual States  that have that law right now, and that is what the radical feminists  wanted.\n\nMy colleagues would say that nobody would allow transgender women in  women's sports, but, again, that is what the radical feminists want.  They want to blur the distinctions between men and women, and almost  all Democrats in this institution follow along…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…green new scam  terminated; EV mandates eliminated; revoked DEI policies in the  military and government; affirming there are only two genders; no more  men playing in women's sports; restoring America's leadership on the  world stage; rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…devotion to their sacred oath: ``To Protect and Serve.''\n\nThe families of law enforcement officers also bear the burden of  service through missed birthdays, school events, and sports games. This  resolution is a small way in which we can show our thanks. I encourage  all Members to take time to pray, show their support for, and say thank  you to our local…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…four regional universities, and other great institutions  of higher education. Utahns value education, and we are good at it.\n\nThe Salt Lake City metro area has professional sports teams competing  at the highest level, with basketball, the Utah Jazz; soccer, Real Salt  Lake; and hockey, the Utah Mammoth. They have already hosted the Winter  Olympic Games…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…are making more money while in Congress while  stock trading than they can in the private sector.\n\nThe same way that a plan B for failed male athletes shouldn't be  women's sports, a plan B for failed entrepreneurs shouldn't be Congress  and stock trading.\n\nMr. Speaker, I support this bill, and I ask everyone to move forward  in guaranteeing that we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the things that they uniformly, acting as a  monolith, refused to applaud?\n\nThey refused to stand and applaud for record-low illegal border  crossings, for protecting women's sports, for stopping fraudulent  payments, and for capturing a terrorist who killed 13 American  servicemembers.\n\nThey refused to stand and applaud for supporting law enforcement,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…believe, in America, in Fairbanks.\n\nJay, thank you. What a life of accomplishment. What a legacy, not  just for Fairbanks, but for all of Alaska. For every different  community--sports community, Jewish community, historical community-- you have done it all. And now, Jay, you have been awarded one of the  most prestigious awards anyone can achieve in their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…support, career counseling,  and medical benefits.\n\nAs a longtime mediocre swimmer and a former swim coach, I am glad to  see that the SCORE Act attempts to protect our Olympic sports. Under  the bill, large universities must offer 14 to 16 different sports,  which will ensure that non-revenue-producing sports are still  supported. I personally hope this…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Protocol (also known as the Columbia-Suicide Severity Rating       Scale)''.            SEC. 3. INCLUSION OF ADAPTIVE PROSTHESES AND TERMINAL DEVICES                     FOR SPORTS AND OTHER RECREATIONAL ACTIVITIES IN                     MEDICAL SERVICES FURNISHED TO ELIGIBLE VETERANS                     BY THE SECRETARY OF VETERANS AFFAIRS.\n\nSection…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…witnessed over the last 100 days is a real master class in  the art of following through.\n\nIf elected again, President Trump said he would put a stop to men  competing in women's sports. He did.\n\nHe said he would end divisive and anti-American DEI policies in  schools across the country. He did that, too.\n\nThe President told us that this country would once…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Colorado. He often enjoyed spending time with his fellow  1966 Academy graduates and cheering on his grandchildren, whether they  were performing in a play or competing in sports.\n\nSadly, in 2021, Rick passed away with his wife, Nancy, by his side.  On the Fourth of July, the town of Lyndonville recognized Rick at its  annual Independence Day parade,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, today I rise to recognize an inspiring  moment in our community, the Spokane Impact's first home match this  past Saturday at the HUB Sports Center in Liberty Lake.\n\nThe Spokane Impact is one of the founding teams of the Inspire Soccer  League, the first-ever national soccer league created specifically for  athletes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Wills, Jr., a man of faith, service, and dedication.\n\nBorn in 1957 in Plant City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment to faith and teamwork from a young age.\n\nIn 1982, he married Stacy, his lifelong partner, and together they  built a beautiful life, raising three…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}]