[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…the height of pandemic, the church created the Food Giveaway  Program to help members from the congregation put food on their tables.  As the harmful impacts of the pandemic spread throughout the Prince  William County, the church expanded its mission--opening its doors to  the entire community.\n\nAs of today, volunteers come together once a week to package…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…It has  worked spectacularly well for 80 years.\n\nNumber two, disease and health: Sadly, those things don't know  borders. Ebola and a variety of different other diseases can spread and  come back here. If we work with the rest of the world to prevent it  before it comes here, that is to our benefit.\n\nThe third is a matter of national security and safety.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…have supported include  giving middle school students opportunities to use math and design to  address agricultural issues; identifying the use of deepfakes and  curbing the spread of misinformation; and supporting and training the  next generation of quantum technicians.\n\nCuts to these programs, and many more, came with no transparency,  little communication,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…beyond  Minnesota. In 2023, he became one of eleven officers to join the Public  Safety Council for the Police Assisted Addiction and Recovery  Initiative (PAARI), helping spread the importance of this work across  the country. Last year, he received recognition from PAARI and was  presented with the ``Leadership Award for Advocacy and Community''.…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that a senior official at  Northwest had an aggressive cross-selling and product sales strategy,  and he brought that approach to Wells Fargo. This strategy was adopted  and spread throughout the business, including to former Wachovia  branches and retail bank operations that Wells Fargo acquired.\n\nWells Fargo's CEO, John Stumpf, was fully aware that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…access to gender-affirming care.\n\nNo. 20, he froze the Clean School Bus Rebate funding, standing in the  way of keeping our air clean for kids on buses in our country.\n\nNo. 21, spread misinformation about vaccines and risked the health of  millions of Americans.\n\nNo. 22, he blamed a plane crash on DEI--irresponsible.\n\nNo. 23, eliminated the public records…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in recent memory.  It is very reminiscent of Jim Crow. That is what Republicans want to  do--they want to not only restore Jim Crow in the South; they want to  have Jim Crow spread from one end of this country to the other.\n\nIt will not happen. It will not happen.\n\nLet me be clear. I will not let this noxious bill, the SAVE Act,  become law. Every Senate…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the vote of  Americans once again. That is incredible. But we are going to stop that  bill.\n\nMy own State has pioneered the ability to vote by mail, and that  provision has spread across the country to States like Utah, a red  State. Blue States, red States are saying this makes sense because it  ends the corruption on election day where officials stop…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, where lies are king, the truth is the  enemy. Institutions that spread knowledge are defamed as ``enemies of  the people.'' NPR and PBS are targeted here today precisely because  they are so good at delivering the truth. Like millions, I tune…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692535/rescissions-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…choosing to participate in  clinical trials. This effort extends beyond sarcoidosis and extends to  all those seeking to participate in clinical trials. I am now working  to spread awareness of this finding, so employers, employees, HR  departments and patients are aware of proper use of leave under FMLA.\n\nThis year marks the 25th Anniversary of the establishment…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Mr. President, 100 days ago, our Nation was safe and  our economy was considered the envy of the world. We had disease  surveillance programs that were in place to stop the spread of deadly  viruses like Ebola, no matter where they broke out in the world, and  the security contracts at detention camps that have been filled with  ISIS fighters were still…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…It gets worse. With President Trump actually allying himself with  China, Russia, Iran, and North Korea, these countries now seemingly  have America's explicit backing to spread their influence, and in some  cases to spread their force, like we have seen in Ukraine. This will  undoubtedly cause people to flee oppressive regimes and create new  regimes,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…recycling, and energy improvements in public schools, as well as  support for public-private clean energy projects.\n\nTheir bill undermines the very programs that help us stop the spread  of nuclear weapons, detect nuclear activity, and uphold arms control  efforts that make America and the world safer--and it underfunds  efforts to clean up sites contaminated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…didn't it matter? It didn't matter because it wasn't about the  evidence. It was actually a test.\n\nIt was a test to signal your willingness to be loyal. If you promise  to spread our lies, you can be on the team. It was a qualification for  being able to work on that team. Slowly, like the rot in the foundation  of an old farmhouse, it continues to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…loyalty to the Union and support Civil  War veterans.\n\nMore than 140 years later, the organization continues to serve  veterans of all wars and endeavors to ``encourage the spread of  universal liberty and equal rights of everyone.''\n\nI support the National Woman's Relief Corps' work, and I urge my  colleagues to support this legislation.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, today is Fentanyl Awareness Day, a day  meant to spread awareness of a ruthless poison that has stolen the  lives of too many of our sons, daughters, sisters, and brothers.\n\nMy family and I know this pain personally. My brother…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690382/fentanyl-awareness-day"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…You raise premiums, and you raise them to a degree that  20 percent of the people--typically the lowest risk--drop their  coverage. Then the Flood Insurance Program has to spread its risk over  a smaller base, which means it elevates the premiums even more, and so  those who need it least are the next 20 percent to drop off. This  initiates what is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…turned a blind eye,  allowing these illicit happenings to continue while drugs poured into  the United States and totalitarian dictators and terrorists enriched  themselves and spread their misery.\n\nBut President Trump has now begun to turn the tide. He began on day  one of his administration with an aggressive immigration enforcement,  rounding up and deporting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…appropriations bill.\n\nIf the Tribal population eligible for these services suddenly grows  by tens of thousands of people, many of whom have no native ancestry,  resources will be spread too thin, and the Tribes with established  rights will suffer.\n\nThat is the crux of the issue. If the Lumbee had a case that could  withstand the scrutiny of the OFA process,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY. Mr. Chair, America's universities have long been the place  where for better or for worse cultural trends tend to begin and then  spread throughout the rest of the country. Unfortunately, in recent  years, it has been for worse.\n\nAn ethos of censorship took hold first in American universities  before spreading…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…threat of communism worldwide.\n\nAs the Soviet Union oppressed its own people and extended its  influence abroad, countless Americans dedicated their lives to stopping  the spread of repressive ideology.\n\nIn 1987, President Reagan famously called on Secretary Gorbachev to  ``tear down this wall'' at the Brandenburg Gate. A few short years  later, the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…now, and it  is the picture of Oklahoma after that bombing. We survived.\n\nThat scrubby little American elm tree is now enormous 30 years later.  Its branches and its leaves spread out over that site. It is the shaded  spot. And on the morning of April 19, there will be survivors and  families that will sit under its branches. And as we pause for 168…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…our  children, friends, and neighbors.\n\nAdditionally, this legislation will also result in harsher penalties  for the criminals and cartel members who are responsible for the spread  of this poison. As a nation, we can no longer sit by while future  generations of American workers, parents, and community leaders are  taken away from us.\n\nMr. Speaker, I…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Texas on a daily basis. They are just as  engaged as we are, but I talk to the American people and I say to you:  We need your help. We have to Facebook this thing. It has to spread  like a wave. Do not be shy about this issue, Mr. Speaker. Our babies  depend on us to watch over them.\n\nI have two beautiful sons, and I give them the latitude they need,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…on his telephone but is  around a lot of friends who do. I wanted to get word to him not to look  at anything because I knew immediately that the horrific images would  be spread around instantly, and no children should be watching that.\n\nThat is just one example of millions every day polluting the minds of  our children, coarsening our culture, breaking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…focus on the  work at hand, and I encourage my colleagues on the other side to prove  me wrong.\n\nOnce again, my colleagues across the aisle are doing what they do  best. They spread misinformation, and they try to sow fear into the  hearts of the most vulnerable in this country about Republicans' work  through the budget reconciliation process.\n\nLet's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…safeguard our Nation's food and drug supply and fully fund nutrition  programs, including SNAP and WIC.\n\nAdditionally, the bill closes the hemp loophole that has resulted in  the spread of unregulated, intoxicating hemp-derived products that are  being sold online and in gas stations and corner stores across the  country. Many of these products are accessible…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…including The House Church, Eastwind  Pentecostal Church, Jornada al Cielo, Wings of Grace Ministries, and  CITA Rescue Mission, all of whom have united to serve families and  spread hope, generosity, and goodwill.\n\nWorking alongside dedicated community and business partners,  including the City of Palm Bay Parks & Recreation, Thrifty Specialty  Produce,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…school. It was in  1990. It ended up being about 46,000 total students in 4 different  States, including my State of Oklahoma, that just kind of gathered. The  word kind of spread organically that one Wednesday morning in  September, students--high school and middle school students--would just  go and do one day publicly what they do privately other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…on computational and data-      driven discovery, decision making, and predictions, from       models that often must quantify uncertainty, as in weather       predictions, spread of disease, or financial forecasting.\n\n(6) Most fields, including analytics, science, economics,       publishing, marketing, actuarial science, operations       research,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}]