[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…94 percent of the way there, and  somebody just woke up and said: Do you know what? Never mind. We are  going to do the thing we were planning on doing originally.\n\nSo hope springs eternal, but this is a deep disappointment. And it  didn't have to be this way. All we had to do--and I am going to offer  this consent later, but I want everybody to understand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Elevation Beer  Company of Poncha Springs, Colorado, for winning a Bronze Medal from  the World Beer Cup for their Coconut Oil Man brew.\n\nThe World Beer Cup, otherwise known as the ``Olympics of Beer,''  evaluates…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Douglasville Mayor Rochelle Robinson, Fairburn Mayor Mario  Avery, Fayetteville Mayor Ed Johnson, Mableton Mayor Michael Owens,  Palmetto Mayor Teresa Thomas-Smith, and Powder Springs Mayor Al  Thurman.\n\nThese leaders can be proud of the fact that they were the first, and  I take pride in knowing that they will certainly not be the last.\n\nThe fact that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "As you heard from Chairman Westerman, H.R. 2302 will help provide the  Shingle Springs Band of Miwok Indians the ability to address their  housing and infrastructure needs for their citizens.\n\nLike Americans across the country who are struggling to afford  housing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697669/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Speaker, I don't know if you have ever been to Washington State.  If you have, you will know that outdoor recreation is our pride and joy  and is what sustains us. Those beautiful springs and summers, that is  what sustains us when we have the rainy fall and winter.\n\nWe have already seen some of these outdoor trail accesses closed. In  fact, there is one called…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…order to  go through our national marine sanctuaries.\n\nAs Mr. Westerman I am sure would not disagree, if they were proposing  to run these things through a national park in Hot Springs, Arkansas,  for example, it is a good thing they would have to get a special permit  to do that, that they would have to pay fair market value, and that the  funds they pay…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…--``a CEW deployment is an       intermediate use of force tool''\n\nLos Angeles County Sheriff's Department Official Temple       Station\n\nMurrieta Police Department\n\nDesert Hot Springs Police Department\n\nHemet Police Department\n\nModesto Police Department\n\nOrange County Sheriff's Office\n\nSanta Ana Police Department\n\nAnaheim Police Department…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…day of sportsmanship directed by Mr. Wisler has  positively impacted thousands of students over the years--proving his  dedication to the students of North Hills and Sinking Springs  elementary schools. After 35 years of teaching and engaging students,  and 33 track meets, Mr. Wisler's service sets the standard by which we  should all be judged.\n\nMr.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690717/recognizing-brian-wisler"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Secretary Wright and Secretary Burgum to streamline  permitting and unleash American energy.\n\nThis is why I am hopeful for projects like Black Butte Copper near  White Sulphur Springs that are committed to unlocking the Treasure  State's resources and driving rural economic development, all in a  responsible manner. I can't wait to see what these next 4…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 2302) to take certain Federal land in the State of  California into trust for the benefit of the Shingle Springs Band of  Miwok Indians, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…that is not  the case. Coal-fired power plants are the most reliable and cost- effective form of available energy that we have.\n\nI will just give one example near Colorado Springs. The coal-fired  power plant is approximately 300 acres in size. Across the highway is a  solar field that is approximately 1,500 acres. The coal-fired power  plant is 80…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…going to go to the United States Hockey Hall of Fame in  Eveleth, Minnesota, the home of Mark Pavelich. The third one is going  to go to the Olympic Training Center in Colorado Springs.\n\nWe recognize that moment 45 years ago. I often wonder why we didn't  do this sooner. Why didn't we do this sooner? We should have. That  moment helped elevate the game of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to welcome the Swire Coca-Cola  manufacturing plant to Colorado Springs. This week, the company  announced a 620,000-square-foot facility at Peak Innovation Park near  the Colorado Springs airport. This is an investment of $475 million and  will…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698080/welcoming-swire-coca-cola-to-colorado-springs"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…my district.\n\nThis would prohibit access to approximately 24 miles of road as the  chairman said, including popular trails near the Orange Cliffs and  segments of the Poison Springs Loop. I have spent a lot of time on the  ground in these areas with local elected officials who, for years, have  tried to generate a better experience for visitors to the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to recognize Sergeant Olav  Chaney, of the Colorado Springs Police Department, for his 35 years of  service to our community.\n\nI had the pleasure of taking Sergeant Chaney and his family last  night on a Capitol tour, and a delightful…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691305/recognizing-sergeant-olav-chaney"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…recognize the contributions  of Pastor Stewart McWilliams and numerous churches in the Pikes Peak  region in organizing and participating in the citywide prayer across  Colorado Springs as part of the National Day of Prayer events earlier  this year.\n\nDuring these events, one moment stood out: when Pastor McWilliams of  Fellowship of the Rockies Church offered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to recognize Colonel Ric  Trimillos for his extraordinary dedication and service as Scoutmaster  of Troop 66 in Colorado Springs.\n\nFor years, Ric has served as a mentor and a role model to the Scouts  of Troop 66. His commitment to the principles of scouting has created a  nurturing environment where…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696825/recognizing-colonel-ric-trimillos"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…protect us every single day, who  wear the badge, and who protect our communities.\n\nMr. Speaker, I thank specifically our El Paso County Sheriff's Office  and our Colorado Springs Police Department and all of the local law  enforcement in Colorado. They put themselves on the front lines every  single day.\n\nI have had the pleasure of doing ride-alongs…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…district judges rig  the rules to stop the President of the United States from being able to  defend our country.\n\nJust last week, within close proximity to my house in Dripping  Springs, Texas, 47 individuals who are affiliated with the gang Tren de  Aragua were found by ICE. Right down the road in suburban Austin,  Texas, 47 people, including 9 children,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to thank the Colorado Springs  Chamber of Commerce for hosting the chamber fly-in to Washington, D.C.,  this week.\n\nOver 90 members of the Chamber, from the Aerospace and Defense,  Energy, Housing, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695829/2025-colorado-springs-chamber-of-commerce-dc-fly-in"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…In addition to Volunteering with the SHINE program he is a Lay Pastor  in his church and has spent time assisting with Metropolitan  Ministries, the Shepard Center in Tarpon Springs, Cares Senior Center,  and other non-profit organizations. He also volunteers with the  Supervisor of Elections and as an election worker during the voting  season. In addition…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…them to make a different choice for some reason.\n\nMr. Speaker, I am here today to support the pregnancy centers across  America, including Life Network in my home of Colorado Springs,  Colorado. Pregnancy centers offer hope, and they offer opportunity.  They promote life and give necessary and lifesaving resources to  struggling mothers and fathers. It…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699216/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]