[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…There are so many other stories that I hear out on the road. I was  with a baker in Virginia who has three pie shops--Mom's Apple Pie. We  were talking about this back in the spring after the tariffs had been  announced but before they had really bit.\n\nShe had seen tariffs in Trump's first term, and she said to me on  behalf of Mom's Apple Pie--I mean,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, 2 years ago today, the blast of an AR-15  shattered a beautiful spring morning in Louisville as a lone gunman  walked into Old National Bank on Main Street and opened fire. We lost  Josh Barrick, Deana Eckert, Juliana Farmer, Jim Tutt, and my…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…their time as part of the Pride, the varsity baseball team won the  regional championship. Students put on their first student-led sensory  performance, ``Big Fish,'' this past spring. Students hosted Heritage's  third annual First Responder Cookout, thanking them for their service.\n\nSo many students have given back to our community in many ways, and  they…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…government, as in the case of       ICBMs.\n\n``We are closer to nuclear catastrophe today than at any       point since the Cold War,'' Representative Jim McGovern said       this spring when reintroducing a House resolution ``urging       the United States to lead the world back from the brink of       nuclear war and halt and reverse the nuclear arms race.''…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…recognize the 100th  anniversary of the New England Council, which was founded in September  1925 when the six Governors of New England gathered with business  leaders in Poland Spring, ME, to better collaborate across our region's  shared and intimately intertwined economic interests. Shortly after,  the New England Council was founded as a nonpartisan and…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the famous Cyrus Cylinder in 539 B.C.E,  and remain an essential part of our values today--including being  enshrined in our own Constitution.\n\nZoroastrianism celebrates the spring festival of Nowruz during the  Spring Equinox in March, signifying the triumph of light, warmth, and  life over darkness. March is devoted to Mother Earth, symbolizing  peace,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688922/introducing-a-resolution-to-recognize-march-as-zoroastrian-legacy-and-heritage-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…within  particular districts is to misrepresent the opinions and aims of other  districts. You cannot shield yourselves too much against the jealousies  and heart burnings which spring from these misrepresentations. They  tend to render alien to each other those who ought to be bound together  by fraternal affection. The inhabitants of our western country…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…groundbreaking in 2005, Mountain's Edge has grown into one  of the most vibrant communities in the southwest area of the Las Vegas  Valley. Mountain's Edge sits at the foothills of the Spring Mountains,  and was envisioned as a place where residents could live, work, and  thrive with the surrounding natural beauty.\n\nOver the past two decades, that vision has become…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…never came to       fruition.\n\nIn 2008 the society moved again, to leased space on the       llth floor of an old building at 75 Varick Street. Over eight       hours one late-spring Saturday, its entire collection,       cocooned in bubble wrap and packed in more than 400 plastic       crates, was transported to the new location as quietly as can…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…cuts even as they try to  provide essential information and services in Ukraine, Iran, and across  the Indo-Pacific.\n\nAnd I want us to understand that what happened in the spring around  DOGE and USAID--a lot of people are not tracking some of these funding  areas, but, for instance, this is about getting our message out in  Ukraine, this is about countering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…generations on the importance of protecting our natural environment and  worked diligently to preserve historic gardens across Virginia,  including Mount Vernon and Green Spring in my district.\n\nThis centennial marks more than longevity; it also celebrates the  enduring impact of The Garden Club of Alexandria. Through their  tireless efforts and shared…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…yet,  and we are so proud of them.\n\nThey are not alone. The Coachella Football Club's Academy's 17-and- under boys' team also had a phenomenal run, winning the fall 2024 and  spring 2025 SoCal East championships without a single loss. Thanks to  Coaches Manuel Montano and Carlos Bustillos, they have set the bar for  excellence, teamwork, and sportsmanship.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…within  particular districts is to misrepresent the opinions and aims of other  districts. You cannot shield yourselves too much against the jealousies  and heart burnings which spring from these misrepresentations. They  tend to render alien to each other those who ought to be bound together  by fraternal affection. The inhabitants of our Western country…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…wealthiest in this country.\n\nIt wasn't just a 10-point win that mattered. In fact, more than the  win was the turnout. We rivaled a midterm congressional election  turnout in a spring nonpartisan election. People are pissed, they are  scared, and they are feeling unheard. So they came out to vote to be  heard.\n\nI know GOP leadership is telling its Members…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…highlight a bipartisan  resolution introduced alongside my northwest Ohio colleague,  Bob  Latta. It proclaims May 9 to May 18, 2025, as National American Birding  Week.\n\nEach spring, 3.5 billion birds from over 350 species migrate through  the United States to their breeding grounds. They stop along the shores  of our Great Lakes flyway before continuing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sports like soccer, these are winter sports in California,  but they are quite hard to play in the winter in this part of the State  because there is a lot of snow. They are spring sports in Nevada. So in  order to allow young people to play soccer and other sports, they  compete in Nevada.\n\nHowever, the State of California has just ordered Truckee Unified…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…know how important this is, and I  know how popular awnings are, but they have to be safe for consumers.  Consumers should not have to fear that their awning might suddenly  spring open and cause harm. This bill will make sure they won't have  that problem.\n\nMr. Speaker, I urge my colleagues to support this particular bill. I  commend the primary sponsor,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Mr. SCHMIDT. Mr. Speaker, 20 years ago this spring, there was a  Cinderella moment in southeast Kansas. The Iola High School girls'  basketball team, known as the Fillies, won the 2006 Kansas State High  School Activities Association…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699133/congratulating-2006-iola-fillies-on-don-bain-hall-of-fame-induction"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…students, Sahil  Ganjyal, Jack Carper, Leon Liu, Kevin Chi, and Nathan Kostenko, earned  their spot at nationals by winning the Inland Northwest Regional  Science Bowl this spring.\n\nAt the competition, they joined 63 of their top high school teams  from across the country to compete in one of the most prestigious  science competitions in the Nation.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…liability company with one shareholder, the Navajo       Nation. NTEC owns and operates three surface coal mines       within the Powder River Basin, including one mine--the Spring       Creek Mine--located in Montana and within the U.S. Bureau of       Land Management's Miles City Office's Resource Management       Planning Area.\n\nAs NTEC's Chief Executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…destination of their funds.\n\nFortunately, the United States is home to some of the world's most  advanced financial technology firms and data analytics companies.\n\nJust this spring, the FBI, working hand in hand with blockchain  forensics firms, seized $1.5 billion in stolen digital assets from the  North Korea-affiliated Lazarus Group. That is why I…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…lodged in the right side of Zariea's brain. What followed were regular  trips to the hospital for chemotherapy, which took a terrible toll on  her physical well-being.\n\nIn the spring of 2024, they believed that the tumor showed  improvement. Unfortunately, she recently learned that she would have to  start chemotherapy all over again. Despite this, her…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698704/praying-for-zariea-patrick-of-harrison-high-school"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Federal accountability, streamlines communication, and  puts in place commonsense guardrails needed to protect the bulk of the  power system.\n\nSince introducing this bill in the spring, I have heard from energy  leaders across Ohio--energy co-ops, utilities, manufacturers, and grid  operators--who all say the same thing: Regulatory chaos driven by  climate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Matthew: Thomson Reuters;       Spiegel, Anna: Axios; Spiering, Charles: DailyMail.com.\n\nSpiliotopoulos, Konstantinos: Asahi Shimbun; Spirit,       Michelle: Times of London; Spring, Jake: Washington Post;       Squillante, Emiliano: Agenzia Nova; Stacey, Stephanie:       Financial Times; Stapleton, Stephanie: KFF Health News; Stech       Ferek, Katherine:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…longstanding, decades-old, U.S. foreign assistance program. It did  a lot more damage than just that.\n\nIn many ways, the actions that began in January and picked up speed  in the spring caused alarm and concern by many of us in the Senate that  we have an OMB Director and an administration willing to violate  bipartisan agreements from the last Congress, commitments…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…champions in Wa-Hi history. Yet, for more than four decades,  the 1984 champions have had no victory cup to mark their achievement.\n\nWhat began as a casual conversation last spring has turned into the  long-awaited correction of that injustice. This Saturday, after 42  years, the 1984 team will finally be recognized with a ceremony and the  presentation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…2025. Without this critical reauthorization, these rural school  districts will not receive any additional funding this year, and  payments scheduled for distribution in the spring of 2026 and beyond  will remain at significantly reduced levels.\n\nI represent many communities that receive funding through the Secure  Rural Schools program, and I remain…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…one paid  attention to it.\n\nIn the year of the cleanup and all of the recovery and what was  happening during that time period, no one paid attention to it, until  the next spring, that scrubby little tree in the asphalt started  sprouting. And people were shocked. It is alive. And suddenly it went  from being a scrubby tree in the parking lot that was…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…veteran who continued his service at  home, serving nearly 1 year as a deputy.\n\nWhat followed was a dangerous manhunt that stretched through the  night and ended near Reeds Spring where Deputy Hislope was killed while  helping bring the violence to an end.\n\nDeputy Hislope was also a United States Army veteran and had served  his country as a deputy for…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700214/moment-of-silence-for-deputies-michael-hislope-and-gabriel-ramirez"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…figure in  Hernando County's economic history. As the county grew rapidly in the  latter half of the 20th century, particularly with the development of  new communities like Spring Hill, the business landscape became  increasingly diverse and fragmented. In a decisive moment of unity and  forward-thinking, leaders Morris Porton, Steve Emerson, and Vince…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}]