[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…orders, the Department of Homeland Security and  its agents of hatred have taken unprecedented, unthinkable, and abusive  control over the lives of immigrant Americans. His goon squad has  broken up families, torn apart communities, and committed atrocities  equal only to the worst sins in the history of our Nation, with extra  sins to spare.\n\nRefugees,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize the Deal First  Aid Squad as they celebrate their 75th Anniversary this year.\n\nIn 1950, residents of the Borough of Deal, New Jersey founded the  Deal First Aid Squad to provide emergency medical services…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…California's 25th District that is lifting up young athletes and  inspiring our entire community.\n\nThis past year, the Coachella Football Club's Premier team, our semi- pro squad, dominated the field. They were SoCal East season champions  and went undefeated in the divisional playoffs. Coached by Aldo Caro  and Octavio Bustillos, this team played one…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of Coach Dino Garr,  Rye High School football teams have won four State championships and  are now competing against Brighton for their fifth State championship.\n\nThis year's squad is led by quarterback Carson Miller; wide receiver  Henry Shoemaker; running back Jagger Fenton; and the aptly named  Charlie Garnet, Garnet being the school mascot.\n\nTheir…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Portland just last October, after protesters were already  restrained, Federal agents pepper-sprayed them pointblank. This is not  law enforcement. This is Donald Trump's goon squad deployed to punish  dissent and sow chaos in our communities.\n\nLet me be clear. Portland will not be bullied into compliance nor  into betraying our values.\n\nMr. Speaker, I…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699722/dhs-excessive-use-of-force"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in crisis response techniques. It will advance their skills to  deescalate situations, and our goal is to deescalate people with the  care they need instead of the back of a squad car or a jail cell.\n\nBy investing in training, we protect our communities and ensure those  in crisis are met with highly trained law enforcement officers.\n\nI am proud to work…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…decades of experience to this role,  having served as lieutenant, captain, training officer, assistant  chief, and deputy chief. He is also a firefighter with Wilmington's  Squad 4, where he is known for his skill, humility, and deep dedication  to public safety.\n\nThis is more than a title. It is a vote of confidence from a  department and community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the service and  commitment of the Chester First Aid Squad. Since 1945, the Chester  First Aid Squad has provided exceptional care in times of need. For 80  years, these volunteers have provided free and professional support to  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695189/recognizing-chester-first-aid-squads-80th-anniversary"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Infantry Regiment, known as the  Borinqueneers.\n\nDuring the Korean war, then-Private First Class Santiago-Rodriguez  displayed extraordinary heroism in the face of danger. When his squad  leader was gravely wounded, he swiftly took command, rallying his  fellow soldiers and leading them safely with unwavering courage and  determination.\n\nLater, while evacuating…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688609/recognizing-arcadio-santiago-rodriguez"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…traveled to Richmond on February 27 and captured their second  consecutive State title, an incredible accomplishment that reflects  their hard work, talent, and dedication.\n\nWith a squad of just 11 boys, Glenvar scored an impressive 280  points, outpacing second-place Radford High by 75 points. Of the 11  swimming events contested, the Highlanders won 5 and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…their recent statewide victory. The team made  history by capturing the State's Class 4A State championship here in  Florida. The Pirates overcame a tough American Heritage squad where  they rallied from a 14-point deficit to win the State title.\n\nLeading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All American,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…bravely responded  to this disaster, including: London Police Department, Laurel County  Sheriffs Office, London Fire Department, London Public Works, London/ Laurel County Rescue Squad, Kentucky State Police Post 11, Bush  Volunteer Fire Department, Campground Volunteer Fire Department,  Crossroads Volunteer Fire Department, East Bernstadt Volunteer Fire…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…committed service to  the people of Bucks County.\n\nLieutenant Moffett's distinguished career in public service began in  1981, when he served as an EMT with the Bucks County Rescue Squad and  Bensalem Rescue Squad. Two years later, he joined the Bucks County  Department of Communications as a Police, Fire, and EMS dispatcher,  demonstrating his deep commitment…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Jacob and Zach Mioduszewski, Landen Gutierrez, Jack  Rakes, and Dallas Riles played vital roles in the team's depth and  success. Eighth-grader Brayden Hawley rounded out the squad and made  his mark, as well.\n\nWith Coach Josiah Somers at the helm and a foundation built on  relentless defense and selfless play, the Eagles swept the Southwest  District,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…of East Manatee Fire Rescue, Firefighter/Paramedic--Company       Fire Captain Ralph Mascaro of Hillsborough County Fire       Rescue, and the Sun City Center Emergency Squad.\n\nPreservation of Life Award: Firefighter/Paramedic Jacob       Campbell, Fire Captain Clifford Davis, Firefighter/Paramedic       Anna Inman, and Firefighter Maurice Swan…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…sheriffs always say: What can we do to  help you? Maybe it is to secure a perimeter, maybe it is to transport  somebody who has broken the law, but maybe it is just to have a squad  car visible to let local people know that some serious law enforcement  work is going on.\n\nWhatever it is, the sheriffs of the State of Wisconsin are always  there. It is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…showed skill, leadership, and grit on the field. Dorsey scored one goal  and assisted on the other, setting the tone and sealing the win. From  defense to offense, the entire squad played with unity and  determination.\n\nThis moment is more than a victory. It is a legacy, and it speaks to  what young women in sports can accomplish when they believe in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Guard's marksmanship school and competition programs.\n\nIt offers world-class instruction in the proper use of various small  weapons systems in the Small Arms Weapons Expert and Squad Designated  Marksmanship programs.\n\nThe Arkansas National Guard is actively working to gain U.S. Army  Training and Doctrine Command (TRADOC) accreditation for the NGMTC.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695158/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…and came out victorious and took the top  honor, adding yet another trophy to their cabinet. What a remarkable  achievement.\n\nI congratulate and thank Coach Thomas; the relay squad, Ricardo  Brooks, Armani Ramirez-Sperle, Vijay Carrier, and Jayden Thomas; and  everyone who played a part in this remarkable season. They have made  their school and the Sierra…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}]