[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…vote for this massive debt but tear down, at the same time, the last  two pillars of the architecture for controlling deficits this year and  into the future. That doesn't square, so don't do it.\n\nI will close by saying this is not the first time we have been down  this road. And there are a few myths that people tell themselves to  justify this: We…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Constitution's       District Clause grants Congress power to ``exercise exclusive       Legislation in all Cases whatsoever, over such District (not       exceeding ten Miles square) as may, by Cession of particular       States, and the Acceptance of Congress, become the Seat of       the Government of the United States.'' Based on this Clause,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…American River Fire Department  and Sacramento County Fire Protection District.\n\nToday, Metro Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…address those things.\n\nThe SAVE America Act is about denying elections and sowing distress  in our system. That is because, according to Donald Trump, it is only  fair and square when he wins. When Democrats win, then it is fraud.  That is their whole argument in a nutshell.\n\nThe most ironic thing of all is that Republican leaders are the ones  who…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…together in  times of hardship. We are a city that welcomes, embraces, and lifts up  those in need. I stood arm in arm with western New York's Ukrainian  community in Niagara Square, designated Ukraine Freedom Square, just  outside Buffalo City Hall days after Russia's invasion.\n\nWhat I said then is just as true today: The United States of America  must…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…additional forces, it was readily available under mutual aid.\n\nI will point out to my colleagues on the other side of the aisle, in  case they need a reminder, L.A. County is 4,060 square miles, not the  10 blocks. When President Trump deployed the Marines and National Guard  in L.A., it was not at the request of local officials, the chief of  police, or the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…A large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary Hegseth's comments about the forfeiture of Ukraine's  sovereign territory.\n\nFurthermore, the deal includes no security guarantees from the United…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Democrats to override the Speaker's  attempt to stifle the will of this body to vote to extend subsidies for  the Affordable Care Act for 3 years.\n\nMy district is just over 17,000 square miles. It is mostly rural with  rural hospitals hanging on by a thread. Some of them have just 15  percent commercial payer mix. Without the Affordable Care Act  subsidies,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…solution there or trying to take us out of the  healthcare crisis? No. He was giving the White House a makeover. He  tore down the entire East Wing to make way for a 90,000-square-foot,  $300 million ballroom, funded by corporations that have a lot to gain  monetarily; and he had ``Great Gatsby'' parties at Mar-a-Lago with  dancing girls. It is just…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…They are not happy with the MAGA movement and what it has brought to  America. The results across the board were overwhelmingly in favor of  Democrats last night. It doesn't square with the happy talk which we  have heard on the floor about the achievements of the Trump  administration.\n\nIn fact, in one candid moment, President Trump conceded that the…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…community empowerment, the city has named  the intersection of W. Sunset Boulevard and Lemoyne Street, adjacent to  El Centro del Pueblo's main office, as ``Sandra Figueroa-Villa  Square.'' This historic renaming will ensure Ms. Figueroa-Villa's  legacy is remembered by all Angelenos in the years ahead.\n\nOn behalf of my colleagues in Congress, I sincerely thank…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Constitution's       District Clause grants Congress power to ``exercise exclusive       Legislation in all Cases whatsoever, over such District (not       exceeding ten Miles square) as may, by Cession of particular       States, and the Acceptance of Congress, become the Seat of       the Government of the United States.'' Based on this Clause,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…across Westchester would be a task  enough for anyone, but Mayor Andino added the responsibilities of  elected office in Tuckahoe, a village of over 6,000 people in one  compact square mile.\n\nTuckahoe local government has all of the responsibilities of any  municipal entity: police protection, sanitation, parks and recreation,  planning and land use functions,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would permit  commercial filmmaking and photography throughout the grounds of the  U.S. Capitol Complex. Currently, such filmmaking and photography is  only authorized in Union Square. Film and television productions that  involve the Capitol should not have to go to other cities or use a fake  building.\n\nThis bill would allow commercial filmmaking and photography…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699181/introduction-of-a-bill-to-permit-commercial-filmmaking-and-photography-on-the-grounds-of-the-us-capitol"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…dysfunctional  mess. We don't need new ballrooms. We don't need new showerheads. We  don't need a new name for the Kennedy Center. We need lower costs,  better jobs, and a square deal.\n\nAt the appropriate time, I will offer a motion to recommit this bill  back to committee. If the House rules had allowed it, I would have  offered a motion with an amendment…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…saying  someone is right or somebody is wrong. President Trump does not  consider Senator Paul to be part of his MAGA agenda, and he will veto  it. Then we are right back to square one.\n\nSo, for that reason, I can't substitute his for mine because his is  going to be as dead as fried chicken here in a few days, and mine has a  chance to pass.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to welcome the Swire Coca-Cola  manufacturing plant to Colorado Springs. This week, the company  announced a 620,000-square-foot facility at Peak Innovation Park near  the Colorado Springs airport. This is an investment of $475 million and  will create at least 170 jobs. It will modernize production…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698080/welcoming-swire-coca-cola-to-colorado-springs"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For       example, as much as 60-plus square miles can now be developed       from a single 12 to 14 acre gravel drill site. New drilling       capabilities are being developed that may increase the       subsurface development…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…``USA'' on the front or a dark blue  jersey with ``USA'' on the front.\n\nTen days before that game, Madam Speaker, they had an exhibition  game, and they were blown out at Madison Square Garden. Yet, a few days  later, Herb Brooks had them ready. They were conditioned. They were  ready. They played as a team. Movies were made about it.\n\nGrowing up in Duluth,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…service to the City  of Carver and surrounding areas.\n\nFounded in the late 1800's, the Carver Fire Department provides fire  safety and prevention services to an area of 32 square miles, including  the City of Carver and Dahlgren and San Francisco townships, and  employs 32 paid on-call firefighters who respond to nearly 300 calls  per year.\n\nChief Trimbo…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…challenges, their program continues  to produce highly skilled providers who are urgently needed across  Iowa, especially nurses and EMTs.\n\nThis funding will create a 1,700-square-foot advanced simulation  center that will allow more students to graduate each year and expand  training for high-demand medical fields.\n\nThis investment strengthens Iowa's…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…dollars to build, operate, and  maintain. In 2010, the GAO, Government Accountability Office, found  that courthouses built from 2000 to 2010 were overbuilt by 3.56 million  square feet, costing an additional $800 million in addition to $51  million annually to operate and maintain.\n\nDespite oversight, and even at one point a moratorium on authorizing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…temporary trailers. Despite those challenges, their program continues  to produce highly skilled providers who are urgently needed across  Iowa.\n\nThis funding will create a 1,700-square-foot advanced simulation  center that will allow more students to graduate each year and expand  training for high-demand medical fields.\n\nThis investment strengthens Iowa's…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696799/recognizing-jones-regional-medical-center-project-funding"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…President Trump is receiving in the  White House the mayor-elect, Mr. Mamdani, from New York City. I salute  the President for receiving Mr. Mamdani because he won fair and square,  and that is the way democracy works.\n\nLet me just tell you something. Knowing very well how Fidel worked,  how Hugo Chavez works, and how socialism works, I want to put this…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…got  computers--we look for the median point, not the average. We don't add  them up and divide; we look for the median point. The median point is  the city right smack dab square in the middle. Half of the cities have  increased housing starts more, and half of the cities below the median  have increased housing starts less.\n\nSo that is our starting…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing affordability are otherwise mitigated.\n\n``(M) Allowing off-site construction, including       prefabricated construction.\n\n``(N) Reducing or eliminating minimum unit square footage       requirements.\n\n``(O) Allowing the conversion of office units to       apartments.\n\n``(P) Allowing the subdivision of single-family homes into       duplexes.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…them.\n\nThe United Kingdom will get money. The military base will become  ours. China will not own the military base. And Mauritius, which has  never owned any portion, not one square inch of the Chagos Islands,  will not own them either. And the world will be safe.\n\nI am going to end on this note. This is something that the Presiding  Officer knows very,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…responsible population  growth, economic development, and long-term sustainability in one of  the most arid areas of our Nation. Today, the Agency's service area  spans nearly 5,000 square miles and provides water resource management  for nearly half a million residents.\n\nOver the past 65 years, the Mojave Water Agency has distinguished  itself through its technical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…interested in genuine cultural exchange or open  dialogue. Its goal is indoctrination, teaching students that China is  benevolent, while erasing events like the Tiananmen Square massacre and  ignoring the ongoing Uyghur genocide and other human rights abuses. By  accepting CCP funding, schools shield students from the truth because  the party does…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…services  and highlights organizations that exemplify outstanding care,  innovation, and commitment to the people who they serve.\n\nThe Susquehanna Regional EMS covers a 3,000-square-mile region  covering townships across four counties. Their EMS has a team of over  170 EMTs and responds to over 20,000 calls annually.\n\nSusquehanna Regional EMS is dedicated…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}]