[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…reason it is absolutely so important is that history  can't just be written, in this case, by the winner. And that is, Donald  Trump did win the election. It was a fair-and-square election, despite  all those things I just said that are true--not just that I believe are  true.\n\nBut what happened on that day was shocking to me, and it was shocking  to…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…vote for this massive debt but tear down, at the same time, the last  two pillars of the architecture for controlling deficits this year and  into the future. That doesn't square, so don't do it.\n\nI will close by saying this is not the first time we have been down  this road. And there are a few myths that people tell themselves to  justify this: We…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…address those things.\n\nThe SAVE America Act is about denying elections and sowing distress  in our system. That is because, according to Donald Trump, it is only  fair and square when he wins. When Democrats win, then it is fraud.  That is their whole argument in a nutshell.\n\nThe most ironic thing of all is that Republican leaders are the ones  who…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that action will improve services or, in the  long run, save money for the American people? It is being done because  there is a goal to have a tax cut. That is a fair-and-square debate.  What should our tax rate be; should we have a tax cut; if we have a tax  cut, how do you allocate; how much goes to corporations; how much goes  to billionaires; how…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Since they won't tell you themselves, I am going to tell       you.\n\nThey approve of the American farmer--but they are willing       to help him go broke.\n\nThey stand four-square for the American home--but not for       housing.\n\nThey are strong for labor--but they are stronger for       restricting labor's rights.\n\nThey favor a minimum wage--the smaller…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700295/president-trumans-words-still-ring-true-today-the-failings-of-the-state-of-the-union"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Celebrating Station 7\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to celebrate the new fire  station that just opened off of Route 50, Station 7.\n\nThis new 23,000-square-foot facility is replacing the previous fire  station that was built in 1971 and will provide crucial, lifesaving  services to over 6,000 residents, covering over 40,000 square…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…together in  times of hardship. We are a city that welcomes, embraces, and lifts up  those in need. I stood arm in arm with western New York's Ukrainian  community in Niagara Square, designated Ukraine Freedom Square, just  outside Buffalo City Hall days after Russia's invasion.\n\nWhat I said then is just as true today: The United States of America  must…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Guard  that the president has to federalize the National Guards of the states  and territories.\n\nThe attack on the U.S. Capitol on January 6, 2021, the events at  Lafayette Square on June 1, 2020, and the current deployment of the  D.C. National Guard in D.C. are prime examples of why the D.C. mayor  should control the D.C. National Guard. During January…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…American River Fire Department  and Sacramento County Fire Protection District.\n\nToday, Metro Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…over the long history of democracy, have been the place  where protests--especially youth protests--begin. They are a thorn in  the side of leadership. The famous Tiananmen Square protests in China  were, of course, started by university students.\n\nSo it is no surprise that if you want to crush democracy, you need to  crush the independence of universities.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…pit stops at McDonald's.\n\nYou also are sure find McDonald's on your international travels. In  fact, I remember being in Moscow when the first McDonald's opened in  Pushkin Square. It was January 31, 1990, and I remember seeing the  dreary grey colors of the former Soviet Union punctuated by the Golden  Arches. It was a vision of hope for many, representing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…as you may know, I represent Colorado's Second  Congressional District. It is an incredibly large geographical  district. It is a district that spans across more than 8,000 square  miles. It is larger than eight States on the eastern seaboard and spans  12 counties and over 55 towns.\n\nI have the privilege of representing this incredible district each…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Democrats did not give up on the American people, unlike many  Republicans, who chose to let these tax credits expire 1 week ago. That  is right. When the ball dropped in Times Square on New Year's Eve,  millions of Americans saw their healthcare premiums rise. That is a  direct result of the healthcare crisis that Republicans created through  their inaction…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…A large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary Hegseth's comments about the forfeiture of Ukraine's  sovereign territory.\n\nFurthermore, the deal includes no security guarantees from the United…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…active in Bronx Community Board 10. Most of the  area is represented by my colleague, Congresswoman Alexandria Ocasio- Cortez, places like Throggs Neck, Pelham Bay, Westchester Square, and  the like. However, Community Board 10 also includes the major complex  of Co-op City in my 16th Congressional District.\n\nCo-op City benefits from the leadership of Joseph…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…interested in genuine cultural exchange or open  dialogue. Its goal is indoctrination, teaching students that China is  benevolent, while erasing events like the Tiananmen Square massacre and  ignoring the ongoing Uyghur genocide and other human rights abuses. By  accepting CCP funding, schools shield students from the truth because  the party does…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…service to the City  of Carver and surrounding areas.\n\nFounded in the late 1800's, the Carver Fire Department provides fire  safety and prevention services to an area of 32 square miles, including  the City of Carver and Dahlgren and San Francisco townships, and  employs 32 paid on-call firefighters who respond to nearly 300 calls  per year.\n\nChief Trimbo…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For       example, as much as 60-plus square miles can now be developed       from a single 12 to 14 acre gravel drill site. New drilling       capabilities are being developed that may increase the       subsurface development…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to welcome the Swire Coca-Cola  manufacturing plant to Colorado Springs. This week, the company  announced a 620,000-square-foot facility at Peak Innovation Park near  the Colorado Springs airport. This is an investment of $475 million and  will create at least 170 jobs. It will modernize production…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698080/welcoming-swire-coca-cola-to-colorado-springs"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…decades of conflict and loss, the Pit River Tribe was federally  recognized in 1976. The Pit River Tribe consists of 11 different  California Tribal bands and resides on a 100-square-mile reservation.  In the late 1960s and early 1970s, the Tribe aimed to regain control of  the Four Corners property near Burney, California.\n\nOver the years, the Tribe repeatedly…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…challenges, their program continues  to produce highly skilled providers who are urgently needed across  Iowa, especially nurses and EMTs.\n\nThis funding will create a 1,700-square-foot advanced simulation  center that will allow more students to graduate each year and expand  training for high-demand medical fields.\n\nThis investment strengthens Iowa's…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…dollars to build, operate, and  maintain. In 2010, the GAO, Government Accountability Office, found  that courthouses built from 2000 to 2010 were overbuilt by 3.56 million  square feet, costing an additional $800 million in addition to $51  million annually to operate and maintain.\n\nDespite oversight, and even at one point a moratorium on authorizing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…place where generations have come  together to learn, grow, and celebrate Jewish life and values.\n\nSince its founding in 1945, the JCC has embraced its mission to be  the town square for building and strengthening community through  recreational, educational, cultural, and social programs rooted in  Jewish values. For 80 years, the JCC has fulfilled this…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…President Trump is receiving in the  White House the mayor-elect, Mr. Mamdani, from New York City. I salute  the President for receiving Mr. Mamdani because he won fair and square,  and that is the way democracy works.\n\nLet me just tell you something. Knowing very well how Fidel worked,  how Hugo Chavez works, and how socialism works, I want to put this…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…got  computers--we look for the median point, not the average. We don't add  them up and divide; we look for the median point. The median point is  the city right smack dab square in the middle. Half of the cities have  increased housing starts more, and half of the cities below the median  have increased housing starts less.\n\nSo that is our starting…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…saying  someone is right or somebody is wrong. President Trump does not  consider Senator Paul to be part of his MAGA agenda, and he will veto  it. Then we are right back to square one.\n\nSo, for that reason, I can't substitute his for mine because his is  going to be as dead as fried chicken here in a few days, and mine has a  chance to pass.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing affordability are otherwise mitigated.\n\n``(M) Allowing off-site construction, including       prefabricated construction.\n\n``(N) Reducing or eliminating minimum unit square footage       requirements.\n\n``(O) Allowing the conversion of office units to       apartments.\n\n``(P) Allowing the subdivision of single-family homes into       duplexes.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…them.\n\nThe United Kingdom will get money. The military base will become  ours. China will not own the military base. And Mauritius, which has  never owned any portion, not one square inch of the Chagos Islands,  will not own them either. And the world will be safe.\n\nI am going to end on this note. This is something that the Presiding  Officer knows very,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…responsible population  growth, economic development, and long-term sustainability in one of  the most arid areas of our Nation. Today, the Agency's service area  spans nearly 5,000 square miles and provides water resource management  for nearly half a million residents.\n\nOver the past 65 years, the Mojave Water Agency has distinguished  itself through its technical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…grown from a  small agency into California's sixth largest public retail water  agency, and seventh largest wastewater agency, serving nearly 1 million  customers across 682 square miles.\n\nThroughout its history, EMWD has remained committed to delivering  safe, reliable water, wastewater, and recycled water services. It  serves one of California's fastest-growing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}]