[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…a hometown hero of Casselton, North Dakota, who served in World  War II, the Korean war, and the Vietnam war as a member of the United  States Navy. As part of Observation Squadron 67, while descending into  a target area in Laos during the Vietnam war, his aircraft crashed in a  remote mountainside on January 11, 1968, killing him and his crew.\n\nHis…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Delta Air Lines.\n\nThrough it all, he never forgot to pay homage to those who made his  career in aviation possible. He volunteered with a Commemorative Air  Force Red Tail Squadron for 29 years to ensure that his father's legacy  and that of the Tuskegee Airmen is preserved and shared.\n\nIn 2015, Brad participated in the arsenal of democracy flyover to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…involvement within the  Seattle Chinese-American and Veterans communities.\n\nBill valiantly served during World War II in the U.S. Army with the  93rd Cavalry Reconnaissance Squadron in the Central European Campaign  and the Battle of Rhineland, and his dedication to service continued  long after his active military duty. Upon graduating from Seattle…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Over the course of  his heroic military career, he served in World War I, the Korean war,  and the Vietnam war.\n\nToday, Oscar is a proud member of the Greater Gary AMVETS Squadron  Post 6 where he can frequently be found supporting veterans throughout  northwest Indiana as they return home from service.\n\nIt is because of the sacrifices of veterans just…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…helm-- because leadership doesn't come with an `abort mission' button.\n\nI rise today to congratulate Commander Daniel Russell on his  promotion to Commanding Officer of Patrol Squadron VP-10 of the United  States Navy, also known as the Red Lancers.\n\nWhen it comes to leadership in the Navy, it's more than just a title.  It is a calling, a duty, and a profound…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Leadership from Regis University and completing the  Air Force's Continuous Process Improvement Green Belt Program.\n\nDuring his career, Evan has served with distinction at the Squadron,  Wing, and Major Command levels, both stateside and overseas at Bagram  Air Base, Afghanistan, and RAF Mildenhall, United Kingdom. His previous  assignments include experience…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…program. As an officer, Capt. Hammond initially served as a Gold Bar  Recruiter before being selected as the Assistant Flight Commander for  Air Freight at the 436th Aerial Port Squadron at Dover Air Force Base.  In this role, he led 226 military and civilian personnel to ensure  efficient flight operations at the Department of Defense's largest  aerial port.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…school  sweetheart, Nancy, he went on to serve 26 years in the United States  Air Force.\n\nDuring his tenure, Rick would become the commander of the 32nd  Tactical Fighter Squadron Wolfhounds, later the 33rd Tactical Fighter  Wing. However, his most notable accomplishment came on February 7,  1991, when he downed an SU-7/17, becoming the only wing commander…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "John Carter", "party": "Republican", "sentence": "…He played a  critical role in contingency operations in Beirut, Lebanon, where he  developed essential emergency plans. Notably, Lt. Col. Smith served on  Marine Helicopter Squadron One responsible for Executive Transport for  President Ronald Reagan and was the Marine One Command Pilot for  President George H.W. Bush. His dedication earned him numerous…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Airmen. I will share a little bit about them.\n\nThey trained on Moton Field and on Tuskegee Army Air Field in  Tuskegee, Alabama, and later formed units like the 99th Fighter  Squadron and the 332nd Fighter Group. They were under the command of  Colonel Benjamin Oliver Davis, Jr., who was born right here in  Washington, D.C.\n\nWhen the pilots of the 332nd…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Following his time at Fort Carson, Captain Retzlaff attended the  Maneuver Captain's Career Course at Fort Benning, Georgia, graduating  in 2022. He was then assigned to the 2nd Squadron, 16th Cavalry  Regiment, where he served as an Armor Basic Officer Leader Course  (ABOLC) Tactics Instructor, training the next generation of Army  leaders.\n\nIn August 2022,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…VOA  stations across the Pacific, including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending the  Pacific Coast during the war.\n\nToday, Delano is best known for its thriving…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…an initial assignment  flying the F-4 Phantom II at Seymour Johnson Air Force Base, North  Carolina, he was deployed to Southeast Asia, joining the 555th Tactical  Fighter Squadron at Udorn Royal Thai Air Force Base, Thailand.\n\nFollowing his combat tour, Colonel DeBellevue attended undergraduate  pilot training and became a full-fledged F-4 pilot. He…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…North Apennines, Central Europe and Po  Valley campaigns.\n\nLt. Col. Wagamon served in the 6th Bomb Group, 313th Bombardment  Wing, 340th Bombardment Group, 486th Bombardment Squadron earning; the  Air Medal, European-Africa-Middle Eastern Campaign Medal with 4 Bronze  Battle Stars, American Campaign Medal, Distinguished Unit Badge and the  WWII Victory…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…proudly served in the United States Air Force, entering service  on September 16, 1966. After basic training, he was stationed at  Whiteman Air Force Base with the Air Police Squadron before deploying  to Vietnam with the 377th Combat Defense Unit.\n\nHe was stationed at Tan Son Nhut during the Tet Offensive, one of the  most dangerous moments of that war.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Master Sergeant  Brandan Holliday.\n\nBrandan recently returned home from deployment, serving with the  332nd Expeditionary Security Forces Squadron in southwest Asia. While  on deployment, Master Sergeant Holliday served as a night-shift flight  chief, leading over 56 security forces members for U.S. Central  Command.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Air Force Exchange Officer to Australia. His leadership  extended across various levels of the Air Force, including roles as  Flight Commander of the 54th Fighter Training Squadron at Reese Air  Force Base, Chief of Airspace at Randolph Air Force Base, and Air Force  Reserve Commander at Reese Air Force Base. In 2004, Lt. Col. Davison  took on the role…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…his heart remained in Iowa, where he guided and mentored  Guardsmen to ensure they were trained, supported, and prepared to  serve. His mentorship, including to myself as a Squadron Commander,  where he imbued his leadership traits upon the next generation of Air  Force officers as our Group Commander, reflects his enduring commitment  to building leaders…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…VOA  stations across the Pacific, including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending the  Pacific Coast during the war. Today, Delano is best known for its  thriving…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}]