[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The result, Medicare spent $22 billion last year alone on these four  heavily advertised medications--$22 billion. With these advertisements,  Big Pharma is betting they can squeeze every penny out of you and our  healthcare system.\n\nJust last week, I released a report about the new telehealth  advertising scheme launched by Pfizer and Eli Lilly. With…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…$5,000 a year in  additional costs. Our constituents' 401(k)'s, pensions, and kids'  college funds have all taken a huge hit.\n\nTrump's reckless trade war has only begun to squeeze the American  people. Imports at the San Pedro Bay port complex in my district are  expected to plunge in May. That means empty shelves at our stores in a  few weeks and further…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rewarded tens of thousands of  American lives for dirty crude oil interests. We should not be sending  our sons and daughters to die in Venezuelan jungles so oil companies  can squeeze wealth out of that sovereign nation to pad their profit  margins, and fill the pockets and bank accounts of the influential  president's billionaire buddies, or presidents…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…looks like it's getting       smaller.\n\nI know what she means. Tria and Esther are not alone in their shared  frustration. Working families across the country are feeling the  squeeze at the checkout counter and are having to cut back on spending  for the holidays.\n\nThis struggle has been exacerbated for several reasons, one of them  being the President's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…State of the Union Address. Based upon everything we know with  the state of the Union, things are very expensive. Our neighbors back  home are suffering a real affordability squeeze.\n\nEspecially when we are talking about energy, we know that 80 million  Americans are struggling to pay their utility bills right now. Look at  our home State of Florida,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…turned upside down: our National Park  Service and workers at a number of Federal agencies, farmers, and  firefighters. Everyone who depends on Federal services is feeling the  squeeze of this reckless agenda. Meanwhile, Republicans are preparing  their budget reconciliation bill, which is going to cost at least $4  trillion.\n\nMr. Chairman, our Republican…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…theme this Congress. Despite the promises of  the President and my Republican colleagues in Congress, they haven't  brought any bill that will help address the affordability squeeze.  Right now, as we debate this package of energy bills, there is a big  discussion going on about the Republican budget that is coming to the  floor likely tomorrow, and Democrats…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…means housing  costs are often the largest part of a monthly budget, and this is even  before groceries, childcare, or healthcare.\n\nIt is not just renters who are feeling the squeeze. Homeowners are  feeling the squeeze, too. The median home value in Ohio's 13th District  is about $228,000. That may sound modest compared to national prices,  especially…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Members of Congress in a letter to Dollar  General and Family Dollar to hold them accountable.\n\nBecause when inflation is crushing families, we won't let big  corporations squeeze people who are just trying to get by.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698519/lowering-costs-for-working-families"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that that executive order perhaps won't work.\n\nMuch later tonight, when the rest of America is sleeping, Republicans  are going to figure out just how many Americans they can squeeze to pay  off their billionaire overlords.\n\nMr. Speaker, this is a bad resolution being considered under the  worst circumstances. I don't know why we are wasting time on this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…are, 9 months into the new  administration and a new Congress, and Republicans have not brought one  bill to the floor of the House that will help tackle the cost-of-living  squeeze and the affordability crisis.\n\nFolks back home really need help. They are paying more on their  groceries despite all the promises, more on their electricity, and now  are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…compounded by the  SNAP cuts in the one big, ugly bill and cuts to food banks all across  this country.\n\nHowever, it is not just food and groceries. Families are feeling the  squeeze in multiple ways. Healthcare premiums, copays, and prescription  costs have climbed, leaving families with difficult choices about their  care. Energy bills from heating homes…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Mr. Speaker, I rise in opposition to H.R. 3616. It is another  Republican bill that fails to address skyrocketing electric bills that  are a part of the overall affordability squeeze that is gripping the  country right now.\n\nWhat should we be doing on the floor of the House right now?\n\nWe should bring up the discharge petition to make sure that  healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to take on tough fights, including for families facing high  costs. This was a bipartisan initiative because across Virginia and  across the country families are feeling the squeeze.\n\nHousing costs are up, childcare is expensive, and utility bills are  rising. In Loudoun County, tolls add an extra burden to the cost of  getting to work.\n\nThis win is a…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the moment of time that we are in, Mr. Speaker. Of course, strategic  tariffs that the previous President and the President before did have  helped, but we are feeling the squeeze in Michigan, and it is news  unfolding before our eyes.\n\nAgain, I reference the article here: ``A stunning number of electric  vehicle, battery factories are being canceled.''…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Treasury Secretary has talked about if we could get down to  3 percent stability. Ray Dalio, who is talking about a book he is  giving away, talks about his incredible fear of the squeeze that is  happening around the world because the countries in the world are  bingeing on debt and that there may be a shortage of borrowable  capital, which will cause us,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…arranging this Special  Order hour.\n\nMr. Speaker, I rise today in strong support of H.R. 6644, the Housing  for the 21st Century Act.\n\nAmericans across the country are feeling the squeeze of a very real  housing crisis. The National Association of Realtors estimates that the  average first-time home buyer was 40 years old in the year 2025.\n\nIn my home State…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…they made their stuff in Missouri, too, with factories in  small towns all across our State; but as we welcomed China into the  world economy, Toastmaster began to feel the squeeze of cheap Asian  imports. By 2001, every Toastmaster plant in our State was gone,  shipping hundreds of jobs from rural mid-Missouri to China. The last  one to go, in the town…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…truth to  the voters? Once again, is this Republican or Democrat? It is just  math. It is an obligation that we have to pay.\n\nWe are going to do what about it? We are going to squeeze out our  ability to do the things that we believe are important for protecting  the Constitution and the society because, God forbid--the bond markets  forbid--that we all…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…producers can't even comply with these rules that don't  exist.\n\nIn other words, the ``exemption'' isn't really an exemption at all.  It is just another backdoor tax designed to squeeze the very industry  that keeps America powered.\n\nThis isn't just bureaucratic red tape, Mr. Speaker. It is a direct  attack on Texas jobs, Texas families, and energy producers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688183/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]