[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…vitrification--a process that other  countries, like France and Japan and Germany have all successfully  achieved--is basically taking the radioactive sludge and turning it  into a stable, storable glass. That is what the skilled workers at the  Hanford Site have been working on for years--years, years--really-- literally 23 years and about $24 billion in taxpayer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…standards as  finalized. Lennox's comments also state: ``The final rule provides  regulatory predictability regarding . . . energy conservation standards  through 2031, providing a stable planning horizon.''\n\nThese comments are an important reminder that regulatory uncertainty  from killing a standard, as the resolution before us today would do,  costs businesses…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Many Haitian TPS recipients have lived in the       United States for over a decade, have U.S. citizen children,       contribute to the economy, own homes, and have built stable       lives rooted in their communities. Termination would suddenly       expose over 300,000 Haitian TPS holders to removal       proceedings, upending families and lives.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…be a police officer, and he gunned down  Democratic State legislator John Hoffman and his wife. Fortunately,  they survived and are recovering from surgery and reportedly in stable  condition. We pray for State Senator Hoffman and his wife's full  recovery.\n\nThen the gunman attacked another Democratic State legislator with  over  20 years of service,…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…homeless and lost custody of her children because she  simply could not afford to feed them. SNAP changed everything. With  help, she got back on her feet. Today, she has a stable home and has  regained full custody of her children.\n\nMr. Speaker, let me also tell you about Michael. Michael is a 66- year-old disabled veteran from San Pedro, California,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of Commerce  has close ties with.\n\nLet me give one more example of why this bill is just bad for  America. The very heart of this bill is that stablecoins will, in fact,  be stable because they will be backed one to one with solid, safe  assets. I invite anyone to read the bill.\n\nWhile some of the reserves are cash and short-term Treasury  securities,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…or asking, but       also Libya will give the United States the energy, and we       will give their states the stability of that region,'' Sahad       said. ``If Libya is stable, then there are big advantages for       Northern Africa, for Africa.''\n\nAlftise reiterated this point, arguing that, while the       Government of National Unity has so far…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…billion in grants for 223 clean energy projects. President Trump  canceled over $714 million in funding for Minnesota. These grants would  have funded battery storage for a more stable grid, modernized  transmission lines, and funded a battery recycling education program at  Macalester College.\n\nMy Republican colleagues want to talk about permitting reform?…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…course of  things; diffusing and diversifying by gentle means the streams of  commerce but forcing nothing; establishing with powers so disposed--in  order to give to trade a stable course, to define the rights of our  merchants, and to enable the government to support them--conventional  rules of intercourse, the best that present circumstances and mutual…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…actions waiting to  be carried out by the Trump administration. There will be no putting  the genie back into the bottle.\n\nIt is going to unleash the President who says he is a stable genius  to continue to perpetrate more of his unconscionable actions on the  people of our country.\n\nSo let's not trigger this nuclear option. Let's not unleash a  mushroom…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this. This is their chance to go on record and show their constituents  that they are serious about getting this done. Imagine what that would  mean. It would mean lower costs, stable coverage, and a Congress that  proves it still answers to working families instead of to the  billionaire class. Instead, we get this GOP inaction and incompetence.\n\nMr. Speaker,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…though we all want answers, we must resist the urge to speculate  on the causes of aviation accidents and allow the NTSB to complete its  work. Aviation safety is dependent on a stable operating environment  and technical analysis. I, for one, would like to trust the experts as  they continue their mission to make the skies safer.\n\nWhen the final report comes…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…balances  responsible energy and mineral development with the protection of  wildlife habitat, water resources, cultural sites, and recreational  opportunities. It provides a stable and predictable framework to guide  and balance the multiple uses of our public lands and resources based  on the needs of today and into the future.\n\nIt is important to recognize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…the United States Constitution.\n\nThat is why I and the executive board of the Congressional Hispanic  Caucus will propose a forward-looking framework for a democratic and  stable Venezuela. As members of the Congressional Hispanic Caucus, we  come from different nations in Latin America and the Caribbean. We are  immigrants, like myself. Many of the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…folks are now waiting months or even years  for their retirement benefits that they earned. This backlog directly  impacts their ability to pay their bills, remain financially stable,  and live with dignity.\n\nOur constituents are paying the price, and we are hearing about it.  Let's inject some common sense and fix this process instead of firing  key staff…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690798/pending-opm-claims"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…spoken, the message still rings true.\n\nAs a key pillar of our economic engagement with Haiti, the HELP/HOPE  program has supported industry growth while encouraging a more stable  business environment. However, as with AGOA and other expired  preference programs, Haiti HELP/HOPE should not be the extent of our  engagement. Congress and the Trump administration…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698849/haiti-economic-lift-program-extension-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…course of  things; diffusing and diversifying by gentle means the streams of  commerce but forcing nothing; establishing with powers so disposed--in  order to give to trade a stable course, to define the rights of our  merchants, and to enable the government to support them--conventional  rules of intercourse, the best that present circumstances and mutual…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Establishing periodic assessments of  vulnerabilities in the artificial intelligence supply chain that  foreign entities of concern could exploit helps ensure our country  maintains stable access to necessary components, boosting domestic  manufacturing and innovation.\n\nTo remain at the forefront of the next generation of technology, we  must thoroughly assess…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…foods.\n\nThese programs should not have been used as a bargaining chip during  the shutdown. Republicans are stepping up to protect Americans and  ensure these programs remain stable and funded. That is what  responsible governance looks like.\n\nThere are three appropriations bills included in the CR, put here to  jump-start our appropriations process.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…know this--the Muslim  Brotherhood issued a memorandum about North America, detailing a plan  for the ``enablement of Islam in North America,'' establishing an  effective and stable Islamic movement led by the Muslim Brotherhood,  which adopts Muslims' causes domestically and globally and works to  expand the observant Muslim base. It was a coordinated…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…of 17 times as  Yvette shielded her daughter, Hope, who then called 911.\n\nThankfully, Yvette Hoffman has been released from the hospital while  John remains in serious but stable condition. He remains in our  prayers.\n\nThe killer, still disguised as a law enforcement officer, then  stopped at the homes of two other Minnesota lawmakers, one whom was…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…hemisphere.\n\nThis legislation passed the Ways and Means Committee unanimously  because members on both sides recognize the humanitarian and strategic  value these programs provide. A stable economy in Haiti contributes to  a more secure United States.\n\nI commend Dr. Murphy for his leadership, and I urge adoption of the  Haiti Economic Lift Program Extension Act.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…President Obama ignored Congress in  pursuing a reckless and bad nuclear deal with Iran. Unsurprisingly,  that deal did not endure.\n\nSuccessfully returning Venezuela to its role of stable, prosperous,  democratic neighbor is a noble goal, but an ambitious one. It doesn't  come without risk. And it is worth making the clear case to the  country.\n\nI appreciate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management.  That is why I introduced the Fix Our Forests Act earlier this year,  which passed the House with overwhelming bipartisan support. FOFA would  not only result in more stable funding for working families, but it  would also mitigate the devastation of wildfires in our wildland-urban  interfaces through the restoration of forest health and commonsense…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…by 2040.\n\nAmerican LNG is more than 40 percent cleaner than Russian LNG.\n\nSince we have increased our LNG exports, domestic natural gas prices  have remained affordable and stable.\n\nUnder President Trump, we are restoring American energy leadership.\n\nMr. Speaker, I thank Congressman August Pfluger for leading this  important legislation, and I encourage…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Mr. CRAPO.  348, the STABLE Trade Policy Act.\n\nSenator Coons is a good friend and a great ally, and, reluctantly, I  stand to oppose this motion on this particular procedure.\n\nFirst, Senator Coons and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…billions more to develop new mines and       mineral processing facilities. Without this certainty, they       will continue to explore and build in countries that have       stable and supportive mining policies.\n\nIt's going to take time to rebuild the U.S. mining       industry, which has atrophied due to decades of hostile       federal policies. Deals…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, nearly 400,000 American children  today are in the Nation's child welfare system and counting on us to  help them secure access to a permanent, loving, and stable home. At the  same time, thousands of parents across the Nation are ready and willing  to provide that love and shelter for kids in need. However, more must  be done to link…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…GDP has grown more than 35 times larger since  the end of the Chinese Civil War. The island has crucial insights to  offer an institution that seeks to put its borrowers on stable footing.  It is long overdue for Taiwan to receive the recognition and  representation it rightfully deserves at the IMF.\n\nMr. Speaker, I urge all my colleagues to join me…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Indiana and beyond.\n\nBeyond their business success, LeMaster Steel Erectors has become a  pillar of the local economy. With offices in Elkhart and Noblesville,  they provide stable employment, support local suppliers, and are a  pillar in their communities.\n\nMr. Speaker, please join me in congratulating LeMaster Steel Erectors  on this remarkable milestone.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}]