[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…sponsor crypto. It means they can print their electronic monopoly  money. China is buying $300 million, and Abu Dhabi has agreed to buy $2  billion of Trump coin or Trump stablecoin.\n\nIt allows for bailouts by the Fed. Jerome Powell won't bail out Trump  coin, but the next Fed Chair will.\n\nIt allows for the purchase with your U.S. tax dollars of Bitcoin…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and co-president Musk to further enrich themselves and  all of their business ventures with their own digital payment systems,  including X and Trump's new payment system, Stablecoin.\n\nMr. Speaker, this is a point that everybody should pay attention to:  The President of the United States and his family have created their  own crypto companies. In addition…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…is pushing to use  crypto to the benefit of himself and his own family, specifically his  son, who is trying to make deals overseas.\n\nOur Secretary has strong ties to the stablecoin Tether. He spent 40  years as CEO and chairman of Cantor Fitzgerald, one of Tether's key  investors. He is using his and his family's weight to pitch Tether to  foreign governments…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692975/leadership-of-blockchain-technology"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…prison cell.\n\nYou don't have to be a genius to know that this bill is an attack on  working families. That is why the AFL-CIO says no, and they are scoring  it.\n\nThey call it stablecoin. It is not stable. It is not a coin. It is a  money market account that, under this law, must pay zero percent  interest. Who wants to forgo a 4 percent rate of return and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…used to offer access to the White House to  the highest bidder, foreign or domestic.\n\nHis family's crypto empire hasn't stopped there. World Liberty  Financial launched a stablecoin called USD1.  Shortly after that, the Abu Dhabi-backed investment firm, MGX, bought  $2 billion worth of Trump's coin to make an investment in Binance.  Trump's family has…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…something that would be in the interest of collective American  security; their request was that the UAE invest $2 billion in Trump's  new crypto business--in particular, his stablecoin venture. This is the  President of the United States going to the UAE and asking a foreign  government to invest $2 billion in his personal business. The company  is called…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Department has described offshore mixers as a primary money laundering  concern.\n\nOf course, you can't make a profit buying and selling something at  the same price, so the stablecoin issuers, like banks, want to earn  interest on the dollars they hold, except that those issuers are not  regulated like banks. We saw this when Silicon Valley Bank collapsed…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…Alsobrooks, Scott, Lummis, and I  introduced the bipartisan GENIUS Act, which is the strongest effort to  date to regulate and create a clear regulatory framework for the  payment stablecoin industry.\n\nIt has a number of commonsense provisions relating to consumer  protections, reserve requirements, illicit finance, national security,  foreign issuers, separating…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…allow him to buy  bitcoin or Trump coin with taxpayer money. That second amendment, also  prohibited by this rule, says that taxpayer money will not be used to  bail out stablecoin or other crypto assets.\n\nWe have already seen dozens of scandals since Sam Bankman-Fried, but  now the industry can say we have got total power in Congress. They gave  us…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the obvious corruption and conflict of interest, but it  allows the President to create electronic Monopoly money.\n\nWho is buying? Abu Dhabi is buying $2 billion of Trump stablecoin  while the Chinese interests behind TikTok are buying $300 million worth  of Trump coin, and that is just what we know about. There is a lot we  don't know about because…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I rise today in opposition to the GENIUS Act.\n\nFrom the beginning, I have said that Congress needs to tackle  stablecoin legislation, but we cannot pretend that this is happening in  a vacuum. We are creating a framework for stablecoins while the  President, his family, and members of his administration…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693830/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…regulatory gray area, putting consumers, markets, and national  security at risk. The bipartisan GENIUS Act brings much-needed  oversight and standards to the $250 billion stablecoin market. It also  creates guardrails for responsible innovation and will enact sensible  consumer protections for payment stablecoins. As an early supporter and  negotiator…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692628/genius-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…some of the foreign investors, maybe some of the  others who have donated or contributed to his campaign and have  invested in the meme coins or in World Liberty Financial stablecoin.\n\nThis plane should be built by an American company. It should be built  so that President Trump can use it--or any other President--on time, on  schedule. It is now already…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…capital formation.\n\nAfter years of good faith, bipartisan negotiation and collaboration  with regulators and stakeholders, former Chair McHenry and I even  drafted payment stablecoin legislation that would create a strong  Federal framework and put consumer protection front and center.\n\nMy bill would foster innovation, while properly addressing the  concerns…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…always have banks, credit cards, debit  cards, Zelle, Venmo, cash, money market funds, and pursuant to the bill  that it looks like we are going to pass today, they will have  stablecoin, a privacy device specifically designed for criminals and  tax evaders. Then they will have mixers to make it impossible for even  the most advanced law enforcement, even…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…colleagues,  Speaker Johnson and Leader Scalise, along with Chairman Hill and  Chairman Thompson, for putting this bill on the House floor today for a  vote.\n\nFundamentally, any stablecoin bill is about national security. It is  about preserving and extending the dollar's dominance as the world's  reserve currency. People want to transact in dollars because…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the bill at all or  if this was about wanting to deny President Trump or Republicans, more  generally, a legislative victory, which might be nice for Democrats but  leaves stablecoin issuers and Americans who use stablecoins in the same  difficult spot that they are currently in. But unfortunately, it is  pretty clear that obstructing, not legislating,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…historic piece of legislation, the  GENIUS Act, to the President's desk because this bill is the first of  its kind in creating a regulatory framework for the future of  stablecoin issuance in the United States to revolutionize finance and  payments in this country and around the globe.\n\nNot only will this cement us, the United States, for decades to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…demonstrated an awareness of the needs of a modern financial sector  here in the United States. I congratulate Chairman Hill and Chairman  Steil and thank them for their work on the stablecoin legislation.\n\nThe GENIUS Act represents an important step for this Congress in  establishing the United States as a leader in the digital asset space.\n\nThis legislation,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693845/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…detail, how they can thoughtfully be  integrated into our payments and contracts. The GENIUS Act thoughtfully  preserves the dual banking system by creating clear pathways for  stablecoin issuance under both State and Federal oversight. The  legislation also protects and builds upon Wyoming's regulatory  framework for digital assets that both protects consumers…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…provides for consideration of S.  1582, the Guiding and Establishing National Innovation for U.S.  Stablecoins Act, otherwise known as the GENIUS Act.\n\nThis is not just a stablecoin bill. This is a strategic step toward  modernizing the U.S. financial infrastructure for the digital age while  protecting the interests of consumers, markets, and the Nation.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…and, frankly, as I was chair of  the Capital Markets Subcommittee in 2017 and 2018 and held hearings on  cryptoassets, Congress has finally recognized the unique nature of  stablecoin products.\n\nUnder this bill, we established a regulatory framework that targets  the activity, not the technology. After years of indecision, Americans  finally have an administration…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693829/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…moving crypto bills today. The Senate passed  the GENIUS Act in the Senate Committee on Banking, Housing, and Urban  Affairs and on the floor of the Senate, which regulates stablecoin.\n\nStablecoins are about 7 percent of the crypto market. The rest is  market structure. I have had a bill to regulate that since 2018. For  over 7 years, I have been trying…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Act of 2025, which will provide a clear regulatory  framework for the issuance of stablecoins in the U.S.\n\nThis bipartisan, industry-supported bill will finally give the  stablecoin asset class clear rules of the road for the issuance and use  of digital assets. The GENIUS Act will establish standards so that  issuers are credible and stablecoins are…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693843/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…treated as a security.\n\nWe talked about that important payment device on a blockchain for use  in that marketplace that is outlined in the CLARITY Act. That is a  dollar-backed stablecoin.\n\nWe want the U.S. to dominate in financial technology and payments,  just as we do for the vast majority of payments around the world in  dollars. That is delivered by the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Bryan Steil's STABLE Act to this  Senate product. However, despite my personal preferences, this bill  absolutely provides a comprehensive and safe Federal framework for  stablecoin regulation.\n\nIn order to usher in a new era of blockchain innovation, we need to  pass the GENIUS Act so our regulators can get to work implementing a  comprehensive stablecoin…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Speaker, I rise in support of the GENIUS Act. The  legislation brings clarity, consumer protections, and American  leadership to the evolving world of payment stablecoins.\n\nStablecoin legislation has been in the works for over 4 years and has  been called for by Democratic and Republican administrations. The  status quo fails to protect consumers from…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…legislation, our legislative work over the past 2 years has laid that  foundation for the progress made in both the House and the Senate.\n\nToday, we have an opportunity to send stablecoin legislation to  President Trump's desk. This is a multi-Congress priority item, and it  ensures American competitiveness and strong guardrails for our  consumers. We should…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]