[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…about everything. Our  basketball arena, FedExForum, has made the city the home of an NBA  team. That is because of Fred Smith. Our college football team plays in  Liberty Stadium. He has pledged $50 million to improve that stadium and  bring it up to higher standards. We have a golf tournament that is the  FedEx St. Jude Golf Classic.\n\nHe had his hand…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…or an entire month.       This could allow employers to pay the tipped subminimum wage       to workers such as baristas, hotel staff, delivery drivers,       salon workers, stadium staff, and other service workers who       do not regularly earn tips. For example, a worker who waits       tables would be paid the full minimum wage for non-tipped…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…born in Indianapolis, Indiana, on June 5, 1889. His  family moved to Tacoma, Washington, my hometown, in 1900, where he  attended Tacoma High School, which is now known as Stadium High School.  At Whitworth College, he was the first African American to play  football at the college level in the entire Pacific Northwest.\n\nAfter college, Mr. Tanner worked…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…very own Super Bowl champions, the Randolph High School Blue  Devils.\n\nShowcasing electric offense and stifling defense, the Blue Devils  shut out West Boylston at Gillette Stadium, capping off an undefeated  season with another championship.\n\nThese student-athletes have made their school and families proud and  proven to themselves and the Commonwealth…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Barbara's Westside, mentoring and caring for  generations of local children with wisdom and heart.\n\nIn a touching full-circle moment, Paul walked down the hill at  Peabody Stadium in 2013 to receive his long-overdue Santa Barbara High  School diploma, graduating alongside his grandson, Diego, nearly 70  years after he left school to serve his country.…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Stockton Diamond Grade Separation.\n\nUnder her leadership, ACE has continued to evolve to meet modern  needs, including the recent launch of a specialty train service to  Levi's Stadium for San Francisco 49ers games--an example of the  flexible, community-responsive transit vision she has cultivated. Her  efforts brought together more than 20 local and regional…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Augustine and Xavier Prep to compete in its tournament,  and the Knights of Columbus ceased running its annual track and field  meet.\n\nOn Friday, December 12, 1975, in Strawberry Stadium. located on the  campus of Southeastern Louisiana in Hammond, Louisiana, the Saint  Augustine High School Purple Knights achieved their first state title  in the Louisiana…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Arlington's influence is seen in its enduring commitment to service  and empowerment. From its collaboration with Arlington ISD on the  annual Back to School Kick-off at AT&T Stadium, to its many ``Done in a  Day'' projects, JLA consistently answers the call to serve families,  women, and children in need.\n\nAs the League begins a new chapter in its new…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Republicans truly cared about TANF oversight, they would have  spoken out when millions of TANF dollars were stolen from struggling  families in Mississippi to build a volleyball stadium and when the  Trump administration stepped in to shield the perpetrators from  accountability. Instead, they were silent.\n\nThe bottom line is simple. Anti-abortion centers…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…projects that have transformed the Great Falls into a hub for tourism  and recreation.\n\nThis includes the expansion of the park's boundaries to encompass the  historic Hinchliffe Stadium. The Great Falls is the crown jewel of our  great city. After Niagara Falls, by volume, it is the largest set of  waterfalls east of the Mississippi River. Hundreds of thousands…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…he meets.\n\nWhether Brother Gary is emceeing the Gorgeous Grandma Pageant,  championing the Marine Toys for Tots on television commercials, firing  up the crowd at Riverside Stadium for the Victoria Generals, or leading  the Christmas parade, Brother Gary shows up with enthusiasm that lifts  the entire community.\n\nAt 73 years young, Brother Gary is always…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…and under  his leadership, the college completed major capital improvements,  including the construction of the Lillis Athletic & Wellness Center,  renovation of Rock Bowl Stadium and Keane Hall, and the construction of  the Tucker Tennis Complex. Collins also expanded graduate and  professional programs, achieved ABET accreditation for engineering…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the  Moody High School football team for winning the Alabama High School  Athletic Association (AHSAA) 5A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 4, 2025,  the Moody football team, with a record of 13-2, secured the school's  second state championship over Vigor High School with a…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697944/recognizing-moody-high-school-for-winning-the-ahsaa-class-5a-state-championship-in-football"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Division 2  High School State Championship.\n\nFollowing an impressive regular season and dominant performance in  the playoffs, the West De Pere Phantoms traveled to Camp Randall  Stadium in Madison to compete in the 2025 WIAA Division 2 State  Football Championship.\n\nIn a hard-fought matchup, the West De Pere team won its third State  title in program history.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…during the pregame show and joined  other high school bands during the halftime performance. The students  performed in front of an estimated 35,000 fans in Raymond James  Stadium, the home of the Tampa Bay Buccaneers.\n\nThe twirlers were invited to participate in the game day programming  through the National Youth Dance and Twirling Program. Stephanie…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699076/recognizing-central-mountain-students"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium upgrades for the football team, Fred Smith and his  family committed $50 million to help the school achieve its financial  goals.\n\nFred and Diane Smith and the Smith family…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…today to recognize the  Moody High School girls' flag football team for winning the Alabama  High School Athletic Association (AHSAA) 1-5A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 3, 2025,  the Moody flag football team, with a record of 22-3, secured the  school's first state championship in flag football over Montgomery…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698051/recognizing-moody-high-school-for-winning-the-ahsaa-class-1-5a-state-championship-in-girls-flag-football"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Fort Wayne Luers  with a 29-14 victory, securing the first football State championship in  the school's history.\n\nThese outstanding athletes played their hardest at Lucas Oil Stadium  on Friday. The Cascade Cadets secured a commanding lead in the first  quarter and remained dominant throughout the game, ultimately emerging  victorious.\n\nI congratulate…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…I rise today to recognize the  Coosa Christian School football team for winning the Alabama High  School Athletic Association (AHSAA) 2A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 5, 2025,  the Coosa Christian School football team, with a record of 13-2,  secured the school's first state championship over Lanett High…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697936/recognizing-coosa-christian-school-for-winning-the-ahsaa-class-2a-state-championship-in-football"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…has been a tradition for the drum major to do a front  flip as the band enters the field at home football games. Ellie  continues this tradition.\n\nAs any visitor to Beaver Stadium can attest, the Blue Band plays a  central role in Penn State's game day and represents the highest level  of tradition, excellence, and pride.\n\nMr. Speaker, as a graduate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…at record highs.\n\nThat is the kind of enthusiasm that people have, once again, for  America. The chants of ``USA, USA'' will permeate not just, of course,  at the baseball stadium tonight but across America because we believe  that America is back. The respect is back, especially after the  failures of what happened in Afghanistan.\n\nWith this in mind,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}]