[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Children's Masonic, and particularly the staff at Hennepin  Healthcare, took in nearly a dozen children in critical condition.", "title": "Recognizing the Brave Hospital Workers to the Annunciation School Shooting", "date": null}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Education Secretary Linda McMahon fired nearly       half of Department staff--with the Office for Civil Rights       (OCR), which is responsible for ensuring schools comply       with federal civil rights laws, being particularly       impacted.", "title": "Pregnant Students' Rights Act", "date": "2026-01-22"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "And after the President-elect requested the ceremonies be  held indoors, our staff and partners worked around the clock to prepare  the U.S.", "title": "Recognizing the Joint Congressional Committee on the Inauguration", "date": "2025-06-02"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "All the staff who help us do our jobs and  help our constituents are unelected bureaucrats, and the majority are  actually Republicans.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "We also include protections I championed for our Department of  Defense civilian workforce, barring arbitrary layoffs for DODEA  teachers and childcare staff, and shielding public shipyard employees  from reductions in force or hiring freezes.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Finally, my third amendment will encourage continued funding for the  Staff Sergeant Parker Gordon Fox Suicide Prevention Grant Program,  which has delivered millions in grants for mental health services to  help prevent veteran suicide.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "We have a that long, proud tradition of bipartisan work by our  Subcommittee on Tactical Air and Land Forces, with special thanks to my  chairman, Chairman Wittman, and his staff.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Before I was a Member of Congress, I served as the Chief of Staff of  NASA and later as the CEO of an aerospace company that created hundreds  of well-paying jobs in the Antelope Valley.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Even that parallel campaign-- they can still share staff.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "As someone who served as the chief of staff on the U.S.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "If passed, school districts already facing shortages of teachers,  counselors, and support staff now will have to divert critical time and  resources from instruction to completing bureaucratic paperwork, like  what qualifies as a foreign source and who qualifies as a foreign  source.", "title": "Combating the Lies of Authoritarians in School Systems Act", "date": "2025-12-03"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "I  also want to thank all the Defense Appropriations Subcommittee staff on  both sides of the aisle.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-16"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "There are 63 living Medal of Honor recipients, including heroes like  Army Staff Sergeant Ryan Pitts of New Hampshire, who served two tours  in Afghanistan.", "title": "Medal of Honor Act", "date": "2025-02-26"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Let's put up a permanent plaque for future generations of Americans  to see that these officers risked their lives for the people in this  Chamber, for the Members of the House and the Senate, for the  leadership of the House and the Senate, for the staff who work here,  and for the reporters who work here.", "title": "Leosa Reform Act", "date": "2025-05-14"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "This is in addition to the  significant staff time reviewing these reports would eat up at BOEM,  leading to further delays in important energy projects that we need to  build for the American people.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "Nothing in the Congressional Review Act, Senate rules, or Senate  precedents gives unelected staff at the GAO the authority to prevent  elected Senators from considering a resolution of disapproval against a  rule.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "It is their own Cheers, as longtime staff  member Dan Collar described.", "title": "Congratulating the Waterville Hotel", "date": "2025-07-15"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Emma  Hall, my deputy chief of staff and the first and only communications  director since the beginning of my journey here to D.C.", "title": "Recognizing Emma Hall", "date": "2025-12-12"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Yet, the one thing we are not allowed to tell our voters, our public,  our staff, each other, is the truth about what drives debt.", "title": "Tell the Truth About Math", "date": "2025-03-25"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "I am grateful for the trust  we have with each other and for the work ethic displayed by Senator  Cantwell and by her staff, who have worked very hard on this matter.", "title": "Rotorcraft Operations Transparency and Oversight Reform Act", "date": "2025-12-17"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Speaker, the fiscal year 2026 Homeland Security appropriations  bill is the culmination of the hard work of our committee and our staff  and provides critical investments to protect the American homeland.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Amanda and I are praying for his wife, Jill; his family and loved  ones; and his staff during this difficult time.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Carol  is an inspiration to the staff and the team she serves with.", "title": "Recognizing Carol Berti", "date": "2025-04-24"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "The Lord provided abundantly by introducing me and my chief of staff  to Riley Pagett.", "title": "America is Back", "date": "2025-03-05"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "He went on to serve in key staff roles at U.S.", "title": "-9999", "date": "2026-02-05"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "She also serves as the Secretary for the Bucks County Technical High  School Foundation for Education Excellence, supporting both students  and staff alike.", "title": "Recognizing Susan Harkins for 45 Years of Service with the Lower Bucks County Chamber of Commerce", "date": "2025-08-15"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Speaker, my prayers are with his wife, Jill; his children; his  grandchildren; the entire LaMalfa family, including his great staff.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Speaker, I rise today to recognize my chief of staff,  James Min.", "title": "Recognizing James Min", "date": "2025-03-10"}]