[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…all New Yorkers.\n\nAs I have said many times, these kinds of violent threats have  absolutely no place--no place--in our political system.\n\nNo one--no public servant, no staff member, no constituent, no  citizen--should ever be targeted for simply doing their job.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…economy. After  graduation, she returned to the District of Columbia to begin her  career in public policy and international affairs.\n\nMs. Manatt served as a professional staff member on the House  Committee on Foreign Affairs, where her portfolio included oversight of  the United States' relationships with Canada and Mexico and countries  throughout…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…extend profound gratitude for the Capitol Police who stood on the  front lines on that terrible day. I thank my colleagues, our appointed  officials, and every congressional staff member who worked to ensure  that the true will of the American people was done.\n\nI urge every citizen that is watching today to remember that the eyes  of the world have not looked…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698550/january-6-attack"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…weeks about this.\n\nBut they didn't come out. What they did is they called the police to  have me arrested. And the police declined to arrest me but did escort  me and my staff member off campus. They did not want there to be a  tour.\n\nAnd I had been told there might be--I think it was--1,000 boys, and  there were some almost 1,500 boys in this. And because…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…us proud.                     Recognizing Max Madrid's Retirement\n\nMr. CORREA. Mr. Speaker, today, I rise to celebrate the retirement of  my very good friend and longtime staff member, Mr. Max Madrid.\n\nMax has worked for me as a field rep since I started in Congress and,  before that, when I worked in the State senate.\n\nMax is a Navy veteran, a Vietnam…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…continued as a naval aviator who flew  missions in Iraq and Afghanistan, as well as missions all over the  world, and then transitioned to Capitol Hill, where he worked as a  staff member at the Navy Office of Legislative Affairs and finally as a  director on the Armed Services Committee. As so many in the Navy and  Congress can attest, our country benefited…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…appointment, your counselor will be out to get you at the       time of your appointment. If you are here for any other       reason, please call and leave a message, and a staff member       will return your call.\n\nWe apologize--\n\n``We apologize''--\n\nfor any inconvenience and impact on your care.\n\nDonald Trump and Elon Musk owe veterans an apology. Right…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate my  Legislative Director, Travis Trejo, on celebrating his eighth  anniversary of employment with my office. Travis is a dedicated staff  member who has repeatedly demonstrated his commitment to my legislative  goals. With loyalty as rare as Travis' on Capitol Hill, I am truly  grateful to have him as the leader…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692740/congratulating-mr-travis-trejo-on-8-years-of-service-to-marylands-first-congressional-district"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Senator Mike Mansfield and ultimately served as Secretary of the Senate  from 1977-1981. His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional life to serving  six different Senators. This is a patriotic family who clearly values  the dignity…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…also like to recognize and thank Mac's family for their  encouragement, love, and support, including his wife Helen Tolar--who  was also a decorated House and Senate senior staff member--and their  three children Walker, Mary Mac, and Oliver.\n\nMr. Speaker, I am honored to recognize Mac Tolar for his outstanding  contributions and overall impact on our Nation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…installed in homes.\n\nMy Energy and Commerce Committee colleagues and I learned of the  serious risks surrounding awnings when tragedy struck the family of  Olivia Shields, a staff member of the committee at the time.\n\nAs Ranking Member Pallone said, she and her family are in the gallery  today. Her father, Michael Hnat, was carrying out a routine household…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…incredible  response to the fire at Lehigh Hospital-Dickson City last Wednesday  night.\n\nThanks to the quick action of hospital staff and first responders,  every patient and staff member was safely evacuated and relocated, many  to nearby hospitals, including Regional Hospital of Scranton, Wilkes- Barre General, Geisinger CMC, and Geisinger Wyoming Valley.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699852/recognizing-lehigh-valley-hospital-dickson-city"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…controlled substances by a member of the Committee staff,       within the workplace or otherwise, shall result in       reconsideration of the security clearance of any such staff       member and may constitute grounds for termination of       employment with the Committee.\n\n10.11. All personnel actions affecting the staff of the       Committee shall be made…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "James Risch", "party": "Republican", "sentence": "…confidential       under other provisions of law or government regulations.\n\nA closed meeting or hearing may be opened by a majority       vote of the committee.\n\n(g) Staff Attendance.--A member of the committee may have       one member of his or her personal staff, for whom that member       assumes personal responsibility, accompany and be seated…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the T&I Committee, first as  deputy staff director and, most notably, as staff director, which he  led my entire team since 2022.\n\nIt is uncommon in this Chamber that a staff member makes such a  lasting impact, but Jack is a very uncommon staffer. He is a trusted  adviser, not only to me but to many members on the Transportation  Committee on both…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in 2018  as a Staff Assistant for Chair Cathy McMorris Rodgers. Since that time,  he has served as a Legislative Clerk, Policy Analyst, and most recently  a Professional Staff Member for the Subcommittee on Commerce,  Manufacturing, and Trade. When I became Chairman in January, Brannon  stayed on as a valuable member of my team as a policy expert in…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690576/recognizing-brannon-rains"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize my longtime  employee, Amy Sorensen, as she prepares to retire at the end of August.\n\nI have often said that a really good staff makes a decent Member of  Congress--and throughout my time in office, I've been fortunate to have  outstanding individuals like Amy by my side.\n\nAmy began working in my Idaho Falls office…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, today I rise to thank Alex Cisneros for his  decade of service to our Nation as a dedicated staff member in the  House of Representatives, most recently as my legislative director over  the last 4 years.\n\nHis diligent work ethic, sharp intellect, and the ability to build  trusting…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688120/thanking-alex-cisneros-legislative-director"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…for Rep. Louie Gohmert (TX-01) in October 2016  before becoming a Legislative Correspondent and Legislative Assistant  for Rep. Bob Goodlatte (VA-06) and a Professional Staff Member for the  Republican Study Committee. In February 2023, Gavin joined the House  Committee on Energy and Commerce as a Professional Staff Member for the  Subcommittee on Oversight…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692115/recognizing-gavin-proffitt"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…memories, and the  moments shared.\n\nFor many, this hotel is far more than a place to eat or sleep. It is  a community gathering place. It is their own Cheers, as longtime staff  member Dan Collar described. It is a place where locals and visitors  alike return year after year, bound by a shared experience of  belonging.\n\nThe Waterville Hotel serves as…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…for future efforts to combat invasive  species in our waterways.\n\nI would be remiss if I didn't thank Representative Elfreth for her  work on this effort, as well as her staff member, Allie.\n\nI also thank the House Natural Resources Committee staff. They  include Richie, Kirby, Doug, Jackson, and Hannah on the majority and  Rachel on the minority staff.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Senate and the chairperson and the ranking member of the       Committee on Transportation and Infrastructure of the House       of Representatives may each designate 1 staff member of each       such Committees.\n\n``(B) Role.--Staff designated under subparagraph (A)--\n\n``(i) may attend and participate in visits and carry out       consultations described…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]