[{"senator": "Ed Case", "party": "Democrat", "sentence": "…gift  for the President's trip home when he surely visits shortly. The  headline of People's Daily in Mandarin reads: Peace in Our time.\n\nThose are the unavoidable broader stakes of betraying Ukraine today.  I know my Republican colleagues know this. I know this because I have  heard them say it repeatedly over 3 years. I have heard them say it in…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…trust.\n\nFamilies looking for answers, for protection, and for justice cannot  afford to wait. Trust me, Mr. Speaker, I know. I have been one of those  families. I know the stakes of receiving justice for a loved one, and  they are just far too high.\n\nI thank my colleagues for standing up. I thank Representative Johnson  for standing up for the integrity…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…like you to believe, and those costs get passed on to the  consumer.\n\nMeanwhile, the world is moving on without us, as I explained a minute  ago.\n\nSo let's be clear about the stakes of what we are debating today: A  vote against this resolution is a vote to maintain Trump's tariffs that  are so clearly devastating our economy already. It will move us closer…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…our thumbprint on ``This is a national mission we are  risking our sons and daughters' lives for,'' we have a debate in front  of the entire public so they can understand the stakes.\n\nWar is too big for any one person.\n\nI think the events of this week have demonstrated that war is too big  to be consigned to the decisions of any one person.\n\nOur current…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…not only cut funding or reduce services, but it  would threaten the future of these students who with just the right  amount of support and accommodations could thrive.\n\nThe stakes are too high. We must protect the Department of Education,  and we must protect IDEA. This administration has yet to lay out any  detailed plan for the future of IDEA.\n\nI have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…contradicted by the White House or other  sources. His argument boils down to: Take him at his word; trust him.  But, frankly, I cannot--not when the law is this clear, not when the  stakes are this high.\n\nShamelessly violating the laws of armed conflict puts our own service  men and women at risk of receiving the same treatment in the future by  our adversaries.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…everything from groceries to rent to electricity  shouldn't be partisan issues.\n\nI know there are many of our colleagues on the other side of the  aisle who understand these stakes, who are worried about what is  happening with their constituents. So let's come together. Let's  address the American people's concerns. Let's put aside the politics  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…happening in my State. As I know, three-quarters  of the people who get their health coverage on this ACA Marketplace  live in States that President Trump won. We know the stakes, and we  must come together to solve this affordability crisis. And I will note  that the amount of money given to Argentina was approximately the same  amount it would take…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…costs, and greater  access for everyday Americans, small businesses, and those who  currently face intimidating and burdensome procedures.\n\nIn a system where there are high stakes for individuals, families,  and entrepreneurs, there is nothing uncommon or unreasonable about  expecting a fair shot, swift resolution, and procedures that reflect  modern…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…a classified setting.\n\nCanceling or even delaying the briefing is completely unacceptable  and a failure of your duties and responsibilities to this body.\n\nMr. Speaker, the stakes could not be higher.\n\nFor more than 40 years, Iran has threatened its neighbors, threatened  Israel, the United States, and the world. Under the Ayatollahs, Iran  has been…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…me simply: We need food to live.\n\nBethany from Center Township says that without Medicaid, she would be  dead. If Trump cuts Medicaid, she will probably die.\n\nThese are the stakes. Every corner of my district, every corner of  the great Hoosier State, and every corner of our country will be  impacted by these very cruel budget cuts.\n\nUnder this budget,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691462/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…run overseas only make it harder to call out abuses when they  occur. The United States should not be stepping back; we should be  stepping up.\n\nFew leaders understood these stakes more clearly than Madeleine  Albright. At her confirmation hearing for Secretary of State, she said,  ``Democratic  progress must be sustained as it was built, by American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…Such discharge would require the Senate to debate whether  congressional authorization should be required for any further  offensive military action against Iran. Given the stakes for U.S.  national security, the safety of military servicemembers we represent,  and the security of our allies, Senators owe the American people that  debate, consistent…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693087/sj-res-59"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…The league talks about lifting women  up. Pay them what they deserve if you want to lift women up in the  WNBA.\n\nThey talk about growing the game with integrity, but when the stakes  were high, the WNBA didn't protect the game. They manipulated it. They  chose a winner.\n\nHere is the truth: Minnesota didn't lose game five. The WNBA took it  from them, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…largest selfsustaining populations of       native lake trout in America. The potential loss of these       unique recreational opportunities is a stark reminder of the       stakes involved in protecting this irreplaceable natural       resource.\n\nH.J. Res. 140 would overturn the 20-year mineral       withdrawal, which complied fully with the Federal…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…vital  partnership at a time when unity and strength are urgently needed. That  is unacceptable.\n\nThe Taiwan Assurance Act passed with bipartisan support in 2020, but  the stakes are even higher today. That is why this bill updates and  strengthens the original law, ensuring that U.S. policy toward Taiwan  reflects today's strategic reality, not yesterday's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…States Research Protection Act. H.R. 1318  is a critical piece of legislation that seeks to protect the future of  our Nation's scientific and technological advancement. The stakes could  not be higher in this era of rapid global innovation and increasingly  complex geopolitical dynamics.\n\nI thank Chairman Babin for working with me to bring this important…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…an ER receives care. Day or  night, emergency nurses answer the call of duty--providing quality care  to patients in critical condition while operating in demanding, high- stakes environments where every second counts. Emergency nurses work  around the clock, caring for patients of all ages and across every  specialty--from cardiology and oncology to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696115/recognizing-emergency-nurses-week"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Chester County, Smarty Jones was not just a racehorse. He was a  Pennsylvania champion horse.\n\nIn 2004, he captivated the Nation, winning the Kentucky Derby and the  Preakness Stakes, and coming within a single length of the Triple Crown  at the Belmont Stakes.\n\nLast month, Smarty Jones was inducted into the National Museum of  Racing Hall of Fame.\n\nToday,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694960/recognizing-smarty-jones"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…strategy is what administrations  use to define threats, identify objectives, and propose coherent plans  for aligning resources to actually meet them. But this time around, the  stakes are a lot higher. A shortsighted NDS that doesn't align with the  President's vision of American greatness and peace through strength  could wind up as the pretext to extend…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…others.\n\nEMS providers are vital to maintaining the health and safety of the  public, especially in rural communities like my district, where  resources can be limited and the stakes are high.\n\nAs someone who has spent more than three decades on the front lines  as a volunteer firefighter and EMT, I have seen firsthand the  extraordinary courage and commitment…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Sheriffs association.\n\nLadies and gentlemen, I don't know why it is hard for any Member of  the U.S. Senate to get behind this bill. It simply says that we are  going to raise the stakes for anybody who would knowingly do harm to a  police officer.\n\nTo every officer serving today: Thank you for your courage. You have  earned my unending gratitude.\n\nBy supporting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…machinery. Working and winning the AI race means we have to work hand  in glove with our allies to ensure that these technologies are not  acquired by the PRC, and we know the stakes if we don't accomplish that  job.\n\nIn the same way that China has captured the supply chain for the  production of processing critical minerals, they have designs to  capture…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…not  enough to brace ourselves for the aftermath of disaster. We must root  out the threat before it has time to fester.\n\nThe reality is this: Our foreign adversaries have stakes in numerous  companies operating freely and legally within the United States. Yet,  in many cases, the public remains unaware which companies are owned,  wholly or partially,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…That is why the crisis that confronts us  today is not merely economic. It is about communism and slave labor  versus freedom. It is about who will win the 21st century. The stakes  are high. It is about the survival of our civilization. It is about the  kind of Nation and people we are and will be: one that creates and  builds or one that simply consumes.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…fire within their own town or a neighboring community in need,  Kennedy's volunteers have never hesitated to offer support through  mutual aid. When disaster strikes and the stakes are high, these men  and women grab their gear and get moving, facing flames, chaos, and the  unknown with unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "John Thune", "party": "Republican", "sentence": "…simply to make it harder to  detain and deport dangerous illegal aliens, then they will find no  interest on this side of the aisle. I hope that is not the case because  the stakes are high.\n\nRepublicans provided for ICE enforcement in the Working Families Tax  Cuts, but the Homeland Security bill funds a number of other critical  Agencies, including…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…earned him  widespread respect. Notably, he served as the Commander of all DPS  uniformed forces during the Mt. Carmel incident, further underscoring  his critical role in high-stakes situations.\n\nAfter retiring from DPS, Danny continued to serve by leading in the  field of education. As Director of the Law Enforcement Academy and  Division Chair of the…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today in strong support of the  rule to consider H.R. 1, the One Big Beautiful Bill Act.\n\nThe stakes for the American people could not be higher. We are  rapidly approaching a fiscal cliff. If we do nothing, the Trump tax  cuts, the most progrowth tax reforms in generations,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…I trust that they are  acting in good faith. But I do ask them--I do ask them and all who  oppose the SAVE America Act, regardless of party--to consider the  extraordinary stakes.\n\nWe have the opportunity in this Congress to remove deep  vulnerabilities in our elections and to restore America's trust in this  core function of our Republic. I can think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}]