[{"senator": "Al Green", "party": "Democrat", "sentence": "…good faith that what is happening in Gaza is something  other than genocide? It is genocide. We have the blood of what is  happening to those innocent people on our hands.\n\nI started by talking about innocent people. They are among the  innocents. We can't care more about some babies than other babies. We  will allow the killing of Palestinian babies and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…family vacation. That means lower  demand, slower growth, job losses in every sector of our economy from  Main Street shops to factory floors.\n\nMr. MEEKS. While Trump may have started this, if this Republican  majority chooses to duck a vote on my resolution ending these tariffs,  then they will own this, too. They will own the higher prices. They  will…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…park signage  that tells the truth about slavery, the genocide of indigenous  Americans, and the incarceration of Japanese Americans during World War  II.\n\nIn Nazi Germany, it started with burning books. In the USSR, they  erased people from photographs. In North Korea, they deleted political  leaders from online archives. Today, in the United States, quite…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, today, I rise to celebrate the retirement of  my very good friend and longtime staff member, Mr. Max Madrid.\n\nMax has worked for me as a field rep since I started in Congress and,  before that, when I worked in the State senate.\n\nMax is a Navy veteran, a Vietnam war veteran who served our country  for 20 years in the Navy. Today, Max…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…about the war in Vietnam.\n\nObviously, there was a draft, and 56,000 Americans were killed in  that war. But President Nixon, without informing Congress, extended the  war and started bombing Cambodia--it was called the secret bombing of  Cambodia--a new country that had not been covered by war  authorizations. So Congress stepped up and acted and passed…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…constituents sent me here to do.\n\nThat is not what my constituents sent me here to do. That is not what  this government has done in the past when people were hurting.\n\nI end where I started. My parents saw the best of government, and  they saw the worst of government.\n\nIf we had another hour, I could walk down the path of how a lot of  what I am seeing in 2025…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…mission--opening its doors to  the entire community.\n\nAs of today, volunteers come together once a week to package and  distribute food boxes to families across the community. What started as  a small operation has now grown into a critical lifeline for thousands.  The Neabsco Baptist Church has now provided food to over 5 million  families, ensuring that no…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…supporting domestic manufacturing, these trade policies  are making future American manufacturing more expensive. Furthermore,  they are threatening jobs.\n\nMy husband and I started out our married life owning and operating a  small business. I know the hardest part of small businesses is growing  and sustaining those businesses when you are uncertain…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Brazil, a country, by the way, with whom we have a trade  surplus.\n\nWe are 9 months into this trade war with tariffs at the forefront. It  is a war with Canada. It sort of started with them. That is a big deal  for Vermont. We are a border State. But it is a big deal for all of our  States because Vermont is 1 of 34 States whose major trading partner…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…named David Kennedy. ``Freedom  from Fear'' is about the events and the misdirection and mistakes that  led our Nation to the Great Depression.\n\nWhat began as a recession, what started as a Wall Street problem,  became a global depression because the world failed to realize that,  even then, our economies were connected and that tariffs could hurt all  countries…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that forever scarred our political system  and scarred our Nation.\n\nWe cannot, and we must not forget, what happened on January 6, 2021.  That morning, my colleagues and I started the day in this Chamber,  ready to fulfill our constitutional duty to ratify the electoral  college votes that would elect Joe Biden as the 46th President of the  United States,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Virginia but gave him the wrong  title--``Speaker of the House'' because people were watching C-SPAN in  the House, and they had no access in the Senate--that then-Senator Byrd  started to think, Hmm, maybe we should have TV coverage in the Senate  as well to make sure that the Senate wasn't outshined by the House. The  Senate voted, and C-SPAN2 was born…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the majority, you never heard  them stop talking about how important the filibuster was, but now that  they are in the majority, it is only a little over 100 days--and this  started some time ago. They immediately started the plot to bring this  chore for the fossil fuel funders through the Senate floor and break  the filibuster in order to accomplish…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…campaign promise.\n\nI am best known around here as being the Ph.D. physicist in Congress.  Before that, I was a manufacturer.\n\nWhen I was 19 years old, my little brother and I started a company in  our basement with $500 from my parents. That company now manufactures  more than half of the theater lighting equipment in the United States.  Our company does…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…collapsed in the hallway. A MERT team was  called, but Janette immediately took action. She understood what the  veteran was experiencing and administered CPR until the veteran started  responding and the MERT team arrived. This veteran credits Janette with  saving their life.\n\nOn behalf of my constituents in New Hampshire's First Congressional  District,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…last year, I think a great deal of praise is in order  for our leadership--Senator Thune and Senate Republicans generally--for  getting so much done in the last 11 months.\n\nWe started the year off with an impressive clip, confirming President  Trump's Cabinet at a record speed. We successfully passed a  reconciliation package, which will extend President…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…worked with community members  to clean up litter and illegal dumping around the town and educate the  public on the importance of conservation and environmental protection.\n\nStarted by a high school student and a group of community members,  within its first year, the organization amassed a team of more than  1,500 volunteers, managing to clear over 10,000…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…our conference  to include furloughed workers. Get on the bill. We will amend it. We  will get this passed, and we will start paying people.\n\nHe rejected that offer. Now, we started having discussions. His staff  immediately acknowledged the fact that my bill did not in any way,  shape, or form impact the President's authority in terms of determining…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Kentucky. Mr. Speaker, I rise to pay tribute to the  Brother's Keepers Motorcycle Club of Kentucky. What started out as a  group of firefighters whose main purpose was to strengthen their  brotherhood through recreational motorcycle rides, has now grown into a  club with much greater…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…the first pieces of legislation that we introduced in the  117th Congress was the Stopping Overdoses of Fentanyl Analogues Act.  SOFA is the same acronym as an organization started by Lauri Badura of  Oconomowoc, Wisconsin, Saving Others For Archie. Archie was her son.\n\nLauri has worked to raise awareness of the dangers of drug addiction  throughout…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…identified an opportunity to improve the quality and consistency of  meat snacks available in the marketplace.\n\nThese efforts led to the creation of Jack Link's Beef Jerky. What  started as a small Wisconsin operation has now grown into the world's  largest manufacturer of jerky in the world. Through it all, the company  has remained 100 percent family owned.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700132/congratulations-to-jack-link-founder-of-link-snacks-inc"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the rules, my colleagues liked  Elizabeth's and my bill so much they said: Let's put it on the NDAA.  And we did; flew out of here.\n\nThen it went over to the House, and we started negotiating the NDAA  because the House passed its version of the NDAA, and we had passed our  version of the NDAA, and they weren't the same. So the people in charge  of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, this week started off very difficult with  losing Representative LaMalfa. I had the privilege of serving with him  for 7 years on the Natural Resources Committee. He also chaired the  Western…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698719/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…to note that is  all stolen taxpayer money. It is so interesting that this big theft was  uncovered by a young independent journalist who really blew the story  open when he started visiting childcare centers following a lead,  visiting these childcare centers in Minneapolis.\n\nDespite these centers having pulled in tens of millions of taxpayer  dollars,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…been a Ramras in  Interior Alaska going on 80 years.\n\nAnd Jay's entrepreneurial resume, which is legendary in Alaska, began  in 1986 at the tender age of 22 years old when he started a chicken  wing restaurant, expanding his business footprint to other eateries  across Fairbanks and, eventually, purchasing the iconic Fairbanks  landmark called Pike's Landing.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…proudest achievements was serving as the 325th Operational Support  Squadron commander at Tyndall Air Force Base, supporting Operation  Northern Watch.\n\nColonel Shurtleff started fighting stage IV cancer in 2019 at just 41  years old and, unfortunately, passed away on May 23 at the age of 48.\n\nMy prayers are with his wife, Julie, and their family.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Speaker, I rise today to honor the retirement  of Chief Keith Kimball, who served the people of Bettendorf and the  State of Iowa with distinction for 35 years.\n\nChief Kimball started on third-shift patrol and worked his way  through the ranks with grit, integrity, and a heart for service. From  becoming Bettendorf's first-ever school resource officer to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people to support our older population. This really seems to upset  people, but understand, look at our fertility, look at our demographic  charts.\n\nGo back to 1990, the year we started to roll over. There is a dataset  out there--I don't believe it yet; I haven't had the chance to try to  prove it--saying even last year we may have had more deaths than…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Republicans have  been hard at work executing the mandate we received from the American  people last November. We already have a number of accomplishments on  the list.\n\nWe got started by sending the Laken Riley Act to President Trump's  desk during his first week in office to keep criminal illegal  immigrants off our streets.\n\nPresident Trump signed the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…under the Biden  administration.\n\nLet's go back into a little bit of history here about the hearing.  The messages show that Plaskett texted Epstein before the hearing that  started that day, at 7:55. She texted him, the sex offender, the  predator on the children she says she protects. They had comments like  he told Ms. Plaskett to  talk about his grades.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]