[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…have invested in, traded, or used digital assets. That is  one in five Americans. The public interest in these markets is already  here, and it is not going away.\n\nUnder the status quo, there is a gap in regulation for the digital  commodity asset market. Our work here today could begin to provide the  protections that American investors are accustomed…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mar-a-Lago, go ahead and support your Republican  Representative. If you are a regular person who feels like you are  getting screwed over, and if you are fed up with the status quo here in  Washington that only works for those at the top, this majority is not  fighting for you--but we are.\n\nDemocrats are on your side, and we will fight with you every…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…power in this body to do something about it, and until we  do, my vote will reflect my complete and utter rejection of this  lawless and cruel regime. This cannot become the status quo. This  cannot become the new normal for America, for Alex Pretti and Renee  Good, for the Californians detained without cause and without  convictions, like those suffering…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…with the flow and go along with the  system that we have today. Instead, my colleagues have decided to speak  up. My colleagues have decided that they will not accept the status  quo.\n\nI know many people were not able to come today. I know we have a few  more still on their way, but the reality is that my colleagues  understand that the system is not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…related substances were originally scheduled by the DEA, in 2018,  Congress has never allowed this authority to expire. So, by passing  this bill, we are merely maintaining the status quo. We must also  address how this poison gets into the hands of the most vulnerable: our  children. Too often, fentanyl is peddled in the open on some of the  world's largest…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…breathe and safe water to drink,  where health equity is a given and not an afterthought, where Black  pain is believed.\n\nAs we stay head down working toward that vision, the status quo is  stark. In 2023, the Boston Public Health Commission reported that  diabetes mortality for Black women was three times that of White women.\n\nThe same report detailed that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…developed Nation that does  not guarantee healthcare for everyone. That is not because we can't  afford it. It is because powerful interests make too much money from  the status quo.\n\nTo any Republican who knows this bill is wrong, who understands what  this will do back home, and who still believes that this institution  should work for the people it…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…defense of identifying racism when you want  to assault racism. We should be able to assault it. We should be able  to attack it. You can't do it because when you do, the status quo  across the media and many persons who can make a difference will reject  what you are doing simply because you are saying this is racist. That  is the case.\n\nIt is not like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…seafloor, then leaving the taxpayers on the hook to  clean up the mess. Yes, did I say taxpayers? Yes, they are the ones who  paid.\n\nFinally, my amendment would maintain the status quo and allow NOAA to  collect a fair market fee for the use of these sanctuary resources,  just like any other public land management agency does for cables that  cross their…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are of a nature  which may with peculiar propriety be denominated political, as they  relate chiefly to injuries done immediately to society itself.\n\nContrary to what many status quo personalities may have you believe  and would have you believe, there is no requirement for the existence  of a constitutional crisis before impeaching for high crimes and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…right over to my right when the  President was up at that podium and I told him he didn't have a mandate  to cut Medicaid, Medicare, and Social Security.\n\nThe networks are a status quo institution for the most part. They  want to maintain things as they are. I am not a status quo  Representative. I want to see change, positive change, change that can  make…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…pregnancy education, pregnancy       testing, diapers, baby clothes, or other material       supports.''.\n\nMr. Speaker, let the record reflect that this bill maintains the  status quo of funding. Right now, people can use TANF dollars for  funding. That is how it has always been. This is just protecting that  it continues to do so because the prior President,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…administration is adding to the humanitarian crisis.\n\nI am disappointed in many of my colleagues on the other side of the  aisle. They continue to defend the U.S. embargo and the status quo.  They claim that they want to force the Cuban Government to treat its  own people better, yet now when they have a chance to speak out against  the Trump administration's…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…for what they have done. I know that  this reporter meant well.\n\nBy the way, I have respect for the reporter, but I know what is  happening at CNN and how CNN has become a status quo news source. To  maintain the status quo, CNN will do things that, quite frankly, don't  allow us to make the change necessary to benefit all Americans.\n\nThis reporter mentioned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Liberty doesn't have certain language on  it. You who are listening will know the truth. That is not true, but  that is the way certain members of the press behave. That is the status  quo press, as how I identify them.\n\nBut I want to say to the persons who are going to be a part of this  impeachment, and that will be all of the Members of the House of  Representatives,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Let's remember what happened in 2020. President Trump issued a  moratorium. That moratorium stays in place until 2032. Absent some  other action taken pursuant to that, the status quo is to protect them.\n\nWhat she is trying to do is to protect against President Trump doing  anything consistent with his authority, consistent with that 2020  order. She is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the era of woke and wasteful spending in  the people's government is over, and it is sad to watch this last-ditch  effort by my Democratic colleagues to fight for status quo. The status  quo is a cesspool of these leftist ideological programs that they would  say is soft power for America's interests or that they would say are  lifesaving services.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…it was yesterday and than it was the day before  that. It is that. It is a fantasy.\n\nNow, interestingly enough, the Democrat proposal--which is a 3-year  extension of the status quo--is an attempt to disguise the real impact  of ObamaCare's spiraling healthcare costs. So, if we do this, if we  extend this for 3 years at a cost of $83 billion to taxpayers--$83…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…spending money and bankrupting our country and  threatening the welfare of future generations. We have a present-day  responsibility to address that, and we know that the status quo was not  sustainable.\n\nAssuring those who do not actually qualify are not taking benefits  away from those who do is only common sense. It is the least we can do.\n\nBut that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…being  considered in my home State of Pennsylvania where there are some  families that feel trapped in a system that puts bureaucracy before  students.\n\nWe cannot allow the status quo to be accepted.\n\nSchool choice works, Mr. Speaker, and what are these politicians  afraid of? I went to a public school, and I had some great teachers. My  son went to public…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Service are       not exempt from paying the FAET on less-than lethal devices.       The legislation returns the U.S. Marshal Service and other       federal agencies to the status quo of not paying a ten or       eleven percent tax on the purchase of less-than-lethal       devices.\n\nA historical payment of FAET tax from a federal law       enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…application is  filed. The fact that the government can waltz in and shut down years of  hard work is staggering.\n\nThis section of H.R. 3898 is not a dramatic departure from the status  quo. It clarifies timelines and brings certainty. When an application  is pending, the EPA can determine whether or not to veto. It is simple.\n\nIt does not alter the process,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…for planning failures that total billions of dollars.\n\nWithout some ways of tying poor performance to outcomes for these  employees, what message does the business-as-usual status quo send to  rank-and-file employees?\n\nWhen they hear of senior executives filling each other's pockets with  improper bonuses, what does that tell the frontline VA police officer,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…administrations, bureaucrats redefined a clear term to advance an  ideological agenda creating confusion for manufacturers and frustration  for consumers.\n\nThis was the status quo under the leadership of Democrats--regulate  everything in our lives right down to our showerheads. It is incredible  if you think about it. This may seem like a ridiculous…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…would say 90 days is too aggressive, my response is: How  long should a veteran wait? How long should a trained physician sit  idle? The current state is intolerable. The status quo has failed, and  it is time for genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…is straightforward. We need to change  the law.\n\nMy colleagues on the other side of the aisle candidly are twisting  themselves into circles to defend the policies of the status quo. They  want more illegal immigrants. They do not want stricter enforcement.  They are turning every opportunity to resist the changes that  Republicans and this President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…shouldn't have to worry whether an illegal alien  driving under the influence of alcohol is going to cause them bodily  harm or kill them outright.\n\nWe simply cannot continue the status quo of allowing aliens who  entered our country illegally or were allowed by the Biden  administration's open border policies and who decide to drive drunk or  under the influence--we…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…per gallon, an increased fuel dependence on Asian  producers, and jeopardizing the fuel supply chain of military  installations in their State.\n\nWe must not let this become status quo across the country. H.R. 3109  requires the National Petroleum Council to collect and examine  information regarding the role of petrochemical refineries in the  United States…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…ecosystem.\n\nAs we said in the last Congress, Mr. Speaker, these rules need to be  fit for purpose for the digital ecosystem. All of us on this House  floor know that the status quo is simply unacceptable. We all know  American consumers and innovators deserve this clarity. They deserve  better. They deserve rules of the road.\n\nThe choice before us is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…corporate bosses, the special interests, and, yes, the  politicians who sold our country out for a seat at the table of the  globalist banquet.\n\nI blame the ideologues of the status quo, the international elites,  the so-called citizens of the world who see our country as a global  economic zone, a giant shopping mall with an airport attached.\n\nI blame the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]