[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…out some States that are represented by our  Republican colleagues.\n\nIn Alabama, 20 percent of Alabamans are on their Medicaid Program. In  total, 330,000 people in one State--Alabama--would lose their  healthcare if this cut went through.\n\nIn Arkansas, 25 percent of families are on the Arkansas Medicaid  Program. A quarter of a million people would…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has repeatedly put politics ahead of the rule of law.\n\nHe has resisted the orders of Federal courts--including the Supreme  Court--after they ruled against him and the State of Alabama in voting  rights cases. His role in that litigation was not confined to a  courtroom. After the Supreme Court recognized that Alabama's voting  maps likely violated section…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, education is personal to my family. In  the 1880s, my great-grandfather founded a school in a rural community  because the State of Alabama did not think it important to educate  Black children. As he explained in his autobiography, he wanted to  teach the children, whose parents and grandparents had been…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Last, but certainly not least, I congratulate Uniontown's own R.C.  Hatch boys' basketball team. In February, the Bobcats set a new record  for boys' basketball in the State of Alabama when they took home their  11th State title as Division 1A champions.\n\nAs the proud daughter of the late Coach Andrew A. Sewell, who coached  the Selma High School Saints…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, I rise today to speak on an urgent issue  that affects the health, well-being, and prosperity of Black families,  not just across the State of Alabama that I call home, but across this  country, the staggering healthcare disparities that persist across this  country and across too many counties in districts like mine,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…others. Black History Month is about more than just those  who are known. It is about a lot of those who are not known.\n\nI begin with a story of a few young men in the State of Alabama.  Following what history has come to label as the end of the civil rights  movement in 1968, in 1969, four young men had been intentionally  recruited to break down a…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…filmmaker, screenwriter, and producer Ava DuVernay grew  up in the communities of Lynwood and Compton, in California, and spent  her summers visiting her father's home state of Alabama. It was in  Alabama that DuVernay found her passion for film through cherished time  spent with her aunt, Denise Sexton.\n\nSetting out into the film industry first as a…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…being released to individuals, and  hopefully, our colleagues are paying attention to this because it is  showing what premium increases look like, but a couple in the State of  Alabama--I am sorry, a single woman in Alabama making $65,000 a year  could see her premium increase 43 percent from the 2025 levels. It  would mean she would pay an additional…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…premiums could  rise from $170 a month to $517, a 204-percent increase. That is why our  vote this week is so important.\n\nWe can stop these premiums from increasing in my State, in Alabama,  in every State where people are affected by it. In Western Illinois,  residents, on average, will see a 120-percent increase if we don't do  something this week.\n\nWhat…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise today in strong opposition to this  bill.\n\nIn a matter of days, roughly 130,000 people in my home State of  Alabama will lose their healthcare coverage because Republicans in this  body refuse to extend the ACA tax credits. Millions of Americans will  find themselves one diagnosis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698384/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Congressional Black Caucus, Congress, and the  constituents who we represent.\n\nMr. Speaker, in the 1880s, my great-grandfather founded a school in  his rural community because the State of Alabama did not provide a good  education to Black children. As explained in his autobiography, he  wanted to teach children, whose parents and grandparents had been  enslaved…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…few years later, in 1934, his mother died from cancer when he was  10 years old. My dad went to Alabama to live with his grandparents, who  founded a school. Because the State of Alabama didn't think it was  important enough to educate Black children, his grandparents started a  school.\n\nMy dad saw the best of government and the worst of government. He…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…hours to serving their community and supporting local veterans'  organizations. Their commitment and dedication earned them recognition  as Unit of the Year in the tri-state (Alabama, Georgia, Tennessee)  Southeast Regiment of the Year of Division 2, and most recently,  National Young Marines of the Year for 2025.\n\nThe impact of this remarkable group…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…come  from.\n\nFor me, what that district looks like is about one in four households  rely on SNAP benefits. Over 200,000 people, almost a third of the  population in the State of Alabama, are enrolled in Medicaid.\n\nThe individual median income in my district is just about $31,000 a  year. I come from a district that is not the wealthiest in this  country.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692812/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…District, a district currently represented by Dale  Strong.\n\nI am so thankful for the representation of my good friends, Terri  Sewell and Shomari Figures, in the great State of Alabama.\n\nTalese writes to us: ``I am a single mom, doing everything with my  one income. My ex-husband refuses to pay child support or split the  cost of anything related to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…ADERHOLT. Mr. Speaker, I rise today to recognize and honor Mr.  Dale Greer upon his retirement and to commend him for a lifetime of  service to the Cullman community and the State of Alabama. Over the  course of more than three decades in economic development, Mr. Greer  has helped shape the future of Cullman County through his steady  leadership, dedication…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…President, I reserve my right to object.\n\nI would like to start by just saying a few comments, and that is just  this: I think about my good friend, my colleague from the great State  of Alabama. He is a patriot. He is a good man. He is a man full of  common sense. He is a man that absolutely cannot stand wasting time. He  can't stand worthless grandstanding,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Talladega Insurance is currently under the leadership of Boyd McGehee.\n\nTalladega Insurance Company was incorporated in 1856 making it the  oldest insurance agency in the State of Alabama and the second oldest  in the United States.\n\nThe company attributes its longevity to its superior staffing. The  Talladega Insurance Agency is built on family, as it…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…first time in 40  years.\n\nThe Vincent players demonstrated the kind of grit, teamwork, and  commitment to excellence that define championship-winning programs. If  the State of Alabama knows anything, we know what it means to win a  championship.\n\nCongratulations to Coach Timothy Junkins, MVP Landon Archer, and the  entire team on a fantastic season.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…State continues to fulfill  its mission of ``learning that transforms lives and communities,''  providing opportunities that strengthen individuals, families, and the  State of Alabama.\n\nUnder the leadership of Dr. Karolewics, who has served as president  since 2003, Wallace State has become a national model for excellence,  innovation, and service.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…36 years. He also worked at Piedmont Health Care  Center as the Alzheimer's Coordinator and Activity Director after his  retirement from DHR.\n\nMayor Baker was awarded a State of Alabama Senior Citizens Hall of  Fame Civic Award in 2008 and received the Piedmont Journal Citizen of  the Year award in 2013.\n\nMayor Baker has served the City of Piedmont since…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…District. She will be greatly missed.\n\nMr. Speaker, please join me in recognizing Beverly for her retirement  and thanking her for her dedication and service to our great State of  Alabama. I congratulate Beverly.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…anniversary of Gadsden State Community College. Gadsden State is  currently under the leadership of President Alan Smith.\n\nOne of the initial founding institutions of Gadsden State is the  Alabama School of Trades. It was established in 1925 as the first  state-operated trade school in Alabama and the entire southern United  States.\n\nClasses began on September…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…marching ensembles in the country. His vision and  commitment to excellence elevated the Southerners to national and  international acclaim, representing Jax State and the State of Alabama  on some of the world's most prestigious stages.\n\nThroughout his tenure, Dr. Bodiford led the Southerners in  performances at the 80th Anniversary of D-Day in 2024, the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}]