[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…operational in  a very short period of time, they want to pull the plug.\n\nNow, why would they do that? Why would they do that when, in fact,  most of those projects are in red States, not blue ones, not States  like California but States like Indiana and Kentucky.\n\nWhy would they do that? Because the obligation here is not to their  State or constituency. The…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…three different ways and  that have all reached the same election outcome.\n\nThe fact of the matter is that audit after audit and investigation  after investigation in red States and in blue States have all reached  the same conclusion, which is that voting by noncitizens--which, by the  way, is already a felony--is so exceedingly rare that it is  statistically…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…invitations  to the new ballroom, but I am not going to back down. I am going to  continue to stand up for small businesses across the country, across  Massachusetts, from red States to blue States, who are bearing the  burden of these tariffs, and I hope that our Republican colleagues will  join us today by voting to pass this resolution.\n\nAnd, again, I thank…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Connecticut and Rhode Island.\n\nBut it is not just Connecticut that has benefitted from Revolution  Wind. The supply chain for this project stretches across the country,  in red States and blue States. The construction of the first American- made offshore wind vessel provided hundreds of jobs. Where? In  Louisiana, Florida, and Mississippi. Steel for the project…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…on investment, Mr. Speaker.\n\nNIH awards over 80 percent of its annual budget in the form of  research grants to 2,500 research institutions across the country, in  red States and blue. These grants support the jobs of more than 300,000  researchers at institutions in all 50 States and provide immeasurable  benefits to our local communities, especially…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…for economic and development  assistance projects tackling issues like education, water and  sanitation, food security, including through university partnerships in  red States and blue States that Trump had eliminated, and more.\n\nIt rejects his efforts to eliminate all funding for the United States  to have a seat at the table at the U.N. and many other…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…warned everybody in this country that this would continue, that  they would go on to other cities, using immigration as a pretext to try  to intimidate blue cities in blue States and blue cities in red States,  and that a violation of the rights of immigrants and the rights of  people across the country is not going to be contained in L.A. It is  going…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…topic.\n\nOne, as I think the gentleman remembers, when this was happening, my  subcommittee held hearings on SALT. We brought witnesses in from a  number of different States, not all blue States. Blue States are the  ones that are generally recognized as being most harmed by this  terrible tax policy that the Republicans put on us.\n\nWhat we saw in those…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Californians--both our health and our economy, along with  our environment--has inspired more than a dozen other States to follow  California's lead voluntarily. Nobody is forcing other States--blue  States or red States--to follow California's lead, but these other  States see the benefits of what California is doing, and they choose to  do so to protect their residents…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…lives nor providing support to victims of crime are  partisan issues. Victimization knows no political party.\n\nThe instability of the Crime Victims Fund threatens red states as  well as blue states alike, urban centers and also rural communities  equally. Passage of the Crime Victims Fund Stabilization Act is a  declaration of our own common values.\n\nThis…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…like, what part of addressing air pollution at schools is       controversial? I don't think there is anything controversial       about.\n\nAnd this is not just Democratic states or blue states. When       we talk about environmental justice, we are talking about       mining-related pollution in Appalachia. We are talking about       water crises in Alabama…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…aren't cutting red  tape. They are sentencing thousands of Americans to die in communities  across our country. This isn't a partisan issue. This affects  everybody. Red States and blue States, Republican and Democrat, every  American deserves clean air.\n\nYet, my Republican colleagues would rather prioritize their donors in  the oil and chemical business…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…expense of our own.\n\nThis phony national emergency declaration comes down to this: Do we  want families to win or do we want billionaires to win?\n\nLet's come together, red States and blue States together, and say: We  want these jobs. We want this clean energy. We want this less expensive  energy for America because we are fighting for the families, not…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…This  resolution will set the stage across the board for cuts on the basic  services our constituents depend on the most. These constituents, by  the way, live in both red States and blue States.\n\nAs the majority brings up their budget resolution, they have already  said what they plan to do because they told us. They want to take away  Head Start  school…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…energy and will  increase household energy costs by up to $415 a year.\n\nOn top of that, ending the tax credits will lead to thousands of job  losses nationwide, in red States and blue States. This comes as demand  for electricity is surging, driving up costs even more.\n\nEveryone in this body talks a good game about lowering costs; but  when the time…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…people are actually listening to  you. You have created conditions where confrontations are more likely.\n\nThere are deportations happening all over this country, in red States  and blue States alike. You don't see what you see in sanctuary  jurisdictions because they are cooperating.\n\nLet's be clear what sanctuary status really means to the American…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…ensure that this injustice never happens again and that the  NCAA will fully adhere to the Executive order.\n\nWhile the vast majority of States are complying, there are some  States, blue States like California and Maine, that are vowing to fight  President Trump over the order.\n\nThe message they are sending is clear: Democrats are willing to risk  millions…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…has ever known.\n\nWhen al-Qaida terrorists attacked our Nation 24 years ago, they had  one goal--to destroy America. They didn't see us as Democrats or  Republicans, red States or blue States. They just saw Americans, one  nation under God, and their goal was to destroy us. When we lose sight  of seeing the humanity in our fellow Americans who think differently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}]