[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Act tax credits to expire.\n\nThe nightmare of families having to choose between taking their child  to the doctor or paying their rent is now a reality, hitting my home  State of Florida especially hard. In Florida, more than 4 million  people rely on the ACA and face premiums that are doubling or tripling.\n\nA self-employed mom recovering from cancer in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…adversity;       and\n\nWhereas, since the first Jewish person set foot in America       in 1654, members of the Jewish community have made indelible       contributions to the state of Florida and to the United       States of America, contributing to the vibrant cultural,       historical, and social framework of American life; and\n\nWhereas, the greatness in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…has detained hundreds of  thousands of decent people this year, often  in unspeakable conditions and without a fair process. That includes  over 10,000 people in my home State of Florida, including a mother torn  away from her child while nursing her baby. These people are largely  good, decent mothers and fathers who are workers contributing to our  communities.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…week. I encourage  every single Member of Congress, whether they are a Democrat or  Republican to do the same. I say this as someone who represents a  community in the State of Florida, the largest Affordable Care Act  marketplace in the entire country. We have millions of people in the  State of Florida that will be impacted by this, and I encourage…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…provide the representative who spent day  after day with us making sure that we had the resources and the means  that we needed, making sure that we understood that the State of  Florida was standing there to support us in spite of the terrible  tragedy that we had suffered. That money, those funds, were allocated  from the Crime Victims Fund.\n\nSo, once…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, I rise today to shine light on a moral  atrocity going on in my home State of Florida, an immigrant internment  camp that Donald Trump, Ron DeSantis, and his administration have  propped up in the middle of an abandoned airfield deep in the Florida  Everglades.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…affordability squeeze.\n\nEspecially when we are talking about energy, we know that 80 million  Americans are struggling to pay their utility bills right now. Look at  our home State of Florida, Mr. Speaker, where FPL and TECO were just  granted the largest rate hikes in history. That is $6 billion that  Floridians are going to have to pay, higher costs at a…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…in this Nation. Instead, here in the  House of Representatives, the Speaker chose for us to be out of session  for 8 weeks, while people across this country and in my State of  Florida are getting letters in the mail saying that their healthcare  premiums will go up anywhere from 50 to 300 percent. Mr. Speaker,  189,000 of my own constituents have been…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697056/aca-tax-credits-set-to-expire"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…products, on their shelves.''\n\nTourism from Canada is down 30 percent. People in the hospitality  industry--Las Vegas, my home State of New York, and the chairman's home  State of Florida--are losing their jobs because Canadians do not want  to come to the United States of America.\n\nWhat are the people getting in return? I will tell my colleagues what…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…for hotels and rentals. It will require  accurate price listings that must include all mandatory and resort  fees.\n\nI have to say that it is a privilege to represent the State of  Florida in the Congress, and I know my friend, Mr. Bilirakis, will  agree. We enjoy welcoming visitors from all across the Nation and all  across the globe to Florida for their…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…countries, cutting their worker visas, and terminating TPS will  have dire economic consequences.\n\nImmigrants have sustained America's economy for generations, and in  my home State of Florida, they make up over 30 percent of our workforce  and contribute more than $170 billion in spending power.\n\nMany industries, such as construction, agriculture, hospital,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698089/immigration"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…Florida all the way up Florida's Eastern  coast.\n\nWe're particularly proud that ABCI has become the largest single  provider of apprenticeship education and training in the state of  Florida. It is a leader in innovative apprenticeship programs for the  construction workforce--including in some of the most high-demand  areas of trade and it has set up its…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691681/recognizing-associated-builders-contractors-institute-apprenticeship-colleges-50th-anniversary-celebration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…passed a couple  months ago is going to raise the cost of living on hardworking families  across the country. There has been a lot of attention on healthcare  costs in the State of Florida because the Republicans would not  reinstate the cost-saving and lifesaving tax credits. Millions of  Floridians, like many more across America, are facing higher healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the cost of manufactured goods. A vote  for this bill is a vote to raise utility bills. That is particularly  problematic to the neighbors back home I represent in the State of  Florida. The State of Florida, the Sunshine State, you would think  would be powered by the sun, Mr. Speaker, but we are 75 percent reliant  on gas to generate electricity.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Chair, I thank the gentlewoman (Ms. Wasserman  Schultz) from the great State of Florida very much for yielding. She  certainly has educated us about Florida, among other things, and she is  a proud, proud ranking member on this bill.\n\nThis bill punishes our…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…death unfortunately. These preventable incidents occur  when the tie-downs on the awning unexpectedly release, causing the  awning to strike the consumer.\n\nComing from the State of Florida, I know how important this is, and I  know how popular awnings are, but they have to be safe for consumers.  Consumers should not have to fear that their awning might…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Whereas, Holy Family Catholic Academy in Niceville,       Florida, opened its doors on August 8, 2025, marking the only       parochial elementary school to open in the State of Florida       that year and one of a small number to open nationwide,       bringing renewed hope and vitality to Catholic education in       the community;\n\nWhereas, Holy Family…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…famous  baseball field in America, the ``Field of Dreams.''\n\nUnfortunately, Mr. Chair, that only happens in the movies. Because  for the last 2 years, if anyone in the free State of Florida tries to  build anything, only the Washington bureaucracy will come. However,  this wasn't always the case.\n\nIn 2020, Florida became the third State, joining Michigan…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…elections. My Republican colleagues  and I have been fighting Democrats' attempts to nationalize our  elections for years now.\n\nThe States have the ability to run elections. My State of Florida is  actually a leader in election security and timeliness to the point that  my last election was called within minutes of polls closing.\n\nMy colleagues are only bringing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…economic growth and technological  advancement.\n\nI urge my colleagues to join me in passing this very good bill  primarily sponsored by my good friend Mrs. Cammack from the State of  Florida. Let's get this done.\n\nMr. BILIRAKIS. Mr. Speaker, in closing, I encourage a ``yes'' vote on  this particular bill, and I yield back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and are a source  of nutrition for the manatees. Marie's generosity of her time,  guidance, and commitment to educate elementary school children,  business owners, and State of Florida leadership about the importance  of clean water and environmental health, reflects her personal nature  of resiliency as a resident of Crystal River. Like so many other…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Northwest Florida State  College State championship basketball team on a job very well done.  Their incredible win is inspiring. They have made their community and  the State of Florida very, very proud. God bless. Go Raiders.                    Remembering Captain Allen Colby Brady\n\nMr. PATRONIS. Mr. Speaker, I am privileged to represent more than  75,000…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Haiti, the fifth of nine children, Oslene came to this  country chasing a dream, not for herself, but for her future children.  She moved to Green Cove Springs in the great state of Florida, where  she met her husband, Alix.\n\nFor 35 years, she built a life, raised six incredible children, and  poured her heart into her community. Yet through it all, she nurtured…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…should be  able to vote in our country, are fleeing in droves. U-Haul business is  going through the roof in places like New York and California, and they  are moving to my State of Florida.\n\nAs Americans leave these horribly run States that do not cooperate  with law enforcement, where they release these criminals out on to the  streets, the only way they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, I rise to honor and recognize my  friend, Reba Y. Mazak as the 2025 Woman of the Year in Agriculture for  the State of Florida. Today, she was honored at the Florida State  Fair--America's Sunniest Celebration--during the annual Woman of the  Year in Agriculture Luncheon.\n\nSince 1985, the Florida…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…President, today I rise to announce a resolution  commending and congratulating the Florida Panthers on winning the 2025  Stanley Cup Final.\n\nLast month, our State--the great State of Florida--along with loyal  fans nationwide, came together to cheer on the Florida Panthers as they  fought hard to secure a victory and bring home the cup to Florida.\n\nAnd they…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…hospitals in nearly 40 States have participated  in the program, which has built a track record of improved patient  outcomes.\n\nIn Health Subcommittee Chairman Buchanan's home State of Florida  alone, there are 23 hospitals participating in this program. Hospital  care provided at home cuts mortality rates, reduces the risk of falls  and infections, and lowers…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…could fill hundreds of pages with stories about how social media is  harming our youth and supplement it daily, I want to focus on stories  from my district and my home state of Florida.\n\nAs a successful Section 230 defense often results in the court  granting dismissal early in the litigation, the facts are often  accepted as plead. In these instances,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…man did. He rushed toward danger to protect other  people. I am so grateful that there are heroes like him in our country.\n\nLast week--just a few days ago--in my home State of Florida, Sergeant  Erik LeVasseur, from Port St. Lucie, while doing his job as a law  enforcement officer, was shot in the face when he responded to a call  for help. These attacks,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Mrs. MOODY. As the newest, most junior Member from the great State-- the free State of Florida, I rise today--as well as the proud  granddaughter of a World War II Army veteran--and I rise today to  congratulate Mr. Duane Brewton of Cantonment, FL, on the extraordinary…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}]