[{"senator": "Al Green", "party": "Democrat", "sentence": "…Walters,      Austin, Texas.\n\nDear Governor Abbott and Attorney General Paxton: This       letter will serve as formal notice by the Department of       Justice to the State of Texas of serious concerns regarding       the legality of four of Texas's congressional districts. As       stated below, Congressional Districts TX-09, TX-18, TX-29 and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…color; District 33, occupied by a person of  color.\n\nNow, this letter goes on to infuse race into the conversation. The  last sentence in the last paragraph reads: ``If the State of Texas  fails to rectify the racial gerrymandering of TX-09, TX-18, TX-29, and  TX-33, the Attorney General reserves the right to seek legal action  against the State, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…people--and people of color it has  happened to in this country. So, let's now contemporize as it relates  to Black history and talk about something that happened in the State of  Texas.\n\nWe have a President of the United States who concluded that he had to  have five more seats for the Republican side in Congress, five more  seats to hold on to power,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Federal Government  putting more guns on the streets of this country.\n\nMr. FROST. Mr. Chair, the interesting thing is the sponsor of this  amendment, Mr. Pfluger, in his home State of Texas, there were 22 mass  shootings in just the first 4 months of this year.\n\nMr. Chair, I am confused on where this amendment is coming from. Why  do we need to task the CMP…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Maryellen Hicks and to recognize the renaming ceremony held in her  name, a tribute to a trailblazing jurist whose legacy has profoundly  shaped Tarrant County and the State of Texas. This historic occasion,  led by the Black Women Lawyers Association, reflects Judge Hicks's  extraordinary impact on the legal profession and her commitment to  justice…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…economy and  public health. There is a reason why California is the fourth largest  economy in the world and has three times the amount of patents than any  other State, that State being Texas.\n\nRepublican Governor Ronald Reagan signed into law the creation of the  California State Air Resources Board and Republican President Richard  Nixon signed into…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690385/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…her the best of luck as she takes on this new role on behalf  of our community. I commend Treasurer Medrano for her invaluable  contributions to Dallas County and to the State of Texas.                                Brazen Payoff\n\nMs. JOHNSON of Texas. Mr. Speaker, the House voted last week on a  bill to reopen the government, but tucked away in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…until after the  enrollment period opened, when there was nothing you can do much past  that. But these States are seeing astronomical costs for health  insurance--the State of Texas, a 39-percent increase; Arizona, a 48.95- percent increase.\n\nSo, somehow, these numbers were not available to the broader public,  and we published a report last week making…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this country, especially in  Texas, where the President of the United States--specificities--had the  Justice Department to send a letter to the Attorney General of the  State of Texas, indicating that four districts, all of which had  minority representation, four districts should be redrawn because the  State of Texas drew them specifically such that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…think Texas A&M and our elite University of  Texas deserve to have the funding in our universities.\n\nWith this bill, we must vote it down. I condemn the Republicans in  the State of Texas who are going to harm our State with their support  of this bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693208/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…protected by the Constitution of the United  States from having exactly the same thing done to him.\n\nMr. HOYER. Mr. Chair, I thank the Chairman, Mr. Sessions, from the  great State of Texas for his remarks. I want to tell the gentleman from  Texas (Mr. Roy) that the gentleman who offered this amendment is  protected by that same Constitution of the United…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…State has  now decided that it is appropriate, according to the sources that have  called it to my attention, and many have. Many persons in the  legislative body in the State of Texas have called this to my  attention--has established what is called a redistricting commission or  committee.\n\nWith this redistricting commission or committee, the Governor…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…refrigerators.\n\nMr. Speaker, I don't know what else to say.\n\nMr. Speaker, I am not trying to disrespect the sponsor of the  resolution. He is on our committee. He is from the great State of  Texas.\n\nWhat I hear is that he said: ``The evidence is clear.'' The evidence  is not clear that these standards for commercial refrigerators are  actually worse or a burden…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…H. Res. 191\n\nResolved, That the House has heard with profound sorrow of       the death of the Honorable Sylvester Turner, a Representative       from the State of Texas.\n\nResolved, That the Clerk communicate these resolutions to       the Senate and transmit a copy thereof to the family of the       deceased.\n\nResolved, That when the House…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688513/expressing-the-profound-sorrow-of-the-house-of-representatives-on-the-death-of-the-honorable-sylvester-turner"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…by their own  hand.\n\nMr. Speaker, they were and are America's patriots, drafted and sent  to that horrible war  by Democratic President Lyndon Johnson from the oil rich State of  Texas. Thousands of conscripted U.S. soldiers were unloaded off ships  to fight in that undeclared conflict. Many deboarded vessels, as they  viewed and reported huge oil derricks…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…chief of police of a small west Texas town  called Sweetwater. I was blessed to work in the United States  Attorney's office and the Office of the Attorney General of the State  of Texas, working every day with law enforcement. What they do matters  for the peace and security of our country. Our Republic depends on  having security on our streets.\n\nThere…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…safer, more efficient, and  deployable.\n\nThis project, Mr. Chair, isn't just pie in the sky. It has generated  over $110 million in private investment, $112 million from the State of  Texas, and just last month, thanks to the leadership and vision of  Secretary Chris Wright, has received a conditional commitment from DOE  to provide its fuel.\n\nThis is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…yesterday, just yesterday.\n\nIn Virginia, a 20-year-old citizen of Guatemala was convicted for  possessing obscene material of a minor and filming child porn.\n\nIn my home State of Texas, a criminal illegal alien from Mexico was  convicted for aggravated assault of a family member in Harris County.\n\nIn New York, a criminal illegal alien from Jamaica was…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…title of the bill.\n\nMr. Speaker, I rise today in support of H.R. 2966, the American  Entrepreneurs First Act of 2025, introduced by Representative Van Duyne  from the great State of Texas.\n\nFor 4 years under the Biden-Harris administration, the SBA approved  loans for illegal immigrants despite their ineligibility. This bill  requires citizenship verification…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…GILL of Texas. Mr. Speaker, I rise today to recognize and commend  Mr. Ray Fletcher of Cooke County, Texas, for a lifetime of devoted  service to our nation, The Great State of Texas, and his local  community.\n\nMr. Fletcher first answered the call to serve when he joined the  United States Air Force in 1981, where he trained and served as a  Nuclear…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…River on  July 4 of this year.\n\nAs the road to recovery gets underway, Iowans stand with Texans. The  grit and resilience we have in the Midwest runs just as deep in the  State of Texas.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…treatments. These diseases  typically lead to death before a child can reach adulthood, but not  anymore.\n\nA dear friend of mine, Dr. Allison from MD Anderson in my home State  of Texas, was able to use this voucher program to obtain FDA approval  for a treatment called CAR-T immunotherapy. He received the Nobel Prize  in medicine for it, and this voucher…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Physicians, they will serve throughout Texas and the U.S.  in underserved communities. Since Dr. White coming to the helm, the  medical school secured an investment from the State of Texas for $32  million and an additional $23 million in pledges and gifts in 2023  alone.\n\nIt's not just in the classroom that Dr. White is making a difference.  On the fields…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…instructor for both new recruits and  continuing certification courses for commissioned firefighters, his  positive impact extends to other fire departments across the State of  Texas.\n\nNow, as he retires from Station 35 in the critical Fort Worth  Alliance Airport Corridor, Mr. DeWitt holds the distinction of being  the department's senior-most engineer…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I thank my dear friend from the great State  of Texas, the chairman of the House Committee on the Budget, for  yielding.\n\nMr. Speaker, I rise in strong support of this resolution and in  moving this process forward. Let's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…already the world's leading producer of oil and  natural gas and also the top exporter of LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time that we repeal the harmful,  politically motivated Biden-era restrictions that have shackled and  locked down our LNG industry. These…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…noncitizens voting.\n\nIt is essential that not only do we have the law but that we enforce  the law, and the SAVE Act does just that.\n\nThis is my good friend, Chip Roy, from the State of Texas, the author  of the bill, who I have been working with to do just that.\n\nMr. STEIL. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nThe SAVE Act is clear.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…from Louisiana because  of his long history of distinguished service, and he knows what he is  talking about.\n\nI know that the gentleman from Louisiana came to my home State of  Texas when the people that I represent were ravaged by the floods that  affected our community in Kerrville, Texas, the gentleman dropped what  he was doing to come up and help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Westerman, my good friend  and classmate, for his services here.\n\nMr. Speaker, I rise today in support of S. 1596 to rename the Anahuac  National Wildlife Refuge located in the State of Texas and in my  district as the Jocelyn Nungaray National Wildlife Refuge to forever  commemorate the life of 12-year-old Jocelyn Nungaray, who was  tragically killed on June…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment in ObamaCare that is now proposing 18  percent premium increases in places like the State of Texas this  upcoming year has been a complete failure.\n\nPresident Obama said that if you like your doctor, you can keep your  doctor; he said that if you like your healthcare…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}]