[{"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in strong support of H.R. 1461.\n\nBettie Cole was a longstanding community leader in her home State of  Pennsylvania.\n\nBorn in Edgeworth on April 5, 1923, she studied journalism and  communications. Later in 2000, she became known as the historian of  Sewickley Valley's Black community.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697613/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…raise taxes to pay for this massive  new bureaucracy that Republicans are creating in every State in this  country.\n\nThe chairman of the Agriculture Committee's home State of  Pennsylvania would have to come up with over $1 billion to cover the  State's share of benefit costs. There is no State in this country who  is able to take on this kind of massive,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania, Congresswoman Madeleine Dean.\n\nMs. KAPTUR. Mr. Speaker, I thank Congresswoman Dean so very much for  joining us and for her firm, firm support of Ukraine and all she…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…of celebrating a new year, millions of Americans confronted  healthcare premiums skyrocketing overnight. Many had to make an  impossible choice. Just look at my home State of Pennsylvania, where  85,000 people who receive their health insurance through Pennie, our  health insurance marketplace, were forced to drop coverage.\n\nThat is one in five Pennsylvanians,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700080/pennie-enrollment"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Chambers and the White House, have yet to  produce an actual funding plan. Instead, House Republicans passed a  blueprint to slash up to $2.5 trillion from Medicaid.\n\nIn my State of Pennsylvania alone, that jeopardizes care for nearly 3  million people, including 100,000 people struggling with addiction.\n\nIn my district, that means risking medical care for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688326/funding-medicaid-is-not-negotiable"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…latest is the horrific murder of Charlie Kirk.\n\nBeyond the horror of such a vile act is the pervasive ugly rise in  political violence.\n\nWe have witnessed it in my home State of Pennsylvania with the  attempted assassination of Donald Trump in Butler; and, again, with the  arson attack on Governor Josh Shapiro's home on Passover with his  family sleeping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "Ms. LEE of Pennsylvania. Mr. Speaker, we have a childcare crisis in  this country. In my home State of Pennsylvania, infant and toddler care  costs on average $14,000 per year. That is almost one-half of the  average annual salary of the childcare workers in my district.\n\nChildcare,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699007/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…Act of 2025. Opioids, like  fentanyl, are incredibly dangerous. Last year, our Nation lost just  over 80,000 people to drug overdoses. That is 220 per day. In my home  State of Pennsylvania, someone dies of a drug overdose every 2 hours.\n\nAs we work to stop these dangerous drugs from entering the country,  it is important we make available the necessary…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Speaker, this week, we will vote on  legislation to improve our domestic energy market and to support  President Trump's agenda on U.S. energy dominance.\n\nIn my home State of Pennsylvania, we have abundant natural gas  reserves. We can utilize this resource that is under the feet of my  constituents to provide tremendous economic benefit to our country…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…cost to the American taxpayer.\n\nOver the last 5 years, SBICs have invested over $130 billion in small  businesses across America, including $1.3 billion in my home State of  Pennsylvania's small businesses.\n\nThough the SBIC program is successful, recent studies have shown that  less than 20 percent of SBIC investment reaches low- to middle-income  communities,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697260/investing-in-all-of-america-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…makes  this policy even more dangerous is that 17 other States, making up 40  percent of the American auto market, are set to adopt these  regulations, including my home State of Pennsylvania.\n\nIf consumers want to purchase an EV, they should be able to, but  Californian politicians have no right to remove the choice to buy a  gas-powered vehicle from my…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…rise today in recognition of this occasion of National  Dairy Month and to honor the hardworking men and women of America's  dairy industry, especially those in my home State of Pennsylvania.\n\nAs the Representative of Pennsylvania's 15th Congressional District  and as chairman of the House Agriculture Committee, I know firsthand  the central role that dairy…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…are counted. And right now, we cannot--we must not-- pretend that all elections in America meet this important standard.\n\nJust last year--just last year--in my home State of Pennsylvania,  Chester County officials mistakenly omitted 7,000 third-party votes  from the voter rolls. Registered voters were turned away at the polls,  and an unknown number…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…opportunities whether in public, private,  religious, or homeschool settings.\n\nUnfortunately, forward-thinking solutions like this are not being  considered in my home State of Pennsylvania where there are some  families that feel trapped in a system that puts bureaucracy before  students.\n\nWe cannot allow the status quo to be accepted.\n\nSchool choice…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…clause.''.\n\nMr. Speaker, I rise today in support of H.R. 2066, the Investing in  All of America Act of 2025, introduced by Representative Meuser from  the great State of Pennsylvania and Representative Scholten from the  great State of Michigan.\n\nOne of the most significant barriers to economic growth across  America is the lack of access to capital…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697259/investing-in-all-of-america-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Standards Act also supports U.S. trade, a  crucial part of the American farm economy. In 2024, the U.S. exported  more than $26 billion of American grains. In just my home State of  Pennsylvania alone, almost $100 million of corn and barley are exported  every year.\n\nThese exports make a difference to the bottom line for family farmers  in Pennsylvania and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…technology when building the infrastructure that our  warfighters rely on, but it also puts millions of dollars into local  economies throughout our country.\n\nFrom my home State of Pennsylvania to Minnesota, communities across  the United States play a vital role in supporting the HDT industrial  base. This amendment will continue to support the hardworking…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…National Dairy Month to highlight the dairy industry and the  hardworking men and women who work tirelessly to produce the dairy  products that we know and love.\n\nMy home State of Pennsylvania produces 9.8 billion pounds of milk  annually from the nearly 465,000 dairy cows that reside in  Pennsylvania. The 4,850 dairy farms located throughout Pennsylvania…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…this is a huge accomplishment, there is still much left to  do. This is why I will continue to advance legislation that promotes  workforce development.\n\nIn my home State of Pennsylvania, there are over 80 career technical  colleges and 145 high schools offering CTE courses. I am proud to be an  advocate for these institutions and courses and to see…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…schools to offer flavored and unflavored  whole and 2 percent milk options.\n\nNational Milk Day allows us to recognize the many dairy farms across  the country. In my home State of Pennsylvania, the dairy industry  contributes $14.7 billion to the State's economy.\n\nMr. Speaker, I thank our American dairy farmers who work around the  clock to provide nutritious…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698847/national-milk-day"}]