[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise to demand that Congress restore the  full State and local tax deduction which would cut taxes for Nassau  County residents.\n\nOn Long Island, we pay some of the highest taxes in the country, and  we send far more to Washington than…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "Mr. SUOZZI. Mr. Speaker, I thank the gentleman for yielding, and I  thank him for bringing attention to this important issue.\n\nI am going to talk about the State and local tax deduction in some  detail, but first let me just say generally that what we are talking  about is so important. We have so many of our friends on the other side  of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, today, I rise to address the unfair double  taxation that my constituents are facing due to the State and local tax  deduction cap.\n\nHardworking families across Long Island and across our State and many  other States already face some of the highest tax burdens in the  Nation. For…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690752/eliminate-the-salt-cap"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…York delegation,  Elise Stefanik,  Andrew Garbarino, Nick LaLota, and Mike Lawler. These  are just facts right now. It was big talk about standing up to protect  the State and local tax deduction.\n\nLet's make sure we set the record straight here as to what happened  to the State and local tax deduction, which impacts millions of  hardworking American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…cost-of-living areas; and someone who has been working on it ever since  they did it, trying to work with people on both sides of the aisle to  figure out how to resolve the State and local tax deduction is my  colleague,  Tom Suozzi from New York. He is a great Member and a member  of the Ways and Means Committee.\n\nMr. THOMPSON of California. Mr. Speaker,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that there are always debates going on in this  building that will determine how the big, beautiful bill is sent to  President Trump.\n\nOne of those debates involves the State and local tax deduction.\n\nAnother of the debates, which hasn't been as highlighted, involves  President Trump's proposal to reduce the marginal rate on manufacturing  to 15 percent.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]