[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…his  opinion on behalf of the millions of Californians that he represents.\n\nIt is so interesting to me that this situation happened because not  that long ago in the State of Washington, in Olympia, we had a bill  signing, and it is no secret in the State of Washington that a guy  named Tim Eyman is probably the antithesis of what our Governor Bob…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…congratulations to the Frank  family and the Nisqually Tribe. I look forward to once again honoring  Billy later this year when his statue will be unveiled to represent the  state of Washington in the U.S. Capitol's National Statuary Hall.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…for groceries, making rent, or having healthcare.\n\nRandall), my cohost for tonight's Special Order hour and my friend and  fellow freshman classmate from the beautiful State of Washington.\n\nMs. RIVAS.  Hoyle).\n\nMs. RIVAS.  Ansari).\n\nMr. GOLDMAN of New York. Mr. Speaker, I thank the gentlewoman from  California and Representative Randall for hosting this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…discretion to rule whether this so-called crime merited  deportation. This bill would prevent judges from being able to decide  if the punishment fits the crime.\n\nIn my home State of Washington, we have a similar law where someone  can be convicted of a misdemeanor DUI without actually driving a  vehicle. While Republicans might wave away our concerns by saying…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…paying them to do, which is to train servicemembers to be  ready for the fight. They don't have any training dollars.\n\nI met with the TAG, the Adjutant General, for the State of  Washington, who told me that they are not able to train because all of  that money is going to have our National Guard's members stay in hotel  rooms all around Washington, D.C.;…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Senate floor, I came and  talked about how States are now putting these numbers out, a lot of  States. When I found this out this summer, I did many events across the  State of Washington trying to bring awareness to the public about this,  and I found out that some States were really trying to hide the ball-- like they literally didn't want to tell people…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…streets  without any badge or identification to distinguish them from a  kidnapper; whisking people away in unmarked cars and even smashing  windshields.\n\nBack in my home State of Washington, I heard from folks who saw that  firsthand.\n\nLast month, ICE aggressively detained Lelo, a farmworker in my State.  And it appears he may have even been targeted because…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…need  groceries, housing, healthcare, basic medications.\n\nPrivate insurance companies are now buying up your local healthcare  clinics and doctors' offices. In my home State of Washington, a handful  of healthcare systems control 90 percent of hospital beds. What does  that mean? It means that people are seeing their costs triple while the  quality of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I come to the floor today to remind  everyone in the United States of America that we have a cleanup  obligation at the Hanford Site in the State of Washington and to remind  the Secretary of Energy and the Trump administration of a commitment to  that part of the United States, to our Nation, and to the cleanup of  the most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and appreciate the  opportunity to follow our senior Senator, Senator Murray, who is  articulating the impact of some of these so important public policy  issues on the State of Washington.\n\nTrade is the lifeblood of the State of Washington and our economy.  Farmers in my State export $7.5 billion worth of agriculture products a  year. That was the number…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…of the record flooding and the  flooding events still predicted to come back to record cresting of many  of our rivers, is making it a very challenging time for the State of  Washington.\n\nSo we certainly appreciate all the first responders, all the law  enforcement that are working in the community, all the work that the  Governor's office is doing,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Admission Act is vulnerable to a constitutional challenge in       the courts. For the reasons set forth below, there is no       constitutional barrier to the State of Washington, Douglass       Commonwealth (the ``Commonwealth'') entering the Union       through a congressional joint resolution, pursuant to the       Constitution's Admissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Admission Act is vulnerable to a constitutional challenge in       the courts. For the reasons set forth below, there is no       constitutional barrier to the State of Washington, Douglass       Commonwealth (the ``Commonwealth'') entering the Union       through a congressional joint resolution, pursuant to the       Constitution's Admissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Admission Act is vulnerable to a constitutional challenge in       the courts. For the reasons set forth below, there is no       constitutional barrier to the State of Washington, Douglass       Commonwealth (the ``Commonwealth'') entering the Union       through a congressional joint resolution, pursuant to the       Constitution's Admissions…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the  Council as the Legislative Assembly, the Councilmembers as  Representatives and the Chair of the Council as the Speaker. The new  titles are the ones used in the State of Washington, Douglass  Commonwealth constitution, which D.C. adopted in 2016 in anticipation  of enactment of the Washington, D.C. Admission Act, which would make  D.C. the 51st…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696437/introduction-of-the-district-of-columbia-government-title-equality-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…conduct  ourselves on the House floor. This is about how we treat each other.  This is a reflection on every single one of us in this Chamber. As my  colleague from the State of Washington said, it is not just us this  affects. This affects the kids of our country, as well, who are  learning, one way or the other, from our examples.\n\nYou can go on and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…should be proud of.\n\nSince its inception in 1925, the Washington Cattleman's Association  has been instrumental in promoting the agriculture and cattle industry  in the State of Washington. They preserve, protect, and promote the  beef industry through producer and consumer education, legislative  advocacy, regulatory scrutiny, and legal intervention.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696671/congratulating-the-washington-cattlemans-association-on-their-100th-anniversary"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…which provided affordable housing for  families living and working in the area. While still managing the  Mobile Home Park, they moved to the San Juan Islands in the state of  Washington, where Margaret worked as the pharmacist in Friday Harbor.\n\nAfter retirement, Margaret and Art bought a small motorhome and  traveled the United States from Washington…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2388) to take certain Federal land in the State of Washington  into trust for the Lower Elwha Klallam Tribe, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today to celebrate $181 million  in rural healthcare funding for the State of Washington.\n\nNot long ago, right here in this Chamber, I joined my House  Republican colleagues to pass the Working Families Tax Cut Act, the  largest tax cut in American history.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2389) to take certain land in the State of Washington into trust  for the benefit of the Quinault Indian Nation, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…offered by  Senator Fischer and Senator Mullin to block these rules.\n\nCalifornia's Advanced Clean Cars II program requires all--and I did  say ``all''--vehicles sold in that State, Washington, DC, and 11 other  States that have adopted California's standard--all cars--to be zero- emissions vehicles by the year 2035; meaning, in one decade, these  States, totaling…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}]