[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chicago Law       School; Peter Edelman, Georgetown University Law Center;       Kermit Roosevelt, University of Pennsylvania Carey Law       School; Eric Segall, Georgia State College of Law; Trevor       Potter, Campaign Legal Center; Gregory P. Downs, University       of California, Davis; Larry Sabato, University of Virginia;       Aziz Huq, University…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chicago Law       School; Peter Edelman, Georgetown University Law Center;       Kermit Roosevelt, University of Pennsylvania Carey Law       School; Eric Segall, Georgia State College of Law; Trevor       Potter, Campaign Legal Center.\n\nGregory P. Downs, University of California, Davis; Larry       Sabato, University of Virginia; Aziz Huq, University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…instilled in her a love of serving others and an unwavering faith  in our Lord and Savior, Jesus Christ.\n\nInstilled with a love of learning, Mrs. Booker graduated from Albany  State College with a Bachelor of Science Degree, a Master of Science  Degree in Counseling and Guidance from Fort Valley State College, and a  Specialist Degree in Education and Counseling…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Chicago Law       School; Peter Edelman, Georgetown University Law Center,\n\nKermit Roosevelt, University of Pennsylvania Carey Law       School; Eric Segall, Georgia State College Law; Trevor       Potter, Campaign Legal Center; Gregory P. Downs, University       of California Davis; Larry Sabato, University of Virginia;       Aziz Huq, University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…four-year universities. He also pioneered Colorado Online,  an initiative that expanded online education access for students across  Colorado.\n\nAppointed President of Pikes Peak State College in 2001 and later  President of Colorado State University-Pueblo, Chancellor Garcia has  long advocated for expanding higher education access and student- centered programs.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Chicago Law       School; Peter Edelman, Georgetown University Law Center.\n\nKermit Roosevelt, University of Pennsylvania Carey Law       School; Eric Segall, Georgia State College of Law; Trevor       Potter, Campaign Legal Center; Gregory P. Downs, University       of California, Davis; Larry Sabato, University of Virginia;       Aziz Huq, University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…was drafted to serve in the United States Army  during the Korean Conflict. Mr. Jenkins returned from the War,  determined to finish his education, which he did at Albany State  College. He obtained a Bachelor of Science in Education and dedicated  his life to teaching. For more than 34 years he shaped minds and  modeled dignity, discipline, and love in…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Texas. Mr. Speaker, I rise today to honor the well- deserved retirement of Dr. Tom Johnson, a dedicated leader and public  servant who has made a lasting impact on Lamar State College Orange and  the community of Southeast Texas.\n\nFor seven years, Dr. Johnson has led Lamar State College Orange with  passion, determination, and a hands-on approach. He…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…reflect his value as a leader during service and in  retirement.\n\nAfter completing his early education in Lockhart, Texas public  schools, Danny enrolled at Southwest Texas State College. Within his  first week there, he recognized the potential of the ROTC program, and  after his first experience with them he was set on a path to earn his  pilot's license,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…billion.\n\nBy the way, fact number five, in some States, in a complete affront  to citizens, illegal aliens can get mortgages, bank loans, insurance,  driver's licenses, in-State college tuition, and free healthcare. For  illegal aliens, the U.S. has been an all-you-can-eat buffet. However,  the American taxpayer and innocent women like Laken Riley, Jocelyn…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Briggeman. Their  family moved with the Wolfe family to Lemhi, Idaho about 1920.\n\nMargaret attended grade school in a one-room schoolhouse in Lemhi.  She then attended Idaho State College in Pocatello, Idaho, first as a  business major, then as a pharmacy major. Margaret graduated in 1938 as  a pharmacist. She worked in Homedale, Idaho where she met Art…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Bruce Dart, who closed his photography studio after more than 40 years.\n\nBruce is a native of Mansfield, Pennsylvania, earned a bachelor of  arts degree from Mansfield State College, and later served in the Navy.\n\nDuring his time in the Navy, Bruce was trained as a journalist and  took courses focused on broadcast journalism and photography, sparking…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…sexual violence.\n\nCentre Safe began as a grassroots effort in 1975 as the Centre County  Women's Resource Center. Since then, it has grown from a one-room  operation in State College to three locations which are the  administrative offices and Sylvia Stein Shelter in State College, the  counseling and legal advocacy satellite office in Bellefonte, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rights movement at a  young age where she proudly participated in organized sit-ins, marches,  and peaceful protests in the city of Savannah.\n\nAfter graduating from Savannah State College and Georgia Southern  University, Ms. Pryor served as an educator in the Savannah-Chatham  County Public School District for more than four decades.\n\nAs a lifelong member…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…School; Nicole       Yancey, Myakka City Elementary School; Kimberly Thomas,       Willis Elementary School; Suzanne Theiss, Southeast High       School; Dilcia Navarro, State College of Florida Collegiate       school.\n\nTeacher Award: Laura Redeker, Anna Maria Elementary School;       Susan Nova, Harvey Elementary School; Katharine Kimbrell,       Braden…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Madam Speaker, I rise today to  recognize the State College Kiwanis Club for reaching a remarkable  milestone, 100 years of service to children and families in our  community.\n\nSince 1925, the club has lived out Kiwanis International's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I wish a good morning to northwest Florida  and rise to offer a special congratulations to the Northwest Florida  State College women's basketball team.\n\nOn April 1, 2025--actually the same day that I was sworn into  office--the Lady Raiders took on Alabama's Shelton State Buccaneers,  and took…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania Congressmen, Ron  Bresnahan and Dan Meuser. I was also proud to have Russell Redding,  Pennsylvania's Secretary of Agriculture, and Dr. Troy Ott, dean of Penn  State's College of Agricultural Science, on the panel.\n\nThis year, we celebrated passage of my bill, the Whole Milk for  Healthy Kids Act, which will be soon signed into law and brings…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…next chapter.                                 Congratulating Adam Bell\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate Adam Bell of State College, Pennsylvania.\n\nAdam accepted a fully qualified appointment to the United States  Naval Academy in Annapolis, Maryland.\n\nAdam is the son of Elizabeth and Jayce Bell, the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}]