[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…hard at work on another  objective, an unprecedented and previously unimaginable effort to  abandon their own standards, their own precedent, their previous very  public statements, the very rules of this body, to make our air less  clean.\n\nTo do so is complicated. It requires a lot of parliamentary  maneuvers. Why?  Because to make the air dirtier…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Unfortunately, progress has been slow despite strong interest from  Senators of both parties. So today's resolution is a step in the right  direction.  And the majority leader's statements about the further progress we need  to make soon were very important--because, on its own, today's action  is not nearly enough.\n\nFirst, unlike the bipartisan House plan,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…membership       for Ukraine is a realistic outcome of a negotiated       settlement.\n\nIn essence, Secretary Hegseth conceded away our most important  leverage against Russia. His statements, echoed by President Trump and  Vice President Vance, have already badly weakened and undermined our  negotiating position by gifting the Russians with several unilateral…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…for America.                                  Healthcare\n\nMr. President, finally, on ACA legislation, when it comes to lowering  costs, Americans don't want nice-sounding statements; they want action.\n\nToday, the Senate has a chance to take action to lower the cost of  healthcare. In a few hours, I will come to the floor to seek unanimous  passage of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…the 9/11 terrorist attacks an inside job, who described herself  as a ``pro-White nationalist'' and a ``proud Islamophobe,'' and who has  made openly racist and anti-Muslim statements. This is not someone with  even a shred of credibility, let alone the experience or judgment we  should demand from those influencing U.S. national security decisions.\n\nYet,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…implementing this bill  would cost between $8 and $12 million and require significant manpower  to update its rules, regulations, guidance, and other materials-- including benefit statements--both printed and online versions.\n\nAccording to the Center on Budget and Policy Priorities, Social  Security's customer service budget has dropped by 23 percent since  fiscal…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Trump, in some cases  against individuals specifically named and accused in flagrantly  improper executive orders.\n\nFurthermore, he has made direct and unambiguous public statements  threatening media outlets, current and  former officeholders, and advocacy organizations. He has pursued  meritless litigation, leveraged his public office for private gain,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…but regardless, this will be good data for decisionmakers to  have.\n\nThe bill would also require reporting on the time it takes agencies  to complete environmental impact statements and the number of pages of  those analyses. The Council on Environmental Quality will then report  annually on average lengths of time, page counts, and any directional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697710/studying-nepas-impact-on-projects-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…secure. Yet, the real test of any energy policy is not  what sounds good in  a televised address. It is whether working families feel relief when  they open their utility statements. It is whether small businesses can  forecast stable costs. It is whether seniors on fixed incomes are  insulated from volatility rather than being exposed to it.\n\nFamilies…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…rod are just a  couple of examples that every day still centuries later are in our  lives. He is known, as was mentioned earlier, for very pithy, very  profound, and witty statements, such as a stitch in time saves nine or  a penny saved is a penny earned. Most memorable, perhaps, is: ``It is a  republic, if you can keep it.''\n\nArguably, Mr. Franklin's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…pdf.\n\nThe statement of Brent and Luke Ganger can be found online at  https://www.blumenthal.senate.gov/imo /media/doc/2026-2-3_luke_and_brent_ ganger_statement.pdf.\n\nAnd the statements of the two other witnesses in that proceeding,  Antonio Romanucci can be found online at  https://www.blumenthal.senate.gov/imo /media/doc/2026-2-3_antonio_romanucci_ statement.pdf,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…evidence of what happened,  last I heard. Maybe it has been announced just recently. I am talking  about the authorities. For people to come to the floor of the House and  make statements about how leftwing people have caused this to manifest  itself, Mr. Kirk's demise, without any evidence of it, and for CNN to  infer in some way that ``racism'' is a term…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…killing the disabled at birth, and told coworkers  that Hitler should have finished the job. At his sentencing, a Trump- appointed Federal judge warned him that his actions and statements make  everyone, including Jewish people, less safe in our country.\n\nHow did Ed Martin, President Trump's pick for one of the most  important jobs in the American criminal…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…legal       official, out of deep concern regarding a number of actions       that the President of the United States and his       administration have taken and a number of statements       targeting lawyers and the legal profession.\n\nThe following are illustrative examples of the concerning       actions and statements:\n\nOn February 25, 2025, the President…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…really hard to tell. We have not prevented them from doing what  they have to do.\n\nThe enrichment level is another thing where we are seeing, frankly,  technically ignorant statements made. We have three levels of uranium.  Less than 20 percent is generally regarded as relatively safe and can  be used in reactors without a lot of safeguards. When you get…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…not taking place. There is no war there  now.\n\nI think what my colleagues are is shell-shocked because after all of  these years of empty comments condemning Maduro, empty statements by  them, empty statements by Joe Biden talking about how bad of a man he  was, we finally have a President who actually went and did something  about it.\n\nThat is what President…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…disappointing.\n\nMr. PERRY. I just have to ask you in this colloquy, Representative  Roy from Texas: You say, ``the radical left,'' but I listened to you  rattle off the statements of elected officials.\n\nMr. PERRY. Not just Members of Congress, but Members of the United  States Senate.\n\nMr. PERRY. Governors of States, including the one that I come from.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…these outlets  like the CEO of NPR, Katherine Maher, to testify before the House  Oversight and Government Reform Committee.\n\nI got to ask her about a lot of her past public statements. It turns  out she has a prolific Twitter history. She has written extensively  about every single major woke buzzword that you can think of, Mr.  Speaker, including ``the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…section 5 of the Securities Act of 1933 as       compared to issuers and offerings of securities subject to       such section 5;\n\n(iii) corporate governance;\n\n(iv) financial statements and the components of such       statements;\n\n(v) aspects of unregistered securities, securities issued       by private companies, and investments into private funds,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…investigation. It is  really interesting. That group, and I was a part of it, found that  there was more than one terabyte of missing data. Based on the  inventory of the digest and statements from Chairman Thompson, there  should have been four terabytes turned over, and there were only three.  That is equivalent to 6.5 million document pages as PDFs or office…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, over the last few days, the  country has been shocked by the horrifying images coming out of Los  Angeles, but what is also shocking are the brazenly false statements  made by the Governor of California.\n\nGovernor Newsom has asked us not to believe our eyes, not to believe  the scenes that we are all seeing of officers being attacked,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692292/controlling-riots-in-california"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…nothing to show for the expenses.\n\nThe Fiscal Responsibility Act of 2023 attempted to change course and  imposed a 2-year deadline and a 150-page cap on environmental impact  statements. However, the Council on Environmental Quality reports that  61 percent of environmental impact statements still take over 2 years  to complete.\n\nThe other two branches of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…thing to have a  conversation. But, instead, what we are hearing is some pretty  aggressive rhetoric from the Trump administration and some members of  Congress. There are statements that we are seeing that are suggesting  that not only is a taking by force or coercion or other related method  not only an option but perhaps a priority. And that, as a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to commit bank and wire fraud, bank  fraud, wire fraud, conspiracy to defraud the United States and obstruct  justice, subscribing to false tax returns, and making false statements  to the FBI. The main conduct being alleged involves theft of campaign  funds totaling $225,000, tax fraud, as well as fraud surrounding a PPE  loan.\n\nThe indictment lists…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…families that don't even  go to church, I think his speaking about Christianity and his faith and  the importance to carry on his mission is more important than his  political statements.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695392/charlie-kirks-religious-message"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…compliance with this Act.\n\nMr. Speaker, I urge my colleagues to support H.R. 1515, the Guidance  Out of Darkness Act, or the GOOD Act.\n\nRegulatory guidance includes agency statements that, while not  intended to have the force and effect of law, establish agency policies  of statutory, regulatory, or technical issues. Because such guidance  communicates…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Accountability Project said the quoted  employee ``didn't know the context when a reporter asked him a  hypothetical question and has promised to check before any future  public statements that could overlap with Judiciary Committee work.''\n\nSo I hope it is clear. It appears that, based on Government  Accountability Project's representations to my office,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Biden-Harris administration to secure our borders and  protect our citizens. In March, the committee heard from sanctuary city  mayors, who offered carefully crafted, lawyerly statements defending  their decisions not to work with the Trump administration as it works  to remove criminal aliens as quickly as possible.\n\nAt the end of the day, illegal alien…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a lead agency among the       Department of Housing and Urban Development and the       Department of Agriculture to streamline the adoption of       environmental impact statements and environmental assessments       approved by the other agency to construct housing projects       funded by amounts from both agencies;\n\n(C) maintain compliance with environmental…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…troops--and the  Democrats applauded President Bush for his action.\n\nFor years, my Democratic colleagues have called for Maduro's removal.  You heard me the other day read statements that my Democratic  colleagues have made. But when President Trump actually made that  happen, now they say: How dare he do this. This is TDS, Trump  derangement syndrome,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]