[{"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…advances, I rise to remind all who are present in the  Chamber, all Members of this body, and every person in this country  that the Fourth Amendment to the United States Constitution states:  ``The right of the people to be secure in their persons, houses,  papers, and effects, against unreasonable searches and seizures, shall  not be violated, and no warrants…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699310/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, every President of the United States has a  right to review and realign programs funded by Congress, but only if  the President acts in a way that complies with the law.\n\nIn the past 5 weeks, President Trump, Elon Musk,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Al Green, would you come to the well before your colleagues and  the world and commit an act of incivility?\n\nHere is why: It is because when the President of the United States  right there at that podium addressed the Members of Congress, Democrats  seated on this side, seated, many of them saying nothing, the President  of the United States looked…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…misdemeanors. Further, Article II of  the Constitution states that the President shall take care that the  laws be faithfully executed.\n\nThe Fourth Amendment of the Constitution states that the right of the  people against unreasonable searches and seizures shall not be  violated, and the Fifth Amendment of the Constitution states no person  shall be deprived of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Keystone is dead.\n\nThere is no reason to believe in any way that the Canadians are  looking to work with us to build a pipeline and export more fossil  fuels to the United States. Right now, we barely have a relationship  with Canada because of the tariffs.\n\nThe fact of the matter is that there is a tariff on Canadian exports.  The bottom line, I guess,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleagues from Georgia.  People are going to love this. She says: ``Full transparency, I did not  know about this section on pages 278 to 279 of the OBBB that strips  States of the right to make laws or regulate AI for 10 years.\n\n``I am adamantly opposed to this, and it is a violation of State  rights, and I would have voted no if I had known this was…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to believe your eyes, not the lies.  This is what we are seeing and experiencing in Minnesota, and it is all  being done at the direction of the President of the United States.\n\nRight now, in Minnesota, we are standing up for our neighbors. We are  defending our rights and the rights of everyone in this Nation.\n\nTo all who are volunteering their time…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…but  without strategy--a dangerous combination.\n\nMoreover, it seems President Trump is drunk on this hubris. We have  now seen Stephen Miller saying that the United States has the right to  take Greenland. Secretary Rubio threatened Colombia and Cuba. It  appears that President Trump thinks that reverting back to an era of  imperialism or ``spheres…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…money.\n\nWe have a President, supported by the Republican Party, who is  sending in the National Guard and militarizing soldiers against  citizens in those cities and States. They are right here at Union  Station in Washington, D.C. The taxpayers are footing a million dollars  a day for these National Guard members to pick up trash. They are doing  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Donald Trump came from 10  individual donors.\n\nThink about that for a second. Of the billions of dollars that were  spent on this election for the President of the United States right  now, 44 percent of that money was contributed by 10 people. This is not  just a purview of any party, though; this is something that is  infecting our entire system.\n\nPeople…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Senator. This is what we expect to see  in authoritarian nations that can't tolerate a question, and they start  to attack the institutions.\n\nWhat we are seeing in the United States right now, we are seeing it  in the form of the President willfully breaking the law on the rules  controlling the executive branch, time and time again. We see it in his  attack…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…man to rewrite the history of that horrible day. Congress must  show respect for those who defended democracy, liberty, and Article I  of the Constitution of the United States right here in the House of  Representatives, defending the vote that occurred in 50 States across  this union. We owe them that memorial.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…cast his ballot in Florida.\n\nIn some States, such as Oregon and Washington, mail-in ballots are  the primary mechanism used by voters. Attempting to illegally strip  States of this right will decimate the way our citizens are heard and  the foundational principle of States' rights.\n\nBy law, by tradition, by history, and sound public policy, States  make…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…had the system to support them.\n\nMr. Chairman, by rolling back this language, you are decimating the  substance use disorder treatment across the United States in 37 States  and many right now who are in the process of applying for the waiver  and who are looking to Colorado as an example.\n\nThis would mean hundreds of millions of dollars of treatment…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…have to explain it over and over again  because of the fog of political theater that we always hear across the  aisle.\n\nIt is a little bit like the President of the United States right now  who says that there is a magic spigot in the northwest and in Canada  that, if we could get past all of the radical environmentalists and  just open up this spigot,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…it has some of the  highest costs of living anywhere in the Nation.\n\nThe discovery of Prudhoe Bay in 1968 could not have come at a more  crucial time for the United States, which was right at the height of  the Arab Oil Embargo. The barrels of crude oil from Prudhoe and  subsequent North Slope discoveries have helped ensure the American  people are not…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…tax while driving over the deepest potholes, something is very  wrong.\n\nI have introduced a simple bill that puts a national cap on State gas  taxes. There are only a few States right now that have over 50 cent gas  taxes, so I figured that that is a good maximum, that no State should  be able to force its citizens to pay taxes of more than 50 cents a…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…American money.\n\nIt goes further too. It mandates full information sharing about  illegal aliens in our prisons so we can deport them immediately upon  release.\n\nThere are some States right now that refuse to provide this  information--criminals being released in our streets as a political  statement so they can't be deported.\n\nIt creates a private right of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…compete for Federal contracts if its workforce isn't  unionized. So it is kind of like a union shop outlawed by the Taft- Hartley Act in right-to-work States. About 27 States have right-to-work  laws.\n\nWell, most of the workforce in Iowa isn't unionized. This Executive  order seems to assume that every workforce should be unionized, and  Iowa happens…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Judiciary Committee in which we  talked about restrictions on free speech in Europe. Usually, when I  think of Europe, I think of Europe as being kind of like the United  States, right? You take an airline to London or Paris or Rome, and you  expect the same freedoms and prosperity you do in the United States.\n\nIn this hearing, we heard of a woman who…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]