[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…thoughtful, and even-handed, evaluating every case from, in  her words, a ``neutral posture.''\n\nSince her confirmation, Justice Jackson made her mark on the Court,  establishing her status as a sharp and inquisitive questioner of the  parties before her. And whether she authors majority opinions or  dissents, she always demonstrates a brilliant legal mind.\n\nJust…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…House Committee on Veterans' Affairs, I have  a sacred duty to care for our Nation's veterans, regardless of their  race, religion, creed, gender, sexual orientation, marital status, or  politics. To fulfill this solemn promise, I am committed to doing all  we can to ensure that we have a well-functioning Department of Veterans  Affairs.\n\nWe must also…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…experience on the Foreign Affairs Committee, I  would like to address that issue. The big part of the problem started  when this Congress voted to give most favored nation status to China.  That was at the beginning of this century. We were told it would only  increase our trade deficit by a billion dollars a year. That prediction  was off by 4,000…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…breathe and safe water to drink,  where health equity is a given and not an afterthought, where Black  pain is believed.\n\nAs we stay head down working toward that vision, the status quo is  stark. In 2023, the Boston Public Health Commission reported that  diabetes mortality for Black women was three times that of White women.\n\nThe same report detailed…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Higher Education Act of       1965 (20 U.S.C. 1002); and\n\n(B) does not include an institution of higher education       outside of the United States.\n\n(10) Permanent resident status on a conditional basis.--The       term ``permanent resident status on a conditional basis''       means status as an alien lawfully admitted for permanent       residence…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…years before that. The history of  their people is one of fighting for their independence. They will  continue fighting as long as peace threatens their sovereign and free  status. They believe in peace. They want Donald Trump to succeed in  achieving peace. We should support them in their goals, in their quest  for peace with freedom and sovereignty…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…2007, making him  the longest-serving General Manager in the station's history.\n\nThroughout the entirety of his tenure, Prazenica played a critical  role in maintaining WPVI's status as the home of the most-watched local  news broadcast in Philadelphia, Action News, a title which the station  and program have held for nearly 50 years. In 2009, he oversaw…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…major developed Nation that does  not guarantee healthcare for everyone. That is not because we can't  afford it. It is because powerful interests make too much money from  the status quo.\n\nTo any Republican who knows this bill is wrong, who understands what  this will do back home, and who still believes that this institution  should work for the people…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…treatment.\n\nUnfortunately, these amendments aren't just needed but necessary  given the reports of DHS violating the rights of undocumented  immigrants and those with legal status at detention facilities all  across our country. We must have accountability, and if this  administration plans to use our military installations as detention  facilities,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695107/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Markey,       and other participating members of the Massachusetts       Congressional Delegation,\n\nThank you for receiving this testimony in support of       Temporary Protected Status (TPS) for Haitians. I am a primary       care physician at the MGB Chelsea Community Health Center in       Chelsea, Massachusetts, where I care for adults and children.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…some of the newest  employees who are eager and excited to have their jobs. They are firing  some people who are simply up for promotion which puts them in a  probationary status.\n\nThey are not looking at what these people are doing or the value they  bring to the workforce and to the American people. They are just doing  it and getting on TV with a…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…. . . our job.''\n\nIn Los Angeles, ICE has been racially profiling people,  indiscriminately arresting and holding people, causing fear and terror  in people of every legal status who simply look Latino or speak Spanish  or congregate on certain corners.\n\nToday's bill is just more of the same scapegoating and lying about  immigrants. Once again, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…carry  out this unauthorized campaign with no public debate and no vote. And  they are apparently preparing a parliamentary move to deprive our  resolution of the privileged status given it under the War Powers  Resolution and, thus, shut debate down.\n\nFirst, an effort to declare this resolution not privileged-- apparently, by arguing that the campaign…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to Mar-a-Lago, go ahead and support your Republican  Representative. If you are a regular person who feels like you are  getting screwed over, and if you are fed up with the status quo here in  Washington that only works for those at the top, this majority is not  fighting for you--but we are.\n\nDemocrats are on your side, and we will fight with you every…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to oppose the Department  of Homeland Security's termination of temporary protected status for  Afghans. TPS has provided a lifeline to Afghans who supported U.S.  national security efforts and risked their lives to support our  missions.\n\nWe offered them protection…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "French Hill", "party": "Republican", "sentence": "…world's poorest nations,  it has entered the capital markets to expand its resources and its  impact.\n\nIt is only logical and fair that its securities receive the same  exempted status consistent with previous treatment of multilateral  development bank securities.\n\nSupporting IDA's access to efficient financing would reflect the  United States' leadership…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…companies.\n\nI don't quite know why my Democratic colleagues are so entrenched in  protecting a broken system. They are willing to raise premiums by 5  percent to protect the status quo.\n\nAll that said, I am a doctor who worked in the public hospital system  for over 20 years, trying to bring healthcare to people who otherwise  couldn't afford it. Let's…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, pursuant to House Resolution 707, I call up  the bill (H.R. 4922) to limit youth offender status in the District of  Columbia to individuals 18 years of age or younger, to direct the  Attorney General of the District of Columbia to establish and operate a  publicly accessible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…are affecting the state of the  industry.\n\nThe Commercial Space Launch Competitiveness Act of 2015 established a  reporting requirement from the Department of Commerce on the status of  commercial remote sensing licensing and regulation. That requirement  expired in 2020.\n\nH.R. 1325 will reinstate the reporting requirement and keep Congress  informed of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Association of Asian  Pacific Community Health Organizations have dedicated their time and  energy to promoting advocacy, collaboration, and leadership that  improves the health status and access of Asian Americans, Native  Hawaiians, and Pacific Islanders. Jeffrey's oversight of the overall  strategic direction and execution of the Association of Asian Pacific…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…preceding the briefing;\n\n(iii) processes of the Coast Guard to mitigate substance       abuse in the Coast Guard, particularly with respect to       fentanyl; and\n\n(iv) the status of the memorandum of understanding required       under subsection (d).\n\n(B) For the 5-year period preceding the briefing, a review       of instances in which naloxone or…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Mr. HOEVEN.  290, S.J.  Res. 86, Calendar No. 293, S.J. Res. 84 remain in status quo through  January 16, 2026.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698227/joint-resolutions-remaining-in-status-quo"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Biden administration reversed course by  reimposing the outdated and rigid ``once in, always in'' policy. This  framework permanently locks facilities into strict major-source status,  even if they make substantial efforts to reduce harmful emissions. That  is not only unfair, it discourages environmental progress.\n\nWhom did the Biden administration hurt?…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Service are       not exempt from paying the FAET on less-than lethal devices.       The legislation returns the U.S. Marshal Service and other       federal agencies to the status quo of not paying a ten or       eleven percent tax on the purchase of less-than-lethal       devices.\n\nA historical payment of FAET tax from a federal law       enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…responsible market participation, and  driven capital and talent to more favorable jurisdictions abroad.\n\nH.R. 3633 addresses these issues directly by clarifying the legal  status of digital assets and establishing well-defined regulatory  responsibilities between the SEC and CFTC, creating a more predictable  landscape for market participants while…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…who physically  attack ICE and Border Patrol.\n\nSecond, it dismantles the corrupt NGOs that are funding and  coordinating these attacks, enabling us to revoke the nonprofit status  of organizations which incite or fund domestic violence against law  enforcement.\n\nThird, it turns illegal entry into a felony with mandatory  detention--no more catch-and-release--and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that would prohibit  the entry of people that are known to be adherent to sharia law, which  is deeply in conflict with our values and our laws.\n\nWe should take away the tax status of CAIR and other radical  organizations with ties to terrorists and a vast network of well-funded  organizations, using American tax dollars, United Nations' funds,  wealthy…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…fails to act, then critical training areas at Fort  Wainwright and Fort Greely in Alaska, the McGregor Range in New Mexico,  and Fort Irwin in California would lose their legal status for military  use.\n\nH.R. 5131 solves that problem by extending these withdrawals for 25  more years and making necessary technical corrections to land  descriptions to ensure…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…this rule, once you classify as a major source, you are always  considered a major source even though--you would even be prohibited  from ever achieving an ``area source'' status again even if your  emissions output decreased below the applicable threshold. This tells  American manufacturing and energy leaders that no matter what you do,  you will always…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…evolving world of payment stablecoins.\n\nStablecoin legislation has been in the works for over 4 years and has  been called for by Democratic and Republican administrations. The  status quo fails to protect consumers from fraud. That is an untenable  situation in a market growing by the billions.\n\nFor too long, the United States has operated without a clear…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]