[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I'll continue to fight for the resources New Hampshire needs to protect the health of Granite Staters.\"\n\n\"Health care professionals have responded heroically to the demands of the COVID-19 pandemic and they must receive the support that they need to continue saving lives,\" Senator Hassan said."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"There are hundreds of thousands of Granite Staters who rely on these programs to get the care they need to live healthy, productive lives which is why I continue to fight efforts to erode these programs in Congress."}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "In New  Hampshire, Northeast Delta Dental plays a crucial role in providing  dental insurance to over half of insured Granite Staters."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"By increasing the charitable giving deduction, this bipartisan amendment would encourage people to support these organizations as they carry out their missions of providing relief to Granite Staters and Americans impacted by this crisis."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Jeanne Shaheen (D-NH) issued the following statement as the United States Senate re-convenes this week and prepares to once again conduct in-person voting and committee hearings:\n\n\"As the Senate re-convenes, there is no more important priority than for Congress to continue to work across the aisle to help Granite Staters and all Americans who are hurting,\" said Shaheen."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Out of work families and individuals in New Hampshire and across the country cannot wait.\"\n\nOver the past several weeks, more than 100,000 Granite Staters and over 22 million Americans have applied for unemployment benefits."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"Community health centers play a critical role in responding to this pandemic and deliver essential and affordable health care to thousands of Granite Staters, especially those living in rural communities,\" said Senator Shaheen."}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Throughout his career Chief McLin has played a  crucial role in supporting Granite Staters through the Adverse  Childhood Experiences Response Team (ACERT) and Comprehensive Opioid,  Stimulant, and Substance Use Program (COSSUP)."}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Throughout his  43 years of working in local government, David consistently ensured  Granite Staters received the support they deserved, greatly helping  residents across the state in Jaffrey, Londonderry, North Hampton,  Belmont, and Gilford."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "They also announced $11.7 million in additional funding to assist New Hampshire's vulnerable homeless population and other local needs during the COVID-19 pandemic, as well as $2 million to help Granite Staters living with mental health and substance use disorders."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"Nearly 75 million Americans and 180,000 Granite Staters rely on Medicaid to access the health care they need to live healthy, productive lives."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Though I'm pleased this funding is out the door, we still have much work to do, and I'll continue to work across the aisle until we reach a point where anyone who needs a test can get it without hindrance or delay.\"\n\n\"Community Health Centers are working hard to support their patients during this difficult time, and they must receive the federal resources necessary to continue to provide high-quality, affordable health care to Granite Staters,\" Senator Hassan said."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I will continue working across the aisle to protect our environment and ensure that Granite Staters and visitors alike can enjoy all that our state has to offer.\" \n\nJack Savage, President of the Society for the Protection of New Hampshire Forests said, \"The Forest Society has long advocated for full, permanent funding of the Land and Water Conservation Fund at its authorized level of $900 million annually."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "\"The men and women of the National Guard have made a huge difference in New Hampshire's COVID-19 response efforts, supporting the health and economic stability of Granite Staters, and I am deeply grateful for their service.\""}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "We know Granite Staters are engaged and we know there are issues that strike especially close to home here."}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "For the past year, as Penn Staters have done for more than 50 years,  these students devoted countless hours to supporting pediatric cancer  patients through THON, the largest student-run philanthropic  organization in the entire world."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "In fact, Ryan and I were Boy Staters together back in 1979."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "\"In the aftermath of a natural disaster, the last thing Granite Staters should be worried about is navigating cumbersome rules and regulations to obtain the emergency funds they need to rebuild."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "I'll continue to work across the aisle to reduce prescription drug costs and increase market competition among manufacturers so Granite Staters and Americans across the country don't have to pick between affording their medication and paying the bills.\"\n\n\"Washington needs to step up and be a stronger partner to communities fighting the substance abuse epidemic, and we need to make sure that all safe and affordable treatment options are available to patients."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "\"When innovative Granite Staters have an idea for a new business, incubators can play a critical role in helping transform those startups into successful small businesses,\" said Senator Hassan."}]