[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…figure out how I was going to be able  to pay for college.\n\nYet Linda McMahon and Republicans in Congress will try to sell us on  the idea that education should be left to States and to local  communities.\n\nTell that to the young student who is struggling to read by the  fourth grade but whose school doesn't have the resources they need to  help them catch…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…so lucky because the legacy of over 300 years of  slavery and Jim Crow, massive resistance, and chronic underfunding has  created too many obstacles to the ability of States and local  governments to give every child an opportunity for a good education.\n\nFor the past 20 years, first as a State legislator and now in  Congress, I have worked to ensure…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…child welfare system,       enforcing our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…protests in Los Angeles when they wrote H.  Res. 516. Instead, the resolution perpetuates a false narrative about  Democratic elected officials in California. H. Res. 516 states that  local elected officials did not adequately respond to the bad actors  and trouble-doers. These claims are patently false. Mayor Karen Bass of  Los Angeles implemented a multi-day…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…without these funds?\n\nAs a former education administrator, I know firsthand the impact IDEA  funding makes on students who need it the most. Without Federal  funding, States and local communities would have to cover the costs,  but your ZIP Code should not determine if you deserve to have your  children's educational needs met.\n\nAs a public school mom,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…child welfare system,       enforcing our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…legal  status. President Trump has said ``homegrowns'' are next. Trump doubles  down on sending American criminals to foreign prisons. We have a prison  system in the United States--local jails, State prisons, Federal  prisons. The notion of sending American citizens to foreign prisons  without scrutiny is truly shocking, and that is the reason that I filed…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…government. That is the choice in front  of us.\n\nThis bill puts real requirements on the Department. It provides  oversight and makes targeted investments that directly help States and  local communities to make sure that we help folks like firefighters and  other folks.\n\nLet me say this: It is better than the alternative, leaving the  Department with a blank…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…introduced the Protect Our Constitution and Communities Act, or POCCA.\n\nPOCCA affirms the separation of budgetary powers and creates a  private right action for individuals, States, and local jurisdictions  that have been harmed by the administration's repeated violations of  the ICA.\n\nPOCCA would also hold accountable any public official with  decisionmaking…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…child welfare system,       enforcing our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Mobile  Bay's national significance and how this program brings people together  to share solutions across the country.\n\nThis program funds partnerships between the EPA, States, local  governments, and community stakeholders. It is very successful in  leveraging not just Federal dollars, but on average the local NEPs  raise an additional $17 for every…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…every child is so lucky.\n\nThe legacy of 300 years of slavery and Jim Crow, massive resistance,  and chronic underfunding have created too many obstacles to the ability  of States and local governments to give every child an opportunity for  a good education.\n\nFor the past 20 years, first as a State legislator and now in  Congress, I have worked to ensure…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…everyone to  join us in signing that. Do not let them bulldoze our public education  system.\n\nThey are going to try to justify it by saying we have to return  authority to States and local school boards, but they already have the  authority. The Department of Education and the Federal Government don't  set curriculum. They don't decide how many kids are…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…defendants, as well as forfeited bail bonds and other gifts and  donations.\n\nFor four decades, the Crime Victims Fund has been a lifeline,  providing money through grants to States, local governments,  individuals, and other entities. It supports rape crisis centers,  domestic violence shelters, child advocacy programs, and services for  survivors like me…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…responsibilities.\n\nFor years, my Republican colleagues have warned against unfunded  mandates. They have rightly criticized Federal actions that impose  requirements on States and local communities that cannot afford to  implement those policies.\n\nYet, H.R. 1049 is precisely that, another unfunded mandate wrapped  around rhetoric but lacking in substance.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…from what  matters most--the students.\n\nPresident Reagan said back in 1982, and President Trump has recently  echoed, that we need to turn the schools back to the States and to the  local school districts. President Reagan rightly noted that `` . . .  the decline and the quality of public education began when Federal aid  became Federal interference.''…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…victims will be  identified and rescued.\n\nLast month, I also reintroduced a package of bills that will do much  to combat human trafficking. My SAVE Girls Act would provide States,  local governments, and nonprofits with the resources they need to end  the trafficking of young women and girls.\n\nMy National Human Trafficking Database Act, meanwhile, would…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the excess costs of special  education services.\n\nYet, for decades we have fallen short of promised funding levels,  which have hovered around 13 to 15 percent, leaving States and local  school districts struggling to make up the difference.\n\nThis shortfall forces schools to stretch their already limited  resources, meaning fewer special education teachers,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…State and Local Cybersecurity Grant Program at the Department of  Homeland Security was created to help close that gap by providing  targeted assistance to those States, territories, and local governments  so that they can assess the risk, modernize outdated systems, and build  real cyber resilience.\n\nThe PILLAR Act reauthorizes and strengthens this program…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that we have right now is to modernize our  government and to rein in the inexorable growth of the administrative  state, restoring power to our elected representatives, States, local  communities, and the American people themselves.\n\nWhen we think about the administrative state, we think about all the  regulations that are churned out, one after another,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}]