[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…legislation to lower the cost of  housing and offer more Coloradans the ability to own a home.\n\nThough Representative Bird and I held different positions during my  time in the State Legislature, we collaborated to cut through the red  tape surrounding professional licensing and keep Colorado one of the  best places to work. She is my colleague, my friend, a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Department of Justice filed a motion in  Federal court, trying to overturn a decision to say that silencers are  not protected by the Second Amendment, trying to say that no State  legislature could ban or regulate the use of silencers, and silencers  are broadly used by killers, by criminals who are trying to hide the  fact that they are engaged in criminal,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…and a system where  more people die.\n\nOne thing drove me to public service and has continued to drive me:  Everyone deserves access to healthcare. That is why, in the State  legislature, I worked every day to protect and expand access to care,  passing laws to expand postpartum Medicaid so that new  parents received the care that they needed after childbirth,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ed Etzkorn, and Jenn Miller. A most big thank you to  our subcommittee chair, Mario Diaz-Balart. We have known each other for  decades, dating back to our time in the State legislature. I am  grateful for his fine leadership and friendship.\n\nMr. Chair, this bill reflects what I believe most Americans want from  their elected leaders: to work together…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…isn't going to cut it.\n\nMs. McCLELLAN. Mr. Speaker, I thank Mr. Carter for his remarks.\n\nMr. Speaker, I wasn't here when the Affordable Care Act was passed. I  was in the State legislature in Virginia. It was after I had become a  mother. It was while I was part of the sandwich generation, trying to  raise two children and deal with elderly parents nearing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…looks like to lead with integrity and invest in an  economy that will make it possible for families to thrive.\n\nIn fact, in just a couple of weeks, on October 1, our State  legislature will convene in the wake of Republicans' disastrous big,  ugly bill, which will gut healthcare and food assistance programs, to  actually shore up the programs that will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and  all across the country.\n\nThey have accused us of fear-mongering and making misrepresentations,  and so I was surprised to learn, Mr. Speaker, that the Louisiana State  Legislature--the Louisiana State Legislature that has a Republican  supermajority--the Louisiana State Legislature recently voted to  condemn the one big, ugly bill because of the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…qualifications and extensive experience, it is no  surprise that in 2014, the good people of Prince George's County,  Maryland elected Mr. Barron to the House of Delegates. In the state  legislature, he prioritized public safety and criminal Justice reform,  co-authoring bipartisan legislation that instituted sweeping  improvements to Maryland's sentencing and corrections…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…firm,  establishing the highest standards of trial excellence and ethics.\n\nJerry's lifelong love of politics was cemented when he was a reading  clerk for the Colorado State Legislature during the 1965-66 session.  Later, he was the point person for the rights of the injured in the  1985 tort reform legislative session and gained respect from  legislators…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…about his authenticity, his warm sense of  humor, just how relatable he was, that is all very, very true.\n\nI go back almost 20 years with Doug because we were in the State  legislature together. A lot has been said about his sense of humor,  which is also very, very true. I want to just share something that I  always think of with Doug because it speaks…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, the State legislature may have forced through  their partisan map, but in Missouri, the final word belongs to the  people. Our constitution gives Missourians the right to check the  politicians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695619/petitioning-to-check-partisan-map"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…job  at the Department of Defense, Olivia wouldn't have gotten the care that  she needed to live for 19 years as healthy as possible if it weren't  for the Washington State Legislature expanding Medicaid the year she  was born.\n\nMy family would have faced dire choices about which bills not to pay  in order to meet Olivia's needs if it weren't for Medicaid…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…the sheer  force of her will, exceptional medical care, and the unwavering support  of her husband, Captain Mark Kelly.\n\nI worked closely with Gabby when she was in the State legislature,  and I served on the Phoenix City Council. She was a singularly talented  leader, brilliant and tough as nails, with the rare gift for bringing  people together. There…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…personal privilege to close  this Special Order hour with some stories from Virginia, which I know  you, Mr. Speaker, care a lot about. You and I served together in the  State legislature there where we were able to find common ground across  the aisle a little more easily than we are able to do in Congress.\n\nIn Virginia, about 350,000 people benefit from…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…she saw impacting her students' lives. She began working as a  legislative assistant for Louisiana State Representative Aimee  Freedman. During her time working in the State Legislature, she worked  on many issues impacting everyday Louisianans. One of her key  accomplishments was helping shepherd  Representative Freedman's bill to eliminate the ``pink…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…the dome would never have been built.\n\nTarky was a one-of-a-kind member of the Greatest Generation. He loved  our State and our country. He was a unifying force in the State  legislature, always bringing together members of both sides of the  aisle for dinners in the legacy of Reagan and O'Neill in that wonderful  tradition.\n\nI congratulate Tarky's family…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Then, you hear some of the brilliant things that are said about  Medicaid. Now, I need to disclose that it has been many, many years. As  a child, I spent two terms in the State legislature. I was never going  to run for office again. Because I was so tall, smart, and good- looking, I got to--well, it had nothing to do with the fact that I was  the vice…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…shouldn't even be here today debating this resolution. Because of  the radical, illegal, and harmful policies being rubberstamped by the  Governor of Colorado and the State legislature, here we are.\n\nMr. CRANK. Mr. Speaker, this terrorist was in our country having  overstayed his visa. Instead of turning over this illegal alien to ICE  and law enforcement,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and, if contained therein,       no additional or State certification under subparagraph (A)       or paragraph (3).\n\n``(C) Extended deadline.--With respect to a State with a       legislature that meets biennially, the deadline for the       submission of the initial certification required under       subparagraph (A) shall be 2 years after the date…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…today to honor my dear friend,  fellow farmer, and colleague, Congressman Doug LaMalfa.\n\nI have known Doug for about 16 years, going back to our time together  in the State legislature. From day one, his commitment to the people of  northern California, especially those in agricultural communities, was  clear.\n\nIn Congress, Doug was one of the fiercest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698738/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ongoing advocacy for Rocklin businesses has left a  meaningful mark on our local economy.\n\nI have had the privilege of knowing and working with Robin since my  time in the State legislature. I have always appreciated her  professionalism, wisdom, kindness, and generosity that she brought to  her role as the chamber's chief executive officer. Robin's visionary…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…serve the United States military with honor. They  shouldn't need a lawyer or specially trained advocate to explain a  claims letter to them.\n\nWhen I was elected to the State legislature in Michigan 10 years ago,  I became the only Iraq war veteran in the entire Michigan House of  Representatives. I worked closely with my Federal Members of Congress…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689676/clear-communication-for-veterans-claims-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…understand what  ``FOIA'' is, that is the Freedom of Information Act--and Sunset Act  protections.\n\nI have always advocated for more transparency at TVA, first in the  State legislature, then as a mayor, and now as a Congressman.\n\nI thank my good friend, Representative Cohen, who I don't see in here  today, for his continued support. Steve and I were…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that the Haney family has had on our community in so many different  ways. In fact, I honored Marcus Haney with the Veteran of the Year  award when I was a member of the State legislature.\n\nI wanted to also give you a description that Dr. Forman has given for  what a servant leader is because I think it is a timely reminder in  these times in many ways…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to be our safety net for indigents and the  poor. I have some old experience with that. For a short time, I  actually chaired the Healthcare Committee in the Arizona State  Legislature when I was a child. For a while I actually worked on the  AHCCCS budget, which is the Arizona Medicaid system. We do something  unique. We actually buy managed care HMO…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, Doug LaMalfa was my neighbor.  Our districts bordered one another. This was true during my time in the  State legislature as well.\n\nThe region of our State that he represented is an area where people  often feel like their voices are not heard in the corridors of power,  in places like Sacramento…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698740/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…because I had so many  Indian  Tribes from California calling me, saying that we have got this great  guy running for the House of Representatives who we know from the State  legislature in California. He cares about who we are, represents our  interests, and understands the trust responsibility. American Indians,  Native Americans, had no better friend…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…basketball championship.  This came on top of a remarkable 24-2 season.\n\nAs a Kansas State senator at the time, I had the privilege of  sponsoring a resolution in our State legislature to commend the team's  win and to host the team at the Kansas State House to see the  resolution's unanimous adoption.\n\nA week ago, on the 20th anniversary, the community…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699133/congratulating-2006-iola-fillies-on-don-bain-hall-of-fame-induction"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…a stark  illustration of our State government's utter inability to provide  effective services to our citizens.\n\nMr. Speaker, I am calling on Governor Newsom and the State  legislature to take immediate action to prevent Californians from  having to pay over $8 a gallon for gas by the end of next year. We need  immediate action to overturn regulations…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…there. They  frequented this nightclub that was shut down.\n\nWe are in this mess because of far-left policies from our Governor in  Colorado, Governor Jared Polis, our State legislature, and the Biden  administration.\n\nI thank Sheriff Joe Roybal and all of the people from El Paso County  Sheriff's Office and the Colorado Springs Police Department.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690282/raid-in-colorado-springs"}]