[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Vice  President, from crypto corruption, each of us will be complicit.\n\nLet me be clear on this point because there has been a lot of  misinformation. This bill has a policy statement that elected officials  like Members of Congress and Senators, as well as government officials,  cannot issue their own stablecoin.\n\nAre my colleagues aware who Republicans…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Notices of Decision were not rules       under CRA, and, in the underlying decision documents for two       of those notices, cited to our 2023 decision in support of       that statement. However, EPA submitted them as rules to GAO       and Congress without any explanation of this discrepancy.\n\nPretty clear.\n\nAnd, finally, later in their letter:\n\nThe agency…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…fact, they indicated  that things that are less serious in nature have been classified. But  the Secretary of Defense has the ability to exculpate himself, so his  exculpatory statement is that this is not classified information.\n\nI believe that if any other person beneath the Secretary of State had  allowed such information, the same information, to be…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Chair. The--yes, it is my time. Yes, I will yield.\n\nMrs. Fletcher. Thank you, Mr. Chairman.\n\nThe Chair. Yes.\n\nMrs. Fletcher. I just want to clarify. I understand the       statement to be that this particular legislation doesn't deal       with the already-obligated funds. But isn't it true that the       administration is rescinding the grants and pulling…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…that under the Constitution, the  power to impose tariffs is a congressional power and needs to be  restored to Congress. Apparently, he switched his vote after issuing  that statement because he got a commitment from the Speaker that this  House would only block votes on tariffs until the end of January.\n\nWell, here we are back again with the Republican…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…that there will be no  exclusions on exemptions from his liberation day tariffs that he  imposed back in April, on Friday afternoon the White House very quietly  released a statement that they, in fact, are exempting and carving out  tariffs for a number of goods, which were blindingly obvious were going  to be costing more because we do not produce any…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and report to the world what they  actually see?\n\nHe said it was too dangerous for journalists to even witness it.\n\nMr. President, I want to tell you, that was an incredible statement  and, I believe, totally wrong.\n\nAt the outset, Cindy McCain and others told us there is no diversion  by Hamas of the humanitarian aid. It just isn't coming into Gaza.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Star,  Representative Cory Mills described the legitimate factual disputes  raised by individuals he purportedly served with and rescued as  ``slander and defamation'' in a statement to the Daytona Beach News- Journal: Now, therefore, be it\n\nResolved, that--\n\nOne, Representative Cory Mills be censured;\n\nTwo, Representative Cory Mills forthwith present…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Nation's future. In this moment, we cannot be silent nor treat these  attacks as normal.\n\nMr. Speaker, I would like to read excerpts from the American Bar  Association's statement on the Republican assault on our judiciary into  the record.\n\n``There have now been statements by officials criticizing judges for  not following the last people. Judges…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, on May 19, 2025, I provided a statement  for the Record of my intent to object to the Senate proceeding to any  of the four nominations currently pending on the Senate's Executive  Calendar for the U.S. Environmental…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…introduce the Central Bank Digital Currency Study Act.\n\nChairman Hill also wrote a letter to the Fed asking for information.  After the Fed agreed to do a study, he issued a statement saying:\n\nThe Fed is finally taking actionable steps to do what we       have been asking them to do       for 2 years, and we are pleased to see Chairman Powell       announce…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…political stunt by a desperate, failed candidate for Governor trying to  pander to the people back in South Carolina. It is nothing more than  that.\n\nYou want to make the statement about who has brought disgrace to the  House. The actions of this House Republican majority have brought  disgrace to the House of Representatives from day one of this  Presidency.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…permanent  and expanding it--is basically if you are an organization that checks  for factual accuracy, we don't want to do business with you, which is  just a remarkable statement in terms of how we approach this. I think  we should want people to check facts.\n\nFor example, it is not the Department of War. It is the Department of  Defense. It is in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…community facing constant adversity, from our  State, and people like in our inner administration.\n\nJust today, Governor Ron DeSantis deleted from the annual anniversary  statement the words and acronyms ``LGBTQ+'' and ``Hispanic,'' when most  of the people who were killed that day were from the LGBTQ+ community  and Hispanic. This was armed bigotry,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…commend her for her bill and  her work in general on these issues.\n\nThis bill codifies an SEC rule that allows any issuer to submit a  confidential draft of the registration statement for review by the SEC  staff. In doing so, it allows companies seeking to access public  markets more time to carefully draft their registration statements  under SEC's guidance…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…would cost hundreds of millions of dollars. By the way, why  should we in the Federal Government care what everyone's desk is like?  Let people choose on that.\n\nThat simple statement, that simple first time that it was actually  used, started a process now of saying: If an administration at the last  minute puts in a rule that Congress then comes in and…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…live warhead is replaced with an inert fill.       The TTR functions the same as a GBU-39/B. The TTR is suited       for training missions.\n\nThe Sensitivity of Technology statement contained in the       original notification applies to additional items reported       here.\n\nThe highest level of classification of defense articles,       components,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Mr. MOORE of Alabama. Madam Speaker, I yield myself such time as I  may consume.\n\nMadam Speaker, in February 2024, the American College of  Pediatricians released a position statement detailing  how social transition, puberty blockers, and cross-sex hormones have no  demonstrable long-term benefits on the psychological well-being of  adolescents in gender…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that there is nothing to terminate.\n\nThere are no U.S. forces in hostilities.\n\nNow, I know some of my colleagues will argue that a vote for this  resolution is a prospective statement about limiting future action in  Venezuela. That is not what it says. They argue we still have ships in  the Caribbean. Clearly, the President is ready to invade again, they…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…a multi-year-long planning  process with dozens of public meetings and thousands of hours of hard  work by BLM as part of the process of drafting an Environmental Impact  Statement--EIS--to satisfy the National Environmental Policy Act. In  December 2020, BLM released its Draft Resource Management Plan/EIS and  identified Alternative C2 as the preferred…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…including--\n\n``(A) the full-time equivalent personnel hour costs,       contractor costs, and other direct costs of the lead agency       that prepared the environmental impact statement; and\n\n``(B) if practicable, and noted where not practicable, the       costs incurred by cooperating agencies, participating       agencies, any project sponsor that prepared…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…opposite.\n\nThese reliable resources are being prematurely retired, and we are  not replacing them with the technologies we can count on around the  clock.\n\nThis is not a political statement. It is simply a matter of physics.  We don't need to imagine the consequences of retiring these baseload  energy resources. Spain, just a few weeks ago, experienced nationwide…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Stop Forced Organ Harvesting       Act of 2025''.       SEC. 2. STATEMENT OF POLICY.\n\nIt shall be the policy of the United States--\n\n(1) to combat international trafficking in persons for       purposes of the removal of organs;\n\n(2) to promote…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…identification of, and information reasonably       sufficient for the covered platform to locate, the intimate       visual depiction of the identifiable individual;\n\n(iii) a brief statement that the identifiable individual       has a good faith belief that any intimate visual depiction       identified under clause (ii) is not consensual, including any…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…promise to secure the border,  and this legislation provides the tools needed to uphold our laws and  remove dangerous criminals.\n\nOn that note, I was also encouraged to see a statement of  administrative support from the Office of Management and Budget stating  that if the legislation were presented to the President, his advisers  would recommend that he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…``strenuously object.''\n\nMr. ROY. Mr. Chair, I am reminded of that line in a ``Few Good Men''  when they talk about strenuously objecting and somehow that that makes  a more emphatic statement.\n\nI would also remind my colleague the way we have drafted this bill is  to reduce the budget by 20 percent. Nowhere in the Constitution does it  stipulate the amount of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…amend the Internal Revenue Code of 1986 to  conform to the intent of the Internal Revenue Service Restructuring and  Reform Act of 1998, as set forth in the joint explanatory statement of  the committee of conference accompanying Conference Report 105-599,  that the National Taxpayer Advocate be able to hire and consult counsel  as appropriate, as amended.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…financial       support to its terrorist proxies throughout the Middle East,       threatening allies and partners of the United States, such as       Israel.       SEC. 3. STATEMENT OF POLICY.\n\nIt is the policy of the United States to fully implement       and enforce the Iran Sanctions Act of 1996 (Public Law 104-      172; 50 U.S.C. 1701 note).…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…training and preparing       terrorists for the planning and execution of terror       operations against IDF forces and the State of Israel,'' the       military said in a statement.\n\nThe weapons stored at the sites and Hezbollah's activity       ``constitute a blatant violation of the understandings       between Israel and Lebanon, and pose a future…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…must end it. Please support my amendment.\n\nMr. LEE. Mr. President, the fact that the acting president and CEO is  a DOGE individual doesn't disqualify him from making this statement. It  is corruption. Sure, it has been going on since the eighties, but so  have a lot of things that are corrupt. We must defund this now.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}]