[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…healthcare program.\n\nThe consequences of these cuts will be devastating. Medicaid provides  healthcare to one in three Americans, nearly half of the children in  the United States, and it is the largest source of funding for nursing  homes for seniors and people living with disabilities.\n\nThis is a lifesaving program for 80 million Americans. They count…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…plaque honoring police officers  who fought tooth and nail for hours against the most bloody, vicious,  violent insurrectionist mob ever to attack the Capitol of the United  States.\n\nChu).\n\nMr. RASKIN. Mr. Speaker, I thank the gentlewoman for her excellent  point. The California delegation has advanced, with Ms. Lofgren, a  truly bipartisan resolution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…minute to the gentleman from  Illinois (Mr. Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party.\n\nMr. BEYER. Madam Chair, I yield 1\\1/2\\ minutes to the gentleman from  New York (Mr. Morelle), who is a distinguished member of the House…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…anyone--never  mind an elected representative of the people--to the ground to be  handcuffed.\n\nThey say that he didn't identify who he was, and yet--watch the  video--he clearly states:\n\nI am Senator Alex Padilla.\n\nThey are going to spin this. But I am begging my Republican  colleagues: Don't let them do it. Protect our ability as servants of  the people…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…system. By walking away from practitioners and patients, the  Trump administration is abdicating its duty to our most vulnerable and  signaling to the world that the United States is no longer the global  leader in scientific research.\n\nAs someone who spent years treating patients, I know that abandoning  our scientists, our research institutions, our…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…You  don't need a statute to deport them for falling asleep drunk in their  car.\n\nToday, there are nearly 13 million green card holders, permanent  residents, in the United States. These are people who have followed all  the rules. We are not talking about undocumented people, the people who  are here unlawfully. They are already taken care of.\n\nThere…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…condemning the ethnic violence in the Democratic Republic of the Congo  (DRC). Dr. King famously said, ``injustice anywhere is a threat to  justice everywhere.'' The United States, credible human rights  organizations, and civil society have documented and published reports  and findings that implicate the Democratic Republic of the Congo and  Rwanda…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…Medicaid by almost $1  trillion. It took away food stamps. Then they refused to extend the ACA  subsidies that would help ACA tax credits, that would help people in  their own States.\n\nThat is what the Democrat majority next year is going to do. We will  continue fighting for our own people throughout the country. It doesn't  matter if a constituent is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…equipment that Olivia needed to thrive.\n\nHowever, gratefully for our family, the Washington State legislature  in 1993 voted to expand Medicaid. Washington was one of the first  States in the country to lead that charge. For us  that meant that we didn't have to worry about losing our house or what  other bills that we could pay so that Olivia could survive…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the 140 persons who, on yesterday, voted to support  H. Res. 939, House Resolution 939. This resolution, H. Res. 939,  impeaching Donald John Trump, President of the United States, for high  crimes and misdemeanors.\n\nI rise to thank the 140 persons who supported this resolution.\n\nI rise to thank the 47 persons who did not oppose what we were doing  but…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…his own country and in dealing  with others.\n\nThis is why the only way to deal with Putin is by sending a clear  message--a message of strength and of unity. As the United States has  for the better part of a century, we must continue to stand up to  tyrants and defend freedom. We have learned that isolationism and  appeasing autocrats is a losing strategy.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…special interests or some new  Presidential obsession.\n\nUnlike many of the nations Trump has slapped with taxes, there is  already a comprehensive trade deal between the United States and  Canada. It was written with input from the Senate Finance Committee,  and it was bipartisan. USMCA was a trade deal negotiated by Donald  Trump himself, and it got a significant…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…expired nearly 18 months ago, and it is in desperate need of  reauthorization.\n\nThe Congressional Award is the highest award for youth legislated and  presented by the United States Congress  to young people. It is a noncompetitive program designed to acknowledge  young people for their initiative, achievement, and service.\n\nOver 8.1 million hours of service…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…lives of every single one of our precious soldiers,  sailors, airmen, marines, and intelligence officers who were deployed  secretly to Venezuela by the President of the United States without  consent of Congress.\n\nImportantly, this operation was planned and executed in violation of  the United States Constitution, Article I, Section 9, Clause 7: ``No  money…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Trump's 100 days:\n\nIn his first 100 days, Donald Trump, No. 1, propped up Big Tech  billionaires at his inauguration, right here in this building.\n\nNo. 2, withdrew the United States from the World Health Organization.\n\nNo. 3, pulled the United States out of the Paris climate agreement to  save our planet.\n\nNo. 4, created DOGE.\n\nNo. 5, called to end birthright…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 131\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Finish the Arkansas Valley       Conduit Act''.       SEC. 2. ARKANSAS VALLEY…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…servicemembers served with honor and bravery, playing a       crucial role in winning the Allied victory. They deserve to       be remembered with dignity and accuracy.\n\nThe United States has a solemn duty to ensure every fallen       servicemember is honored correctly Enacting H.R. 2701 helps       ensure that the Star of David marks the Jewish graves of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2225\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Access to Small Business       Investor Capital Act''.       SEC. 2. AMENDMENTS…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…emissions and keep alive the option of returning to an area  source once emissions are reduced.\n\nOver the last 20 years, no other country has reduced its emissions  like the United States, and we do not need overly restrictive  regulations to continue this.\n\nGiving our private sector the ability to innovate on a sensible  timeline is a different approach than…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…economy and the Chinese military  through outbound investments to the tune of billions of dollars.\n\nThe U.S.-China Economic and Security Review Commission noted that the  United States is ``the most important single source of investment to  semiconductors, quantum computing, and AI in China.'' In other words,  we are funding our principal competitor, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…General CQ Brown. I thought he  did a good job. I publicly stated a number of times that he served his  country very well.\n\nBut here is the deal: The President of the United States is entitled  to the Chairman of the Joint Chiefs that he wants. You look at history,  senior military commanders on the Democrat's side, on the Republican's  side--if the President…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Congressman Ogles for his leadership on this legislation and  for his commitment to enhancing the security of our Nation's critical  infrastructure.\n\nIn recent years, the United States has faced an alarming surge in  malicious cyber activity originating from  groups aligned with the Government of the People's Republic of China.\n\nThese actors have demonstrated…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…party staff members, and representatives of numerous  political, business, academic and media agencies.\n\nA comparable delegation of German staff members will visit the United  States from Saturday, December 6 to Saturday, December 13, 2025. They  will attend similar meetings in Washington organized by the members of  the U.S. delegation.\n\nThe Congress-Bundestag/Bundesrat…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693345/announcement-of-the-2025-congress-bundestagbundesrat-exchange"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…you missed your ability to  apply for a Native allotment, you should get your ability to do that.\n\nThat law passed. I was in the Oval Office when the President of the  United States signed it. He said: This is an injustice. I am going to  fix this for the Alaska Native Vietnam vets.\n\nI mean, what is more bipartisan than that? Why would you come down to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Hamas has  kept their bodies and refused to return them to family and friends,  compounding the grief of loved ones. All Americans would say this  cannot stand.\n\nThe United States must remain steadfast in its commitment to securing  the release of these hostages and holding Hamas accountable for these  atrocities. Under President Trump's leadership,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the  Stop Chinese Fentanyl Act.\n\nThe fentanyl crisis is one of the most significant threats to our  country and continues to plague families and neighbors across the  United States.\n\nMy home State of Kentucky, sadly, has been ravaged by the fentanyl  crisis.\n\nDrug overdoses are the leading cause of death for Americans aged 18  to 45, and fentanyl is responsible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, tonight the President of the United  States will give the State of the Union Address. Americans are going to  hear two things from the President. They are going to hear a record of  progress that puts America back on…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…legislation would require, as we have  said previously, proof of citizenship when registering to vote and the  presentation of a valid ID when at the ballot box. Currently, only 13  States do not require any form of voter ID. Having this requirement  should be the standard and not the exception.\n\nMy Democratic colleagues claim that requiring a photo ID to vote…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5131\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,            SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Public Lands Military       Readiness Act of 2025''.       SEC. 2. EXTENSION…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Roanoke, Virginia, who will celebrate his 100th birthday this  Thanksgiving Day, November 27, 2025.\n\nMr. Holland is a proud World War II veteran who enlisted in the  United States Army at just 18 years old. He spent his 19th birthday in  France, serving as a Staff Sergeant with the 381st Battery. He worked  as a powder man and also served in supply operations,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}]