[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…these Halls, as the whip observed as well.  They erected gallows. They erected gallows on the Capitol lawn to hang  the Republican Vice President of the United States, and so stated.\n\nUnlike the past few months, the National Guard was nowhere to be  found. Donald Trump had every opportunity to restore order. The  Republican leader of this House, Mr. McCarthy,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…formal notice by the Department of       Justice to the State of Texas of serious concerns regarding       the legality of four of Texas's congressional districts. As       stated below, Congressional Districts TX-09, TX-18, TX-29 and       TX-33 currently constitute unconstitutional ``coalition       districts'' and we urge the State of Texas to rectify…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the deaths of multiple children. While       specific information on the manufacturers or brands tied to       these       fires is not publicly available, fire experts have stated       they suspect that low-quality batteries from overseas are       often to blame.\n\nA federal safety standard enforced by the CPSC would level       the playing field and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Patriarch.'' He famously declared shortly after he assumed the  ecumenical throne in 1991 that ``crime against the natural world is a  sin.'' Human beings and the environment, he stated, ``compose a  seamless garment of existence, a multicolored cloth, which we believe  to be woven in its entirety by God.'' The world, he told a 1997  conference of environmentalists…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…meta-analyses consistently demonstrate a positive relationship between  ESG integration and financial performance.''\n\nGAO itself has already examined this issue in the past and stated:  ``The vast majority, 88 percent, of the scenarios in studies we  reviewed . . . reported finding a neutral or positive relationship  between the use of ESG information in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…to find new markets and new  allies that are more reliable than the United States. America would get  better results on trade by buying spells from an Etsy witch.\n\nTrump's stated reason for blowing up commerce is fentanyl  trafficking. Now, I don't take a backseat to anybody when it comes to  cracking down on the scourge of fentanyl. Oregon is no stranger…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…downtown Los Angeles to maintain control of the situation.  This kept the situation contained to 10 blocks of the downtown area.\n\nBut even when the Los Angeles Chief of Police stated that the  demonstrations ``were nowhere near a level'' where the National Guard  was needed, President Trump disregarded his opinion and took the  escalatory action of deploying…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mrs. DINGELL. Mr. Speaker, I rise today to share my strong support  for H.R. 2290, the World War II Women's Memorial Location Act, which I,  as has been previously stated, introduced  alongside my good friend, the gentleman from Idaho (Mr. Fulcher).\n\nMr. Speaker, this bill authorizes The National Mall as the location  for the memorial, commemorating…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…2025, Reuters reported that U.S. Supreme Court Justice  Ketanji Brown Jackson addressed President Donald Trump's attacks on the  judiciary. The relevant part of the article stated as follows:\n\n1) ``U.S. Supreme Court Justice Ketanji Brown Jackson said on  Thursday attacks by Republican President Donald Trump and his allies on  judges were `not random'…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…loans, grants, benefits, or       contracts to use APA notice-and-comment procedures       notwithstanding the exemption (Richardson Waiver). The       Richardson Waiver further stated that APA's good cause       exception should be used sparingly, such as in emergencies       and for amendments covering minor technical matters. The       Richardson Waiver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…concerns that the proposed solution doesn't  get to the root of the problem. The underlying cause behind the IBLA's  delays is a lack of capacity and resources.\n\nThe Board has stated it does not have the resources needed to resolve  every appeal filed every fiscal year. Instead  of setting more deadlines that we know the IBLA can't meet, we should  be appropriately…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691036/expedited-appeals-review-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Americans voted by mail. Mail-in voting is  instrumental in helping our troops and making sure that every voice is  heard, even when they are overseas.\n\nPresident Trump has stated that he wants to ``lead a movement'' to  get rid of mail-in voting, and he posted this past week on social  media: ``No mail-in or `Early' Voting.'' He has assigned lawyers…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of dollars the  Venezuelan operation had cost us in the United States to date, I asked  where the unappropriated funds had come from. He rather dismissively  blew me off and stated: From the general accounts. Mr. Speaker, there  is no such thing. I asked that he identify the specific accounts at the  Department of Defense from which he diverted funds…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…He well knows that from my first months in the  Senate, I have taken this position, now, against four Presidents,  Democratic and Republicans.\n\nThe principles that have been stated on this floor about the  Constitution and War Powers Resolution are very,  very clear. Congress declares war. Once declared, the President is the  Commander in Chief. There…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…thousands of peaceful protesters that were exercising their  constitutional right to fight against fascism, their constitutionally  protected right to assemble, to free speech, and stated that he would  send in his Federal goons to Eugene.\n\nLet me tell you: Eugene, Oregon, has a long tradition of speaking  out, speaking out and showing up for peace. We will…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699509/we-will-not-back-down"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Mills for a Bronze Star, which  includes a signature from then-Army Brigade Commander Arnold N. Gordon- Bray;\n\nWhereas Retired Army Brigadier General Arnold N. Gordon-Bray has  stated he did not personally write, read, or sign the Department of the  Army Form 638 recommending Representative Cory Mills for a Bronze Star;\n\nWhereas five people who served with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "Ms. TENNEY. Mr. Speaker, had I been present, I would have voted YEA  on Roll Call No. 119.\n\nStated against:", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690841/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…woman to raise taxes. It must be the body of Congress.\n\nNow, this wasn't new. This was part of maybe a thousand-year  tradition from Magna Carta on. In Magna Carta, it is stated:\n\nNo taxation without the common counsel of the realm.\n\nEven at that time they were chafing at one man, the King, determining  the taxes for the land.\n\nOne hundred years before…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Americans and small businesses.\n\nIn fact, the Department of Energy estimates that these standards on  commercial refrigerators and freezers will cost approximately $8  billion, as stated earlier, which we know will be passed down to  consumers.\n\nWhen did the Department of Energy get into the appliance business?\n\nMr. Speaker, this is an easy ``yes'' vote. I…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689128/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Chair, had I been present, I would have  voted Aye on Roll Call No. 259.\n\nStated against:", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695210/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…have proven potential for  significant hydrocarbon reserves, but in doing so, the 2024 ROD ignored  explicit instructions put forth by Congress in the TCJA. Congress  clearly stated the Secretary ``shall establish and administer a  competitive oil and gas program for the leasing, development,  production, and transportation of oil and gas in and from the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Reclamation and Enforcement.\n\nIt considers appeals dealing with grazing, mining, energy  development, wildfire management, timber harvesting, trespass, and  more.\n\nThe IBLA's stated mission is: ``to provide an impartial forum within  the Department of the Interior for the fair resolution of disputes  involving public lands and natural resources under the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…complete with targeted redactions in an effort to smear President  Trump.\n\nFor example, former U.S. Attorney General Bill Barr, who oversaw the  2019 Epstein investigation, stated clearly under oath that the  prosecution team found no evidence that President Trump committed  wrongdoing.\n\nDespite this simple and straightforward fact, Ranking Member  Robert…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…term       `engineering performance-based standard' means an existing       engineering standard with respect to which the requirements       applicable to such standard are stated in terms of required       results, with criteria for verifying compliance rather than       specific composition, design, or procedure.\n\n``(6) Institution of higher education.--The…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…plan year 2024, our covert tests       included fictitious applicants       who provided invalid (i.e., never issued) Social Security       numbers (SSN). Additionally, we stated income at a level       eligible to obtain APTC. As appropriate, we used publicly       available information to construct our applications for       coverage and subsidies.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…1049.\n\nWe need greater transparency in American education. In recent years,  foreign governments have increasingly sought to influence our K-12  schools. It is not for their stated purpose of cultural exchanges or  diplomacy, but to push propaganda.\n\nThe Chinese Communist Party, for example, has spent untold sums  across hundreds of schools to indoctrinate…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…wish that I could say we have  received that kind of reassurance, but to date, we haven't. We haven't  had that assurance.\n\nTo be fair, the Secretary of State has recently stated that we are  not talking about military intervention, so much as seeking to  purchase. Again, in order to purchase something, you have to have a  willing buyer and a willing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Commission, and he  was an advisory member to the Tennessee Public Service Commission.\n\nBeyond his leadership, Reverend Middlebrook is a loving father to  three children, as was stated earlier, two of whom followed in his  footsteps to work in public service.\n\nReverend Middlebrook spent his life befriending and mentoring folks  in our community. Many friends…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…inflation not seen since Jimmy Carter was President  of the United States. The cumulative inflation from the time President  Biden took office until he left was 20.6 percent. Stated another way,  everything cost more than 20 percent more from the time President Biden  took office to the time he left. That is a huge cut in the standard of  living and a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…country towards membership in the European Union and NATO.       SEC. 4. STATEMENT OF POLICY.\n\nIt is the policy of the United States--\n\n(1) to support the constitutionally stated aspirations of       Georgia to become a member of the European Union and NATO,       which is made clear under Article 78 of the Constitution of       Georgia and is supported…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]