[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Orlando  Sentinel's Central Floridians of the Year, JJ Holmes and his mother,  Alison Holmes. Together, they are a force, not just in central Florida  but across the entire State and country.\n\nJJ has a severe disability, but he hasn't allowed that to stop him  from speaking out and advocating tirelessly for our disability  community.\n\nHis mother, Alison,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690733/recognizing-jj-holmes-and-alison-holmes"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…a political stunt to  distract from this administration's terrorization of hardworking  families and immigrant communities that are a huge reason why our city,  our State, and our country are great.\n\nFamilies across Los Angeles are living in fear because of this  administration's reckless and chaotic actions that are instilling more  fear, causing more…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692962/republicans-are-putting-forward-a-resolution-that-targets-los-angeles"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…we are seeing.\n\nOf course, we came out and protested. That is what democracy looks  like. Of course, our communities are terrified across Los Angeles,  across the State, and across the country.\n\nInstead of listening to us, the people from L.A., the President  escalated this drama, deploying the National Guard and the Marines to  Los Angeles without a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…biggest shipbuilding enterprise in the world. We have the Pentagon,  the largest military office in the world. We have been the site of more  battles on U.S. soil than any State in this country, in Virginia: the  Revolutionary War, the Civil War, the attack on 9/11 at the Pentagon.\n\nWe are as pro-military a State as there is, but I can tell you this:  Virginians…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…and her legacy will continue to guide and inspire generations to  come, I urge my colleagues to join me in celebrating her extraordinary  contributions to Washington State and to our country.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…critical in allowing the grid to endure  multiple heat waves this summer.\n\nThat is why Texas has added more solar and wind energy to their power  grid, more than any other State in the country, in the wake of their  horrific blackouts during Winter Storm Uri 4 years ago. That is because  solar energy helps keep the lights on.\n\nUnfortunately, Republicans seem…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…highly successful solution that has reduced  healthcare costs for the whole Nation or do we allow the clock to run  out and raise healthcare costs for families in every State in this  country?\n\nThat choice can still be made in the next 24 hours, in the next 2  days, to shorten and lessen the pain that will be felt by Americans.\n\nI choose to stand with working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…reckless  tariffs is going to be seen as one of the greatest economic blunders in  a century. It is that bad.\n\nWhat is happening in Vermont is happening in every State across this  country. First of all, these tariffs are a tax. Second, they are paid  for by consumers, by manufacturers, and by producers. Third, it is  having a negative impact on trade…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…Rockies, from the saltwater estuaries of the Croatan National  Forest in North Carolina to the towering Ponderosa Pines of the Santa  Fe National Forest in my home State, across the country, many people's  favorite hunting spots, their favorite hiking trails and biking routes,  ATV trails, and fishing streams are in these protected roadless areas.\n\nWhen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Trump's policy  would also impose unfunded mandates on States. According to the Rhode  Island secretary of state who is one of the most, I think, effective  secretaries of state in the country, the State government would need to  change its voter registration systems and forms. It may need to  purchase new voting machines and equipment, and it would need to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…live.\n\nAs a matter of fact, last November--just a few months ago--Virginia  voters proudly made history by electing the first Muslim woman to  statewide office in any State in our country. Ghazala Hashmi will be  sworn in as Lieutenant Governor of Virginia this coming Saturday. She  joins the growing number of Muslim Virginians that already serve across…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…interview. ``I have people approaching me       all the time in their 70s and 80s, and they're beside       themselves. They don't know what's coming.''\n\nKing's home state has the country's oldest population.       ``What they're doing now is unconscionable,'' he said.\n\nLeland Dudek, who became acting commissioner after he fed       data to Musk's team…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…two wars over the course  of 20 years, from 2001 to 2021. I was Governor of Virginia from 2006 to  2010. I was Lieutenant Governor of Virginia before that. Like every  State in this country, Virginia was deeply, deeply affected by the  global War on Terror.\n\nWhen I was Governor of Virginia, I had the honor and responsibility-- but it was also a burden--of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…earners in the country, so the billionaires.\n\nI don't think this tax increase is going to help the small business  owner I visited on Monday or the families in my State and across this  country who are trying to afford groceries. I intend to vote to end  those tariffs on Canada today when I have the opportunity. I hope my  colleagues will join me.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Americans who love this country, we need that strong, muscular  economic patriotism to serve my constituents in my district, which is  the Hudson Valley of New York State, and across this country.\n\nMr. Speaker, I rise today because I love this country. I believe it  is the greatest country in the history of the world. I believe it is  worth fighting for,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Nation in debt and deficits. Just this week, we  learned that for the sixth straight year, California leads the Nation  in outbound U-Haul rentals. The greatest State in the country has  become the most popular State to leave.\n\nThat, Mr. Speaker, is the true state of our State during this  Governor's tenure.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…policies, I was not serving my constituents.\n\nI very strongly disagree with that statement.\n\nThe fact is that we have a Governor whose policies have turned the  greatest State in the country into the most popular State to leave.\n\nWe have a Governor who believes that because he has a supermajority  in the legislature, he can run roughshod over the rights…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…landmass. We have more than half of the United States coastline, and it  is estimated that we have more undiscovered estimated natural gas and  oil resources than any other State in the country.\n\nWe have nearly every critical mineral on the critical minerals list  in Alaska. We have base metals, precious metals, and of course we have  rare earths in abundance.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…citizen whether it is in this  bill about vulnerability disclosure policy and Federal Government. I  will do it for rape victims not just in my district, but in my State  and in my country. I will do it because I care. I swore an oath to the  Constitution to serve my constituents, to serve my State, and to serve  my Nation every possible way that I can.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Maine and beyond to Rocky Mountain Terrain  Park and nearby Mt. Blue State Park.\n\nCarthage is also home to Newman Cemetery, a reminder of the  townspeople's service to the State and country. In this historic  cemetery, lie the remains of founding families, as well as veterans of  the Revolutionary War and Civil War.\n\nHiram Pitt Bennet was born in Carthage…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…credit that would go straight to their premium payment at the time it  is due.\n\nHurricane season won't wait on those who need flood insurance.  Americans in my State and across the country need relief now. If we  really want to put Americans first, we can start by making the National  Flood Insurance Program affordable now and keeping it affordable…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…forcing on them all of the concomitant increases in the prices of  the goods that they buy every day.\n\nLet me remind you, California already has the worst poverty of any  State in the country. Madam Speaker, this waiver would have made it  even worse. That is why I think it is entirely appropriate for us to be  considering this action today.\n\nAlso consider…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Dome. Tarky was so tenacious. Without his  advocacy, the dome would never have been built.\n\nTarky was a one-of-a-kind member of the Greatest Generation. He loved  our State and our country. He was a unifying force in the State  legislature, always bringing together members of both sides of the  aisle for dinners in the legacy of Reagan and O'Neill in…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…bill H.R.  909, the Crime Victims Fund Stabilization Act.\n\nThis bipartisan legislation will provide critical support to over 7  million crime victims throughout every State in this country, without  spending a single taxpayer dollar.\n\nMr. Speaker, across the United States, domestic violence shelters,  rape crisis centers, and child advocacy centers are…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…and this President are trying to implement.\n\nAgain, as a Federal prosecutor in my previous career, I saw how  illegal, unchecked immigration harmed every corner of my State and the  country. When you have an open flow of illegal immigration, crime  flourishes. It is hard to quantify the cost.\n\nAgain, with this bill, for any illegal immigrant to be under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…constituents whom I have would lose the right to be able to  choose me as their Representative.\n\nWhat is more, this is going to consume an inordinate amount of time  of State legislatures across the country, not to mention resources. It  is going to consume an inordinate amount of time for Representatives of  this body who are going to have to learn and get to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…call  to enact the sort of education reforms that have worked well in other  States because we are failing our students right now, and we are  imperiling our State and, increasingly, our country's future.                          California by the Numbers\n\nMr. KILEY of California. Mr. Speaker, there is no doubt that  affordability and the cost of living…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…window of opportunity for a bipartisan  agreement to bring this madness to an end.\n\nMr. Speaker, I have introduced H.R. 4889 to ban mid-decade  redistricting in every State in the country. I am calling on House  leadership to do the right thing and bring this bill to the floor for a  vote. Not only is it supported widely by Members in this body but a…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}]