[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…cooperation that we enjoy.\n\nI rise today in support of H.R. 250. The bipartisan legislation would  direct the Joint Committee on the Library, as Mr. Steil said, to  procure a statue of Benjamin Franklin for placement in the Capitol to  be observed by all those blessed to come and tour the United States  Capitol.\n\nAs my colleague and friend, the sponsor…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…equally and  endowed by the Creator with certain inalienable rights, among them  life, liberty, and the pursuit of happiness.\n\nI am proud that we would receive and have the Statue of Liberty. The  statue speaks to the world about who we are. It really symbolizes the  United States of America. It is an awesome piece of work that was  accorded the United…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…my colleagues from New Jersey and New York, I  introduced the Improving Helicopter Safety Act, which bans all  nonessential helicopter traffic within a 20-mile radius of the Statue  of Liberty.\n\nIt is clear that the helicopter industry is not a good actor or one  willing to proactively take measures to protect our communities. In the  wake of this most…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…``Tribal,'' ``Native American,''  ``immigrants,'' ``racial,'' ``Black,'' and ``women.''\n\nThey are not trying to erase all of our history. In fact, they have  restored a Confederate statue of General Albert Pike here in  Washington, D.C., and ordered a portrait of Robert E. Lee to be placed  in the Pentagon. These are men who committed treason against this  country…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Yes, we are proud in the city of Akron to honor the legacy of rubber  workers in my district. As the centerpiece of downtown Akron's Main  Street corridor, you can find a statue of a rubber factory worker  standing tall in commemoration of their contributions to our community  that is 200 years old this year. Unfortunately, a generation later, we…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…thank Ranking Member Morelle for  yielding.\n\nToday, I am so grateful to have the opportunity to rise and offer  this bipartisan legislation, H.R. 250, the Benjamin Franklin statue  placement act. It is so very important to highlight moments where we do  come together here in the body, and this bipartisan, bicameral  legislation is a bright moment of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…surveillance.\n\nOn this momentous occasion I send my congratulations to the Frank  family and the Nisqually Tribe. I look forward to once again honoring  Billy later this year when his statue will be unveiled to represent the  state of Washington in the U.S. Capitol's National Statuary Hall.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…those interests are not geopolitical  abstractions, they are real.''\n\nI was reminded of that during a visit to Kosovo a few years ago.  While standing at Secretary Albright's statue, an older man approached  to thank us for her leadership and for the U.S. role in ending the war  there. It was a clear reminder that when the United States stands with  people…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…for his own well-being, he fought German soldiers day and  night.\n\nHe was killed in action. He lies in rest at Zachary Taylor National  Cemetery in Louisville, and a bronze statue of Squires sits atop the  Kentucky Medal of Honor Memorial.\n\nSquires is one of just 3,538 Medal of Honor recipients in our  history. From all who have been awarded, for all…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…be  antiracist and that leadership must reflect the values of equity and  justice.\n\nToday, her legacy stands tall in Grand Rapids, both figuratively and  literally, with her statue near GRCC's campus.\n\nDr. Patricia Pulliam, Publisher: As an educator, Dr. Pulliam worked  tirelessly to uplift students in Grand Rapids, serving as an adviser,  mentor, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…extraordinary American hero that I had the great pleasure to know from  my home community in Ohio, Lieutenant Colonel Harold H. Brown. He was a  Tuskegee Airman, and this is the bronze statue that was cast in our  region as part of our Air Force museum, honoring his astounding life.\n\nHe was a warrior for justice on many fronts and an unwavering  patriot. He was…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…would give Representative Houlahan a big hug of gratitude for finally  recognizing him.\n\nMadam Speaker, I rise today in resolute support of H.R. 250, the  Benjamin Franklin statue placement act. Alongside my friend and  colleague from Pennsylvania, Congresswoman Houlahan, I am proud to  advance this effort to enshrine one of America's most extraordinary…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 250) to direct the Joint Committee on the Library to procure  a statue of Benjamin Franklin for placement in the Capitol.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 250\n\nBe…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…control services to meet the needs  of a growing community. His service to the community was so exemplary  that he was honored with the unveiling of the ``Jules the Turtle''  statue to celebrate his enduring community spirit.\n\nEven before his election as commissioner, Mr. Kwiatkowski was a  dedicated community servant. Upon moving to Florida, he volunteered…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…right to  vote and hold office in Utah, putting the State decades ahead of the  national curve, and then helped reestablish the right to vote when the  Nation caught up.\n\nHer statue now fittingly stands in Emancipation Hall and represents  Utah.\n\nLet's also be reminded of women like Sally Ride who in 1983 became  the first woman in space, defying conventional…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Doug game nicknames to everybody.\n\nMr. Speaker, I will point out the last thing about Doug is that he  loved his country. He knew that on the top the Capitol rotunda was a  statue called the Statue of Freedom. Doug served not only his people  but he served his God. He certainly loved both. In serving his country,  he understood he was serving freedom.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698668/protecting-healthcare-for-millions-of-americans"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…made possible entirely through Scout-raised funds  in 1960, mostly in the form of dimes. Those Scouts who sent in their  dimes have their names engraved at the base of that statue, reminding  us of the quiet strength and legacy of civic engagement.\n\nMadam Speaker, I, once again, encourage all my colleagues to join the  Congressional Scouting Caucus,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…him in his honor in the House Press       Gallery;\n\n[Whereas, in 2012, Congress passed and the President signed       Public Law 112-174, which directed Frederick Douglass' statue       placement in the Capitol Visitor Center's Emancipation Hall;       and\n\n[Whereas Douglass was a pioneer in journalism who broke       through glass ceilings throughout…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]