[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…God,  giving thanks, asking for protection over his wife and family and  asking for forgiveness. Determined to survive, he was able to hang onto  a piece of the bridge to stay afloat. He immediately started calling  for his coworkers, including his brother-in-law and his 18-year-old  nephew, who, unfortunately, lost their lives.\n\nThanks to a light on…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…banks with assets over $10 billion,  institutions that would remain highly profitable without these  predatory practices. These megabanks aren't using overdraft fees to  stay afloat.\n\nMr. FIELDS. Mr. Speaker, I thank the gentlewoman for the additional  time.\n\nThey are using them to pad their already substantial bottom lines at  the expense of working…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689851/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…costs of  essential goods. My farmers are struggling, as well as American  consumers. Healthcare costs are skyrocketing for millions. Critical  programs that help families stay afloat are under attack. The cuts in  Medicaid and the Affordable Care Act, as well as SNAP and other  programs, are taking their toll.\n\nTake healthcare as an example. The enhanced…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and groceries.\n\nStates will be stuck in a corner. They will cut benefits, cut  eligibility, or cut public safety, education, housing, and mental  health programs just to stay afloat.\n\nThis isn't just a budgeting decision. It is a values decision, and  for what? All to take from the hungry and give it to the wealthy. To  slash SNAP benefits just $6 per…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…country.\n\nMake no mistake, this agency isn't a luxury. It is a necessity. This  agency helps our veterans, our seniors, people with disabilities, and  families struggling to stay afloat.\n\nWhen I saw the harmful impact of this administration, I quickly took  action and hand-delivered a letter to Secretary Turner, signed by 122  Democratic colleagues demanding…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Protection Program imposed significant compliance  burdens on small businesses, but I believe we can all attest to the  fact that the PPP helped millions of small businesses stay afloat that  otherwise would have gone out of business. Clearly, the benefits of  those regulations at the time outweighed the costs.\n\nHad a regulatory budget been in place in…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…depend  on the cost of fertilizer, seed, and equipment.\n\nSmall business owners across the country depend on consumer  confidence in our economy so that they can keep sales and stay afloat.  Sharp increases propose a major threat to that economy.\n\nInflation and high costs are a threat to stability and prosperity of  American  businesses of all size, to our…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…especially in New Mexico. It is not just the cost of healthcare  that is going up, but our hospitals, clinics, and providers who are  struggling to make sure that they can stay afloat, especially after the  big, ugly bill gutted and promised to take $1.5 trillion out of the  public healthcare system.\n\nIt is why I have been working to champion bipartisan…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…renting are paying more than a  third of their income for housing.\n\nThese prices are going through the roof. American families, unless  they are billionaires, are struggling to stay afloat in this economy.  While President Trump and his family use the White House to haul in  billions of dollars to line their own pockets, people will not be able  to access…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Hard-working Americans are doing everything right. They are  working longer hours. They are budgeting carefully. They are raising  their families. And they are just trying to stay afloat, but they are  still falling behind. That is why we are here today.\n\nIn 2010, the Supreme Court handed down a decision that put a ``for  sale'' sign on our democracy. The…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Randall  for hosting this Special Order hour.\n\nMr. Speaker, I represent Phoenix, Glendale, and Guadalupe,  communities where families are working hard every single day to stay  afloat. Across this country, including throughout Arizona, millions of  families are struggling to afford basic healthcare. With costs rising  on everything that they need to live,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…impacted. The Federal Government took action to ensure  that an unprecedented amount of money flowed into small businesses in  the form of grants and loans in order to help them stay afloat.\n\nOver the course of 18 months, the SBA administered four major  programs, which delivered 22.1 million loans and $1.2 trillion in  grants. Although these loans did provide…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…depend  on the cost of fertilizer, seed, and equipment.\n\nSmall business owners across the country depend on consumer  confidence in our economy so that they can keep sales and stay afloat.  Sharp increases propose a major threat to that economy.\n\nInflation and high costs are a threat to stability and prosperity of  American  businesses of all size, to our…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…on Small Business.\n\nMr. Speaker, since assuming office, President Trump has been making  himself richer and richer, while working-class Americans are struggling  just to stay afloat.\n\nPresident Trump has earned $1.2 billion since he entered office. The  Trump family has been using the Office of the Presidency, and the way  that they are doing this is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…struggling to afford the basic necessities  in their life.\n\nH.J. Res. 142 would overturn this law and rip away the money that  parents and low-earning families could use to stay afloat in this  disastrous Trump economy. Today is just another day in Congress where  instead of being on the floor debating legislation on healthcare,  instead of debating legislation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…burdens can be especially tough on smaller businesses,  sometimes leading them to sell or shutter their operations. Those who  stay in business often have to raise prices to stay afloat. And whether  it is through higher utility bills or higher costs at the grocery store  or for other goods, it is the American people who ultimately bear the  cost of these…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…their neighbors. It isn't glamorous, but  it is essential, and they need commonsense policies like the ones in  the one big, beautiful bill to ensure their businesses can stay afloat  and that their families won't lose their inheritance because Uncle Sam  is trying to bankrupt them.\n\nIf Congress fails to get this bill across the finish line, the  average…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Carolina who  could no longer keep their doctor? We all know the answer to that, Mr.  Speaker.\n\nAcross the Nation, Federal workers are working two and three jobs  just to stay afloat, all so Democrats could champion illegal aliens who  exploit our compassion as they poison our communities with deadly  fentanyl.\n\nThat is not governing. That was extortion…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…cities with permanent SBA infrastructure. That is not  just wrong, quite frankly, it is insulting to every law-abiding  taxpayer and every small business owner struggling to stay afloat.  These offices have got to be moved.\n\nThis legislation is another example of House Republicans working to  codify President Trump's executive orders.\n\nIn March, SBA Administrator…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}]