[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Mr. JEFFRIES. Mr. Speaker, I thank the distinguished gentlewoman, the  top Democrat on the House Appropriations Committee, for yielding and  for her steadfast leadership on behalf of working families and  hardworking American taxpayers in the great State of Connecticut, and  all across America.\n\nMr. Speaker, I rise today in strong…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped out of this race for one reason and one reason only: his  family. We often hear in these hallowed Halls…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…President at all levels, as  well as two terms as National Sergeant of Arms--roles in which she  exemplified leadership, humility, and heartfelt service; and\n\nWhereas, her steadfast volunteerism, including at the Sandusky Ohio  Veterans Home, and her continued leadership as President of Ohio AMVETS  Charities and Secretary of her local Auxiliary, reflect…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…dedicated his  efforts to protecting the community's most vulnerable, serving as a  Court-Appointed Special Advocate and Guardian Ad Litem. In these roles,  he has been a steadfast voice for children in abuse and neglect cases,  offering critical guidance and advocacy. He has also provided  leadership to numerous community organizations, including TriCity…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…of  strength in the House of Representatives and a champion for the people  of Maryland for more than four decades. His patriotism, mastery of the  legislative process, and steadfast commitment to America's working  families have left an indelible, positive mark on our Nation.\n\nSteny has been a steady presence in our Caucus and the Democratic  leadership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…those who persecuted them. Patriarch  Bartholomew fits that definition precisely. Despite facing harassment  by foreign governments and attacks by extremists, he has remained  steadfast in his mission to promote reconciliation, environmental  stewardship, and human dignity.\n\nHis contributions have been recognized around the globe. In 1997, he  was awarded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…collaborated to cut through the red  tape surrounding professional licensing and keep Colorado one of the  best places to work. She is my colleague, my friend, a mother, and a  steadfast advocate for her community.\n\nRepresentative Bird has been serving the Westminster community for  decades, starting as a city council member, serving as board chair of  the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…including Y2K, the  tragedy of 9/11, the changes in Rochester's economy and iconic  businesses such as Kodak and Bausch + Lomb, and the local jazz festival  every year. A steadfast leader in journalism, he has continually upheld  the principle that every story matters.\n\nI have had the privilege of knowing Randy since my time in the New  York State Assembly,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, today I rise to honor Mr. Sangho Ko, Vice  President of the Dallas Taekwondo Association, for his steadfast  dedication to Taekwondo as a vehicle for cultural diplomacy and  community empowerment.\n\nMr. Ko has long championed Taekwondo not only as an athletic  discipline but as…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692626/recognizing-sangho-ko"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…stood right down there for 15 hours. I paced this room pledging  to you I wouldn't go to the bathroom. I wouldn't sit down. And I was  hurting after 15 hours, but you were steadfast until we finally got  Mitch McConnell to give us something. It was one or two votes. It was  two votes. Both of them failed; we didn't get 60. At least what we  forced this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…President Trump has let out of prison.\n\nThe threat to our democracy that we witnessed 5 years ago has not  lessened, and our obligations to be vigilant in its defense and  steadfast in our pursuit of a more perfect Union is as important as  ever.\n\nThe Constitution that binds this country together is a sacred  document that has guided our pursuit of perfection…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…which has strengthened oversight capacity through the use of data  science, artificial intelligence, and other emerging technologies.\n\nThroughout his career, Gene has been a steadfast defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee, including oversight of Impoundment Control Act  reviews. He also…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…honoring Colonel David ``Moon''  Halasi-Kun for his decades of service and sacrifice. We extend our  deepest gratitude to him, his wife Gretchen, and his son Luke for their  steadfast support throughout his career. His legacy will continue to  inspire future generations of airmen as the 104th transitions to its  next chapter with the arrival of the F-35s.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Waltham and married Ruth  Hills. Together they raised three daughters, Diane, Edie, and Cindy.  For many years, Johnson worked as a machinist at W.H. Nichols. Known  for his steadfast work ethic, he retired at age 90 from Meals on  Wheels.\n\nMr. Speaker, I am proud to recognize Freeman Johnson, and I ask that  my colleagues join me this Veterans Day in…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696706/recognizing-freeman-johnson"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…people are stronger when we invest in education and  workforce.\n\nThe change that Hebrew University has seen over the past century is  profound, in some ways miraculous. Your steadfast support has produced  this positive change, and that change continues today. You have my  fondest wishes for the celebration of the century, and I look forward  to what the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "Mr. CLOUD. Mr. Speaker, I rise today to honor Mr. Bill Matthys--a man  whose life reflects a steadfast commitment to education, public  service, and community.\n\nRaised in rural Wharton County, Mr. Matthys graduated from El Campo  High School in 1965, later earning degrees…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…defined by titles or accolades but  by the quiet power of their actions. They are distinguished by their  unwavering integrity, the strength of their character, and their  steadfast commitment to the people and places they serve. They are the  foundation upon which our communities stand--the ones who lift others  up, inspire hope, and, in doing so, call…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Middle East fails. We have a plan. We have a vision for success in the  region and now is not the time to take our foot off the gas pedal.\n\nHouse Republicans will remain steadfast in maintaining a strong  relationship with Israel to continue to ensure that freedom and  democracy endure.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…through the sacrifice of our heroes.\n\nThe American flag flies in red, white, and blue--each color rich with  meaning. Blue stands for vigilance and justice, a call to remain  steadfast in our values. White reflects our Nation's ideals and purity  of purpose. Red honors the valor and the blood shed by those who died  defending our rights.\n\nThis weekend,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691585/recognizing-the-service-of-those-who-gave-the-ultimate-sacrifice-memorial-day-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…numerous fundraising efforts that have uplifted Cass City. Even in the  face of personal health challenges, undergoing both a liver and kidney  transplant, Jim has remained steadfast in his commitment to serving  others. The overwhelming support he received during his health battles  was a testament to the lives he has touched though his generosity and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…veteran of the  United States Army and our distinguished Veteran of the Month for May  2025 from Michigan's 9th Congressional District. His exceptional  military career and steadfast commitment to innovation, leadership, and  mentorship embody the very best of American service.\n\nSergeant First Class Leidlein answered the call to serve his country  on…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Rotary International by promoting  peace, advancing education, and delivering vital services to the  community. Over the past five decades this organization has remained a  steadfast force for good in Eastern Sarpy County and beyond.\n\nThe club's service includes providing college scholarships to local  students, honoring outstanding educators, and awarding…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692687/recognizing-the-50th-anniversary-of-the-bellevue-papillion-rotary-club"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…States, and to the people of Turkiye. May the  friendship between our nations continue to grow stronger in the years  ahead, rooted in mutual respect, shared prosperity, and a steadfast  commitment to peace and security.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…safer. He represents the very best of public service.\n\nOn behalf of the people of South Carolina, I am proud to acknowledge  Dave McMahon for his decades of service, his steadfast leadership, and  the example he sets for all of those who follow in his path. As a  father, as a soldier, as a public servant and steadfast South  Carolinian, his story is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…families and civilians anxiously watching and waiting onshore.\n\nIn the face of disaster, the efforts of the D.C. Fire and EMS divers  were nothing short of heroic. Their steadfast presence and commitment  to vigorously search amidst the confusion and chaos was a source of  strength to a city, region, and Nation in mourning.\n\nThe divers of D.C. Fire…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690276/recognizing-the-heroism-of-the-district-of-columbia-fire-and-emergency-medical-services-department"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…thank my dear friend from Georgia (Mr.  Carter) for those kind words. I thank Chairman Guthrie, Gus Bilirakis,  Mr. Pallone, and, especially, Chairwoman Dingell for their steadfast  advocacy for these kids. I can't think of anything more important in my  22 years.\n\nAs chairman of the Childhood Cancer Caucus, I host a yearly childhood  cancer summit.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…servicemembers. It is long due for a change,  and I extend my personal gratitude to Mr. Tremelling for bringing this  critical matter to my attention, and I thank Chairman Bost for his  steadfast leadership and support.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 983.\n\nMr. Speaker, once again, we are seeing fear-mongering from the other  side…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…Mayor Bob Morgan as a positive and stabilizing influence  for the city, Doug has also served several years on the City of  Beatrice Community Redevelopment Authority.\n\nDoug's steadfast work ethic is a model of Nebraska devotion to a job  well done, and I certainly wish him a happy retirement.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…this church  has been more than a house of worship. It has been a place of hope,  healing, and community for thousands of families on the Mississippi  Gulf Coast.\n\nUnder the steadfast leadership of Bishop Jason Johnson and his wife,  First Lady Kim Johnson, Abundant Life has grown into a vibrant  congregation committed to spreading the Gospel of Christ…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…commitment to his beloved State of California as he  championed water rights and fought for the conservative values at the  very core of our American culture.\n\nDoug was a steadfast warrior for the country and State he loved. He  will be sorely missed. His faith, grit, and authenticity have inspired  us all. Rest assured, we will continue to carry on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}]