[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…denouncing authoritarian socialism,  they would start with the Trump administration. In less than 1 year,  the Trump administration has demanded U.S. companies like Intel, U.S.  Steel, MP Materials, Lithium Americas, and Trilogy Metals to hand over  stock to the U.S. Government. These are capitalist companies who are  doing business that they claim this…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…world. You have probably seen the pictures of him being caught and  beaten by the mob, which that day was wielding Confederate battle  flags, American flags, baseball bats, steel pipes, broken furniture,  you name it, to attack our officers.\n\nThese people gave blood, sweat, and tears. Several officers died in  the aftermath, including Officer Brian…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, today what a privilege it is to join with a  dear dozen Members from across the Congressional Labor Caucus and  Congressional Steel Caucus to address the devastating harm the Trump  administration and DOGE have exacted on people, our communities, the  cost of living, and job losses across our Nation.\n\nJob…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spiderweb of tyranny led by  Russia, China, North Korea, and Iran, all of them acting against  liberty around the world.\n\nXi said that Russia and China should be friends of steel. He said  that they would deepen relationships in all areas, including military  ties, and strengthen coordination in order to decisively counter  Washington's course of dual…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…percent stake in Intel, a 15 percent stake in  MP Materials, a 10 percent stake in Lithium Americas, and a 10 percent  stake in Trilogy Metals, and we have a golden share in U.S. Steel-- state control of the means of production.\n\nMr. HIMES. If the definition of socialism is political control over  the means of production, welcome to the great socialist state…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in red States and blue States. The construction of the first American- made offshore wind vessel provided hundreds of jobs. Where? In  Louisiana, Florida, and Mississippi. Steel for the project was sourced  in Texas, Alabama, North Carolina, and West Virginia. Offshore wind  components were sourced and manufactured in Kansas and South Carolina.\n\nJust…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the firms that employ them. If not wisely  applied, jobs hang in the balance on both sides of our border between  the United States and Canada.\n\nA part in a car or truck, in a steel mill, all of this that happens  in our area can cross over the border six times. Is it going to be a 10  percent tariff put on every time it crosses the border? This is crazy.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…housing. Due to Trump's tariff taxes,  the price of construction materials, appliances, and furniture have  skyrocketed, gone through the roof. When you raise the cost of lumber,  steel, and other materials builders rely on to build new homes, you  slow down construction. And when supply can't keep up with demand,  prices go up. That is not just ideology;…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…create confusion,  hesitation, and uncertainty, not just in hydrogen production, but also  the challenges for our auto industry to grow and for the outsourcing of  American steel production and our national security to the highest  foreign bidder.\n\nMr. Speaker, the loss of American manufacturing jobs is a direct  result of the administration's failed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…for it, listen to the National Association of Home  Builders, a staunch Republican organization that has warned this  administration that putting tariffs on everything from steel to copper  and nickel is going to drive up the price of home construction.\n\nIn fact, screws and nails, made from steel, are already showing huge  increases. They have already…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…remain completely silent on the Trump  administration policies that are currently negatively impacting the  electric supply chain.\n\nLet's look at Trump's disastrous tariffs on steel and aluminum. These  materials are essential components in our electric infrastructure from  power lines to transformers. Slapping a hefty tariff on steel and  aluminum only…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…highest unemployment rates while families are  struggling with rising costs.\n\nMr. Trump promised that tariffs would protect our jobs. Instead, they  have driven up the cost of steel, aluminum, and auto parts while plants  close and workers are left behind. When a plant shuts down in Detroit  or Wayne County, it doesn't just hurt the workers inside of it.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695795/real-solutions-for-manufacturing-in-michigan"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…now, about this  budget, they can't handle it.\n\nTariffs, as I noted, can be an important tool for countering other  countries' unfair trade practices. I supported some of the steel  tariffs that were more narrow from the former Trump administration and  the Obama administration and the Biden administration in order to make  sure that our iron ore--very…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…They divert resources from their most       efficient use, while making it more difficult and expensive       for U.S. businesses to access inputs and capital goods, like       steel and machinery for manufacturers and fertilizer and       agricultural equipment for farmers.\n\nAdditionally, by increasing production costs for       domestically made products…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Transportation Safety Board and directs the Department of  Transportation to study and generate best practices for inspecting and  addressing corrosion on bridges made of weathering steel.\n\nIn July 2021, the House passed Section 2 of the ``Bridge Corrosion  Prevention and Repair Act'' as Section 1116 of former Chairman Peter A.  DeFazio's (D-OR) ``Investing…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…volumes to the type of man he is. He served as counselor to  then-United States Trade Representative Bob Lighthizer and helped  implement the historic USMCA. William defended our steel and aluminum  industries and worked tirelessly to ensure that America's trade policy  put our workers, farmers, and manufacturers first--and not the other  way around. While…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mining for 145 years. We mined the iron ore that won us two world wars  and currently mine the taconite that is used to make 80 percent of this  country's domestically produced steel.\n\nBefore Biden's mining ban, we had the opportunity to mine the copper,  nickel, cobalt, and other critical minerals that are necessary for this  country to compete and win…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…global leader in smart and sustainable mobility, has opened  its new, cutting-edge plant 4 facility in Hornell, New York.\n\nThis 135,000-square-foot expansion brings stainless steel railcar  body production back to the United States, strengthening our domestic  supply chain, and reaffirming Hornell's position as the Nation's  premier center for passenger…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…by a previous  protester down the street by a car.\n\nI read a minute ago about the ICE officer who was lacerated across  his face when one of these thugs attacked him with a steel coffee mug.  I talked about another guy that had this cord wrapped around his neck,  and they tried to get him. One of these guys did that to an ICE  officer.\n\nWhere is the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Commonwealth, for Pennsylvania, and for  America.\n\nUnder the Trump administration, we have already seen historic  investments in the Pennsylvania economy, including the Nippon and U.S.  Steel merger and Amazon's $20 billion investment in building data  centers in the Commonwealth.\n\nNow is the time to build on this momentum to ensure that Pennsylvania  is the hub…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "James Risch", "party": "Republican", "sentence": "…explosives which are optimized for       effectiveness against large area and imprecisely located       targets. The M404 Unitary variant is a 200 pound class       Unitary with a steel blast fragmentation case designed for       low collateral damage against point targets. The ER GMLRS       maintains the accuracy and effectiveness demonstrated by the…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  Goodhart Sons Inc. on their 90th anniversary. Goodhart Sons Inc. is a  steel fabricator and installer based in Lancaster, Pennsylvania. Their  history began in 1935 when Frank G. Goodhart purchased the two-man  sheet metal shop that he was once an apprentice…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695929/congratulating-goodhart-sons-inc-on-their-90th-anniversary"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…importing foreign students if you won't even  deport the dangerous illegal aliens on your streets.\n\nWe are at a crossroads. We can surrender our country to mass  migration or we can steel our spines, plant our feet, and fight to  defend our home. I have made my choice. I urge my colleagues to make  theirs.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of grain, livestock, meat, and  poultry. The United States imported $97 billion worth of oil and gas  from Canada last year. Canada is a major provider of cars, car parts,  steel, lumber, aluminum.\n\nThis amount of trading demonstrates that no American will be able to  avoid the high taxes, the high prices. They will be forced to pay  because of tariffs.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and the best environmental standards in the world. We have been mining  in Minnesota for 145 years. We have mined the iron ore that makes over  80 percent of this Nation's steel.\n\nThe cleanest water in the State of Minnesota, Mr. Speaker, is in the  heart of mining country in Buhl, Minnesota. We know how to do it.\n\nLet's stop exporting our environmental…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…operations.\n\nIn 2023, we had a BIG Idea team from the University of Utah that won  first place overall as the Artemis Award  Winner with their development of the ``Production of Steel from Lunar  Regolith through Carbonyl Iron Refining'' project.\n\nAs the space industry continues to grow and evolve, Utah is at the  heart of it all, leading through ingenuity,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…make to Americans; forcing U.S.  companies to hand over proprietary technology in order to gain access  to China's market; aggressively subsidizing important industries, like  steel, where they flooded global markets and destroyed the American  heartland; blocking U.S. exports from having fair and reciprocal access  to China's market; and unleashing economic…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Rose", "party": "Republican", "sentence": "…home.'' That is because Federal law has forced us to adhere to  a permanent chassis requirement. Since 1974, manufactured homes have  had to be built on a permanently installed steel chassis, even after  the home is placed on a site, never to be moved again.\n\nThis bill will give millions of Americans a path to homeownership  without going over budget. It…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…do not protect public  health and the environment or to write rules that have no public health  benefits.\n\nThe EPA has announced it will reconsider the integrated iron and  steel NESHAP, the coke ovens NESHAP, the lime manufacturing NESHAP, and  many other NESHAPs promulgated under the same legal authority. I  applaud EPA Administrator Zeldin for his…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692022/hj-res-61"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…horrible  Governors who want to ignore our laws. They want to fundamentally  change America, but our President, whoever that President is, has to  have the courage and the moral steel to stand up to these people and  remove people who don't belong here.\n\nAnybody who feels guilty about that, again, I remind you: 800,000  people a year, almost all what liberals…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}]