[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…interests can be served by connecting the U.S. and the African  Continent with undersea cable infrastructure by way of the U.S. Virgin  Islands.\n\nThis bill is an important step to enhance American communications  security and competitiveness around the world.\n\nIn recent years, Mr. Speaker, the United States and many allies have  recognized the threat…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…to pull from that  allows the licensee to fund these processes, but new projects are  completely sourced by the developers.\n\nThis commonsense, bipartisan bill takes the first step by enhancing  transparency and tracking progress on any given licensing process for  all parties involved.\n\nI look forward to continuing to work with my colleagues on  comprehensive,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…capital markets by  funding businesses and industries in geographies often overlooked by  other financial institutions. BDCs are often the first institutional  investors to step in.\n\nThis bill will play an important role in getting BDCs the capital  that they then put into small- and medium-sized businesses.  Calculations are that $120 billion more…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1765, the Promoting United  States Wireless Leadership Act. This legislation is an important step  toward ensuring that the Nation and global bodies crafting standards  for next-generation wireless technologies, such as 6G and Wi-Fi 8,  include significant representation…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nLilith has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Lilith, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691136/recognizing-lilith-roberts-ruiz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nKloey has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Kloey, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691929/recognizing-kloey-kehl"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…CDFI Fund at the current level, and we made sure  it would be adequately staffed so Trump can't try to sabotage that work  with mass firings again.\n\nWe also took an important step to prevent Washington, DC, from not  being able to spend its own taxpayer dollars again after House  Republicans completely shortchanged our Capital last year.\n\nThe Defense…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nDanovin has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Danovin, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689693/recognizing-danovin-barscocchini"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…in  Xinjiang. The administration's opposition to Uyghur resettlement in the  United States is hypocritical at best and morally reprehensible at  worst.\n\nThis bill is a good step for Congress to take, but President Trump is  squandering American leadership and taking us backward.\n\nMr. Speaker, H.R. 1724 calls on the State Department and USAID to  verify…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690653/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAbel has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Abel, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689700/recognizing-abel-harris"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Inauguration Day. They led multiple walkthroughs with principals and  senior staff and pivoted seamlessly when the ceremonies moved indoors.  Not only did they rehearse every step for every guest, but they also  made sure to document it in ``PILLARS''--the Presidential Inauguration  Line-by-Line and Relevant Seating application developed by the expert…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…things done. This victory wouldn't have happened if it  weren't for the advocacy of people at all levels, all across the  country, making their voices heard. It is a monumental step toward  restoring the moral standing of the United States abroad and saving  countless lives.\n\nWhile I am very glad that this program is restored, that Edesia is up  and running…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nNathan has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Nathan, develop crucial skills and a  work ethic that will guide them for the rest of their lives.  This award…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691983/recognizing-nathan-angel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nPerla has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Perla, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690318/recognizing-perla-lopez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlexis has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alexis, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690022/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…value.\n\nCritics argue that some government contracts canceled by DOGE haven't  led to immediate savings. Isn't canceling wasteful government spending  before it can be renewed a step in the right direction?\n\nShouldn't we be cleaning house rather than just accepting bad deals  because they are already in motion?\n\nLet's put it in terms we can all understand:…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with neighbors helping neighbors.\n\nThese few examples remind us that acts of service have a profound  impact, strengthening the fabric of our society and inspiring others to  step forward.\n\nVolunteering doesn't just help those whom we serve, it enriches our  own lives. Studies show that service fosters personal growth, reduces  stress, and even enhances…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…have answered the call, not for accolades or attention, but  out of a deep and abiding duty to protect their neighbors.\n\nThis is a department that doesn't just show up, they step up. Whether  it is a fire within their own town or a neighboring community in need,  Kennedy's volunteers have never hesitated to offer support through  mutual aid. When disaster…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…government and Chinese political officials' culpability does not  end when their precursor products land in Mexico or illegally cross our  southern border. We must look at every step of fentanyl's deadly supply  chain and hold our adversaries accountable.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…my colleagues on this side who have  advocated for the bill. I would like to back up a bit and talk more  generally about regulatory burden and how this bill is an important  step in dealing with a much larger problem.\n\nThe chart on my right shows the number of pages in the Federal  Register. The year I was born, 1968, there were about 50,000 pages.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…criminals. The VSAFE Act should strengthen the accountability, improve  prevention, and give veterans the support and protection they deserve.\n\nThis bill takes an important step toward safeguarding veterans and  strengthening trust in the VA system, and I am proud to support it.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nSomeday, I would…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…board with the  SAVE America Act. The House will pass it shortly. We can get this done  today and deliver for the American people.\n\nPassing the SAVE America Act is an essential step to our democracy,  ensuring free and fair elections nationwide. We must get it done.\n\n1383; further, that the Senate concur in  the House amendment, and that the motion to reconsider…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…affordability to the American people and the U.S.  workforce.\n\nThe American taxpayer needs our help now more than ever to get our  economy back on track, and this bill will be one small step in making  that dream a reality.\n\nMr. Speaker, I thank the chairman for his support on H.R. 2270.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Clinch River site, which should soon be home to the  Nation's first small modular reactor. And taking advantage of this  opportunity, the Tennessee Valley Authority has got to step up, and  they have to lead the way.\n\nThis week, the Senate is set to confirm four of the President's  nominees to serve on TVA's Board of Directors and ensure that Tennessee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recognize the  leadership of Dr. Cam Patterson, our former chancellor of the  University of Arkansas for Medical Sciences.\n\nLast year, Dr. Patterson announced his decision to step down from his  leadership position after 7 years of focused, dedicated service to the  university, the medical school, and the people of Arkansas.\n\nUnder his leadership, UAMS…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to actually govern in the interests of the  country and to fulfill the promise of representative government.\n\nI am hopeful that the legislation I have offered can be a first step  in saying we need to find more common ground. We need to get back to  the issues that actually matter to the American people.\n\nMr. Speaker, one of the worst consequences of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…That is the choice.\n\nCongress squanders hundreds of billions of dollars annually on  destructive subsidies and useless grants like these. Let us finally  take this first, small step toward the solvency of our Nation, relief  for our people, and redemption for our Congress.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693724/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…recruiting events, I knew  something had to be done.\n\nOur Medal of Honor heroes deserve better, which is exactly why this  critical legislation is needed. While this bill is a small step  forward, it is the very least that Congress can do to recognize and  show support for these selfless, courageous heroes.\n\nMr. Speaker, I urge all of my colleagues on both sides…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…having  overstayed his visa. Instead of turning over this illegal alien to ICE  and law enforcement, Colorado lawmakers gave him a sanctuary pass. In  fact, they even went a step further and gave this terrorist a driver's  license.\n\nI am proud to be from El Paso County, a county in Colorado that  stands for commonsense immigration policies and a community…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…the American people to know that it is their money to spend  on illegal aliens' free college tuition, putting it on the backs of the  everyday working man.\n\nThis is the first step in a long journey of what we are voting on  today. From the very first day I set foot in this Chamber, I have  always promised my constituents that I would do everything within…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]