[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…moving us in the right direction. Does it stop all those  bad things that President Trump and Pete Hegseth are doing right now?  No. But it really couldn't. It is a step in the right direction toward  reasserting the authority of Congress, which is but one step along a  very long road, I will grant you, to try to get some restraint on the  lack of transparency,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…expressed support to fund that effort.\n\nUnfortunately, progress has been slow despite strong interest from  Senators of both parties. So today's resolution is a step in the right  direction.  And the majority leader's statements about the further progress we need  to make soon were very important--because, on its own, today's action  is not nearly enough.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…defense purchases via  greater direct commercial sales from U.S. firms. While these steps need  to be taken carefully, the review required by this bill is a smart step  in the right direction which I support.\n\nThis legislation provides a useful directive while maintaining  congressional prerogatives and oversight over armed sales. I hope that  all of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…law, which provided $2.5 billion of investment in port infrastructure.\n\nWe all now understand the importance of a strong resilient supply  chain, and this bill is a step in the right direction.\n\nI look forward to working with my colleagues to ensure robust funding  for the maritime industry. For this reason, I will vote ``yes'' on H.R.  252.\n\nMr. CARBAJAL.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…reversing  pointless tariffs. We did that when we passed Senator Kaine's bill to  end the tariffs on Canada. Today, the Senate can take another powerful  step--a powerful step in the right direction--by voting to repeal the  global tariffs on a bipartisan basis.\n\nI would just close by saying: Listen to your constituents. Listen to  what you are hearing from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…that slashes clean energy incentives and  raises prices, I am grateful to find consensus around safeguarding  water for our communities.\n\nThis amendment is one small step in the right direction. I will not  stop fighting to protect water, to protect our children's future, and  to protect our planet.\n\nMr. Chair, I urge the adoption of this amendment en bloc.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694860/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Congress, address the issue at the  border and let us, as Members of Congress, better respond to the  challenges.\n\nMr. Speaker, I believe this bill is an important step in the right  direction. Receiving information from the Department of Homeland  Security on an annual basis will improve Congress' efforts to counter  illicit cross-border tunnels and hold…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688706/subterranean-border-defense-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…convincing in their deceit thanks to emerging technologies like  artificial intelligence, the time to create informed and resourced  tools is now.\n\nH.R. 1663 marks a step in the right direction, but I urge my  congressional colleagues to do more to help protect our Nation's  veterans against these scams.\n\nIn response to the chairman, let me just say that…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…trading crypto assets, transacting in goods and services, insulating  against local currency instability, and sending payments across  borders. While S. 1582 is a step in the right direction, it fails to  establish an effective federal framework to regulate stablecoins. The  bill also opens up a path for Big Tech and other commercial businesses  like…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…foreign nationals who want to contribute to U.S. elections.  This way, we can all have faith that only Americans are contributing to  our campaigns.\n\nFor now, this is a step in the right direction as we all work toward  the larger goal of overturning Citizens United.\n\nI hear from a lot of constituents about what is the disconnect  between Washington's policies…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…need  to ensure proper staffing at the SBA to review the 1,892 active SVOG  awards totaling over $3.2 billion.\n\nMr. Speaker, with that said, this legislation is a step in the right  direction. I commend Mr. Downing and Mr. Conaway for leading this  effort. We need to make sure that no one gets away with fraud simply  because the clock ran out.\n\nMr. CISNEROS.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697226/sba-fraud-enforcement-extension-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…career services to wildfire survivors.\n\nI am grateful to the Department of Labor for awarding Hawaii $2.5  million in dislocated worker grant funding. While this is a step in the  right direction, the livelihoods of displaced workers, the health of  our local economy, and the long-term trajectory of Maui's recovery  remain in the balance.\n\nWe must continue…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…must continue to fight for military  aviators and countless others who have been exposed to a litany of  toxins and hazards during their service.\n\nThe ACES Act is a step in the right direction. It is not the fix-all.  It is not the end of the journey. It is a start of one, just like the  Honoring our PACT Act was.\n\nI will say that I am heartened by the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the pain and grief.\n\nMr. Speaker, I thank all of those who have worked tirelessly to bring  this issue to the attention of Congress. The ACES Act is definitely a  step in the right direction. It is not a fix-all, but it will give  affected veterans a fighting chance. In the near future, I hope we can  do the same for so many other worthwhile populations,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…they are located and no matter who owns them, small  businesses are the backbone of our economy. They should be and are a  bipartisan priority, and this bill is a step in the right direction.\n\nWith the understanding that we will be able to deal with the other  bills that are scheduled to come before us even after a short recess, I  urge a ``yes'' vote…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…understandable terms. We need to make it easier and not harder for  individuals to plan for retirement in this country.\n\nThe Claiming Age Clarity Act is a positive step in the right  direction. Representatives Smucker and Beyer are to be commended for  forging this bipartisan consensus on a policy that will improve  retirement security and ensure the bureaucracy…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…excellence  through hard work and training.\n\nLike many others, I welcomed President Trump's executive order  earlier this year, keeping men out of women's sports, as a step in the  right direction. However, in Washington State, the law still requires  schools to allow participation in sports based on gender identity, not  biological sex. That violates Title…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692397/recognizing-lauren-matthew-of-west-valley-high-school-state-champion"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…victory  for the pro-life movement. This decision rightfully reaffirmed that  ending the life of an unborn child is not a constitutional right. While  this was a step in the right direction, there is still much to be done  to protect the lives of our Nation's most innocent.\n\nModern science objectively proves that new, distinct human life  begins at…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…prioritizing American  jobs, economic strength, and practical solutions. S.J. Res. 31, like  other measures undoing ill-advised Biden-era policies, represents a  decisive step in the right direction.\n\nLet's get back to smart, forward-thinking policies that actually  serve the American people, not far left activists and D.C. bureaucrats.\n\nMr. Speaker, I urge…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…employees.\n\nOf course, for some families, these credits seem like a drop in the  bucket compared to the cost of raising a family, but I hope these small  steps are a step in the right direction toward making family life more  affordable, which we must do.\n\nAnother area my colleagues and I have been discussing on both sides  of the aisle, which is a real…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…solutions to boost  productivity and improve project outcomes, the Federal Government must  do the same or risk being left behind.\n\nThe ePermit Act takes a strong step in the right direction by  modernizing Federal permitting technology in a project-agnostic manner.\n\nAgain, I thank my colleagues, Representatives Johnson and Peters, for  this commonsense…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "John James", "party": "Republican", "sentence": "…decreases  our dependence on adversaries and leverages American ingenuity. It is  crucial for our economic and national security.\n\nPromoting resilient supply chains is a step in the right direction.  This legislation specifically will create a supply chain resiliency  program to identify and address gaps in critical industries and  emerging technologies, establish…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…of competition, this resolution cuts burdensome  red tape and allows banks to get back to what they do best: serving  customers and serving communities. This is a step in the right  direction.\n\nMr. Speaker, comments were made earlier on the other side about the  big, beautiful bill that we are going to be passing hopefully this  week. This is another…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and a mistake.\n\nI will tell you, Mr. Speaker, that it is true that the bill, the  SCORE Act, does not solve all the ills that some may see out there, but  it is a step in the right direction. That is why in my opening I said  that this was a first step but not the last step in trying to solve  problems that we have in our college athletics.\n\nIt is true…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Uzbekistan because of his links to a terrorist  organization.\n\nNeedless to say, seeing ICE and State law enforcement come together  to make America's roads safer is a step in the right direction.  Republicans in the Senate and this administration remain committed to  protecting American lives and keeping our roads safe. One key to do  that is to ensure CDL…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…hope my colleagues  across the aisle will help to vote to empower pregnant students and  support this vital life-affirming legislation.\n\nMr. Speaker, this bill is a step in the right direction to creating a  culture of life in our society and a step that we must take as we  continue to pursue policies that help our families to grow and thrive  from Iowa…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "John James", "party": "Republican", "sentence": "…people are tired of Democrats and Republicans  bickering. I imagine both Democrats and Republicans agree on fentanyl  and any direction on fixing this scourge is a step in the right  direction.\n\nMr. Chair, with this bipartisan legislation and action that we are  taking to save lives, I encourage all of my colleagues to support this  crucial legislation.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…actually follow the law.\n\nWhat happens? Well, it often depletes the public resources meant for  U.S. citizens.\n\nMoving SBA offices into nonsanctuary jurisdictions is a step in the  right direction.\n\nLet me be clear, Mr. Speaker. The Federal Government should not  reward sanctuary cities with permanent SBA infrastructure. That is not  just wrong, quite frankly,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…use  disorder.\n\nMeanwhile, access to mental health support remains limited,  especially in key military regions. Recognizing the need to address  this reality is a step in the right direction, but we can and must do  more to equip our military personnel to continue being the finest  fighting force in the history of the world.\n\nMy amendment will provide…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…traffic infants abroad.  Most of the developed world has already banned international commercial  surrogacy due to the trafficking risks, and this bill is a strong step  in the right direction to prevent bad-faith actors from taking  advantage of U.S. surrogate mothers and the children they bear.\n\nI am proud to champion legislation that directly benefits…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}]