[{"senator": "Dave Min", "party": "Democrat", "sentence": "…for the top holders  of his coin.\n\nThe level of corruption right now is breathtaking. It is  unprecedented. Unfortunately, he is not going to stop because Congress  is not stepping up to enforce our rights. We are not stepping up to do  the oversight that is required of us.\n\nAs the Romans used to say, who watches the watchmen? When there are  no guardrails…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…telling U.S. personnel to avoid speaking publicly about how elections  are run overseas only make it harder to call out abuses when they  occur. The United States should not be stepping back; we should be  stepping up.\n\nFew leaders understood these stakes more clearly than Madeleine  Albright. At her confirmation hearing for Secretary of State, she said,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…as all of the laws and Constitutional provisions that he  and every other member of DOGE has done. This is the time to do it. I  would urge my colleagues to actually start stepping up for the  Constitution.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…reflects the very best of Delaware: commitment to  neighbors, courage under pressure, and a heart for giving back.\n\nMr. Speaker, I congratulate Chief Stephens and thank him for stepping  up, once again, this time to lead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…rent, with  families barely able to afford the cost of groceries, to say nothing of  the skyrocketing healthcare costs. But now, instead of putting  Americans first, we are stepping into a foreign nation and promising to  run it for the foreseeable future. An administration that had promised  to end foreign wars has begun a new one. A President who had…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…combat extreme heat and the greater climate crisis.\n\nWithout a robust Federal heat response, we put countless lives and  billions of dollars at risk. The Extreme Heat Caucus is stepping up to  change that. We are championing smart, bipartisan actions to combat  extreme heat.\n\nAs a former mayor of Phoenix, I have been focused on heat policy that  starts local,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…children out of school, leaves small farmers without  tools, wipes out access to clean water, and cuts off contraception for  women and girls.\n\nMeanwhile, our adversaries are stepping in. China and Russia are  seizing influence as we retreat. This bill cedes Congress' power of the  purse giving one man the authority to cancel funds we have already  approved.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…demonstration to defend and remind us about  the rights of the LGBTQ community.\n\nWith encouragement from their parents, Amy and Kevin, Bryce is  furthering our democracy by stepping up and speaking up. As Bryce said:  ``We will be loud. We will be proud--for our rights, for our families,  and for our LGBTQ community.''\n\nMr. Speaker, the actions of Bryce…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690886/commending-leadership-of-bryce-grossman"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…unless it is also anchored in  accountability. Yet, as it stands, Federal judges facing serious  misconduct allegations can stop an investigation in its tracks by  simply stepping down from the bench. This loophole not only undermines  public trust but leaves serious questions unanswered about conduct  unexamined.\n\nMy legislation, the TRUST Act, would…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692556/accountability-for-judiciary-investigations"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…over the summer. All of them told me that that is going to be a big  issue.\n\nWe need to continue to address food insecurity in America, and I  thank those organizations for stepping up when we needed them most.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…where  classified information was shared in a way that it should not be  shared, and there should be no disagreement on that. We didn't exercise  oversight on that either, so stepping aside from all of these issues,  simply letting the President do what he wants to do.\n\nThen, internationally, the last point, this attack on that boat down  in the Caribbean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…disasters.\n\nOur office continues to receive urgent calls from       constituents seeking referrals and emergency financial       assistance. The silver lining is that neighbors are stepping       in to help one another with assistance for rent, food, and       basic necessities, even while community organizations and       faith groups are stretched beyond capacity…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…government--is demanded by  our democracy.\n\nWhen you have a President that so flagrantly violates the checks and  balances--so much so that the authorities today kept a Senator from  stepping forward and asking questions to an executive official and is  met by violence--this is exactly the time that our Founders saw that we  must stand up and speak up and protest…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…This story from The Washington Post is dated June 9, 2025. It reads as  follows. This is the style of the story. It reads: ``California  Governor Gavin Newsom says Trump is stepping toward authoritarianism.''\n\nAn excerpt from the actual story reads: California Governor Gavin  Newsom should be arrested.\n\nThis is something that President Trump said.\n\nThis…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…chance to keep stringing along American negotiators, to continue to  play President Trump as he is trying to secure a Ukraine peace deal,  but across the globe, China is stepping in everywhere the United States  is retreating.\n\nAfter the earthquake in Myanmar, the Chinese Embassy flooded social  media with images of Chinese rescue workers responding…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…strength,  service, and resilience.\n\nIn 1943, during the Second World War, Marjorie became one of the  original ``Rosies,'' embodying the spirit of Rosie the Riveter and  stepping up to support her Nation on the home front. Immediately after  her high school graduation, Marjorie volunteered at the Chevrolet plant  near her home in Flint, Michigan, where…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the home front. While many Americans recognize the  image of Rosie the Riveter, their work went far beyond the factory  floor. My grandmother served as a Rosie the Riveter, stepping up to  fight on the home front, as well. Women became welders, code breakers,  pilots, medical professionals, truck drivers, and community caretakers.  Their contributions…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…finding. Among Americans who initially  said they would support a U.S. withdrawal from NATO, nearly one in five  changed their mind when they learned how our European allies are  stepping up their commitments to collective defense.\n\nI am happy to provide these findings to anyone in Washington who  still bets against the future of the transatlantic alliance,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…opinion, America needs to lead the world, and that is what we are  doing today. Instead of the world absolutely leading us, we are doing  what the world wants us to do. We are stepping up. We are leading the  world.\n\nAgain, I want to thank Senator Tuberville in every way. And to my  Democratic colleagues that I respect more than you know in all ways-- and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Dr.  William Clark, who is stepping down as chair of the Okefenokee Swamp  Park Board of Trustees after 15 years of hard work and dedicated  service.\n\nSince 2010, Dr. Clark has advanced the mission of Okefenokee…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…discipline,  and real opportunities to grow.\n\nThat's why I want to recognize two Utah businesses--Gateway Parks in  Spanish Fork and Barn Elite Training in Mapleton--that are stepping up  where too many institutions have failed.\n\nGateway Parks is making winter sports accessible to kids who might  never get the chance, teaching them confidence, grit, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…commodity  price is below the actual cost to extract it. The ripple effects are  still being felt throughout my district.\n\nThis is why Montana's congressional delegation is stepping up. I  stand shoulder to shoulder with Congressman Zinke and Senators Daines  and Sheehy. We introduced the Stop Russian Market Manipulation Act.  This bans imports of critical…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…to punish success. They want  more people dependent on government and fewer people building  independent lives. Republicans will not let that happen.\n\nWith H.R. 1, we are stepping in to lock in the Trump tax cuts  permanently and to provide targeted new relief to the workers and the  families who keep this country running: seniors, tipped workers, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…transformed a moment of isolation into one of connection and healing.  In the wake of hurricanes and amid logistical challenges, they've  served hundreds of meals, including stepping up at the last minute to  support a community feeding event for an elected official. They showed  up with no expectation of recognition--just a desire to help. Whether  at…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…When Craig is there, and he is most nights, he personally welcomes  each audience. When you step through the doors, Mr. Speaker, you are  not just attending a show. You are stepping into a legacy, one that  continues to shine brighter with each curtain call.\n\nEarning this recognition is no small feat. I congratulate Craig and  the entire Alhambra team…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…still  matters, and that a business rooted in values can lift entire  neighborhoods.\n\nMike's commitment to the community doesn't stop at the manufacturing  doors. Whether it's stepping up in times of need, supporting local  nonprofits, or quietly funding initiatives that benefit area youth,  families and veterans, Mike has always led by example--without…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…disturbing to some Poles in a land where antisemitism is       still present albeit with a small Jewish community. I vividly       recall upon visiting Poland in 2017 and stepping out of the       new state-of-art Polin Museum next to the giant Warsaw Ghetto       Memorial, an Israeli military group getting ready to conduct       a memorial service…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…The Support Officer of the Year Award is given to individuals whose  actions have gone above and beyond their normal responsibilities to  help keep the community safe.\n\nBy stepping forward in challenging circumstances and offering  assistance without hesitation, Special Agent Cephus embodies what it  means to serve with professionalism and care.\n\nToday,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…lift others up,  ensuring that every person who walks through our doors feels welcomed  and supported. Her kindness is not just in her words but in her  actions--consistently stepping in wherever she is needed without  hesitation. Without individuals like Teresa, the impact of the YMCA in  Hernando County would not be what it is today. She represents the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…economy while preserving the character of our town. Cindy's  volunteerism goes above and beyond expectations. She does not hesitate  to take an extra responsibilites, often stepping up when additional  help is needed. Whether it is arriving early to set up for an event,  staying late to clean up, or brainstorming creative ideas to enhance  the visitor…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}]