[{"senator": "Mike Levin", "party": "Democrat", "sentence": "…Representative Roy,  and others who have been working together for some time on this. We  have a lot of momentum. Today, as was said, Speaker Johnson said that  he supports a stock trading ban. Leader Jeffries supports a stock  trading ban. President Trump has said that he would sign a stock  trading ban into the law.\n\nAgain, this is not a partisan issue.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691224/stock-trading-ban-for-members-of-congress"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…families, because exploiting inside information to enrich yourself  should never be allowed. It is time we come together to stop this  corruption and pass an immediate stock trading ban.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691226/stock-trading-ban-for-members-of-congress"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…STANSBURY. Mr. Speaker, let me begin with a simple fact: No  Member of Congress should be trading stocks. Period. None.\n\nThat is why I believe we must ban congressional stock trading and why  I am proud to cosponsor this act here in Congress.\n\nThe American people deserve to know that their Members of Congress  are working for them, not for stock portfolios;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691225/stock-trading-ban-for-members-of-congress"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…You have to have some credibility and this Chamber, this town, this  Congress, needs more credibility. One way to build that back is to  start with banning congressional stock trading. I think it is an easy  place to start. You talk to people in western Pennsylvania, you talk to  people all over this country who think it is ridiculous that folks in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…taken out of a budget. This is material information, and Members of  Congress should not have the advantage of that insider information and  use that advantage to engage in stock trading.\n\nAlso, Members of Congress should not be conflicted when we have to  decide about what to vote for or against. Members of Congress should  not be in a position of thinking…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…President and Vice President  from trading stocks, and that is what the Restore Trust in Government  Act would do.\n\nSpeaker Johnson has refused to move any bill to ban Member stock  trading. I offered this proposal as an amendment to the SAVE America  Act, but it was rejected by the majority.\n\nI also have a discharge petition on stock trading that has over…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699938/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…call, supporting the restoration of integrity  and transparency to Washington.\n\nTogether, I honestly believe, with enough reformers, we can change  the Congress. We can ban stock trading by Members of Congress. We can  end dark money in our politics. We can overturn Citizens United. We  just have to have the political will to do it.\n\nMr. Speaker, I thank…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699238/restoring-election-integrity"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…let me thank my  distinguished colleague from Rhode Island, whose clarion call on this  issue, his demand to an end of corruption, an end  to this outrageous practice of stock trading by Members of Congress,  has inspired many of his colleagues who have joined the coalition that  he is building in real time. I couldn't be more grateful to  Representative…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691220/stock-trading-ban-for-members-of-congress"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…just a few days ago, it was discovered that the  husband of a member of leadership on the opposite side of the aisle had  been trading in stocks, while we are considering a stock trading ban  right now in this House. This is corruption in action.\n\nWe have a judiciary across the street who is considering undermining  the fundamental voting rights of the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it also if you don't flood the  country with literally tens of millions of people that are illegally  here or through an abused legal immigration system.\n\nCongressional stock trading: I have got to be honest, my colleagues  on both sides of the aisle, stop it. When you are serving out in the  private sector, God bless you, do what you want to do, but…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…aisle do not want voter identification to be used to vote, and they do  not want to guarantee that only citizens vote. It is that simple.\n\nMr. Speaker, we will deal with stock trading. I am one of the lead  sponsors of that legislation. We will get it done but not as a  substitute for what 80 percent of American people want, which is to  guarantee only…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…about it, dadgummit.\n\nThat means making sweeping reforms that may actually involve some  sacrifice, like passing a bill that I have--a shameless plug--End  Congressional Stock Trading Act, which would level the playing field  and help restore America's faith in Congress once again.\n\nThere is no reason in the world, Mr. Speaker, that we are  individually…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…knowledge on what  is out there, but not public knowledge on what is being put into the  NDAA during the markups?\n\nInsider trading must stop. I can tell you that banning stock trading  for Members of Congress and their spouses should not be something that  is in question.\n\nWe must rebuild the actual image of Congress. We must rebuild the  image of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…cold in here. Maybe we need to start cutting some hogs.\n\nIf you know what that means, you know what that means.\n\nMr. Speaker, I rise to address this body on the issue of stock  trading by Members of Congress. We are public servants and stewards of  our community. Why does Congress think we are above the law?\n\nFor years, Members of Congress have gotten…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I rise today in strong support of the  effort to ban congressional stock trading because public service must  never be compromised by private financial interest. The American people  deserve to know that we are acting on their behalf, not for our own…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…here.\n\nPresident Trump agrees and Speaker Johnson agrees that now is the  time to pass my bill, the No Corruption in Government Act to finally  ban Members of Congress from stock trading, stop government pay raises,  and extend the lobbying ban.\n\nMr. Speaker, let's pass this bill and get it to the President's desk.  Let's give the American people back their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}]