[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…today  down 400 points. The warning lights are everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It is really the people on Main  Street who are going to feel the brunt of a tariff policy that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…which Americans benefit greatly and  built for decades is now destabilized by Trump's trade war against our  allies.\n\nIn just a few months, Trump has introduced chaos in the stock market  and undermined confidence for consumers, investors, and small  businesses, many of which have cautioned that they will have to close  due to Trump's untenable tariffs which…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…to say on the show ``Dragnet\": Just the  facts, ma'am.\n\nThe facts during the first 100 days of Mr. Trump's administration are  the following: The economy has shrunk; The stock market has taken a  hit; 401(k)'s that are critical for a majority of Americans' retirement  have declined; there has been a launch of a trade war that could cost  the average…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…temporarily raise more money from dumb investors because  they don't get that protection. If we stop protecting investors, then  why would investors put their money in the stock market? They will  abandon the U.S. to go to places with a better risk-reward.\n\nI understand we have a lot of fraud and grift in the White House. I  understand Republicans are…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Deal, where the Federal Government used its  power to help people who couldn't afford to put food on the table, to  help people who lost their life savings overnight in the stock market  crash, but didn't help all the people because at the same time, my  parents saw the worst of government, a government that oppresses some  for the benefit of a few.\n\nThat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…Republican districts, to make sure that  people are being heard.\n\nThis is not winning for the American people. Trump's tariffs are  taxes on working people. He is crashing the stock market and making  costs go up. This is the opposite of what he had promised.\n\nPeople don't want their services cut to fund a tax cut for the most  wealthy. They don't want people…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, 100 days: irresponsible tariff imposition,  confusing businesses, and tanking the stock market; illegal seizure of  citizens without judicial process; dramatic cuts to the delivery of  Social Security benefits and veteran benefits; abandoning environmental  protections…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…initiative, the likes that this Nation had never seen.\n\nYes, Mr. Speaker, it was money, the taxpayer money out of the  Troubled Asset Relief Program. GM, General Motors, left the stock  market.\n\nI reflected on the 15-year anniversary of this auto rescue last year  in this Chamber during another one of these addresses.\n\nMr. Speaker, it was really quite remarkable…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…world, of Cabinet Secretaries, did we speak up?\n\nWhen the American economy, in 71 days--71 days--has been upended;  when prices at the grocery store were skyrocketing and the stock market  was plunging; when pension funds, 401(k)s were going down; when  Americans were hurting and looking up; when the resounding answer to  this question was no--are you better…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…now. My parents grew up during the Depression, and  my father was born in 1925. He would have been 100 years old in  September. He was just old enough to remember when the stock market  crash happened. He didn't know what was going on. He was 4.\n\nHe remembered how his father one day owned an apartment complex, a  newspaper, and a nightclub, and the next…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fact that the tariffs impose additional costs on consumers.  Again, the uncertainty--the back and forth, put the tariffs on, take  the tariffs off--is the reason that the stock market has been so  volatile. People don't know with certainty what is going on with this  administration.\n\nWe are facing policies from the Trump administration that will  increase…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…day one, that he was  going to reduce the cost to American families and improve their quality  of life. Only, 100 days later, Americans have only seen reductions in  the stock market, in their 401(k)s, and a lowered respect for the  Constitution. What we have seen continue to rise, instead, are grocery  prices. We are seeing the cost of living grow out…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…time when our economy is already  in a free fall because of these crazy tariffs.\n\nAnd, by the way, if you care about your retirement and your 401(k),  you are watching that stock market because that is in free fall. That  is what this administration, that is what these Republicans are  bringing you.\n\nBut, remember, when they started, they got handed an…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Americans' throats couldn't come at a worse time. The Federal  Reserve reported that a key metric of inflation is going up, and that  was before President Trump sent the stock market further into the tank  with the global trade war he launched last week.\n\nRepublicans promised that inflation would go down and the stock  market would thrive under his leadership,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…America's enemies around the world today are applauding the self- inflicted tariff chaos that has been exacted on our people. They are  also plotting as they watch the U.S. stock market plummet, and then  bounce back a little bit, and then go down again, endangering and  impacting markets around the globe. Reckless and cavalier economic  policy could lead…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…manufacturing and industry are returning to U.S. soil.\n\nPresident Trump has secured over $8 trillion in investments that will  fuel job growth and create opportunity. The stock market continues to  set new all-time highs.\n\nIt is a fact that Republicans are committed to making sure  hardworking Americans keep more of what they earn. The Working Families…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…almost all capital gains. So,  of the increased tax receipts, only about 5.5 percent of it is actually  the growth in wages. Almost 65 percent is capital gains because the  stock market has been doing well. So, once again, we are back to the  world of financial engineering.\n\nThose of us with assets, we are doing great. You keep hearing people  talk about…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…Court ended nationwide injunctions. How about that? That  conservative majority on the Supreme Court also allows third-country  deportations.\n\nWe have had a record-high stock market, and we are signing a China  trade deal.\n\nThat is just the last 2 weeks, the last 2 weeks.\n\nThere are so many simple truths to share and so little time to do it  because…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…2026 is our tax receipts--so tax collections are  actually up. They are actually up almost 17.8 percent, which is  wonderful. Most of it is capital gains. You know, the stock market is  doing well.\n\nOddly enough, our spending is actually slightly down, but we still  have this massive gap. Our best guess is that we are still running a $2  trillion deficit…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…office. Inflation  is at its lowest level in more than 5 years, thanks to President Trump.  Gas prices are down below $2.30 in most States. Incomes are rising  again. The stock market has set 53 alltime record highs since President  Trump's election in 2024. Fentanyl moving into our country is down 56  percent. The murder rate has had its single largest…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The 16-week financial education competition brings together thousands  of student teams from across the country, each tasked with investing a  hypothetical $100,000 in the stock market. The goal: to learn the  fundamentals of financial literacy, teamwork, and long-term investing.\n\nCompeting against students from every congressional district, the  Rock…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692754/recognizing-rock-l-butler-middle-school"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…now say prolonged the  Depression for 10 years and caused the worst part of the Depression to  actually be in 1937--7 years after the tariff and nearly 8 years after  the stock market crash.\n\nDo you know what happened to the Republicans in 1932? The Democrats  won the Presidency, and they won the House. Do you know when  Republicans got back in charge…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]