[{"senator": "Josh Harder", "party": "Democrat", "sentence": "Mr. HARDER of California. Mr. Speaker, I rise today because this  weekend my community in Stockton, California, was shaken by a horrific  mass shooting.\n\nFamilies were gathered at a banquet hall for a 2-year-old's birthday  party. They were about to cut the cake when gunshots…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "Mr. HARDER of California. Mr. Speaker, I rise today to recognize the  opening of The Cambodian Experience: Our Journey to America, Finding  Freedom at the Haggin Museum in Stockton, California. This exhibit  documents the experiences of Cambodian Americans, tracing their journey  from the atrocities of the Khmer Rouge regime to refugee resettlement…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694719/recognizing-the-opening-of-the-cambodian-experience-our-journey-to-america-finding-freedom-at-the-haggin-museum-in-stockton-california"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Kids Act, does absolutely nothing to  protect our kids. Just 5 days after three children and a 21-year-old  were shot and killed in a mass shooting at a birthday party in  Stockton, California, is a level of tone-deafness that I don't think I  have seen during my 7 years here in Washington.\n\nThere are four families burying their children this week. There…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…San Joaquin Joint Powers  Authority and spearheaded the Valley Rail Program, securing nearly $2  billion in funding and enabling major infrastructure projects such as  the Stockton Diamond Grade Separation.\n\nUnder her leadership, ACE has continued to evolve to meet modern  needs, including the recent launch of a specialty train service to  Levi's Stadium…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "Mr. HARDER. Mr. Speaker, I rise today to recognize the 160th  anniversary of the First Congregational Church of Stockton--a steadfast  pillar of faith, fellowship, and service in the heart of the Central  Valley.\n\nFor over a century and a half, the First Congregational Church has  nurtured generations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "Mr. HARDER of California. Mr. Speaker, I rise today to recognize  Sovanna Koeurt for her decades of service to the Southeast Asian  community in Stockton and the broader San Joaquin Valley.\n\nMs. Koeurt arrived in Stockton in the early l980's as a refugee from  Cambodia following the Khmer Rouge regime. Like many others in her…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…American Medical       Response, Independence, Missouri; Talitha Crowe, EMT, AMR       Temple EMS, Temple, Texas; Dustin Wilson, Paramedic, American       Medical Response, Stockton, California; and Brannen Zilka,       Paramedic, American Medical Response, Concord, California.", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}]