[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…authority being  attacked by unchecked Office of Management and Budget Director Russ  Vought and a lawless Administration.\n\nSince taking office, the Trump Administration has stolen resources,  appropriated by this committee, for programs and services across the  federal government that help to grow the middle class, protect the  working class, support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…not  legally appropriated a single dollar. Rather, it appears billions and  billions of dollars have been expended, some might say illegally  transferred and some might say stolen, from other Department of Defense  accounts or from executive accounts or from other Federal agencies to  conduct these costly Venezuelan operations. From where? So now the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the State of Ohio  as a Senator, then-Senator JD Vance, now Vice President Vance, please  don't forget Ohio.\n\nThe biggest of the cancellations of these investments that was stolen  back in Ohio by the Trump administration was another major Ohio  company, steel producer Cleveland-Cliffs.\n\nPlease let me remind folks that steel helps create America's spine,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…stealing from the American people and which does nothing to help the  American people with the cost of living.\n\nSince taking office, President Trump and Elon Musk unlawfully have  stolen funds appropriated by Congress, passed by Republicans and  Democrats in the House and in the Senate, and signed into law by the  President, upending the separation of powers…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…kind of exploitation of women,  predatory victimization of girls, in effect, trafficking them--which  was Maxwell's specialty. And the President has said that they may have  stolen some of them from his spa, as if they were chattel to be bought  and sold. But that was the attitude that Epstein and Maxwell had toward  them, and, sadly, that was the attitude…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…legislation before us makes a  mockery of that legacy.\n\nSince his defeat in the 2020 election, President Donald Trump and his  Republican allies have pushed the big lie of a stolen election. The  majority has tried to convince the American people of the lie that  noncitizens are a threat to our elections and are using that lie as an  excuse to pass a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…reported receiving threats,  harassment, and abuse. So, for Tina and so many others, that harassment  grew worse with every lie spread by the Trump campaign about a so- called stolen election, with threats against election officials  continuing in subsequent elections.\n\nThere was no stolen election. That is a farce. But for those selfless  election workers,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…support, deserves to be supported by this body.\n\nAs has been indicated, this legislation would direct the SSA to issue  a new Social Security number to a child under 14 if it was stolen in  the course of being mailed.\n\nThe current policy brings nothing but misery upon a child and a new  family, and I think that this is a commonsense effort to mend this  grievous…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697264/social-security-child-protection-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…across the country rejected  claims of widespread fraud. Federal judges appointed by Presidents of  both parties dismissed these cases for a lack of evidence.\n\nThere was no stolen election. There was no massive fraud. There was  no justification, then or now, for the Federal seizure of elections. To  suggest otherwise is not really wrong; it is reckless.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…embraces something  that is a little bit more contemporary and something that gives us  reason to understand why we have to celebrate Black history.\n\nThe topic is Black History: Stolen Legacies. Stolen legacies. Black  History: Stolen Legacies.\n\nMr. Speaker, fear not, because I want you to understand that I  understand that this theme could be applicable…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…brought her little girl with her, her 5-year-old  little girl with her.\n\nHere is what she said:\n\nCuts to medical research are not just numbers on a       spreadsheet--they are stolen chances, unfinished stories, and       futures left unrealized.\n\nI plead with my Republican colleagues: Break your silence. Let us  work together to ensure the chances for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…against innocent civilians as was exposed in  the investigation following the violent October 7 attacks on Israel.\n\nNorth Korean hackers, operating as arms of the regime, have stolen  billions of dollars in cryptocurrency through cyberattacks, laundering  those funds to bankroll their illegal weapons programs and bypass  international sanctions.\n\nThese…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the financial harm, the strain of being taken advantage of  can further eat away at the veteran's physical and mental health. We  must empower the VA to more quickly return stolen or misused benefits  to veterans who are exploited by their fiduciary. This bill would do  just that.\n\nIt passed the House last Congress, and I encourage my colleagues to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…medical  intervention when complications were left untreated.\n\nIf Republicans truly cared about TANF oversight, they would have  spoken out when millions of TANF dollars were stolen from struggling  families in Mississippi to build a volleyball stadium and when the  Trump administration stepped in to shield the perpetrators from  accountability. Instead,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…and are exposing all of this fraud and  abuse, why aren't they in front of Congress to tell us about it?  Democrats demand that DOGE be held accountable for what they have  stolen and put into a cloud.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…a narcoterrorist and international drug trafficker  whose actions led to the addiction and deaths of many Americans. He was  an illegitimate dictator who held power through stolen elections and  horrific violence against the people of Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and  extradition to the United States.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…far-left jurisdictions seek to allow illegals to vote in local  elections, let me be clear about this one thing at this point: Every  vote cast by an illegal alien is a vote stolen from an American  citizen.\n\nCongress must defend the integrity of our elections. We must  aggressively push back against the left's attempts to change the  electorate and dilute…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…compete in women's sports is patently unfair and robs  women and girls of accomplishments and opportunities.\n\nOver 900 medals in women's sports have been won by biological men,  stolen from women who worked hard to earn them.\n\nWomen have fought hard to earn records that have been shattered by  mediocre men, men pretending to be women, mentally ill men pretending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…sanctions this Chamber has helped lead.\n\nHowever, the transparency and traceability of blockchain enhances our  law enforcement's ability to intercept these threats, recover stolen  funds, and deliver justice for everyday Americans.\n\nIn fact, just weeks ago, the U.S. Department of Justice used  blockchain analytics to intercept over a quarter of a million…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…SBA financial assistance programs are critical to  entrepreneurs. Unfortunately, fraudsters infiltrated pandemic-era loans  at an alarming rate. An estimated $200 billion was stolen from honest,  hardworking small businesses who needed help when they were forced to  close their doors during the COVID-19 pandemic. The harm these  fraudsters caused small…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Chinese  Communist Party, contribute billions of dollars to American  universities. The lack of transparency around foreign relationships  should concern every American as we see stolen research, anti-Semitic  propaganda, and academic censorship. None of these things belong inside  our borders let alone on our college campuses.\n\nBy establishing footholds in…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…important piece of legislation, as  well as the leadership of Representatives Malliotakis and Sewell.\n\nMr. Speaker, over the last several years, the number of government  checks stolen from the mail has increased dramatically.\n\nIf I could, I will share just a few statistics:\n\nBetween 2019 and 2022, there was an 87 percent increase in theft from  mailboxes,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…away  anymore by these unaccountable, unelected, heavyhanded bureaucrats who  think they know better than the American people. And it is certainly  not going to continue to be stolen like it has been by these fraudsters  in Minnesota, while the Democrats look the other way.\n\nIn all, American workers are going to see higher take-home pay, more  money in…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Date.--The amendments made by subsection (a)       shall take effect on the date that is 180 days after the date       of the enactment of this Act.\n\nMr. Speaker, a lost or stolen Social Security number can cause a  lifetime of harm to American children. Every year, more than a million  children become victims of identity fraud.\n\nCurrent Social Security…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Smith, not only for his strong leadership but for his support on this  important legislation.\n\nMr. Speaker, every year, more and more Americans are having their  identity stolen. It is a sad fact. However, actors are becoming more  sophisticated. They are using new technology to gain access to  sensitive information. Just last year, there were over…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…him, his wife, and his daughter, stating ``I am coming for you. .  . . [Y]ou, your wife, and your dead damn effing daughter are dead,''  after his personal information was stolen from a government vehicle  last month.\n\nThe numerous ICE officers whose wives have received calls telling  them that their families will be killed.\n\nThe ICE agent in Los Angeles…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more than 120 missing children and  have recovered 970 illegal firearms and 560 stolen vehicles.\n\nWith President Trump and AG Bondi and Kash Patel, and the commitment  that they have made to Memphis, this is what you are seeing. Criminals  are being apprehended,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Sunday, May 18, marks 7 years  since the heartbreaking and evil tragedy struck the town of Santa Fe,  Texas.\n\nMr. Speaker, it has been 7 years since 10 innocent lives were stolen  in a senseless act of violence that shook our community to its very  core. Lives were cut short. Families changed forever.\n\nI will never forget getting that phone call. I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691383/anniversary-of-santa-fe-shooting"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…remember, every child  receives a Social Security number that follows them around for the rest  of their life. Every year, there are kids whose Social Security numbers  are lost or stolen in the mail and exposed to fraudsters.\n\nBecause children don't open bank accounts, they don't apply for lines  of credit, and they don't seek employment, it can take them years…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697265/social-security-child-protection-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…because--if  there is a case of Trump derangement syndrome, I think it has spread  throughout the building.\n\nI didn't riot. I didn't give cover to the idea that the election was  stolen--quite the opposite. What was my big offense? Being a friend of  Trump's.\n\nWhat are you trying to do here? Do the right thing? The right thing  is to continue to investigate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]