[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…do we have as a body going forward?\n\nAnd I know, I get it. I am new here. I am one of the newer members  here. I came here--I wanted to serve in this body because of what it  stood for. I wanted to serve in this institution because I believe that  this is an institution of incredible honor, integrity.\n\nAnd even at this challenging moment in this country's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…here trying to protect the Members, trying to protect the  building, trying to protect the electoral college votes.\n\nJust this morning, I spoke to a Capitol Police officer who stood  shoulder to shoulder with Officer Brian Sicknick on January 6. He was  with Officer Sicknick who collapsed in the Capitol after being  assaulted by insurrectionists and, tragically,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the infliction of  suffering that Hamas has inflicted on Palestinians within Gaza. But the  situation is much different today than it was a few months ago.\n\nFour months ago, I stood here, and I asked for unanimous consent in  support of the Senate resolution on the humanitarian disaster in Gaza.  The resolution called for an end to the siege, an end to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…next year.\n\nI followed the rules of Illinois and its election law. When the  ballot was open for anyone to file--as they had over the past 6 years  and the four times that I stood for election--and contrary to claims  that were made earlier today, I did not circulate any petitions that I  was accused of circulating. I only circulated when I filed on…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…blind eye as  Musk was handed the keys to the government, enabling him to disable or,  rather, dismantle--probably both--programs everyday Americans depend  on. The majority stood by Trump through everything he has done, and now  we will see if that support falters.\n\nThe American people deserve much better than the drama playing out  between these two…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692030/elon-calls-it-quits"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…who Donald John Trump is. I have seen him before. I have seen his  cousins. I have seen his relatives. I am going to tell you who he is.\n\nI saw him on June 11, 1963, when he stood in the schoolhouse door. He  was George Wallace. I saw him when he fought desegregation in this  country. I saw him. He metamorphoses. He changes. He is a shape- shifter. He…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…are facing attacks on  their healthcare, education, and housing. When we reduce  an agency established to work for them, we fail them.\n\nI stand behind Congressman Green as he stood up for the rights of all  veterans and all Americans.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…like  environmental and wildlife protection organizations, to clean up  abandoned coal mine sites. Qualifying projects would be exempt from  certain legal liabilities that have stood in the way of cleanup.\n\nRight now, there are many thousands of abandoned coal mine sites  across the country, many located in Appalachia, from before the  industry was federally…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Administration says they are not  closing any offices; but the so-called Department of Government  Efficiency, DOGE, is attempting to weaken and dismantle a system which  has stood tall for almost a century, created by Franklin Delano  Roosevelt.\n\nMore than 11,000 Americans turn 65 each day. Many will graduate to  access benefits and, ultimately, Medicare…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Known as the ``Bridge Builder'' and the ``Patriarch of Peace,'' he has  worked tirelessly to foster dialogue, reconciliation, and cooperation  across nations and faith. He has stood firmly against racism,  extremism, and fundamentalism, championing peace-building measures to  help defuse conflicts in some of the world's most volatile regions.\n\nIn addition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…was a citizen, a  citizen, mind you.\n\nThis is the worst case of mass civil rights violations by the Federal  Government in recent history.\n\nMr. Speaker, 2 weeks ago, Minnesota stood up to call out these  illegal abuses by masked Federal agents, and a citizen, a mother of  three in Minneapolis, Renee Good, was shot and killed.\n\nIt is happening right here,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…events. One was on September 11, 2001, and we  were, as the gentleman observed, attacked by an enemy from without.  That was horrific. America lost thousands of lives that day. We stood  on the steps of the United States Senate that evening and sang ``God  Bless America.''\n\nOn January 6, I was sitting where the gentleman from South Carolina  now stands. I…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Really,  no one knew. John was the kind of person, you could never quite be  sure.\n\nAnd he walked in the well near the table where the Republicans gather  for votes, and he stood there. And he barely raised his left arm-- because it was broken while he was a prisoner of war--just enough to  get his thumb up and go ``no.'' No. That was it.\n\nJohn McCain,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Mr. KELLY. Mr. President, I have to say this week stood out for me  personally with some positive notes and some real downers.\n\nThe week didn't start great. We saw the President of the United  States--for the first time, I think,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…And still I rise, censured but not silenced. It is important to have  this photo tonight because it will get us into some very important  issues.\n\nThis was the occasion when I stood before the President as he stood  behind me giving a statement at a joint session of Congress. I was  seated right over in the third row up.\n\nThe President started to talk…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to recognize the 65th  anniversary of the Mojave Water Agency, an institution that has stood  as a pillar of responsible stewardship, innovation, and public service  in California's High Desert since its founding in 1960.\n\nFor over six decades, the Mojave Water Agency…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…hosting him in North  Carolina for an agriculture roundtable. He engaged with my  constituents, speaking their language, and truly listening to their  concerns.\n\nDoug LaMalfa stood tall, both literally and figuratively, for the  people who feed this country. To know Doug was an honor and a  privilege. His absence will have a profound void in this Chamber.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698714/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Department of Corrections, the  U.S. Attorney's Office, Spokane County Prosecuting Attorney's Office,  and many other local, State, and Federal law enforcement agencies that  stood shoulder to shoulder in this effort.\n\nI also give a special shoutout to two leaders of this operation:  Sheriff's Sergeant Patrick Bloomer and Acting Supervisory Deputy U.S.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…wealthy, and Democrats work and fight for  you, the working class and middle class of this country, the economic  patriots of the United States of America.\n\nJust over a year ago, I stood on this very floor and ultimately  successfully  called on the CEO of a local utility monopoly in my district which had  been screwing over my constituents, robbing them blind,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…was a man who showed up, not just when it was easy but when it  was needed. He believed in faith, integrity, and perseverance. He loved  his family dearly. For 42 years, he stood side by side with his beloved  wife, Judy, raising their sons, Garrett and Greg. They also cherished  their granddaughter, Diana Del.\n\nTo his church and to his church family…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…the Continental Congress formed what  would become the U.S. Marine Corps under the command of Major Samuel  Nicholas. Since its founding 250 years ago, the Marine Corps has stood  as a symbol of excellence and steadfast commitment to defending our  homeland. From the Revolutionary War to the present, our marines have  demonstrated outstanding courage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…to transparency and good governance.\n\nDebra's accomplishments would not have been possible without the  support of her family. Her husband, Gene, and their six children have  stood by her side throughout her many years of public service and  community leadership.\n\nDebra has had a profound impact on the Victorville community. Heather  and I deeply appreciate…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, a weekend or two ago in Suffolk County, I stood with  nearly 1,000 Long Islanders at a Vietnam war Veterans Day ceremony. The  theme of the day was simple but powerful: Welcome home.\n\nWelcome home after serving in a war…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…a  century. For generations, this hotel has offered hospitality and a  sense of belonging to visitors from near and far. It has welcomed  notable guests over the decades and stood as a testament to seaside  Georgia's heritage.\n\nThe spirit of Riverview reflects the heart of St. Marys. Its veranda  overlooking the river and its proximity to the ferry for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…will continue to support wetlands  restoration through the North American Wetlands Conservation Act for  years to come.\n\nFor nearly a century, the Pittman-Robertson Act has stood as one of  the most successful conservation funding models in the world. It works  because sportsmen and sportswomen pay a dedicated excise tax on  firearms, ammunition, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…trophy or the title. It is about  the countless hours of practice, the late nights and early mornings,  and the unwavering belief in one another.\n\nIt is about the community that stood behind them: the fans who filled  the stands, families who provided constant support, and coaches who  guided them every step of the way.\n\nI especially congratulate Coach Henson…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the city's rich history, enduring spirit, and the generations of  citizens who have shaped Brooksville into the vibrant community it is  today. For 170 years, Brooksville has stood as a testament to  resilience, civic pride, and a deep respect for tradition, while  continually embracing progress and growth. From its earliest days to  the present, the…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Virginia, Specialist Sarah Beckstrom and Staff Sergeant Andrew Wolfe.\n\nSpecialist Beckstrom gave her life in service to our country. She  wore our Nation's uniform with honor, stood ready to defend her  neighbors, and lived out the highest ideals of duty and sacrifice. We  grieve her loss deeply, and I ask God to bring comfort and peace to her  family,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to honor the 100th  anniversary of Indian River County, Florida, founded on June 29, 1925.\n\nFor a century, this community has stood as a jewel on the Treasure  Coast, a place where history, culture, and natural beauty come together  in extraordinary ways.\n\nIt has grown from humble roots to a thriving community,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694133/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…season, earning  a trip to the College World Series. Even though Arkansas came up short  of the program's first national title, Thomas' relentless hitting in  clutch moments stood out.\n\nJustin was one of just two Razorbacks named to the all-tournament  team, finishing the tournament with an impressive .571 batting average.  His leadership, sportsmanship,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}]