[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…departments, which includes Minneapolis and St.  Paul, they were triple the number of sworn police officers in  Minneapolis and St. Paul.\n\nBut for more than 2 months, Minnesotans stood together. They stared  down ICE, and they never blinked. They marched--and I was there, 50,000  strong in 10 below zero weather--peacefully. And what I will never  forget is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…helping hand.\n\nIf our offer on the Democrat side is rejected, the American public  will know, with every paycheck, with every prescription, with every  hospital bill, which party stood on their side and which didn't.\n\nThe time to make a good-faith effort on a bipartisan basis is now.  Just 13 days from now is the deadline to enroll or change plans before…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…wins prevented him from taking his seat. No  stranger to adversity, during his campaign, his car was shot at in a  crude attempt to derail his progress, yet Overseer Carter stood firm in  his commitment to bring about positive change.\n\nOverseer Carter answered the most important call of his life--the  call to preach the Gospel of Jesus Christ. This…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…the courage we have seen from  everyday Americans.\n\nWhen ICE agents started interrogating kids on a baseball diamond in  Harlem, Coach Youman Wilder was the only thing that stood between those  agents and his young players. Despite threats, he stood up and told the  agents that they had no right to speak to those kids. The agents left.  In the moment,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…against oppression  here and across the world.\n\nIt was also another son of Detroit, my predecessor and founder of the  Congressional Black Caucus, Congressman John Conyers, who stood with  Dr. King and later became the driving force behind making Dr. King's  birthday a national holiday.\n\nI am so incredibly proud to welcome all of my neighbors, residents,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…infinite continuum that we call  time, you are going to have to account for those times.\n\nThe question won't be: How loyal were you to the President? It will  be whether you stood on principle when you had an opportunity to deal  with the great issues of your time related to this country. There will  be a day of reckoning for you. It will not be in terms…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…significant training, access, and readiness enhancement benefits to the  United States military.\n\nMr. Chair, the question was asked on this House floor who came to our  aid, who stood for the United States.\n\nI was here on September 11 serving in Washington, D.C., my first term  in Congress. NATO, the world, came to our aid. The world came and  helped us…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…blind eye as  Musk was handed the keys to the government, enabling him to disable or,  rather, dismantle--probably both--programs everyday Americans depend  on. The majority stood by Trump through everything he has done, and now  we will see if that support falters.\n\nThe American people deserve much better than the drama playing out  between these two…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692030/elon-calls-it-quits"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…George W. Bush. He  named Russia and North Korea as the ``axis of evil.'' We could add Iran  and other countries. Never before at the United Nations has any U.S.  President ever stood with the dictators of Russia.\n\nThose countries that voted with Russia yesterday are state sponsors  of terrorism. Russia understands terror. That is what she does. For the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spinning and  stretching its ugly net from Russia to Brazil, India, North Korea, and  South Africa, seeking a global necklace of repression and domination.\n\nYet, at Davos today stood the unvanquished, courageous leader of the  poorest and most embattled nation in Europe. On behalf of his valorous  people, he delivered his eloquent plea.\n\nBravo, President…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…her life to justice, equality and faith. She  captivated audiences as a lecturer on women's rights and temperance and  preached wherever she was welcome. In 1850, she proudly stood at the  first National Women's Rights Convention.\n\nCommitted to voting rights, she lobbied President Theodore Roosevelt  for suffrage and remained a steadfast advocate for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691473/antoinette-brown-blackwell"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…boat. ``You cannot,'' the sentry shouted back. ``You cannot       come aboard.''\n\nA moment later, the schooner's commanding officer came on       deck. Roused from his bunk, he stood at the rail in his       shirtsleeves. Raising a pistol, he warned the men not to come       closer.\n\nAnother man in another boat rose to his feet and declared,       ``I am…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…anniversary of Russia's full-scale  invasion of Ukraine.\n\nOver the past 3 years, the world has witnessed the incredible bravery  and resolve of the Ukrainian people as they have stood up to Russia's  unspeakable brutality and destruction.\n\nWe have seen--and, indeed, the United States should take great pride  in having led--an impressive coalition of nations…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Known as the ``Bridge Builder'' and the ``Patriarch of Peace,'' he has  worked tirelessly to foster dialogue, reconciliation, and cooperation  across nations and faith. He has stood firmly against racism,  extremism, and fundamentalism, championing peace-building measures to  help defuse conflicts in some of the world's most volatile regions.\n\nIn addition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…trillion by 2034.\n\nOur national debt has reached unprecedented levels as well. In 2004,  the total debt was $7 trillion. By 2014, it had increased to $18  trillion. In 2019, it stood at $23 trillion. Today, our total debt has  surpassed $36 trillion.\n\nOur gross debt-to-GDP ratio is now 124 percent, the highest it has  been since the final years of World…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, this year, the First Baptist Church of Biloxi  celebrates 150 incredible years of ministry and service.\n\nSince 1875, this church has stood as a beacon of faith, hope, and  love--guiding generations through times of challenge and celebration.  Their commitment to spreading the Gospel, serving the Gulf Coast  community,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691555/special-recognition-of-150-years-of-first-baptist-church-of-biloxi"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…billionaires.\n\nHow many waitresses who are tipped are billionaires? How many  billionaires work hourly jobs and overtime? None do so.\n\nMr. SMITH of Missouri. Wow, Mr. Speaker, we have stood in this  Chamber for over 8 hours listening to a lot of words, a lot of  comments, a lot of inaccurate statements, and where I come from--could  we have order?\n\nMr. Speaker,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…is very brutal. Sea piracy is a violent crime that  endangers the lives of merchant sailors, disrupts global trade, and can  cause massive economic losses.\n\nAmerica has long stood strong against sea piracy. However, in recent  years, piracy has been on the rise, Mr. Speaker. Pirates, often based  out of Somalia, have taken advantage of disruptions created…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…and the struggle required to maintain it are not cheap.\n\nOur Nation was built on a yearning for the kind of freedom from  government repression and overreach that Jimmy Lai stood up against.  And our democracy rests on a lot of different foundations, but at the  core of all of it is a restraint on government power.\n\nA democracy rooted in free speech,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…First, it was regulations on cars and  trucks. Then, it was gas stoves and washing machines and, now,  commercial refrigerators and freezers. The list goes on and on.\n\nIn fact, I stood on the House floor in the last Congress and defended  my very own wife's gas stove, and we won that battle.\n\nFortunately for the American people, under the leadership of House…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689128/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Patriarch Bartholomew was elected in  October 1991 as the 270th Archbishop of the 2,000-year-old Church  founded by the Apostle Andrew. For more than three decades, he has  stood at the forefront of the cause of religious freedom, interfaith  dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…he would stop this crazy idea because we are  already $1 trillion in debt year by year and $37 trillion in debt  overall.\n\nThis is common sense, and the President has finally stood up for  those people who have been left behind the last 4 years.\n\nSo, Mr. Speaker, I thank Congressman Knott very much for taking on  this real issue. It is the kind of discussion…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…to transparency and good governance.\n\nDebra's accomplishments would not have been possible without the  support of her family. Her husband, Gene, and their six children have  stood by her side throughout her many years of public service and  community leadership.\n\nDebra has had a profound impact on the Victorville community. Heather  and I deeply appreciate…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…are at the Ivy-League-level of prestige.\n\nBecause of their academic rigor, competitive admissions, and strong  career outcomes, Georgia Tech University and Emory University stood  out.\n\nGeorgia Tech is renowned for its innovation and return on investment.\n\nTheir recent graduate career placement rates consistently hover above  90 percent, which is an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694832/recognizing-the-georgia-new-ivies"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…was a man who showed up, not just when it was easy but when it  was needed. He believed in faith, integrity, and perseverance. He loved  his family dearly. For 42 years, he stood side by side with his beloved  wife, Judy, raising their sons, Garrett and Greg. They also cherished  their granddaughter, Diana Del.\n\nTo his church and to his church family…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to learn the  fundamentals of financial literacy, teamwork, and long-term investing.\n\nCompeting against students from every congressional district, the  Rock L. Butler team stood out not only for their strong returns but for  their discipline, collaboration, and commitment to learning. Their  performance reflects the dedication of their teachers and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692754/recognizing-rock-l-butler-middle-school"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…decades, he has worked tirelessly to make his  community, his state, and his country stronger for the generations to  come. In every season--in challenge and in triumph--he has stood firm  in his convictions and committed to the conservative values that unite  us.\n\nIt is with great pride and deep gratitude that I join the Alden  Republican Committee in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…reflect on my very recent  visit to Israel. It was a humbling journey through the Holy Land, where  the history and resilience of the Israeli people left a deep  impression.\n\nI stood inside Jerusalem's Church of the Holy Sepulcher, a profound  moment for me as a Christian.\n\nI was grateful to have met Prime Minister Netanyahu, Israel's  President Herzog,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695802/reflecting-on-trip-to-israel"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise today to recognize the Hanford Civic  Auditorium on their 100th anniversary. For the past century, this  iconic building has stood as a symbol of Hanford, California's rich  history, architectural heritage, and cultural identity.\n\nSince opening its doors in 1925, the Hanford Civic Auditorium has  served…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…organizing and participating in the citywide prayer across  Colorado Springs as part of the National Day of Prayer events earlier  this year.\n\nDuring these events, one moment stood out: when Pastor McWilliams of  Fellowship of the Rockies Church offered a model of the Olympic torch  to be passed from week to week and church to church as a picture of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}]