[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "But his corruption does not stop there.", "title": "Genius Act", "date": "2025-06-16"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "JJ has a severe disability, but he hasn't allowed that to stop him  from speaking out and advocating tirelessly for our disability  community.", "title": "Recognizing Jj Holmes and Alison Holmes", "date": "2025-05-06"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Our offshore  wind project, Revolution Wind, had already weathered one stop work  order which came out of the blue from the administration.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Unfortunately, he is not going to stop because Congress  is not stepping up to enforce our rights.", "title": "Gross Violations of Law By Trump Administration", "date": "2025-05-07"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Let's stop wasting methane without consequence, and let's not leave  American consumers to foot the bill.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "If just a few of my  colleagues on the other side of the aisle take a stand today, we can  stop this from happening.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I rise today in strong opposition to this rule, another  reckless effort by the Republican majority to stop this House from  doing something to stop the reckless Trump tariffs.", "title": "Providing for Consideration of H.R. Law-Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act; and for Other Purposes", "date": "2026-02-10"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Team Maryland won't stop fighting for our State.", "title": "-9999", "date": "2025-03-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "But because Donald Trump  ordered it stopped.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Let's stop clutching our pearls.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Speaker, while the House debates various veterans-related  legislation today, none are more urgent than the legislation I am  introducing to stop thousands of veterans from losing their homes.", "title": "Montgomery Gi Bill Selected Reserves Tuition Fairness Act of 2025", "date": "2025-04-07"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Stop in any store.", "title": "Buckling Under the Weight of Rising Costs", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Two of these bills are about misleading pregnant women to stop them  from making decisions about their own  bodies.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "That is precisely the abuse  that Congress needs to stop.", "title": "Department of Homeland Security", "date": "2026-02-02"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Since agritourism is a form of nontraditional  farming, the Federal Government simply hasn't done much to help the  industry, which is why I am proud to work with Congressman Newhouse to  introduce the bipartisan AGRITOURISM Act, which will ignite the  industry and provide a one-stop shop of resources like grants, loans,  and technical assistance for farmers who want to participate in  agritourism.", "title": "Supporting Agritourism", "date": "2025-05-20"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Even a 2-hour weather delay couldn't stop  the Lancers from taking down the number two ranked Eastmark 17-0,  winning them the 4A title in the first year of the girls' flag football  program.", "title": "Congratulating Salpointe Catholic High School's Girls' Flag Football Team", "date": "2025-12-03"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, because if you are the  Chinese Communist Party and see a mine is getting ready to happen in  the United States, and it is going to be done by a company that is  traded publicly, you could go buy 10.1 percent and stop the project.", "title": "Critical Mineral Dominance Act", "date": "2026-02-04"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Make no mistake, these mass atrocities will not  stop until the current regime is crippled.", "title": "Bringing Real Accountability Via Enforcement in Burma Act", "date": "2026-02-09"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Charlie often said that when we stop talking, that is when violence  happens.", "title": "We Are Better Together", "date": null}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Some examples include: ordering the  President to stop deporting foreign terrorists; directing the military  to enlist and retain transgender servicemembers; directing who will and  will not staff the President's administration--that is really  extraordinary, I think--and then, lastly, an example, ordering the  immediate expenditure of billions of dollars.", "title": "-9999", "date": "2025-03-25"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Coast Guard stop two alleged drug smuggling operations in the Caribbean  Sea.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "``Madam Wu Yi, you have to stop stealing our IPR.'' That senior Chinese  official, 2003, looked at the President of the United States and  solemnly and sincerely said: Mr.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "This time, I hope that our Committee on Ways and Means, together  with President Trump, stops taxing these wildly wealthy people at a  lower tax rate than what the average guy or woman is making in this  country.", "title": "Diversity, Equity, and Inclusion", "date": "2025-04-07"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "In Shackelford and Hockley Counties, folks said that it is about time  that we put a stop to Biden's war on energy so that we can lower energy  prices for working people; so that we can strengthen our energy  security; and so that we can unleash not just American energy  dominance, but American prosperity for our children and children's  children.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "By requiring a fraud ban notification, we can put a stop to these  senseless scams and protect vulnerable consumers.", "title": "Romance Scam Prevention Act", "date": "2025-06-23"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "It stops cyber abuse.", "title": "Tools to Address Known Exploitation By Immobilizing Technological Deepfakes on Websites and Networks Act", "date": "2025-04-28"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "We are ultimately restoring hope and healing by putting a stop to drug  overdose and poisoning.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "I am talking about everything from crime against small businesses  forced to close their storefronts to the death of innocent Americans,  and it hasn't stopped, as evidenced by the tragedy in Boulder,  Colorado, earlier this week.", "title": "Save Sba From Sanctuary Cities Act of 2025", "date": "2025-06-05"}, {"senator": "James Risch", "party": "Republican", "sentence": "What we are debating is  trying to stop something that is not happening.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}]