[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…time, to call  on the Trump administration to restore lifesaving food aid for starving  children around the world.\n\nIt has been 8 months since the Trump administration put a stop-work  order in place. As a result, there are thousands of boxes of lifesaving  aid meant to save the lives of starving children sitting in warehouses  in Rhode Island and Georgia…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695224/restore-lifesaving-food-aid-for-children"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Trumped-up energy emergency.\n\nForty-five of the planned 65 wind turbines were already installed  when the Trump administration, just months ago in late August, issued a  stop work order, grinding this project to nearly a complete halt--men  and women on the job in New London, offshore, onshore, stopped from  going to work, out of jobs; investors, construction…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…if this amendment passes. That is going  to just cause more deaths from drunk driving.\n\nI would implore everybody: Please, privacy can be addressed, but we  should not stop this work from continuing. We can't have drunk drivers  on the road. It is not just them but everyone else who is killed and  injured as a result of those drunk drivers.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…scientists, and union workers alike.\n\nWe saw the promise of good-paying jobs in offshore wind manufacturing  at our ports. Yet, instead of stability, this administration issued  stop-work orders and launched sham investigations that have chilled the  industry.\n\nSome manufacturing projects are pressing forward; but others have  been forced to walk away, robbing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…capabilities in a  comprehensive manner. Why?\n\nSince taking office, Elon Musk and DOGE have decimated cybersecurity,  CISA, our premier cybersecurity agency, with personnel cuts and stop  work orders.\n\nWhy would anyone do that?\n\nIn March, President Trump and Defense Secretary Pete Hegseth abruptly  ended U.S. cyber operations against Russia. This was done without…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…continuing  resolution.\n\nThe subcommittee provides Navy with contracting authority for five  new Columbia subs, with incremental funding authority, eliminating the  risk of a stop-work order which came close to happening because of the  Columbia omission in last month's CR.\n\nThe bill also authorizes a boost to sealift, the new Marine Corps  Landing Ship…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Chairman, I thank my friend from Connecticut for  yielding.\n\nDonald Trump is breaking promises left and right to American workers.  His latest target is Revolution Wind. His stop work order is abusing  the definition of national security and hurting hundreds of union  workers in my home State of Rhode Island ready to finish this project  that is 80 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…pleased with the way the process was  going.\n\nOff of Rhode Island, we are developing offshore wind. Our offshore  wind project, Revolution Wind, had already weathered one stop work  order which came out of the blue from the administration. This was a  project then with about $4 billion of investment already expended and  north of 80 percent complete--a…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…streets in conjunction with  law enforcement and community members who have lost loved ones to  violence.\n\nJune is Gun Violence Prevention Month, Mr. Speaker, and we cannot  stop this work in decreasing gun violence on our streets and in our  communities.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692122/supporting-gun-violence-prevention-programs"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…President Trump is strangling the energy supply we badly  need to drive down costs for everyone.\n\nFrom canceling energy projects to withholding energy permits, to  issuing illegal stop work orders on fully permitted generation  projects, President Trump is waging a war on affordable, American-made  energy. Most recently, that came in the form of canceled energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…idly by  while the Trump administration wages war on a clean energy power  source? Many of them are already permitted and constructed.\n\nIn April, the administration issued a stop-work order for the Empire  Wind offshore wind project surrounding New York. Even though the order  was lifted in May, that delay cost the developer $955 million.\n\nThe President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…ever  before, our permitting system is frozen in place. It definitely isn't  going to work if Federal Agencies ignore statutory timelines, stall  approvals, issue illegal stop work orders on partially constructed,  fully permitted projects, pause leases, and cancel projects that were  already under construction.\n\nSo what this administration is doing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}]