[{"senator": "George Latimer", "party": "Democrat", "sentence": "…expand our economy and make us competitive in worldwide markets.\n\nThen, there is the morality of helping others. The Good Samaritan  stopping by the roadside to help a beaten stranger not of his own  religion is a testament to: ``Who is my neighbor?'' It is not just the  person who shares my skin color.\n\nPolicies to eliminate all DEI efforts are a vestige…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…County Commissioner in Lee County,  Georgia. Although he won the district of Chokee, changes in the rules  requiring county-wide wins prevented him from taking his seat. No  stranger to adversity, during his campaign, his car was shot at in a  crude attempt to derail his progress, yet Overseer Carter stood firm in  his commitment to bring about positive…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…contrast that philosophy with that which was expressed in  Matthew 25:\n\n``For I was hungry, and you gave me something to eat, I was thirsty  and you gave me drink, I was a stranger and you took me in, I was naked  and you clothed me, I was sick and you ministered to me, I was in  prison, and you visited me.\n\n``Then the righteous will answer, `Lord, when…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689931/elon-musks-lack-of-empathy"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…of the [house, and that]       is why I depend on this waiver. I would rather care for my       daughter, give her the quality care and love she deserves,       than hire a stranger and depend on them to take care of my       child. Without the waiver, I wouldn't be able to afford to       stay home and make sure she is safe and happy. Thanks to the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…moment of  these attacks on our immigrant communities. An attack on our immigrant  communities is an attack on all of us.\n\nAs a woman of faith, my God tells me to welcome the stranger. Do not  be indifferent to the suffering of your neighbors. Immigrants make our  country a better place. Immigrants make America great, and our  immigrant brothers and sisters…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…see somebody who is hungry, we  feed them. When we see someone who is homeless, we give them shelter.  When we see someone who is sick, we provide them care. When we see a  stranger, we welcome them. When someone is in prison, we visit them. At  a minimum, how about we make sure they are in conditions that are  humane?\n\nWe can do a lot better. The American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Georgia and that its people had the means to implement the necessary  reforms. Georgia's story has been one of success.\n\nGeorgia, strategically located on the Black Sea, is no stranger to  larger geopolitical forces. Russia invaded Georgia in 2008 during the  Beijing Olympics and proceeded to occupy 20 percent of its territory.  Despite the persistent threat…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…civilians, primarily due to  displacement and military bombing campaigns, targeting civilians as  retribution for rebel gains on the battlefield.\n\nThe Burmese people are no stranger to displacement. A decade ago,  Burma's military junta engaged in a violent persecution of the Rohingya  minority, forcing 1.5 million people to flee to Bangladesh and  Thailand.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…just received the Nobel Peace Prize for her work. They  voted, according to the estimates of monitors, about a ratio of 2 to  1--2 to 1--for democracy.\n\nNo, Venezuela is no stranger to democracy. They had a democracy for  three decades, and they lost it to the internal corrosion of the  separation of powers and the checks and balances of a democracy.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…that they are hurting, we have an opportunity to do something  to stop that hurting, an opportunity to feed the hungry, house the  homeless, care for the sick, welcome the stranger, and visit the  incarcerated. When we do for the least of these, we are at our best.\n\nWe have gotten away from that, Mr. Speaker. We better get back to it  because the American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the kingdom  prepared for you since the creation of the world. For I was hungry and  you gave me something to eat, I was thirsty and you gave me something  to drink, I was a stranger and you invited me in, I needed clothes and  you clothed me, I was sick and you looked after me, I was in prison and  you came to visit me.'\n\n``Then the righteous will answer…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…campaign for chairman of the Fairfax County Board  of Supervisors, and a year later he managed Gerry's successful campaign  for Congress.\n\nWhile a new Member, James is no stranger to Congress. After Gerry's  election to Congress, James went on to serve as his chief of staff for  over a decade, where he worked closely with many of us and our staffs.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Sandra writes:\n\nMedicaid has allowed my son's needs to be met at home and       not in a group home. It has allowed my husband to participate       in his caregiving, not a stranger. It has allowed him to be       employed with the aid of a job coach.\n\nThese are just a few things, in addition to healthcare, if the cuts  to Medicaid happen--it goes away.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…us and pit us against our own neighbors.\n\nDespite those who seek to use their faith to justify their cruelty,  we remember that the Bible itself teaches us that: ``When a stranger  sojourns with you in your land, you shall not do him wrong. You shall  treat the stranger who sojourns with you as the native among you, and  you shall love him as you love…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…dignity and grace in one another and have the strength  to stand up and confront hatred and evil.\n\nAs I told Ahmed, he is a hero to us all. He teaches us that love of  the stranger can lift us all and defeat hatred. Or, as Rabbi Ulman and  Mr. al-Ahmed have titled their visit around the world, ``The Light Will  Win.''", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…scene, said the boy ``was near hypothermic and might well have  died had Danny not found him.''\n\nDanny is an Army Veteran and having served in Iraq and Afghanistan,  he is no stranger to perilous situations. And this specific situation  was personal to him. ``I've got grandkids about the same age, so it  just hit pretty close to home. Serving the public…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690127/recognizing-the-heroic-actions-of-mr-danny-wells-of-peculiar-mo"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…bill that will  prevent deadly chemicals from falling into the hands of children, our  Youth Poisoning Protection Act.\n\nIt's a parent's worst nightmare: a nameless, faceless stranger over  the internet teaching your child how to take their own life, and your  child, in a moment of vulnerability, listening to them.\n\nThat's exactly what happened to Kristine…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…lead for the final 24 laps, displaying  his dominance as he secured his third career victory on his first-ever  non-superspeedway track.\n\nAt just 20 years old, Love is no stranger to winning and bringing  back hardware to the stock car racing capital of the world. At age 15,  he set a record as the youngest winner of the ARCA Menards Series West  and…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696515/recognizing-jesse-love-jr"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…government would tell us to, but  because the love of Christ propels us to.\n\nWhether it is cleaning up a park, helping a neighbor in need, or  simply showing kindness to a stranger, Love Thy City challenges us to  use our active faith to lead by example and invest in our communities,  not just with words, but with action.\n\nThis is what makes east Texas…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise today to recognize the legacy of my  friend and a great Wyomingite, Juli Spitzer. Juli never met a stranger,  and her life was defined by the love she had for her neighbors and the  communities she called home in Sublette and Teton Counties.\n\nFrom the day Juli moved to Wyoming to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}, {"senator": "John James", "party": "Republican", "sentence": "…of it.  America called on us during two World Wars and a global pandemic, and  my legislation ensures Michigan stands ready to answer the call once  again.\n\nMy family is no stranger to how important the trucking industry is.  My father started a trucking business with one truck, one trailer, and  no excuses. Then a generation later, I started a trucking…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…when what happened to them was some form of sexual abuse, the odds are  about 90-10 that the offender is somebody that the child knew and  trusted.\n\nIt is rare that it is a stranger offense with little kids. That is  because that is how the offender got access to the child.\n\nMr. SCHMIDT. Mr. Speaker, on our watch, we prosecuted parents, we  prosecuted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…officers, the most basic,  simple, fundamental elements of being a dad, in my opinion, shouldn't  be a question of whether you do it. Watching them walk over to a  complete stranger, but they are in uniform, and they look up at them in  the eyes--they regularly don't look at folks in the eyes. It is always  a little awkward for them to learn that interaction--and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…conferences, supported  reconciliation in conflict-ridden regions, and spoken out for  persecuted groups across the globe.\n\nHis All-Holiness Ecumenical Patriarch Bartholomew is no stranger to  our Nation's Capitol. In 1997, during his first official visit as His  All-Holiness, he was awarded the Congressional Gold Medal in a ceremony  in the U.S. Capitol Rotunda.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…give 70 percent of the cost of a developer's project to him in tax  credits. That seems a strange way to solve the housing crisis in this  country for a Democrat. It is even stranger for a Republican.\n\nIn any event, I think people should look at this. We are spending  $13.5 billion every year on this credit and, like I said, you can get  it on all sorts…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691140/low-income-housing-tax-credit"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Democrats were for  providing government benefits to illegal immigrants who were charged or  convicted of very serious crimes.\n\nYou really can't make this stuff up. It is stranger than fiction.\n\nOur colleagues across the aisle showed their true colors by voting  for taxpayers to continue paying for government handouts to folks who  shouldn't really…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…and respected member of the community, unsurprisingly, last  year, he was voted Boss of the Year. I know his coworkers are sad to  see him go, but I also know he won't be a stranger. He has been named  the grand marshal of this year's Paynesville Town and Country Days  parade.\n\nMr. Speaker, I thank Ron so much for his service to the community and  congratulate…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…national park or  otherwise visiting a location where today the law may preclude him or  her from carrying the means of defending himself, his family, his  colleagues, or the stranger standing next to him.\n\nWe trust those officers to do exactly that while they are on duty and  in service, and we should trust them to do exactly that under the  reasonably…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, I rise today in support of Judge Stephen  Vaden's nomination to be the Deputy Secretary of Agriculture.\n\nJudge Vaden is no stranger to public service. He served as USDA  general  counsel during President Trump's administration and now sits on the  U.S. Court of International Trade, both roles confirmed…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692280/9999"}]