[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, at the end of last week, President Trump  published his national security strategy. It could have been called his  national insecurity strategy.\n\nTo say it is bad is a misstatement, understatement. It is disastrous.  During Europe's largest land war since…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697955/national-insecurity-strategy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…the  supply chains through tariffs or threats to pull out of trade deals  like the USMCA could destabilize job-creating industries within  Illinois.\n\nMoreover, this trade strategy is not only economically damaging, but  also unconstitutional. Congress, not the President, holds the exclusive  authority to regulate foreign commerce. The Administration's…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…said Saturday night, Congress and the American people are owed  answers. No President should be allowed  to unilaterally march this Nation into war with erratic threats, no  strategy, and no explanation. That is why I have called on Leader Thune  to hold a vote immediately to enforce the War Powers Resolution. The  law requires the Trump administration…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…has  for the better part of a century, we must continue to stand up to  tyrants and defend freedom. We have learned that isolationism and  appeasing autocrats is a losing strategy. As President Trump and his  administration continue to push for negotiations between Ukraine and  Russia, I encourage them to remember history. Remember the reasons we  fought…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Frankly, all of us deserve a bill that reflects our shared commitment  to the men and women who wear and have worn the uniform.\n\nNational defense is not just about weapons and strategy. It is about  people, and this bill, as currently written, does not prioritize the  needs of our people. Instead, it is laced with ideological provisions  drawn from Project…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…establishment that would make energy  independence in perpetuity a reality.\n\nOur energy portfolio domestically must be balanced and comprehensive,  a truly all-of-the-above strategy in order that there be competition  not reliance on dirty crude. That day should be over. That means  continuing progress on renewable energy systems like modern nuclear,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…review.\n\nThe result of petty and punitive motives of this bill is that small  businesses will suffer. You would think that, when you offer support  for this President's tariff strategy, reckless as it is, which is  damaging small businesses that rely on international goods, components,  and supplies, they would instead be working to stimulate that. Yet,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Venezuela's military and armed groups around  the country will welcome democracy with open arms is naive at best.\n\nThis administration has no plan for the day after. It has no  strategy. If Members do not vote for Mr. McGovern's War Powers  Resolution, they are signing their name to everything that comes after,  a forever war in our own hemisphere, a quagmire…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to solve the world's toughest challenges.\n\nMr. Speaker, foreign assistance, which has long represented just  about 1 percent of our national budget, is not charity. It is strategy.\n\nDon't take my word for it. Military leaders from both parties have  warned us for years. If we fail to lead with soft power, we will end up  paying in blood, bombs, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…the Assistant Secretary of Commerce to lead a governmentwide supply  chain resilience effort.\n\nIt also ensures input from the Department of Labor and lays out a  national strategy to coordinate action and prevent future disruptions.  Leaving our manufacturers and suppliers vulnerable creates fragile  supply chains that threaten both our economic and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, President Trump has developed a new MAHA  strategy. Instead of Make America Healthy Again, his new strategy is  ``Make America Hungry Agenda.'' He is weaponizing food against  America's most vulnerable families. In my State…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…it so politicians  can't use it like a weapon. If the President can bully or threaten the  Fed Chair, interest rates become a political tool, inflation becomes a  campaign strategy; and your mortgage, your job, and your savings become  collateral damage.\n\nMake no mistake, Mr. Speaker, this attempt to intimidate the Fed  isn't about justice or the American…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698888/chair-powell-refuses-to-give-in-to-trumps-demands"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…again. And when experts gently try to correct these  falsehoods, they are attacked, doxed, and threatened. This is part of a  deliberate cultivation of ignorance as a political strategy.\n\nWhen you undermine expertise, when you treat all opinions as equally  valid regardless of evidence, when you replace scientists with  sycophants, you make people vulnerable…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…on sales, profits, assets, and market value.\n\nYet, in our investigation, we learned that a senior official at  Northwest had an aggressive cross-selling and product sales strategy,  and he brought that approach to Wells Fargo. This strategy was adopted  and spread throughout the business, including to former Wachovia  branches and retail bank operations…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…or specialized. And third, it sends  U.S. dollars, jobs and technological investments directly into the  hands of a strategic competitor identified by out National Defense  Strategy as the most significant long-term challenge to U.S. interests.\n\nNowhere are the consequences of this policy failure more acute or  more strategically dangerous than in my…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…opaque to us, as  policymakers, that are helping China basically compete with us. We  know, of course, it is not just about economic competition. We know  that China has a strategy of military-civil fusion, which means that  these investments are not simply benefiting China's economy and  consumer tech sector; they are directly helping build China's…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…readiness.\n\nAs Civil Air Patrol's first director of government relations, Colonel  Swain reestablished its presence in Washington after a 50-year absence.  His legislative strategy more than doubled its Federal funding, built  trusted bipartisan relationships on the Hill, and led the successful  effort to award Civil Air Patrol the Congressional Gold…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…urge my colleagues to support the bill, and I reserve  the balance of my time.\n\nMr. BAUMGARTNER. Mr. Speaker, the AUKUS partnership is foundational  to our global defense strategy. We must ensure it is implemented as it  was intended.\n\nI am proud to support this legislation to improve existing AUKUS law,  and I urge my colleagues to join me.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694783/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…owns 13 of the 19 industrial mines in the  Congo, and they utilize child slave labor and follow zero environmental  laws.\n\nMy amendment would require DOD to help develop a strategy to reshore  critical mineral production and end our reliance on Communist China.\n\nMr. Chair, I urge my colleagues to support this en bloc package.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…price, and nothing is free.\n\nEvery dollar that flows into American classrooms from foreign  countries comes with strings attached. This is particularly true for  China, whose strategy is to gain a foothold in America's educational  system to steal personal data and to manipulate the material children  are being taught.\n\nMillions of dollars of Chinese funds…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Affairs, including serving as the  director of U.S. Public Affairs before leading the Global Government  Affairs organization. In this pivotal role, he developed Deere's  strategy and advocacy priorities leading to legislative, regulatory,  and public policy outcomes that ultimately benefited the company,  customers, employees, and business partners.…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…for the future. It is affordable, it is reliable, and it is ready  to go.\n\nPresident Trump knows that. He knows that coal is a key ingredient in  an all-of-the-above energy strategy and agenda for our Nation. So I  look forward to standing today with President Trump to celebrate this  victory for Wyoming and for America and for a strong energy future…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Pacific Spaceport Complex-Alaska,  or PSCA, on Kodiak Island is at the forefront of these efforts as a  premier launch site that plays a critical role in America's space  strategy.\n\nAlaska's geostrategic location in the Arctic makes it an  indispensable asset in America's national defense and global power  projection. As the closest U.S. State to both…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…reliable and lower America's electricity bills.\n\nMr. GUTHRIE. Mr. Speaker, I thank Congressman Balderson for  sponsoring the GRID Power Act.\n\nMr. Speaker, this is part of the strategy we all have to do to  produce more power so we can have cheaper power. Demand is rising. We  need supply to rise. We need supply of dispatchable power to rise.\n\nI do believe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…single civilian nominee go by  unanimous consent or voice vote at this point in his Presidency. The  first President on record. Think about that.\n\nAnd Democrats are using this strategy even on noncontroversial  nominees. Almost a quarter of the nominees whose confirmation process  Democrats have dragged out actually got more than 60 votes here on the  Senate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…economy. Recent attacks on the  transcontinental cable have exposed vulnerabilities in the framework.\n\nHowever, this bill directs Congress and the State Department to  develop a strategy to eliminate adversarial access to the key  technologies used in undersea cables. This strengthens our export  controls, requires transparency and public reporting, and promotes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Mr. CRANK.  4503, the bill now under consideration.\n\nMr. Speaker, I rise today in support of H.R. 4503, the ePermit Act,  which will establish a governmentwide technology strategy to improve  Federal permitting processes and timelines. I thank my colleagues,  Representatives Johnson and Peters, for their strong bipartisan work on  this legislation.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…the Chief Acquisition Officer of the agency, or the       equivalent officers of the agency.\n\n(b) Plan Requirements.--The plan of an agency shall--\n\n(1) include a detailed strategy for--\n\n(A) the remediation of any software asset management       deficiencies found during the comprehensive assessment of the       agency;\n\n(B) the ongoing maintenance…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…sensitive data,  effectively funding breakthrough research for the Chinese Communist  Party with American taxpayers' dollars.\n\nChina's government has embarked on an aggressive strategy to acquire  critical American research and intellectual property. We have seen a  troubling pattern of intellectual property theft, economic espionage,  and illicit influence…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…competitive, we need to get back to making things affordable in the  first place.\n\nThe National Coal Council plays a critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance to lower costs for hardworking households.\n\nMr. Speaker, I urge my colleagues to support H.R. 3015, and I reserve  the balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}]