[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…want to lower  the standards to allow for more chases and more innocent people getting  hurt.\n\nI will remind us that this District is dense. Sidewalks oftentimes  are small. Streets are tight. There are a lot of folks who live here.  We should not have a one-size-fits-all policy for D.C. We should allow  the people of D.C. to decide when a car chase is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…crime.\n\nThe President's false rhetoric about Chicago being ``overrun'' with  chaos was clearly a pretext to intimidate our city and normalize the  deployment of soldiers on our streets.\n\nTo protect civil liberties and civilian rule--pillars of democracy-- our country has long upheld the norm that the military does not police  our cities.\n\nThe Supreme Court…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and practice, building  institutions, mentoring leaders, and offering pastoral care to  countless families. He bore witness to a faith that moved beyond  sanctuary walls into streets, schools, and global mission fields.\n\nI ask my colleagues to join me, my wife Vivian, and the more than  765,000 people of Georgia's 2nd Congressional District in honoring…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…an unshakeable commitment to making  this country, as Martin Luther King would say: ``Be true to what you  said on paper,'' for all of us.\n\nFrom the Halls of Congress to the streets of our communities, Black  leaders and educators and entrepreneurs and activists have shaped this  Nation. Yet, we know that honoring this history isn't just about  reflection.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…colleagues to join me in voting for this package.  Let's pay our troops, fund clinical trials right now, work to rein in  DHS, and end the chaos that is happening on America's streets.\n\nMrs. MURRAY. Mr. President, this amendment would strike funding for  one Member's project simply because the Senator offering the amendment  doesn't like the project. That…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…weekend--the  good and the bad alike.\n\nOn one hand, this weekend we witnessed one of the largest peaceful  demonstrations in American history. Nearly 5 million Americans took to  the streets and made their voices heard against the rise of  authoritarianism on our shores. I was proud to be one of them. We  gathered in the streets. We gathered in front of State…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Trump's  action, ICE and CBP have turned from law enforcement agencies into  something much more dark and much more sinister.\n\nAmericans are scared by masked agents roaming our streets arresting  anyone in eyesight whom they deem to be a threat, not a court of law.  They are terrified that they could be the next Renee Good or one of the  many who have died…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Republicans like you, Mr. Speaker,  to join us. Think of our future. Think of how history will remember  this government you are a part of: executions of Americans on our  streets, demanding  papers from Americans to prove that they belong, and mass Federal  agents acting with impunity.\n\nOne day, everyone will say that we were against this. One day,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Columbia, if that State's Governor, or the DC Mayor,  objects. Unfortunately, the effort failed, and this bill does not  prevent the President's efforts to militarize American streets.\n\nAnd abroad, Trump has resurrected a policy of a bygone era: the Trump  version of the Monroe Doctrine, carrying out an illegal airstrike  campaign against boats in international…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, we have a President who is corrupt, criminal,  and craven to the core, a President who has declared war on American  cities and flooded the streets with untrained, unqualified, and  unidentified agents.\n\nWhen agents show up in unmarked vehicles wearing masks without  warrants, without body cams, targeting people based…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699018/history-is-watching"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman from  Massachusetts for yielding time.\n\nMr. Speaker, Congress must not give ICE or CBP another dollar while  they are killing Americans in our streets. We must protect our  communities by demanding real change first. This is what our  constituents elected us to do.\n\nAs a starting point, the Federal occupation of Minneapolis…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…communities. We appreciate their dedication to public  service and pray for their continued safety. I look forward to our  continued partnership as we work to keep drugs off our streets and hold  bad actors seeking to prey on our communities accountable.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697564/commending-the-isleta-police-department-and-local-law-enforcement"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Donald Trump ignore the law abroad makes him think he  has a free pass to do it right here at home.\n\nDonald Trump thinks if he can do this in the Caribbean, he can do it  on the streets of Chicago. He could use the military for his own  political retribution and consolidation of power in and outside our  borders.\n\nAfter all, he said in his own words:\n\nWe're…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…SHAHEEN. Mr. President, it wasn't that long ago that Sudan was  on a path to recovery after decades of violence and civil war.\n\nBack in 2018, Sudanese citizens took to the streets to protest the  conditions in their country. This movement pushed Omar al-Bashir, who  was indicted by the ICC for a campaign of mass killing and rape, out of  power, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…breaks for the wealthy.\n\nApparently, Republicans are content with continuing to ignore  Americans across the country who have flooded our offices with calls  and taken to the streets to tell them to keep their hands off our  healthcare, our education, and food assistance for our children, our  elders, and our neighbors in need.\n\nThey certainly haven't…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…who introduced a reign of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green  Movement, they looked to the United States for support but got only  silence. In 2016, the American Government sent $1.7 billion in cash to  the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…call simple.\n\nWe shouldn't have to wait for repeat drunk drivers to injure someone  or kill before they are deported. That is why H.R. 875 is so  imperative. It creates safer streets and safer communities for all of  us.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. MOORE of Alabama. Madam Speaker,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…change in       size or capacity of more than 20-percent, including       replacement of water or sewer lines, reconstruction of curbs       and sidewalks, and repaving of streets.\n\n(II) Rehabilitation of 1-to-4 unit residential buildings,       and existing housing-related infrastructure, such as repairs       or rehabilitation of existing wells, septics,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…borders so much or they want new voters in this country for them so  much, they crave for power so much that they are willing to let an  illegal immigrant rapist back out on the streets.\n\nA murderer. A burglar. Nope, we are not telling you. And oh, by the  way, we are not going to send 9-1-1 to help you if you have a problem.\n\nThis is insane.\n\nSo to my Republican…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…appreciate the time yielded  and the indulgence of the chairman. I urge strong support of H.R. 5143.  It restores legitimate discretion to the police officers who actually  work the streets of D.C.\n\nMr. HIGGINS of Louisiana. Mr. Speaker, let me just diplomatically  address a couple of the accusations here regarding the nature of my  bill.\n\nThe gentlewoman acknowledged…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Order  of Police, Major County Sheriffs of America, Peace Officers Research  Association of California, and so many others.\n\nYou can ask every law enforcement officer on the streets of America  whether they want this to move forward and pass and become law. The  answer is yes because the technology continues to grow and grow.\n\nWhen I first started in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  United Kingdom in World War II. Those still alive tear up and cry,  wondering what it was that they fought for when they watch the radical  extension of Islam into the streets of London and throughout the United  Kingdom.\n\nIn France, a majority of young French Muslims put sharia above their  own national laws, and more than a third have sympathy…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, since December 28, Iranian civilians  have taken to the streets to protest the bleak economic conditions and  the daily hardships imposed on their families by the Iranian regime.  Local protests have spread across the country to all 31…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…this should have happened. There is no  reason for the American taxpayer to have to fund the incarceration of  this person or any other programs to help him get back on the streets  of Georgia.\n\nThough my example is the worst outcome possible, illegal aliens  should not be able to stay in America with a minor penalty for driving  under the influence…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…moving to my State of Florida.\n\nAs Americans leave these horribly run States that do not cooperate  with law enforcement, where they release these criminals out on to the  streets, the only way they can retain power is to import illegal  immigrants to try to hold on to their seats in this House, to try to  hold on to their Federal funding, and to try…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…in decline. We are not a  nation in decline.\n\nThe city of D.C. needs to live up to its obligations to keep us safe.\n\nGet the homeless people help. Letting them live in the streets is not  helping them. You are hurting them. Get them mental health counseling.  Get them a shower. Get them a job. Get them help. Letting them live  under bridges is not helping…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…unleashed a wave of tragic and entirely preventable outcomes. Governor  Hochul and Democrats have doubled down on procriminal policies that put  violent offenders back on our streets, leaving families and communities  to suffer the consequences. The American people deserve better. New  Yorkers deserve better. People in Washington, D.C., deserve better,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…imperative. No  American should live in fear for their faith or their safety.\n\nWe must stand united in saying that anti-Semitism has no place on our  campuses, no place in our streets, and no place in the future of this  country. I am committed to ensuring that we act, not just speak,  because the time to confront rising hate is now.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…When danger or bad actors  present themselves to our communities, Craig has run toward them and  worked swiftly with his fellow marshals to remove these criminals from  the streets.\n\nIn August 1993, a convicted marijuana grower walked into the Frank  Carlson Federal Building in Topeka, Kansas, for his sentencing. What  was a normal day in Topeka suddenly…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…targeted police officers in D.C. for simply doing their duties, and  it led to over 1,600 officers being removed from the city's force.\n\nThanks to President Trump's efforts, the streets in D.C. are safer,  and we have the opportunity through these two measures to add to that  progress.\n\nFinally, Mr. Speaker, we have H. Con. Res. 58, a resolution  denouncing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}]