[{"senator": "Ed Case", "party": "Democrat", "sentence": "…support of  Congresswoman Radewagen's South Pacific Tuna Treaty Act. I am an  original cosponsor of this bill because we urgently need this update to  U.S. law that will strengthen our national tuna fleet, restore  regulatory clarity and reinforce America's presence and partnerships  across the Pacific.\n\nThe South Pacific Tuna Treaty, first signed in 1987,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Member Larsen for  including this amendment, and I look forward to working together with  the Coast Guard on this important issue.\n\nMadam Speaker, this bill will also strengthen our national security  and support the men and women I met at the Coast Guard Station in Jones  Beach. This bipartisan bill will ensure  that the Coast Guard has the resources…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Babin, who have helped shepherd this legislation through  today.\n\nMr. Speaker, I urge my colleagues on both sides to support this  commonsense, bipartisan measure to strengthen our national security and  our economy.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today in support of the ANCHOR Act,  a bipartisan bill to protect American maritime research and strengthen  our national security.\n\nThe University of Delaware's research vessel, the Hugh R. Sharp, is a  floating lab used by scientists and students to study everything from  our ocean…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Services Committee reported  out this year's NDAA, it was a bill I was proud to support after months  of bipartisan work, careful oversight, and real provisions to  strengthen our national defense. That is the kind of process this  committee is known for.\n\nAs we have sadly seen before, the amendments being considered are  largely partisan poison pills…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Our adversaries continue to target  our communications systems, so Congress must take steps now to protect  our communications, telecommunications infrastructure and strengthen  our national security to keep Americans safe. I urge a ``yes'' vote on  the bill.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…the rights and protections of the Federal workers who serve our  Nation, over 48,000 of them in Hawaii alone.\n\nJust yesterday, this House passed the NDAA, meant to strengthen our  national defense. However, the NDAA means nothing if we cut down, take  away rights, and fail to protect the very workforce that makes national  defense possible.\n\nEarlier…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697988/protect-americas-workforce-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…they are being held back from their fullest  potential, and that weakens our national security.\n\nIn the bill before us, rather than working with House Democrats to  strengthen our national security and prioritize the issues that matter  most to our men and women in uniform, House Republicans are abandoning  our allies, undermining democracy at home and…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…risk  leaving our defenses weakened.\n\nThe REFINER Act is common sense. It will help identify ways to expand  refining capacity, protect our energy infrastructure, and strengthen  our national security.\n\nMr. Speaker, we must act now to restore American energy dominance,  secure affordable fuel for families, and protect our Nation's military  defense. I urge…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…fueled American  innovation by providing early-stage funding to small businesses. These  investments have led to groundbreaking technologies that grow our  economy and strengthen our national defense.\n\nSBIR and STTR programs have been regularly reauthorized by Congress  to include many reforms to drive small business. However, the programs  will expire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our national  security.\n\nFinally, I want to address the fear-mongering among our Democrat  colleagues. This budget resolution does not cut benefits for any  legitimate recipient…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…in a row--the 65th  consecutive year--that Congress has come together across the aisle and  across two Chambers to send the President a bill designed to sustain  and strengthen the national defense.\n\nEveryone in this Senate played a role. I want to thank all 99 of my  colleagues. First among them, I thank Jack Reed, the ranking member of  the Senate Armed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Speaker, I rise today to urge my colleagues to  approve my bipartisan legislation, H.R. 252, the Secure Our Ports Act.\n\nThis bill is designed to strengthen our national security by  prohibiting foreign adversaries from owning and operating critical  infrastructure in the United States.\n\nChina's influence and access to critical infrastructure…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692207/secure-our-ports-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…obtained $83 million for the United States Strategic Command, the 55th  Wing, and the 557th Weather Wing--all of those are based at Offutt.\n\nThese funds are going to strengthen national security, and they are  going to enhance Nebraska's role in that.\n\nIn the agriculture and rural development funding bill, I secured $16  million for the USDA's Agricultural…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize our nuclear deterrent and strengthen our national  defense.\n\nAs chair of the Strategic Forces Subcommittee, I fought to upgrade  the National Nuclear Security Administration's infrastructure. The bill  establishes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…laundering and addressing national security  risks, we are able to help stop the illicit finance activities that do  real harm to the United States.\n\nBy passing this bill, we strengthen national security, protect  digital assets, and ensure the next generation of financial and  technological innovation is created right here in the U.S.\n\nI thank Chairman Hill…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…in a powerful new supply chain that will support upwards of 6,000  jobs. T1 delivers domestic energy and energy dominance.\n\nThis investment in American energy will strengthen our national  security, bolster our economic competitiveness, and power the future,  including the technologies of tomorrow like artificial intelligence and  data centers. I congratulate…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…supports this  resolution.\n\nMr. Speaker, Alaska is ready to power America. We are ready to help  lower energy costs for families and small businesses. We are ready to  strengthen national security by reducing our reliance on foreign  nations. The people who live in Alaska's Far North, the people whose  ancestors have called the region home for 10,000…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…where school funds come from and  whether foreign adversaries are exploiting financial ties to influence  students.\n\nBy requiring disclosure, we protect American values, strengthen  national security, and ensure our children learn what is right, not  what our adversaries dictate.\n\nMr. WALBERG.  I say that as a gentleman from  Michigan.\n\nMr. WALBERG.  As…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…have the following       responsibilities:\n\n(1) Promote the stability and resilience of critical supply       chains and critical and emerging technologies that strengthen       the national security of the United States.\n\n(2) Lead the Working Group established pursuant to section       3 and consult covered nongovernmental representatives,       industry,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…housing, childcare centers, and other  quality-of-life components that are so important to those who risk so  much.\n\nThis bill continues to build on investments that strengthen our  national security through the construction of modern infrastructure and  improvements to critical quality-of-life facilities for our  servicemembers and their families.\n\nAdditionally,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]