[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are introducing bills to expand access to tax-free  savings accounts to cover the costs of medical expenses, to improve  communication between Medicare and caregivers to streamline the  benefits process, and to create a new $5,000 tax credit to help offset  the costs of family caregiving.\n\nJust a few weeks ago, I joined a bipartisan, bicameral group…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…for them to raise capital from the public.\n\nI commend the gentleman from Iowa (Mr. Nunn) on this bill. I urge my  colleagues to support the ELEVATE Act of 2025, which would streamline  accounting disclosure requirements and auditing requirements for  emerging growth companies, also known as EGCs, so those EGCs only need  to provide 2 years of audited financial…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Development Center, or FFRDC, to evaluate  these communications within 30 days of the bill's enactment and submit  its recommendations within 90 days. This effort aims to streamline the  claims process and reduce the stress and confusion many veterans face  when dealing with their benefits.\n\nMr. Speaker, in spite of my support for the substance of this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…role, he helped the Council remain solvent during the Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns. He went on to continue serving  his union as a Chairman of the General President's Advisory Committee  and Special Assistant…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…monthly benefits, and other  information designed to help them more effectively plan for retirement.  To this end, SSA has worked diligently over the last several years to  streamline and modernize the Social Security annual statements to  increase the public's understanding of its programs. However, SSA's  funding constraints already limit SSA's ability…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…50-1 vote.\n\nThis legislation reflects input from Democrats, Republicans, and  hundreds of organizations nationwide. If enacted, the Housing for the  21st Century Act would streamline regulations, expand affordable  housing financing, and modernize Federal housing programs to  significantly expand the Nation's housing supply. Passage of this bill  would…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…infrastructure, particularly in high-risk areas of the West.\n\nCurrent requirements for timber sales can delay essential maintenance  and fire prevention efforts. This legislation would streamline that  process while maintaining environmental safeguards under existing land  management plans and Federal law.\n\nImportantly, the bill would ensure taxpayer fairness. If…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691067/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…and in the Pacific Northwest, hydropower  makes up the majority of our energy mix. That is why I am very proud to  lead this effort to enhance transparency and really help streamline the  non-Federal hydropower licensing process with my colleague from Idaho,  Representative Fulcher.\n\nThis bill will support the proper permitting of clean, abundant, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…always happy, as are other  Democrats on the Ways and Means Committee, for any initiative to  protect our data, to protect and secure it, to protect people's  privacy, and to streamline their ability to resolve their problem.\n\nI would hope that the authors of this legislation and the chairman of  the committee would recognize that this will mean that they…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…legislation.\n\nAI has the potential to boost productivity, enhance customer service,  and save costs. While it is becoming increasingly common for small  businesses to use AI to streamline their operations, many still do not  know how to access it responsibly. If used incorrectly, AI could have  disastrous consequences.\n\nThat is why it is incredibly important…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699178/ai-for-main-street-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…my colleagues, Representatives LaLota, Morrison,  and Thanedar.\n\nThis legislation would require the SBA and DOE to enter a memorandum  of understanding to help unify and streamline research efforts between  the national labs and American small businesses. Currently, the 17  national laboratories across the United States provide the government  with…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…impact       of such inefficiencies and duplicative steps on project       timelines;\n\n(3) the Secretary's recommendations for legislative or       administrative actions to streamline such permitting process;       and\n\n(4) a summary of the economic impacts associated with       current permitting timelines under such permitting process,       specifically…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…Interior fails to authorize the SWAP  within 180 days, the SWAP is deemed approved.\n\nIt is time to take a real swipe to unnecessary red tape, minimize  self-induced delays, and streamline the regulatory process for the  allocation of much-needed conservation funding to our States.\n\nMr. Speaker, this is a very good piece of legislation. It was my  pleasure…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual. This…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Interior to revise or  rescind any agency actions that are a barrier to domestic mining, as  well as make recommendations to Congress as to how current law can be  changed to streamline mineral development. It will also conduct a  broader review of State and local laws that are also holding us back  from our true mineral potential.\n\nI think each and every…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…to conduct a study on  whether the cancers suffered by military pilots and aircrew are related  to their chemical and toxic exposures.\n\nVA needs robust medical research to streamline military aircrew  veterans' access to disability compensation, and VA needs it fast for  today's and tomorrow's veterans.\n\nThis bill ensures that research gets done and that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…development that does not disproportionately burden residents       of economically distressed areas;\n\n(vi) provisions regarding review of by-right development       proposals to streamline review and reduce uncertainty,       including--\n\n(I) nondiscretionary, ministerial review; and\n\n(II) entitlement and design review processes;\n\n(vii) the reduction of obstacles,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…decisions in specific cases, and use limited  contempt authority to maintain order. This is similar to how magistrate  judges currently assist Federal district court judges to streamline  their dockets when consent of the parties exists. The result is simple:  faster resolution for taxpayers without sacrificing expertise on the  bench, fairness in the process,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…security vulnerabilities;\n\n``(3) describe actions to be taken to achieve such goals       and the means necessary to do so, including steps to reform,       improve, and streamline existing efforts to align the current       threat environment to elementary and secondary schools; and\n\n``(4) build upon existing or ongoing evaluations and avoid…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Cybersecurity,  Information Technology, and Government Innovation Subcommittee.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support this  important legislation, which will streamline cybersecurity  vulnerability disclosure to protect Federal IT systems.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…producers by President Biden's Green New Deal  initiatives.\n\nNow, my colleagues and I in the House will take up a strong  deregulation package this week that will further streamline the  permitting process for our energy producers throughout the U.S.\n\nIt is time that my colleagues and I codify President Trump's  deregulation agenda so that our energy…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual. This…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…studies have determined that predation from  double-crested cormorants costs the aquaculture industry nearly $65  million annually in economic losses.\n\nThis legislation would streamline the permitting process to take  double-crested cormorants, restoring protections for aquaculture  producers without negatively impacting cormorant populations.\n\nMr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual. This…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…stifles innovation and leaves  American farmers falling behind their international competitors.\n\nI am proud to join a bipartisan group of Members on the Innovative  FEED Act to streamline this process and cut the approval time down by  years.\n\nNutrient supplements keep our food supply safe and our livestock  healthy and allow American farmers to stay competitive…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}]