[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…volunteers, and all community members who tirelessly work  to equip our students for the future. We owe you a debt of gratitude  and so much more than that. We need to recommit to strengthening our  public schools and to investing in them.\n\nIn the first part of the 20th century, it was the high school  movement that broadly expanded educational attainment, preparing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…also imposes sanctions  on individuals who knowingly and directly engage in or facilitate the  involuntary harvesting of organs within the People's Republic of China  while strengthening reporting requirements regarding this heinous  crime.\n\nThese steps are vital to address the forcible harvesting of organs, a  grave violation of human rights and bodily…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…improving health  outcomes for patients and communities, securing global competitiveness  in science, boosting job creation, educating the next generation of  scientists, and strengthening economic growth.\n\nMedical research through the support of the National Institutes of  Health (NIH), continues to serve a vital role in the medical research  enterprise.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Health, USAID            the PRC is stepping up where the U.S. is stepping back\n\n``That support has been withdrawn and the sustainability       and the long-term system of strengthening . . . is       questionable for the future. The People's Republic of China       is filling that gap. The people in the communities that we       serve have lost services,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…headquartered in Reston, Virginia, within Virginia's 11th Congressional  District. Their presence in our community reflects the important role  this profession plays in strengthening access to justice nationwide.\n\nMr. Speaker, I urge my colleagues to join me in recognizing Court  Reporting and Captioning Week and in thanking these professionals for…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…have a roof over their heads.\n\nAll of these products will have higher costs, and the only ones who  will pay more are the families and businesses that buy them. Instead of  strengthening those relationships with our neighbors, Trump's tariffs  are making everything more expensive for us.\n\nWhat do we get in return? Absolutely nothing. American companies…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…for me, represents the kind of tangible, bipartisan work I  believe that Congress should be doing every day: delivering real  solutions, repairing historic injustices, and strengthening our  relationships with sovereign Tribal nations.\n\nEarlier this year, I reintroduced the Quinault Indian Nation Land  Transfer Act in partnership with Senators Cantwell…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…farmers across Maine and the  Northeast through her advocacy.\n\nAnnie recognizes the interconnectedness of our farms and communities,  and has steadfastly devoted herself to strengthening these ties,  carrying on Maine's agricultural legacy, and bolstering our food system  and economy.\n\nIn the words of Annie herself, ``Maine farms are not just part of our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…secure. The standards he set, the integrity he  brought to the job, and the respect he earned across Congress will  continue to shape the institution he devoted his career to  strengthening. I thank Gene Dodaro for his extraordinary service to our  country and wish him continued success in the next chapter of his  public service.", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…punished, not the severity or length of the  sentence, is what deters criminal conduct. Increasing and mandating  harsh, lengthy sentences will not deter illegal reentry, but  strengthening the border will do that.\n\nAccording to The Washington Post, the administration is actually  pressuring Governors today to commute the sentences of immigrants who  are in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for nearly five decades.\n\nFounded on October 22, 1975, as the Service League of Arlington with  45 charter members, the organization was officially…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…barriers to prevention, screening, and care.\n\nNational Cancer Prevention Month serves as a solemn reminder of both  the progress we have made and the work that remains. By strengthening  prevention efforts, expanding access to lifesaving screenings, and  working to close gaps in care, we can honor those we have lost and help  spare other families from…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…deliver the benefits they have earned. That is what guides my work on  the House Veterans' Affairs Committee and why I am proud to see this  bipartisan bill move forward.\n\nBy strengthening the expertise of the Board of Veterans' Appeals, we  can reduce the backlog, restore trust in the system, and ensure  veterans receive the timely and fair decisions they…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…thrive. At a time when harmful  Federal worker layoffs at the VA are making it harder for veterans to  access support, this legislation is more important than ever. By  strengthening SBA programs, we are investing in our veterans, creating  jobs, and boosting our local economies.\n\nMr. Speaker, I urge my colleagues to support this bill and show our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…hard to navigate, and roads that don't get fixed.\n\nThis shouldn't be a partisan issue. All of us here today should be in  favor of making our government work better and strengthening programs  that our constituents rely upon. In fact, some of my Republican  colleagues, led by Congressman Tony Gonzales, wrote in a letter to  Speaker Johnson that the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…hospitals, and ensures that communities across Jones County have  access to trained, qualified providers. I am proud to have secured this  funding and remain committed to strengthening healthcare access and  training across Iowa.\n\nMr. Speaker, I wish a very happy birthday to Ambassador and Iowa's  longest-serving Governor, Governor Terry Branstad. Happy…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696799/recognizing-jones-regional-medical-center-project-funding"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…to form well-rounded       individuals guided by wisdom and virtue;\n\nNow, therefore, be it\n\nResolved, That Holy Family Catholic Academy is applauded       for its role in strengthening the Niceville community and       advancing educational opportunity through the formation of       virtuous, thoughtful, and service-oriented young leaders; and\n\nResolved,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…defense? Well, I am not going to read  everything to you, but suffice it to say we plussed up or increased  nuclear weapons development, nuclear weapons sustainment. We are  strengthening our nuclear weapons stockpile testing. We are  strengthening its certification. We are continuing to provide money for  a new nuclear warhead, for a sea-launched cruise…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Strait of Hormuz, the narrow mouth of the Persian Gulf through which  nearly a fifth of all crude oil traded in the world passes. This is an  ominous sign. We know they are strengthening their cooperation together  in a way to undermine and challenge the West, including the United  States. The last thing the United States should do is to join this  cooperation…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…come  together to learn, grow, and celebrate Jewish life and values.\n\nSince its founding in 1945, the JCC has embraced its mission to be  the town square for building and strengthening community through  recreational, educational, cultural, and social programs rooted in  Jewish values. For 80 years, the JCC has fulfilled this mission by  offering a wide…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to       strengthen the international oversight of regulated       commodities, provide technical assistance to regulatory       partners in Abraham Accords countries on strengthening       regulatory oversight and converging regulatory requirements       for the oversight of regulated products, including good       manufacturing practices and other…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…concluded more than 35 years of combined  military and civilian service to our Nation.\n\nMaster Sergeant King now plans to dedicate his time to supporting  fellow veterans and strengthening the bonds of community that have  guided his life of service. His journey reflects not only a lifetime of  personal sacrifice, but also an enduring devotion to the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Jersey represents--as so much  of the United States of America--a small business community that is the  backbone of our economy; driving innovation, creating jobs, and  strengthening communities.\n\nIn today's world, small businesses face competition not just from  their neighbors and other States, but from businesses and corporations  around the globe.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Department of Justice. As a She Leads  America honoree, Jennifer believes leadership is a calling to serve  others with both truth and compassion, empowering individuals,  strengthening families, and preserving freedom for future generations.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  outstanding woman for her public service and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…will fully fund air  traffic control operations and enable the hiring of 2,500 new  controllers. It will jump-start the modernization of outdated  facilities and equipment, strengthening the safety and reliability of  our national airspace system.\n\nWe provide more than $64 billion for highways, taking care to send  the overwhelming majority of these dollars…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…celebrated her  final meeting as Secretary and Supervisor on December 4, 2025. Her six- year commitment to Warminster Township has been marked by leadership,  promise to strengthening local government, and an unwavering focus on  the residents of Warminster Township.\n\nThroughout her service, Judy witnessed and helped guide Warminster  through a period…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Timothy reported to 2nd Battalion, 9th Marines, where he  deployed to Okinawa, Japan, and participated in Exercise Forest Light  and the Korean Marine Exchange Program--strengthening joint  capabilities and international cooperation.\n\nFollowing this assignment, Timothy transitioned to Tampa, Florida,  where he served as the First Sergeant for Headquarters…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…extend their reach into America due to the open-border  policies that the left seems so committed to.\n\nIt is only through maintaining the policies of this President and  strengthening deterrence that we can ensure that illegal immigrant  criminals do not continue to flood this country.\n\nWe must send a message to those around the world who want to come…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…transport energy resources between the United States and our  neighbor to the north, Canada. It would have created tens of thousands  of jobs, as my colleague earlier said, strengthening our energy  security and generating billions of revenue to boost economic growth.\n\nDon't listen to this chatter out here. Talk to the folks in the  energy business. Let's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Strengthening America's       Turning Point Act''.       SEC. 2. SARATOGA NATIONAL BATTLEFIELD PARK.\n\n(a) Redesignation.--Saratoga National Historical Park shall       hereafter be known…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}]