[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the  legislative filibuster. So let's play it out a little bit so we are  clear as to what this would lead to.\n\nUnder this logic, the Trump administration can send an endless stream  of nonrule actions to Congress going back to 1996, including vaccine  approvals. After all, we have an HHS Secretary with a spotty history as  it pertains to the health and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…effort. When you turn on  the evening news, one-third--one out of every three--commercials you  see are for drugs from prescription drug companies. It is the same when  you stream your favorite show or scroll on social media.\n\nAmericans see an average nine pharmaceutical ads every single day.  With billions in targeted spending, patients are bombarded…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…saving  healthcare, not ending hunger, but getting an award.\n\nWe need serious people working to solve real problems, and what we  have is a reality TV show White House with a stream of consciousness  press operation, and it is supported by a Republican Congress that  thinks it is a debate club rather than an equal branch of government.\n\nThis Congress doesn't…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…for many Americans or whatever the latest overreach is  called for by President Trump?\n\nThis goes way beyond the filibuster. The Trump administration could  send an endless stream of nonrule actions to Congress, going back to  1996, including vaccine approvals, broadcast licenses, merger  approvals, and any number of government decisions that apply to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…me with a real, honest  fear about Medicaid cuts.\n\nHer granddaughter is just 11 years old, and she lives with type 1  diabetes.  Her life depends on insulin and a constant stream of medical supplies  to keep her alive.\n\nHer mother is a single mom and a nurse. She takes care of others for  a living. Even though she has her own insurance, it doesn't come…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691478/gop-tax-scam-hurts-women-and-families"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…has now grown to  over 600 volunteers. The conservancy has led the charge on habitat  conservation, environmental education, and advocacy in Loudoun County,  everything from stream monitoring to bird and animal counting.\n\nThe Loudoun Wildlife Conservancy reminds us that conservation isn't  just about nature. It is about community, resilience, and quality…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Act, further weakening protections on our rivers,  lakes, streams, and wetlands. This bill protects polluters from  responsibility for treating toxic pollution in their waste stream like  lead, mercury, selenium, PFAS, and arsenic. If enacted, the PERMIT Act  will lead to an increase in the unregulated discharge of these harmful  chemicals into local bodies…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…has moved beyond just simple bullying. Today, groups of  people online, like the so-called 764 network, seek out and coerce  vulnerable kids to photograph, record, or live stream acts of violence  or self-harm to the world.\n\nTake, for example, a horrific case that happened just last summer on  the online platform Roblox. Several people associated with…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Louis Leakey, digging age-old skulls       from earth, He found something in her manner, recognized her       hidden worth.\n\n``You shall study chimpanzees in the wilds of Gombe Stream,       You shall live among the primates and fulfill your childhood       dream.'' So at twenty-six she ventured to Tanzania's lake       shore, Where no woman dared go solo,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…troubling one:  Providers close down. Hospitals and clinics close down when Medicaid is  affected; particularly hospitals, for whom Medicaid is a huge portion  of the revenue stream coming into the hospital, find that they can't  make it work.\n\nA national organization that looks at hospital fiscal soundness has  put about 300 hospitals in the United States…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…that governs the policies of the Department of  Defense and authorizes our common defense. It is deeply unfortunate  that Congress considers this year's NDAA amongst a steady stream of  alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…``firearm'' is the meaning  given that term in section 921(a) of Title 18, excluding any machine  gun. They have properly decided that we should not put more machine  guns into the stream of commerce.\n\nWhat is still swept within it? Any explosive, incendiary, poison gas,  bomb, grenade, rocket, missile having explosive or incendiary charge of  more than \\1/4\\…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…continued access to  critical water infrastructure, and promote efficient regional water  supply management while protecting the wilderness area.\n\nIt would also support higher in-stream flows for Cross Creek, reduce  energy consumption, and foster long-term economic benefits for Eagle  County. This is a priority for this community, and I thank  Representative…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…More people are going to  get sick because of this law, but we are going to have fewer hospitals  and doctors to take care of them. Why? Because Medicaid is a big  revenue stream for really all hospitals but especially rural hospitals.  It can be up to about half of the payer mix.\n\nWhat is a payer mix? It just means you might get paid by private  insurance…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…also includes annual reporting to track progress on new  hydropower licenses, which are the most sensitive to licensing costs  and delays. Existing projects have a revenue stream to pull from that  allows the licensee to fund these processes, but new projects are  completely sourced by the developers.\n\nThis commonsense, bipartisan bill takes the first…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…assistance grant  programs.\n\nOverall, we addressed the priorities of dozens of Members of the  Senate, whether it was programmatic requests for more parochial  matters, like stream gages on the Ohio River, to the distribution of  revenues from development off the gulf coast.\n\nWe did instruct Agencies not to undertake certain activities that  would waste…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…our cities. We  cannot get used to this, and we should always be outraged when they  occur.\n\nUnfortunately, a tragedy like this is happening time and time again  in a growing stream of incidents across our country, wherein our  Nation's guardians, with whatever badge they wear and whatever oath  they have taken--from our guardsmen to our Federal law enforcement,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…in this bill, everywhere from the North Slope of Alaska to, yes,  the Gulf of America, where President Biden had shut down American  energy.\n\nHe green-lighted Russia's Nord Stream pipeline so Russia could  produce their energy, funding billions of dollars to go fund their war  against Ukraine, but in America, we were shut down. We open it up in  this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…PEPFAR, rather it eliminates programs antithetical to  American interests and ones that worsen the lives of women and  children. Enacting this rescission will get this funding stream back to  its core mission by refocusing it on protecting health and supporting  life-sustaining treatment.\n\nWhat we don't need is the wasteful spending priorities of President…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…said: Pay no attention to what the  President says; pay attention to what he does.\n\nI will say: I am paying attention to what he is doing because, in  addition to a steady stream of late-night rants on social media, we  have seen actions--actions--by Federal Agencies: investigations,  prosecutions, persecution, labeling protesters as domestic terrorists,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…years, large parts of my district and rural areas across America  have lacked access to fast broadband connections.\n\nReliable internet access is more than just being able to stream your  favorite TV shows and movies. It is the critical connecting link for  all of us. Whether it is helping our seniors access telehealth services  or allowing students to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…views, but they are all going to be private companies, Mr.  Speaker, not taxpayer-funded entities.\n\nIf somebody wants to pay money to go on one of their services that  they stream or get over-the-top or however they get their digital  content, they can still do that. There are a lot of options. There has  never been more options.\n\nSome people joke that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…moral and religious people. It is  wholly inadequate to the government of any other.''\n\nWe are witnessing the reality of Adams' wisdom in the clash of  cultures as outsiders stream into our country without assimilating. A  prominent Muslim attorney argued in the U.S. court: Islam is sharia;  sharia is Islam. The two cannot be separated.\n\nThere are acceptable…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…you know what. There are good projects, and there are bad  projects. We don't mine like we used to.\n\nIn Montana we have Virginia City. They took a paddleboard up the  river stream, took everything, turned it around. We don't mine like  that anymore.\n\nWe use science now, and when you look at the science and  documentation on this mine, it uses the best…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…hospitals by ensuring fair  reimbursement, strengthening telehealth and infrastructure, and  preserving access to critical resources like the 340B drug program, a  key revenue stream for rural hospitals.\n\nRural hospitals must not only survive but thrive. We need to keep  that because it is not about ZIP Codes.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Democrats say choice, choice, choice over and over, but they try to  deny women the choice to choose life.\n\nH.R. 6945 codifies the operations of TANF to ensure this funding  stream remains focused on its mission, helping needy families and  children, rather than serving as a tool for ideological gatekeeping.\n\nI am incredibly proud of this bill, which…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}]