[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…lifesaving.\n\nThe President and my Republican colleagues have spent the year  scapegoating a very small group of very vulnerable children because  they have no solution to strengthen the economy, reduce healthcare  costs, or make our communities safer. This legislation is just the  latest attack.\n\nMs. BONAMICI. As I close, Madam Speaker, I find it disturbing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Jinping. We cannot strip away resources from  allies confronting Russian aggression or leave a vacuum for our enemies  to exploit.\n\nInstead, we must reaffirm our commitment, strengthen our alliances,  and provide the tools our partners need to deter aggression and defend  democracy.\n\nI am proud to cosponsor this bipartisan amendment. I am proud to  stand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…legislation has done more to allow more Americans to live longer  and healthier lives than the bills that established Medicaid and  Medicare and the efforts that followed to strengthen both of these  landmark laws.\n\nSo before we proceed, let's take a step back for a moment and  remember that Congress created Medicaid for two simple reasons. Prior  to Medicaid's…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the quality of drinking  water across our great country.\n\nOur rivers, our brooks, and our streams are the center of our  communities, and we have come so far to protect and strengthen these  resources for the generations that will follow.\n\nInstead of strengthening our waterways, this bill that we are  debating today on the House floor is a wholesale attack…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…no child--Israeli or Palestinian--deserves to have  missiles fall on their heads. However, this NDAA goes beyond support  for missile defense and includes provisions that strengthen the defense  production relationship and technology sharing, including unmanned  systems, between the United States and Israel. As a strong critic of  Prime Minister Netanyahu,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…they come, and I know he is going to keep fighting.  Our thoughts and prayers are truly with him.\n\nMr. Speaker, I am pleased to support this bipartisan measure, which  will strengthen U.S.-Taiwan ties, showcase our support for Taiwan, and  help counter Beijing's coercive influence around the world.\n\nU.S. policy toward Taiwan remains consistent across administrations…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…operation of [HHS], and impede[d] [HHS's] flexibility to       adapt quickly to legal and policy mandates.''      Congressional Review Act (CRA)\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and the       Comptroller…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…investigations after  tragedies occur like the recent shootings of both Renee Good and Alex  Pretti.\n\nThese are just a few of the examples of commonsense practices that  strengthen accountability and help ensure the safety of both law  enforcement and our communities. Our local law enforcement personnel  already follow them, and we shouldn't expect…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…committee is always looking for ways to make the Tax  Court more efficient and fairer for the taxpayer, and that is why we  are here today.\n\nThe Tax Court Improvement Act will strengthen Tax Court procedures  and practices by making four commonsense reforms. The act will  accelerate the collection of documents, expand the types of cases  assigned to special…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…can't fight with doubt. Our factories can't build American  strength without steady support. This bill fails liberty on all counts.\n\nThis bill misses crucial opportunities to strengthen America's  defense industrial base. Shipbuilding is backed up over 2 years. The  Great Lakes region, a cornerstone of American industrial manufacturing,  can play a major…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…curb these rubberstamped mergers, former President Biden issued an  executive order to encourage the Department of Justice and the banking  agencies, including the OCC, to strengthen their merger reviews--get  more information and find out what they intended to do and how they  were going to provide more services.\n\nThat is what President Biden tried to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…adopted the preferred alternative, with some minor clarifying       edits and corrections to the Strategy.      Congressional Review Act (CRA)\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and the       Comptroller…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…squandering  investments made in their training and careers, and disrupting lives  and units.\n\nThat is why I introduced an amendment to repeal this ban because this  ban doesn't strengthen our military. It weakens it. It doesn't uphold  our values. It betrays them. It sends the cruelest message to some of  our most devoted patriots that one identity they hold…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to rescue him. Today, he continues to  keep the memories of his coworkers and friends alive.\n\nThese men were essential workers, working the dangerous jobs that  build and strengthen our State's infrastructure. It is in their loving  memory that we dedicate our own efforts to rebuilding the Key Bridge.\n\nWhen the bridge collapsed on that early morning,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…crisis and ensuring safety for life and property.\n\nTherefore, we ask for your leadership on this important       issue by passing H.R. 973. Doing so will save lives and       strengthen the safety of firefighters across the country.            Sincerely,                                               Robert S. Tucker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…In Tennessee alone, our advanced manufacturers are using it to become  more efficient, to lower costs, and to increase productivity.  Healthcare providers are using it to strengthen care, and researchers  are using it to discover new treatments. These are all things that are  worth celebrating. They are good, and they are yielding good results,  but…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…homicides and a sharp decline in carjackings since  President Trump's intervention.\n\nRepealing the antipolice policies enacted by the procriminal D.C.  Council will further strengthen President Trump's efforts and restore  common sense to law enforcement in Washington, D.C.\n\nLast Congress in the 118th, I led a joint resolution of disapproval  alongside…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…invests in rural development programs, including funding affordable  housing rental assistance for low-income families and seniors in rural  communities. These investments strengthen our local economies and  ensure that rural communities are not left behind.\n\nFor our troops, this bill demonstrates our dedication to veteran  medical care, including funding…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…we  obtained $83 million for the United States Strategic Command, the 55th  Wing, and the 557th Weather Wing--all of those are based at Offutt.\n\nThese funds are going to strengthen national security, and they are  going to enhance Nebraska's role in that.\n\nIn the agriculture and rural development funding bill, I secured $16  million for the USDA's Agricultural…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Republicans of the House  fashioned a fiscal framework that was responsible, that put pro-growth  policies in place to incent growth and job creation, move our country  forward, strengthen our economic base, which is our power base that  gives us our global leadership influence.\n\nWe also give tools and resources to our Commander in Chief to provide  for a common…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…here in D.C. A duly elected President should not be  bound by a bureaucratic commission when choosing judges. By ending this  broken system, we can fill vacancies faster, strengthen courts, and  ensure justice is delivered without delay.\n\nMr. Speaker, Democrats' soft-on-crime policies have failed in D.C.  just as they have failed in States like New York.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…those laws while expediting critical  energy infrastructure.\n\nWe want to fuel our Nation forward. If we want to lower costs for  consumers, win the AI race against China, and strengthen our position  as an energy superpower, it is critical that we have a regulatory and  statutory process in place that allows us to build infrastructure in  this country.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Iowa's most critical resources. He helped oversee  major infrastructure improvements, expanded watershed protection  programs, and worked with partners across the region to strengthen  collaboration among local water providers. His leadership helped bring  about the creation of Central Iowa Water Works, a new regional utility  model built on cooperation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…piece of legislation because when Roe  v. Wade was rightfully overturned in 2022, the next chapter of the pro- life movement began. We were all given the opportunity to help  strengthen our support for unborn babies and for new moms.\n\nAs a mom of two, this issue is personal for me. I know that when you  are pregnant, there are about a million questions that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "John James", "party": "Republican", "sentence": "…revival. By  unlocking responsible--responsible--development of critical minerals in  the Upper Peninsula, we can create good-paying jobs, attract investment  back to Michigan, strengthen local supply chains, and bring new life to  communities that have long contributed to America's prosperity.  Boosting domestic mineral production means boosting Michigan's…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…of if but when and how devastating it will be.\n\nThat is why the Utah Wildfire Research Institute Act is essential. By  passing this bill, Congress has the opportunity to strengthen how we  understand, prevent, and respond to wildfire in the Mountain West.\n\nAs the only Four Corners State to not have a SWERI facility, it is  only right for Utah to have…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698236/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…included is $643,000 for LGBTQI+ programs in the Western  Balkans. This is borrowed money.\n\nMr. Speaker, there is $567,000 for LGBTQI+ programs in Uganda and  $5.1 million to strengthen the ``resilience of lesbian, gay, bisexual,  intersex, and queer global movements.'' I am not sure what that global  movement is. They can continue that movement in some…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…democracy, and that is the right to vote.\n\nMr. Speaker, I urge everybody to pass this bill over to the Senate  and then the Senate to get it to President Trump's desk so we can  strengthen American democracy.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the power of mentorship  has left a lasting impression on the young people he has supported and  inspired.\n\nBeyond coaching and mentorship, Jim has worked tirelessly to  strengthen his community. He has been a dedicated member of the Rotary  Club, an advocate for educational initiatives, and a key organizer in  numerous fundraising efforts that have…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…would rather tip them off than to have  them deported. These are the facts.\n\nSo what should we do?\n\nHere is what I think: I think it is actually an opportunity for us to  strengthen our immigration laws. The Democrats want to kneecap ICE. I  have submitted the Protect America Act for debate. It would do four  things:\n\nOne, it would end sanctuary city…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]