[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…continue to support these much- needed reform efforts.\n\nMr. Speaker, this bill also includes important provisions to ensure  that our medical product supply chain can be strengthened by working  with international partners that believe in both tolerance and respect  for every person, as well as advancement of science and medicine.\n\nAs a whole, this bill…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…children since 2010, until funding for new orders was halted by the  Trump administration earlier this year.\n\nThis is not just about saving lives. This food aid has also  strengthened America's national security and commercial interests. In  the same country where this ready-to-use food has saved the lives of  children, the United States relies on cooperation…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690575/call-for-restoration-of-global-emergency-food-aid-funding"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…Compared to the rest of the defense budget, OHDACA's budget is  modest, but its impact is huge. It yields massive returns in lives  saved, crises stabilized, and partnerships strengthened.\n\nMr. Chair, I urge my colleagues to reject this amendment.\n\nMs. JACOBS. Mr. Chairman, these AUMFs were literally voted on when I  was 2 years old and 13 years old, respectively,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents       deemed important such as mandatory public release of body       worn camera footage within five days of officer-involved       deaths or serious bodily injury, strengthened civilian       oversight of police use of force, limitations on consent       searches, requiring additional law enforcement training on       racial bias and de-escalation…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…have made  progress. After the massacre at Columbine, we closed the gun show  loophole, which 90 percent of the American people support. After the  tragedy in Aurora, we strengthened background checks in my State. In  the wake of the shooting at Club Q, we raised the age to purchase a  firearm from 18 to 21. This year, Governor Polis signed three  commonsense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…deployed to Sarasota County, Florida  to provide critical support during Hurricane Milton.\n\nNathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership and commitment to  keeping our communities safe.\n\nOn behalf of the people of Colorado's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…from the Fredericksburg Police Department  after three decades of service.\n\nChief Layton has served in the department since 1994 and as chief  since January 2020. He has strengthened department recruitment and  retention, modernized their operations, and is expected to soon achieve  national accreditation for the city's emergency 911 center.\n\nThe role…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697520/recognizing-chief-brian-layton"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…exploring for a new community campus. He is also an  avid cyclist, a hobby he pursues with energy and enthusiasm. His  collaborative approach within Snohomish County has strengthened  regional partnerships while keeping Mill Creek's unique identity  intact.\n\nMr. Speaker, I ask my colleagues to join me in thanking Mayor  Holtzclaw for his leadership and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…continues to embody faith in  action. Through partnerships with local organizations and tireless  service for the Hampton community during the COVID-19 pandemic, they  have strengthened the church's legacy of compassion and service.\n\nMr. Speaker, as they mark this milestone, I extend my sincere  gratitude to Bethel Temple Church for seventy years of faithful…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…defended this Nation  with courage, discipline, and sacrifice, even when this Nation did not  fully defend them in return.\n\nTheir service helped win wars. Their leadership strengthened our  institutions. Their resilience expanded the promise of American  democracy. As we observe Black History Month, let us commit not only to  remembering this history but…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Comprehensive Policing and Justice Reform Amendment Act, among  other things, gave the police chief more authority to discipline  officers for serious misconduct and crimes; strengthened civilian  oversight of the police department; improved public access to body-worn  camera video; and imposed limitations on the purchase of military  weapons and the use…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…April 30, 1975. In the years since, hundreds of thousands of Vietnamese  Americans have built vibrant communities in the United States that have  enriched our Nation and strengthened our communities.\n\nBy recognizing Black April, we honor those who sacrificed their lives  for freedom, including members of the South Vietnamese military who  fought alongside…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…don my own       uniform, I understand that I'm not just pursuing a career but       that I'm continuing a mission he began. His success proved       that the military is strengthened, not compromised, by       diverse leadership. The respect he commanded showed that       authority flows from character and capability, not color or       gender.\n\nThe…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…restoring passage for sea- run fish species like Atlantic salmon to rebuilding working waterfront  properties after historic storms ravaged our coast. His efforts have  strengthened our environment, commercial fisheries, and coastal  communities.\n\nWhile Commissioner, Pat engaged stakeholders on some of the toughest  issues facing our state. He worked…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Under Tracy's leadership, Metrocrest Services opened its new, state- of-the-art community center, an investment that will serve north Texas  families for generations. He has strengthened partnerships, expanded  critical programs, and ensured that every person who walked through  Metrocrest's doors was met with dignity and hope.\n\nAs Tracy prepares for his…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…fairness and worker dignity.\n\nFollowing his service in law enforcement, Mr. Maki began working with  AFSCME, where he mentored countless workers, negotiated contracts, and  strengthened the voice of public employees. At the turn of the 21st  century, he continued his service working as a Federal Mediator and  Conciliation Services Commissioner. He helped…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696858/recognizing-donald-maki-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…in 1953.\n\nAt 106 years young, Hazel is not a page in our history book. She is a  living chapter of American courage. Her life reflects a generation  shaped by sacrifice, strengthened by service, and sustained by quiet  resolve.\n\nMr. Speaker, we honor Hazel Womble not only for the years she has  lived but the example she has set. Today, we celebrate an…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…led with conviction,  compassion, and humor, reminding us that faith must also always be  lived out through service.\n\nUnder his leadership, the Archdiocese of New York was strengthened in  meaningful ways, including the reopening of dozens of Catholic schools,  ensuring that families across our State continue to have access to  education rooted in faith,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…professionalism, integrity, and tireless commitment to  service have been evident in every role he has held. His legacy is one  of excellence, and his contributions have strengthened the foundation  of our military and its future.\n\nI also want to extend my deepest gratitude to his children--Sarah,  Grace, Naomi, Camille, and Nate--for their unwavering…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…sustain the  Wendelville Volunteer Fire Company.\n\nRandy's experience, leadership, and willingness to serve in any  capacity have inspired generations of firefighters and strengthened the  company's presence in the community.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Randy Moje for his remarkable 50 years…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service was not lost. Similarly, at Grace's Food Pantry,  Ambassadors stepped in to address staffing shortages, ensuring  continuity in service. Their proactive approach has strengthened the  program's ability to adapt and grow. RSVP Pasco demonstrates the  transformative power of volunteerism. From hurricane recovery to  improving healthcare and food security,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the authority of the Colombian state across  the nation.\n\nUnder his leadership, Colombia's economy flourished through increased  trade and investment. His administration strengthened U.S.-Colombian  relations, culminating in the U.S.-Colombia Trade Promotion Agreement,  which expanded cooperation on security and counter-narcotics efforts.\n\nPresident…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "John Thune", "party": "Republican", "sentence": "…we saw and what we are seeing as the facts  continue to come in from the Arctic Frost investigation, there was  clearly a violation of the law and a law that needs to be strengthened  and clarified so protections are in place for future Members of the  U.S. Senate.\n\nAgain, I would argue, someday, probably, Members of the House would  want that same protection.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…with the Jones County Coroner's Office, where  he continues to serve as deputy medical examiner.\n\nMr. Speaker, Mr. Sheffield's decades of leadership and dedication  have strengthened emergency preparedness across our State. Today, I am  proud to honor him and his lifetime of service.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…business and professional  members have generously volunteered their time and talents, faithfully  upholding Rotary's Four-Way Test. Their commitment to these principles  has strengthened the community and enriched countless lives.\n\nThrough community projects, scholarships, and youth initiatives, the  Rotary Club of Winter Garden has demonstrated unwavering…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699377/recognizing-the-100th-anniversary-of-the-rotary-club-of-winter-garden"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to determine  whether they pose any security risks for the United States.\n\nThrough the Foreign Investment Risk Review Modernization Act, or what  was known as FIRRMA, we strengthened and modernized CFIUS to rise to  the occasion of new threats coming from the People's Republic of China.  The President's America-first investment policy builds on this…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…administrator was recognized  by more than 50 higher education awards. He deeply believed in the  transformative power of higher education, and his stewardship directly  strengthened Georgia for generations.\n\nMr. Speaker, Dr. Adams has left an enduring legacy that will forever  touch the soul of our beloved State.                 Honoring Colonel Stephen…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…championed the rights of Orthodox Christians to worship freely. His  efforts to promote dialogue between the Orthodox Church and other  Christian denominations have significantly strengthened interreligious  understanding.\n\nIn my home State of Kansas, we are honored to have a strong and  active Greek Orthodox community, with more than 4,300 Orthodox  Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…workforce development,  scholarships, educational initiatives, and community programs, the  Foundation has served as a bridge between cultures and a beacon of  hope. It has strengthened the Korean American community while enriching  the social, civic, and cultural fabric of our Commonwealth and our  Nation.\n\nAs the Philip Jaisohn Memorial Foundation marks…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, today marks 46 years since the Taiwan  Relations Act became law.\n\nThis landmark bill has strengthened the partnership with Taiwan and  shaped America's foreign policy in the Indo-Pacific region.\n\nI will recognize that Taiwan is a trusted leader in freedom,  democracy, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690020/recognizing-taiwan-as-a-trusted-leader-in-freedom-democracy-and-trade"}]