[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…agents dragged a 67-year-old U.S. citizen from his car, breaking  six of his ribs, while children in Halloween costumes watched in  horror.\n\nWhat was his crime?\n\nTurning down a street to get home. That is what he did.\n\nBovino then went south to Charlotte, North Carolina, to continue his  reign of terror. Masked agents raided a church. Charlotte-Mecklenburg…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…vote in 1977 that allowed  Jimmy Carter to become a King on tariffs.\n\nSo the President says it is ``enemies of the country'' who are suing  him. If that is how you view Main Street in America--Kiwanians,  Rotarians, small business, chambers of commerce all across the  country--they are the ones bringing the suit and have already won twice  and are now…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…protections for wage theft. If  you want any indication where the current President stands on the  Department of Labor and American workers, all you have to do is walk  down the street and you will see a three-story picture, not of the  American worker on the front of the Department of Labor, but of Donald  Trump's face, who spent American taxpayer, hard-earned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…those families. It is 22 million Americans.\n\nBy the way, it is 10 million Americans who either own small  businesses or work in small businesses. So we are talking about Main  Street America. Ten million of the 22 million people actually work for  small businesses in America, so for them, this is going to be a bill  that they are going to be receiving in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…are frightened. Families are frightened. There is no need for  that in this country.\n\nWe need to have the rule of law reinstated. We can't have masked,  armed people on the street pulling over anyone that they choose to  based on the color of their skin or how they look.\n\nI said this in the Rules Committee when I testified. I actually have  two grandsons…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, on October 7, my constituent, Vicente  Ventura Aguilar, was snatched off the street by Federal immigration  agents.\n\nAccording to a friend who was detained alongside him, Vicente was  last seen on October 8 when he suffered a medical emergency and was  separated…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697508/vicente-ventura-aguilar-disappearance"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…happening in our State of Minnesota, the stories that have  captured everyone's attention.\n\nTwo innocent U.S. citizens, Alex Pretti and Renee Good, shot and  killed on the street in broad daylight by Federal agents just as they  were trying to help their neighbors and document with their telephones  what was going on, the brutality of it.\n\nA 5-year-old…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…share  would suggest.\n\nAn imbalanced power structure could limit other investors' abilities  to direct strategy or hold boards accountable. Basically, this bill  gives Main Street investors the complete and full picture and the  necessary information to make smart and informed decisions.\n\nLet me be clear: I very much understand the benefit of multiclass…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of energy and transportation,  and certainly not from our history of leading the world at the  forefront of new technologies.\n\nI would like to include in the Record a Wall Street Journal article  from April, ``Five-Minute EV Charging Is Here, but Not for U.S.-Made  Cars''. I would also point my colleagues to the following articles on  this topic: Electryk's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…stablecoins, which are  representations of dollars recorded on a blockchain.\n\nThe GENIUS Act could be the most significant banking bill that  Congress has considered since the Wall Street reform legislation that  passed after the 2008 financial crisis. There are a number of, I  believe, fundamental problems with the GENIUS Act in terms of national  security,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…justification for this invasion is  to get control of their oil, it should worry you more that now the plan  is not just to seize the oil for the purposes of enriching Wall Street  and the oil industry, the purpose is to seize the oil so the United  States can manage and run the country of Venezuela.\n\nWhy should regular Americans care about that?\n\nWell,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…administration  plans to do, would greatly undermine the FBI's security.\n\nThis is a picture of the Murrah Building in Oklahoma. In 1995, a guy  named McVeigh drove a step van up to the street of the Murrah Building  and blew it up, killing 168 people and injuring over 800 people. That  is a major artery in front of the Murrah Building.\n\nThe Reagan Building was designed…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…taken to preserve as much of the original  diner as possible, and Henry's successfully reopened the following  year.\n\nIn the early 90s, a McDonald's opened directly across the street from  Henry's. Some feared this signaled a cultural shift and could spell the  end of the historic diner. However, the McDonald's closed years ago  while Henry's remains standing…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise today to remember the life and times  of Millie Ortiz Sheehan. Today, we are naming a street after her in the  town of Greenburgh where she did so much to help her community and her  people.\n\nMillie was born in New York City, the daughter of Miguel and Cruz  Ortiz.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pretend it doesn't. It  is kind of like the situation where the king wears the magic robes--at  least he thinks he is wearing magic robes, but he is actually walking  down the street naked because he doesn't have magic robes--in this  case, again, lying to the public about the cost.\n\nIn the real world, you have real math. In this special new world  under…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…qualifications for  leadership to prioritize the rural communities.\n\nThis bill ensures that the office will be utilized to reach rural  entrepreneurs anywhere they are in Main Street America. These efforts  will strengthen local networks and equip entrepreneurs with the  knowledge and support necessary for long-term growth.\n\nH.R. 4549 is about investing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things that actually reduce spending and  modernize.\n\nI do want to sort of start with this. We have spent time since last  summer working on pieces of legislation. The Wall Street Journal series  and the ProPublica series came out about the scale of bad acts that  were happening in what we call Medicare part C, which is Medicare  Advantage for most of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…DUMP Red Tape Act strengthens our commitment to a pro-job, pro- innovation economy by ensuring that Federal agencies remain accountable  and responsive to the needs of Main Street.\n\nMr. Speaker, with that in mind, I urge my colleagues to vote ``yes''  on H.R.\n\nMr. WILLIAMS of Texas.  Hageman).\n\nMr. Speaker, despite what my colleagues say, there is no…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…it can even get to the  heart of the heartland.\n\nIowa's businesses, America's businesses, deserve an equal opportunity  to access the capital they need to grow right on Main Street. These  businesses are not backed by billion-dollar valuations or teams of  high-powered lawyers. What they do have is grit, innovation, and the  drive to succeed. They are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…regardless of party, to ensure that a  strong chief counsel stands up for the little guy and warns regulators  when small firms will be harmed.\n\nDr. Mulligan understands Main Street and the importance of examining  all costs imposed on America's entrepreneurs.\n\nI urge my colleagues to consent to the confirmation of Dr. Mulligan  as chief counsel of the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…says how crazy it is and how divided we are, and I always remind  people that when was the last time you had a Secretary of the Treasury  and Vice President dueling in the street?\n\nThat has happened in our past, not now, that was 200-and-change years  ago. We have differences of opinion, and that is the reason this body  exists. We represent our constituents,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Madam Speaker, I rise today in strong support of our AI  for Main Street Act.\n\nI thank Chairman Williams for his leadership. I also thank my  colleagues on the other side of the aisle. Foremost, I recognize both  Ranking Member Velazquez for her…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…backs that up.\n\nThis commonsense legislation, as well as others that Members will be  voting on this week, put Americans and American small businesses first.  It puts Main Street first.\n\nMr. Speaker, people can't stop there. There are many cities that  share the same lawless, woke policies as sanctuary cities. They are  soft on crime, even if they don't…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…owner myself, I know the early mornings,  the long nights, the lack of vacations, and the risks it takes to keep  a business running. These men and women are the heart of Main Street  America, and they deserve leaders who will fight for them.\n\nIn Iowa, small businesses represent 99 percent of all businesses in  the State. In President Trump's first term,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…in reality. People are not issued helicopters, grenades, or whatever  else.\n\nMr. FRY. Because they are not actually issued it.\n\nMr. FRY. You cannot buy these things on the street.\n\nMr. Speaker, H.R. 2255, the Federal Law Enforcement Officer Service  Weapon Purchase Act, is a very commonsense piece of legislation  supported by Republicans and, at least…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Recognizing the 50th Anniversary of Gallery 209 in Savannah\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize and  congratulate Gallery 209, located at 209 East River Street in Savannah,  on celebrating 50 years at its historic location.\n\nFounded in February 1975 by a group of Savannah artists, Gallery 209  has remained a member-driven space where…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…than the State of Kansas had ever  spent on addiction treatment and intervention and prevention.\n\nWe have an obligation to support these folks who are struggling down  the street from us with addiction. It shouldn't be a partisan issue. It  is more than just closing the border, although we have to do that. It  is about helping folks change their behavior…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 1461) to designate the facility of the United States  Postal Service located at 521 Thorn Street in Sewickley, Pennsylvania,  as the ``Mary Elizabeth `Bettie' Cole Post Office Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697612/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Homeowner's Association. Over the past 30  years, Hugh has worked tirelessly on the Board, mostly serving as  President. When safety concerns arose about people walking on the  street, he successfully fought for the installation of sidewalks at no  cost to our HOA. He negotiated the development of a front entrance  monument to maintain the community's visibility.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692162/recognizing-hugh-townsend"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Big Beautiful Bill Act is  a win for Utahns.\n\nIn Manti, I met with small business owners at a Sanpete County  Chamber of Commerce to talk about what this bill means to Main Street.  From making the small business tax deductions permanent to doubling  expensing for equipment, this bill gives Utah entrepreneurs the freedom  to grow, hire, and thrive.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}]