[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…for EGC spinoffs to 2 years.  That is only 2 years of audited financials, keeping in line with what  is required when the EGC itself goes public.\n\nIn doing so, this bill streamlines the financial disclosure  obligations for emerging growth companies across the board making it  easier for them to raise capital from the public.\n\nI commend the gentleman…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…fraud.\n\nTheir app, Eagle Express, establishes online wallets for students to  virtually track their Beak Bucks balances and redeem them for prize  rewards. Eagle Express also streamlines the process for teachers,  creating more efficient ways to track and allocate Beak Bucks.\n\nMr. Speaker, stories of innovation like these raise my spirits and  make me more…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…of what they own, what they are fully using,  or whether they are buying the same thing twice.\n\nThat doesn't make any sense, and this bill solves the problem.\n\nThis bill streamlines how agencies track, manage, and report their  software assets by requiring complete assessments on the software paid  for, used, or deployed at each agency.\n\nIt also requires…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…inadequate or confusing guidelines as to what they  are supposed to do with breast milk. The Bottles and Breastfeeding  Equipment Screening Enhancement Act strengthens and streamlines TSA's  screening procedures so parents can travel with dignity, confidence,  and peace of mind.\n\nIt requires TSA to work with maternal health experts to create clear,  science-based…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…costs, and fewer options for  care are symptoms of a workforce that is stretched far beyond its  limits.\n\nOur bill takes a commonsense approach to address the shortage. It  streamlines and modernizes the healthcare apprenticeship approval  process, requiring Federal and State labor agencies to act on the  application within 45 days, and directs the Department…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697515/supporting-healthcare-apprenticeships"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…prevents  Federal agencies like the SEC from obtaining data from the public. This  is the very data that assists the agencies in carrying out their  missions.\n\nThis bill streamlines the ability of the SEC's Office of the Advocate  for Small Business Capital Formation to carry out its mission by  exempting it from the requirements of the act in the same…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693955/improving-access-to-small-business-information-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Energy Regulatory Commission, and Federal  agencies proposing regulations that could affect the power generation  and grid reliability.\n\nIt strengthens Federal accountability, streamlines communication, and  puts in place commonsense guardrails needed to protect the bulk of the  power system.\n\nSince introducing this bill in the spring, I have heard from energy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…fought hard to include an  important provision in the One Big Beautiful Bill Act that cuts red  tape on domestic energy production. It reopens Federal lands for  drilling and streamlines refinery regulations.\n\nMr. Speaker, it is simple: When America produces more energy, we pay  less at the pump. That means that we don't have to beg foreign  dictators for…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…for  the American people and deliver on that American Dream of  homeownership.\n\nThis bill cuts through the regulatory choke hold that Washington has  imposed on housing. It streamlines permitting, modernizes outdated  Federal programs, and gets the Federal Government out of the way so  builders can do what they do best: build.\n\nIt empowers local communities,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…construction of this new home is being supported by an  organization called Non-profit Construction, which is leading the  rebuild, and El Dorado County's title 25 program, which streamlines the  rebuilding process for homes damaged or destroyed by the Caldor fire.\n\nThis groundbreaking and upcoming construction of this new home  represents not just shelter but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…tax  credits. It reverses electric vehicle mandates that let radical climate  activists set the standards in American energy.\n\nIt ends Biden's war on American energy.\n\nIt streamlines onerous permitting processes so America can get  building again.\n\nIt refills the Strategic Petroleum Reserve to safeguard America's  energy security.\n\nIt repeals and rescinds…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…restrictions. It opens up  investment opportunities to more working Americans saving for their  retirements, opportunities that are currently reserved for the rich.\n\nINVEST also streamlines disclosures for startups, and I like that it  includes my WKSI bill that alters the status of more companies. More  companies can sell securities to the public quicker and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697826/increasing-investor-opportunities-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…parcels suitable  for water recharge projects like aquifer recharge and surface  infiltration.\n\nThat is a very limited scope of the federally controlled land in  Arizona. It streamlines permitting under section 404 of the Clean Water  Act, and it minimizes red tape through categorical exclusions in  collaboration with State agencies.\n\nThis ensures Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…have been delayed or blocked  altogether.\n\nThe truth is America's power demand is surging. To meet this  challenge and power the future, we need pipelines. This legislation  streamlines regulatory oversight, establishes clear timelines for  environmental reviews, and helps lower costs for American families by  unleashing our full energy potential.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…EDWARDS. Mr. Speaker, I thank Mr. Valadao from California for his  leadership on Modernizing All Veterans and Survivors Claims Processing  Act. This important legislation streamlines the VA claims process,  helping veterans and their families receive the benefits that they have  earned and deserve.\n\nI am especially grateful to Mr. Valadao for his collaboration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…fight against the drug cartels that are ravaging  American communities, the Drug Enforcement Administration receives an  increase of $63 million in this bill.\n\nThe bill also streamlines and enhances support for the National  Weather Service to ensure Americans receive lifesaving information in  times of need.\n\nThis bill is pro-law enforcement. It includes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…terrorist organizations' use of generative artificial  intelligence applications.\n\nMr. Speaker, we have all seen AI permeate our lives in both positive  and negative ways. AI streamlines workflows, has made breakthroughs in  the medical field, and can dramatically increase the speed at which  Americans are able to do work. We have also seen the dark side…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Fairview, I heard from rural Utahns who rely on affordable energy  to power their homes, farms, and businesses, and they are tired of red  tape.\n\nThe One Big Beautiful Bill Act streamlines permitting, unleashes  Utah's energy potential, and helps providers deliver.\n\nFrom Payson to West Jordan to Murray, I visited Utah manufacturers to  see firsthand how the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "French Hill", "party": "Republican", "sentence": "…local housing process to give  rural and urban communities the tools they need to build homes faster.  Importantly, our bill helps banks access stable deposit funding. It  streamlines the exam process that is tailored particularly for our  vital community banks. It helps promote more community banks to do what  they do best, which is lend locally and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]