[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…members to ``Vote No'' on these harmful bills.   Commonsense policing reforms have not hindered historic low crime rates                                  in D.C.\n\nH.R. 5107 would strike down, without sufficient       justification, the majority of Comprehensive Policing and       Justice Reform Amendment Act of 2022 (CPJRAA), which enacted       police transparency…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Mr. Speaker, I need to say, as someone who served on the  House Rules Committee for 4 years, that we clearly could have put on  the floor and made in order an amendment to strike this provision from  the bill that had been passed by the Senate.\n\nMost people who took social studies in elementary school understand  the bill has to pass the Senate and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…you look at the data from DEA and people who work at the border,  less than 1 percent of fentanyl comes from Canada. Yet, he used that  law, without Congress' approval, to strike at that nation.\n\nWe have already heard from the new Prime Minister that they are going  to raise countertariffs against the U.S. This is a vicious cycle where  there is not…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…vote to spend one  more cent on ICE. I will not fund an agency that acts like an American  gestapo.\n\nThe Trump administration has launched a brutal and reckless campaign  to strike fear in immigrant communities across the country, and ICE is  on the front lines, using aggressive and violent tactics that too often  end in tragedy. I cannot support one…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President, I rise today to address a matter of grave  concern regarding the Trump administration's military operations in  South and Central America and specifically the September 2 strike on a  suspected drug vessel that has now been the subject of deeply troubling  press reporting.\n\nThe facts as we understand them are these: On September 2, U.S.  forces conducted…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…entering the United States comes from Canada.\n\nSome of my colleagues on the other side have voiced concerns about  tariffs but said they want to give Donald Trump more time to strike a  deal. I would ask: what in the past 6 months makes you think that this  is somehow magically going to get better?\n\nInstead of negotiating, Donald Trump spends his energy…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…authorizing the United States to  be at war--in this case, with Iran. That second criteria has been met.\n\nWe had a similar resolution on the floor a few years ago following  the U.S strike that killed the Iranian military leader Soleimani, and  the ruling of the Parliamentarian and really the acknowledgement of the  body was that there was no current congressional…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Ready  Group, the 22nd Marine Expeditionary Unit, attack submarines, P-8  Poseidon aircraft, Aegis destroyers, F-35 fighter jets, and eventually  the USS Gerald R. Ford Carrier Strike Group. The administration never  explained why this buildup was necessary other than vague references to  drug interdiction. It was clear then and it is perfectly clear now…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…these strikes has been authorized by Congress and I  have publicly called for them to cease because I believe them to be  unlawful extrajudicial killings.\n\nThe footage of the strike on September 2, 2025, which I have viewed  in a classified setting, is deeply alarming and calls into question the  Trump administration's respect for the laws of armed conflict.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…defend our own citizens and  interests or to come to the collective self-defense of our allies and  our partners.\n\nIt comes down to this: The President has used our military to strike  unknown targets on at least four occasions, and he is promising more.  With at least 21 people dead and more killing on the way and with the  President telling us that strikes…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…at  a dinner the night before the shooting. To think that one moment, you  can celebrate each other's company--laugh and joke, share a meal, a  drink--only for violence to strike the next moment makes us all sick to  our stomachs. It is haunting.\n\nMy prayers are with the families of the victims. I am heartbroken for  the loss of Representative Hortman…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…we had  protests on the ground. Back in the early 2000s, the then-government  had to fire or ended up firing 18,000 people in the oil industry  because there was a general strike. We have no idea and, certainly,  this President has no idea where this is going to go. He had no plan  going in, but we are all along for the ride.\n\nI think it is just as…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…day has fueled mass incarceration, economic  exploitation, and generational harm, especially for Black Americans.\n\nThat is why I support the abolition amendment, which would strike  this shameful exception from our Constitution and end the legalized  practice of slavery in the United States.\n\nDetroiters understand that reparations are not just about the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…recognized, but they held on  to that faith for this Nation, and they led us to being a better place.\n\nComing from that background, several actions of this administration  strike a little bit differently. It stings a little bit more when  things happen like the rolling back of an EEOC order that has been in  place since 1962 that was meant to make sure…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…evening to speak of a grave act  that took place last week in the capital of Ukraine, Kyiv. The Putin  dictatorship continues its illegal war with a double crime--a double- tap strike attack.\n\nA double tap is a merciless attack when a target is struck, but then  struck again within minutes in an attempt to kill survivors and first  responders. I repeat:…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…does.\n\nMr. Speaker, I will also remind the ranking member and my Democrat  colleagues that when they were last in the majority, they also utilized  an engrossment resolution to strike extraneous provisions from their  American Rescue Plan in 2021.\n\nFurthermore, Mr. Speaker, what we are doing with the reconciliation  bill and with the rescission bill is,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Israel, Saudi Arabia, and the United Arab Emirates--mostly civilians,  for that matter.\n\nSo if the Democrats had their way, President Trump would not be able  to, for example, strike a secret meeting of senior Houthi leaders;  wouldn't be able to strike imminent attacks on our friends in countries  like Israel, Saudi Arabia, or United Arab Emirates.\n\nI…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…post office in Knoxville, Tennessee, for Reverend Harold Middlebrook.\n\nReverend Middlebrook played a crucial role in the civil rights  movement during the sanitation workers strike in Memphis and later  founded the Dr. Martin Luther King, Jr. Commemorative Commission in  Knoxville.\n\nReverend Middlebrook was president of the Bolivar Human Development…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697619/reverend-harold-middlebrook-post-office-building"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…4-year low, my friends.\n\nThe Air Force and Space Force both hit their 2025 recruiting goals 3  months early.\n\nIsrael is agreeing to a 60-day cease-fire with Hamas. A successful  strike on Iranian nuclear sites handles that problem. That is exactly  right. Strength is back. America is back. It has resulted now in a  cease-fire deal between Iran and Israel.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…clashes in March between clans close to       Hezbollah and the Syrian army along the Lebanese-Syrian       border, the LAF deployed its Super Tucano attack aircraft to       strike at a position in Syria, demonstrating its growing       operational capabilities and use of such weapons. Despite the       cease-fire agreement, Israel has continued to carry…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Just this past weekend, Missouri's own 509th Bomb Wing and the 131st  Guard Wing of Whiteman Air Force Base in my district demonstrated the  vital role that our B-2 long-range strike force plays in preserving  national and international security.\n\nDrone warfare between Ukraine and Russia has shown just how  vulnerable strategic assets can be. This bill…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…potential aggressors. From protecting the shipping lanes in the Red Sea  to using sea power to protect our allies to securing our borders and,  finally, to projecting power to strike a nuclear-ready Iran, our  military continues to be up to the task.\n\nOur servicemembers should be commended on their professionalism and  commitment, but we have much more…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697789/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…is one of the  reasons God gave us a body in which whole milk clearly tastes better  than 2 percent milk and way better than skim milk.\n\nMr. Speaker, I urge my colleagues to strike a blow for freedom and to  bring the healthiness of our children back to what it was 50 years ago  and pass the Whole Milk for Healthy Kids Act.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698182/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…legislation.\n\nThis legislation will not only help taxpayers who have been victims  of fraud, but it will also help combat fraud by eliminating  opportunities for criminals to strike a second time.\n\nCheck fraud is a major challenge in this country, and it has grown  exponentially over the past several years. In fact, in 2022, the  Treasury Department's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…other two pieces of legislation under consideration via today's  rule are two separate Congressional Review Act resolutions: H.J. Res.  24 and H.J. Res. 75. These two CRAs will strike down separate rules  from the Department of Energy that were finalized under the Biden  administration.\n\nH.J. Res. 24 overturns a wrongheaded midnight rule from the  Department…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Beach for restructuring the       Federal anchorages in San Pedro Bay described on page 54 of       the Report of the National Transportation Safety Board titled       ``Anchor Strike of Underwater Pipeline and Eventual Crude Oil       Release'' and issued January 2, 2024.\n\n(2) Study.--The Secretary of the department in which the       Coast Guard is operating…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…like Huawei must be stopped. We can no longer permit  authoritarian regimes like China to infiltrate our networks and lurk in  the shadows, waiting for the opportune moment to strike. It is not  enough to brace ourselves for the aftermath of disaster. We must root  out the threat before it has time to fester.\n\nThe reality is this: Our foreign adversaries…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Calvert's bill would also require VA to improve  communications during urgent fraud incidents, so veterans and their  families are not left in the dark while scammers continue to strike. By  building up VA's existing antifraud tools, adding new ones where  necessary, we can combat fraud head-on.\n\nMr. Speaker, at the end of the day, veterans should never lose…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…invasion-of-Israel capabilities       through the Radwan force, and also to the Lebanese       government, which is responsible for upholding the       agreement.''\n\n``We will strike every terrorist and thwart any threat to       the residents of the north and to the State of Israel, and we       will respond with maximum force against any attempt [by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…world saw, once again, what American  resolve looks like when we are paired with unmatched precision and  capability. B-2s launched from Whiteman and executed a long-range  strike against Iran in Operation Midnight Hammer.\n\nThis is one of the best examples of integration of total force that  has come from Whiteman Air Force Base in recent times. Operation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}]