[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…similar standards in the future.\n\nNow, let me say, Mr. Speaker, at a time when Americans are struggling  to make ends meet and facing the reality that Republicans may soon  strip them and their families of healthcare, it is shocking that House  Republicans are spending another day here on the floor focusing on  repealing commonsense energy efficiency…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Palestinians have waited for food, water, medical supplies, and  nutrition kits that have not come.\n\nInstead, an estimated 170,000 metric tons of aid sits right outside  the Gaza Strip, prohibited to enter by Prime Minister Netanyahu.\n\nLet me be clear. Since October 7, the return of all hostages, living  and dead, has been my priority. They must be returned…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692119/aid-to-gaza"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…disposable.\n\nThese workers feed America. They feed you every night. They do the  work most people can't and won't.\n\nInstead of protecting them, this administration wants to strip away  their voice and hand power to the very people who exploit them.\n\nOmar) to  discuss the tools available to OSHA to keep Americans safe at work.\n\nMrs. McIVER. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…said several times in the course of this debate,  is a blunt instrument. It would prevent BLM from ever issuing a  substantially similar replacement, and so this path would strip local  land managers of the ability to respond to on-the-ground changes and  needs for the future of the NPR-A.\n\nMy friends across the aisle don't need to do this. There are…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…defenses, undermine the general welfare, and reserve to  ourselves and our posterity staggering debt servitude for eternity, do  hereby instruct the Republicans in Congress to strip 17 million people  of their healthcare, increase copays, deductibles, and premiums for  everyone else, cut 42 million people off of nutritional assistance,  increase the national…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693231/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…by Hamas were abused,  shackled in cages, and isolated in underground tunnels--in some cases,  for more than 2 years. Many were killed there.\n\nAccording to UNICEF, the Gaza Strip is now home to the world's  highest concentration of child amputees. More than 80 percent of  buildings in Gaza have been damaged or destroyed in the violence.\n\nThe world breathed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, I rise to speak in opposition to H.R.  1949.\n\nMr. Speaker, this bill would force the Department of Energy to  rubberstamp every LNG export and strip the Department of its ability to  review whether those exports are actually in the public interest.\n\nAt a time when families across the country are already seeing rising  costs,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…for the use of these resources.\n\nThe National Marine Sanctuaries Act is the only statute requiring  compatibility with the conservation objectives of each sanctuary. If we  strip that away, as this bill would do, we have created a regulatory  sacrifice zone.\n\nHouse Republicans can't even identify which licenses and permits  would qualify in this bill…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…blatant lie and absurd insult is a lie directly out  of Soviet-style propagandist playbooks. It is Putin who wants to take  Ukraine's resource-rich land. It is Putin who wants to strip its people  of their rights and their freedoms, and it is Putin who wants to  destroy another European democracy. It is Putin who is a cancer on the  world, a liar, a torturer,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…filibuster for the oil industry.  Tomorrow, we blow another hole in the filibuster for what other  polluting industry? Or, more broadly, should we expect this majority to  use it to strip away protections for workers or privacy rights or  reproductive freedom?\n\nThis is the real fight here, not just over emissions or waivers or  vehicles, but whether we are a…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…over 900 nuclear tests,  more than any other place in the country.\n\nThroughout the 1950s, the visible mushroom clouds often loomed in the  distance. They could be seen from the strip, and they became part of a  tourist attraction there in southern Nevada.\n\nThese tests were conducted for a number of reasons. They were to  better understand the power and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans from air pollution.  Unfortunately for everyone with lungs, Republicans can't leave  commonsense environmental protections in place.\n\nAs the House Republicans move to strip healthcare from millions of  Americans to fund tax breaks for billionaires and big corporations,  they also want to make people sicker by rolling back regulations meant  to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…and a  half years.\n\nPlaces like West Las Vegas, which became the heart of the city's  Black community during segregation.\n\nBlack-owned businesses and venues along the Black Strip on Jackson  Avenue allowed culture to thrive . . .\n\n. . . while entrepreneurship and homeownership helped local community  members begin to accumulate wealth.\n\nAnd breakthroughs,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…million people to flee to Bangladesh and  Thailand. A recent investigation by the United Nations concluded the  2017 attacks were a ``coordinated and organized operation'' to strip  the Rohingya of their land rights within the country. In 2022, the  State Department officially determined that these actions constituted a  genocide.\n\nToday, refugees from…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…doesn't care about that. Linda  McMahon will carry out President Trump's dangerous agenda to dismantle  the Department of Education, privatize the Nation's public schools, and  strip educational opportunities from millions of students across the  country.\n\nIn doing so, she will be 100-percent loyal to Donald Trump above all  else. She will execute the plans…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…these cables, or not bury but run it along the  ocean floor.\n\nAgain, they are 1 inch to 2 inches in diameter. If you just looked at  1 mile at, say, 4 inches in diameter, that strip of land at a rate of  $40,000 per mile would be the equivalent of a yearly rent of about $1  million per acre every year.\n\nThe whole rule and the law was stacked against doing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to law enforcement, do you know the other  things that sheriffs in my district need to respond to crime and to  keep people alive? They need rural hospitals. When Republicans strip  $715 billion from Medicaid, no matter how they try to paint that pig,  they will be eliminating rural hospitals and emergency rooms.\n\nWhen they do that, police officers in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…some people who wonder why we have demonstrations in this country  hostile to Israel, and even more bizarre, demonstrations favorable to  Hamas and people who live in the Gaza Strip.\n\nIt has been my belief--and I give this conversation privately to  people, but I should make my case more public--that when people take  bizarre positions, in other words,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…their critical investments in education and  other important causes.\n\nUnfortunately, it was through a Democratic Byrd process. It was a  partisan effort to initiate a process to strip out the provisions that  would have exempted religious institutions from attacks that should not  be applied to them.\n\nSo I seek an exemption on behalf of all these religious…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Chair, I rise in support of my amendment to strip out  the earmarks within the Labor, Health and Human Services, and Education  division from the underlying legislation.\n\nThis includes over 900 earmarks totaling nearly $1.4…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…is absolutely my favorite one. I am  going to call this a T-bone steak. Most of you know that a T-bone steak  not only has a bone in it, but on one side, of course, is the KC strip.  That is a Kansas City strip. Some mistakenly call it a New York strip,  but this is actually a KC strip, as well. And on this side, there is a  little bit more of a flavorless…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…object because we did it in coordination with the Democrats.\n\nThe House? The House did it quickly. There are provisions in this  bill from the House that his amendment would strip out--the  notification requirement. Every Member should want to be notified if  anybody in the government, in the executive branch, is looking at your  phone records. This…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…emissions,  are actually being punished. That is not environmentalism; that is  government overreach plain and simple.\n\nLet me be clear, Mr. Speaker. This resolution does not strip the EPA  of its authority to regulate air pollutants. It doesn't. It simply  returns us to the commonsense, pro-growth, pro-clean-air policy of the  Trump administration. If…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…less than any other system.\n\nStill, even with it as it is, 40 percent of pregnant women in the  country rely on Medicaid so they can give birth to healthy babies. They  would strip that away from those women. It is even higher in rural  areas, and those hospitals in the rural areas rely on that.\n\nWith regards to prices, Trump's tariffs are raising prices.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…protecting our children.\n\nIn many ways, KOSA is common sense. We have many protections for  children in the physical world. Yet, if children are unable to buy  alcohol or go to a strip club in the physical world, why do we allow  them to be exposed to harms in the virtual space? They are exposed to  these same harms 24 hours a day, 7 days a week, 365 days…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…on January 6 was  Ashli Babbitt, an unarmed Air Force veteran who was shot that day in  this building.\n\nRecently, Senate Democrats attempted--think about this--attempted to  strip Ashli Babbitt of her military funeral honors. Now, why would they  do that? Ashli Babbitt was wrongfully killed on January 6, 2021. The  Federal Government admitted it, and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…In fact, the United States conducts research,  development, and test activities with Israel, which must contend with a  vast network of Hamas tunnels originating in the Gaza Strip. This  partnership helps us to detect and destroy tunnels in our respective  countries.\n\nThe FY23 NDAA mandated that CBP submit a one-time report to Congress  on a strategic…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California Coastal Commission is Out of Control\n\nMr. KILEY of California. Mr. Speaker, this week, I officially  introduced the Coastal Commission Accountability Act to strip the  California Coastal Commission of its powers under Federal law.\n\nThe Coastal Commission is simply out of control. It is one of the  most out-of-control agencies in the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…families from pregnancy through childbirth and beyond with  parenting classes and assistance such as formula, diapers, and whatever  else that family may need.\n\nThe attempt to strip TANF funding from these centers was never about  fiscal responsibility. It was a targeted, ideological attack on  organizations that provide a real alternative to abortion.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Tucked away on page 163, title VII, division B of this spending  package is a provision that will shut down the hemp industry across the  United States. My amendment would strip the provision designed to  regulate the hemp industry to death.\n\nThe bill as it now stands overrides the regulatory frameworks of  several States, cancels the collective decisions…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}]