[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Security and the Medicare of the American people.\n\nKeep your hands off Social Security, Medicare, Medicaid, all of those  things. Hands off.\n\nOne of the many reasons why we strongly oppose Donald Trump's one  big, ugly bill is because it will result in the largest cut to  Medicare, sets in motion the largest cut to Medicare, more than $500  billion by some…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, I rise to strongly oppose the Law-Enforcement  Innovate to De-Escalate Act, a very disingenuous title for a bill that  doesn't mention law enforcement through the text of the bill.\n\nThis bill does…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. Speaker, I stand tonight to strongly oppose this bill, which  repeals commonsense criminal justice reforms that were passed by D.C.'s  elected representatives in the wake of George Floyd and the Black Lives  Matter…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I strongly oppose this bill, which eliminates the  District of Columbia's already small role in the selection of its local  judges.\n\nMr. Speaker, I include in the Record letters opposing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Speaker, I urge my Republican colleagues to get serious and focus  on the priorities our constituents sent us here to address. For all  these reasons and so many more, I strongly oppose this bill.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…requiring the agency to make a monthly payment of the amount  due plus interest.\n\nHHS should be held accountable for harming individuals, families, and  businesses.\n\nI strongly oppose this bill that tramples on women's rights to choose  their own best health interests.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699231/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…taking away their health coverage, regardless of what they say about  the red tape.\n\nThis is from a coalition of 425 disability and aging organizations.  They say: We strongly oppose Medicaid cuts in any form. Whether it is  done by imposing work requirements, repealing the eligibility and  enrollment rule, or further eliminating the way States fund…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Madam Chair, I rise in opposition to the amendment.\n\nMs. ELFRETH. Madam Chair, House Natural Resources Committee Democrats  strongly oppose Biggs amendment No. 29, which seeks to weaken the  Department of Defense's work to preserve habitats crucial for military  readiness and recovering vulnerable species.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to be a model for  our Nation of courage, compassion, and conviction.\n\nI could not be prouder of my state and its people.\n\nAnd so that brings me to my vote this week.\n\nI strongly oppose combining Homeland Security funding with the other  important Appropriations bills in this package. I wish that it had not  been tied to funding for the Departments of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…reckless budget  resolution bestows tax cuts for the wealthiest 1 percent of Americans  while jeopardizing essential healthcare and nutrition programs. For  this reason, I strongly oppose the budget resolution authored by House  Republicans.\n\nShockingly, gutting programs our communities rely on isn't harmful  enough because this resolution will also require…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I strongly oppose this undemocratic and paternalistic  bill, which amends D.C. law. The over 700,000 D.C. residents, the  majority of whom are Black and Brown, are capable and worthy of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I strongly oppose this undemocratic, anti- immigrant bill, which would nullify laws, policies, and practices  enacted by the locally elected District of Columbia Government. The  over 700,000…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. HUFFMAN. Mr. Speaker, I strongly oppose all three of these  Congressional Review Act resolutions on the floor because the reality  is that these would overhaul years of public input. They would silence  Tribal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…While most other federal employees are  eligible for VERA if their agencies are undergoing a RIF or other  restructuring, the members of the Foreign Service are not.\n\nI strongly oppose the Trump administration's efforts to fire federal  employees and to dismantle the federal government, and I will continue  to fight those efforts using every tool at…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693054/introduction-of-the-foreign-service-voluntary-early-retirement-authority-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…while stripping  healthcare away from more than 13 million Americans.\n\nI mean, they are jeopardizing our health and taking away our  healthcare. I urge my colleagues to strongly oppose this bill. It is a  corporate giveaway that hurts our constituents once again.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691595/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…prices, and cost  hundreds of thousands of jobs was made by California and approved by a  Federal administration that had already been rejected by the American  voters.\n\nI strongly oppose these California EV mandates and strongly oppose a  process that allows such a major national policy decision to be made  against the will of the American people, without…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, I thank the chairman for yielding me  time on this important issue.\n\nI strongly oppose this bill because it would jeopardize our national  security, and it locks in harmful last-minute agreements from the Biden  administration.\n\nUnion bosses love this bill…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…enough resources not  to depend on the charity of the United States or any other country to  fix the destruction that Maduro wrought.\n\nMr. Speaker, for those reasons, I strongly oppose this resolution,  and I urge my colleagues to do the same.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…friend from Texas for  yielding.\n\nMr. Speaker, the question I wanted to ask to my Democratic colleagues  is  that since they have made it abundantly clear that Democrats strongly  oppose photo identification in order to vote, now that is a First  Amendment right, so am I correct in assuming that Democrats also  strongly oppose a government-issued photo…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Ms. MACE. Mr. Speaker, while I support the Senate Amendment to H.R.  5371, which puts an end to the Democrats' reckless and unnecessary 43- day government shutdown, I strongly oppose Section 781 of this bill,  which would deal a fatal blow to American farmers supplying the  regulated hemp industry and small businesses, and jeopardize tens of  billions…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…I would like to state clearly that the administration  is very much opposed to this resolution, and they have put out a policy  statement as of today stating that they strongly oppose S.J. Res. 90.\n\nWithout going into all the details, they say that S.J. Res. 90 fails  to account for the extraordinary national security threat posed by  transnational…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…important factors in  choosing ERISA retirement plan service providers. In so doing, they are  advocating for blatant race and sex discrimination, which we should all  strongly oppose.\n\nDiscrimination is never justified, and the use of quotas is  inherently discriminatory. ERISA plan service providers must be  selected using a prudent and nondiscriminatory…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Newsom, as his plan to  push the commission aside requires voter approval.\n\nTo overcome this problem, to produce an artifact of voter approval  for a proposition our voters strongly oppose, the Governor has resorted  to two strategies: disenfranchising voters and defrauding them.\n\nFirst, the Governor has called a sudden, impromptu, off-year, low- turnout…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "James Risch", "party": "Republican", "sentence": "Mr. RISCH. Mr. President, I rise today and come here to strongly  oppose the two resolutions before the Senate at this moment.\n\nThese misguided resolutions, if adopted, would reinstate the failed  policies of the Biden administration. Worse,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "Mr. DIAZ-BALART. Mr. Speaker, I strongly oppose this resolution,  which limits the United States' ability to fight narcoterrorist  traffickers in our own hemisphere, where we are most directly impacted.\n\nI just heard…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]