[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…accolades reflect the tangible, community-level impact of Mr. Thomas'  contributions toward creating more equitable hiring practices, greater  workplace protections, and a stronger pipeline for economic mobility.\n\nBeyond the state of Missouri, Mr. Thomas' voice has been heard across  the country. As Special International Representative for the Laborers…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…And fortunately, it failed here. But  don't forget why this failed. This failed because of patriotic police  officers. It failed because the will of the American people was  stronger than an angry mob and stronger than Donald Trump.\n\nBut now the question is: If this happens again, will this fail?  Democracy is not self-executing. It depends on leaders…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…safety. For them, they would have to figure out where to get the money  from, or else they would be slashing services.\n\nIt is an unholy choice. Cutting Medicare doesn't make us stronger. It  will weaken our economy. It will raise healthcare costs for everyone  and push millions of Americans into crises that will ripple and radiate  through their lives, their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…a successor, we would lose onsite  inspections, data exchanges, and mutual visibility into the Russian  nuclear forces. That loss does not make the United States safer or  stronger. It increases uncertainty. It fuels worst-case assumptions and  raises the risk of a dangerous miscalculation.\n\nThat is why I am proud to be leading H. Res. 100, which calls…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and       honors the principles of home rule. Together, we can build on       our successes while protecting the autonomy that, as history       reflects, has made our city stronger.            Sincerely,                                                     Muriel Bowser,      Mayor.                                   ____                              Council…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…unions to further his power grab  and to continue to push an agenda which leaves working families behind  and, instead, supports billionaires.\n\nUnions make our middle class stronger. They make our government  stronger, and they make our economy stronger. We should be working  every day to strengthen the right to organize and not to undermine it.  This…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…one of the countless ``powerful women,'' ``poderosas mujeres''  leaders organizing to protect and unite our communities reminding us  that immigrants make our communities stronger.\n\nOn behalf of Illinois' Third Congressional District, it is my honor  to commend Erendira Rendon in this day for her lifelong commitment to  ensuring that immigrant communities…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…encourage the Board of  Veterans' Appeals to prioritize hiring judges with at least 3 years of  veterans' law experience. That means more cases decided, fewer delays,  and stronger retention of professionals who already understand this  complex and deeply consequential area of the law.\n\nHiring experienced veteran law judges will help speed the appeals…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…prevention, malaria,       maternal care, newborn care and water and sanitation       programs.                    top line impact of global health cuts\n\nOur 50-country network for stronger surveillance to deadly       diseases from bird flu to swine fever [is] gone.\n\nOur emergency response system that cut response times to       global outbreaks from greater…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…driving force behind the organization's  success. Through their hard work, they have uplifted individuals,  strengthened families, and transformed lives, making our communities  stronger and more resilient.\n\nMr. Speaker, I am proud to represent such an impactful organization  in my district. I ask my colleagues to join me in congratulating Family  Counseling…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…386  and Business Manager/Secretary-Treasurer for District Council 82. In  this role, he helped the Council remain solvent during the Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns. He went on to continue serving  his…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…have a heart condition?\n\nI submit that, for all of our challenges, we suffer not from a  poverty of resources but a poverty of moral imagination. We are bigger,  better, and stronger when our reach is wide and when we dare to build a  nation that embraces all of our children. God gives us strength, grace,  and moral courage to get it right.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…under the guise of efficiency.\n\nDemocrats are the party that champion and protect the things that  working people rely on, like the Affordable  Care Act, Social Security, stronger unions and workplace protections,  the 40-hour workweek, overtime pay, public education, and strong  consumer protections. However, we need more Democrats whose filter for…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…fighting to protect and pursue opportunities that give Black Americans  the same advantages that White Americans have enjoyed since our  Nation's founding.\n\nOur history is made stronger and more vibrant. Just when Black  Americans think that we are equal, we are still fighting for equal  rights.\n\nHere we are, from chaos and confusion with this administration,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Secondly, this bill will also strengthen law enforcement's ability to  combat check fraud. Criminals have become more sophisticated in their  methods, and law enforcement needs stronger tools to fight back.\n\nLastly, a financial system that cannot protect its users from fraud  is a system in jeopardy. If consumers and businesses lose faith in  their ability…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…in community spaces like their town park.  These efforts reflect the vision and determination of a community that  takes pride in where they live and works hard to build a stronger  future.\n\nRico exemplifies what it means to be a small-town community in  western Colorado. Its commitment to progress and service will continue  to enrich the lives of many…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697140/recognizing-2025-small-community-of-the-year-rico-colorado"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is a  privilege to celebrate National Volunteer Month, recognizing and  honoring the millions of individuals who dedicate their time and  talents to making our communities stronger, more resilient, and more  compassionate.\n\nWhen we give our time and our efforts to others, we foster a sense of  unity and purpose. We bridge divides, strengthen neighborhoods,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…preserved more than 9,300 jobs across coastal  Georgia, Florida, and South Carolina.\n\nI thank CADDA for their steady commitment to expanding access to  capital and building stronger communities.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699854/marking-50th-anniversary-of-coastal-area-district-development-authority"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…decades, our partnership with Taiwan has been anchored in  democracy, in freedom, and in economic opportunity. Today, it is  equally defined by innovation and resilience. A stronger Taiwan means a  stronger United States and vice versa. That is why both our Nations  must continue working deliberately and decisively to deepen  cooperation. The payoff is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…are going to fight for those hardworking families who want to get  our great country back on track.\n\nLet's pass this bill, keep moving, and keep working toward a better,  stronger America.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…dollar stolen by fraud, it is a dollar we  cannot spend on public safety, on our national security, or on helping  working families get ahead.\n\nWe owe taxpayers accountability, stronger oversight, and closed  loopholes that invite abuse.\n\nProtect the taxpayers. Protect the programs, and punish the scammers.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699028/trust-versus-waste"}, {"senator": "John Thune", "party": "Republican", "sentence": "…promises to the American people. We promised to  turn the page on the failures of the last 4 years, to help working  families and to get our economy moving, to make our country stronger  and more secure. Last week, we delivered legislation that will help  fulfill those promises. That starts with permanent tax relief for hard- working Americans.\n\nBack in 2017,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…to know which  companies inside our tech and telecommunications markets are linked to  hostile regimes. Shining a light on this malign influence is the first  step toward a stronger action to defend our communications  infrastructure and our national security.\n\nWe know what these threats are. We have seen them develop. We have  seen them accelerate. We…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…great example is the U.S. Border Patrol, as they are now  expanding their workforce and hiring new agents as a direct result of  our One Big Beautiful Bill Act. This will mean stronger borders, safer  Texas communities, and definitely greater peace of mind for our  families.\n\nAmerica's future is shining brighter than ever. With the economic  policies of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…back on its  promises, but, instead, allow for matched adoptions to finally be  completed. That has not happened.\n\nIt is a positive development that Chinese families have a stronger  will and capacity to adopt orphans within their own country. Children  having a safe and loving home is always a good thing. But my point of  contention is that China left…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…resulting from years of unchecked authoritarian rule. Under her  guidance, the organization has adapted to these turbulent times while  maintaining its core mission, emerging stronger and more resilient in  its commitment to human rights, freedom of expression, and the rule of  law.\n\nFreedom House, founded in 1941 by Eleanor Roosevelt and Wendell  Willkie,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Patrol the Congressional Gold Medal in honor  of its World War II service.\n\nColonel Swain's lifelong commitment from cadet to congressional  liaison made Civil Air Patrol stronger, more visible, and better  equipped to serve the Nation.\n\nI have been proud to work with Colonel Swain to fight for Civil Air  Patrol funding throughout my time in Congress…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…harvest season underway, the Trump administration continues to  fight for better markets for our farmers and ranchers, but in the  meantime, our producers need a bridge to stronger markets and the  updated farm safety net which we included as part of the One Big  Beautiful Bill.\n\nDue to China's efforts to reduce commodity prices and push up the  cost…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…peace.\n\nOur allies stepped up. Our adversaries stepped back. America, once  again, led from a position of strength and confidence. The results  speak for themselves.\n\nWe have a stronger economy, lower inflation, higher wages, lower  energy costs, a secure border, energy dominance, and economic  resurgence. We have a restoration of the American Dream and a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…defines Jerry most, however, is his unwavering loyalty and deep  patriotism. For over four decades, he has worked tirelessly to make his  community, his state, and his country stronger for the generations to  come. In every season--in challenge and in triumph--he has stood firm  in his convictions and committed to the conservative values that unite  us.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}]