[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this bill will  actually drive up monthly utility bills for American families.\n\nElectricity prices are up 13 percent across the country. Eighty  million Americans are struggling to pay their utility bills, and  Republicans want to make that financial pain even worse. Meanwhile,  grocery prices are surging, and, of course, monthly healthcare premiums…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…very expensive. Our neighbors back  home are suffering a real affordability squeeze.\n\nEspecially when we are talking about energy, we know that 80 million  Americans are struggling to pay their utility bills right now. Look at  our home State of Florida, Mr. Speaker, where FPL and TECO were just  granted the largest rate hikes in history. That is $6 billion…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…U.S. Sustainable Investment Forum. The link is: https:/ /house.app.box.com/s/xpixugm5qpckl4kxrc4h4u55i3to8roy\n\nMr. Speaker, right now across the country, workers are struggling to  pay their bills and meet basic needs, let alone save for retirement. It  is incredibly hard for workers to do much on their own for retirement  when, according to the Federal…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…constituents.\n\nDonald Trump claimed he would lower costs, but this bill, along with  his chaotic tariff policies, are making costs rise--not fall. People  across this country are struggling to pay for housing, groceries, child  care, and other necessities. Too many families have already reached  their breaking point, and this will drive them further into debt and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, across America, hardworking people are  struggling to pay their bills. This includes housing, groceries,  healthcare, and more. Hundreds of thousands of jobs have been cut due  to the DOGE policies. Our economy is sputtering,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695634/delivering-for-the-american-people"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to make the impossible choice of either  paying for medicine and food or keeping their lights on. I think it is  a disgrace that,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…campaign checks, boy, did  Republicans deliver. They rammed through their awful, big, ugly bill in  a nanosecond. What the hell is wrong with them?\n\nWhile regular people are struggling to pay bills, Donald Trump's net  worth has gone up by $3 billion since he became President.\n\nPeople's health insurance premiums are doubling and tripling, but  Republicans…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…could be Republicans;  they could live in the north, the south, the east, or the west--agree  on one thing: The cost of healthcare is at crisis levels, and families  are struggling to pay for healthcare, such a necessity for their  families and themselves.\n\nNow, on January 1, as just about everybody knows, the ACA premium tax  credits that lowered premiums…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Americans.\n\nSince President Trump took office, electricity prices have gone up by  13 percent nationwide and 20 percent in New Jersey, leaving over 80  million Americans struggling to pay their utility bills. Instead of  addressing the affordability crisis that they have ignored, that  President Trump has called a hoax, the Republicans' priority on day…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…didn't  happen. In fact, electricity prices are up 15 percent and increasing  twice as fast as inflation just since Trump took office.\n\nMore than 80 million Americans are struggling to pay their utility  bills. Even though these price increases are a direct result of  Republican policies, today House Republicans are choosing to double  down. Rather than…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…It was a universal chorus of complaints that our country is not doing  enough about the cost of living.\n\nEvery county I visited--all 62--had the same story. People are  struggling to pay for the things they need. Some of their worst moments  are while simply sitting around the dinner table after a Friday evening  dinner and saying: How are we going to…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…healthcare because prices keep climbing.  Affordability is equal to economic stability. Let me repeat that:  Affordability is equal to economic stability. Americans are struggling  to pay for groceries, rent, gas, and healthcare. They are drowning  under rising costs while promises to lower the cost of living have  remained unfulfilled by this administration.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…colleague from  Wisconsin's sentiment here. If people are looking to not pay taxes on  tasers, he has them covered. The Republican Conference has them  covered.\n\nIf people are struggling to pay for their groceries or their rent,  they are out of luck as far as the House Republican Conference is  concerned. Taxes on tasers, don't worry. They have a plan for that.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cut energy bills in half in  his first year, but that has not happened. In fact, electricity prices  are up by 13 percent across the Nation and 80 million Americans are  struggling to pay their utility bills.\n\nThese increases did not just happen. They were a direct result of the  Trump administration's disastrous policies, policies that have been  rubber-stamped…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their war on cheaper, clean energy.\n\nThanks to Republicans, electricity prices are climbing more than  twice as fast as inflation, and more than 80 million Americans are  struggling to pay their utility bills. Many of these Americans are  having to make the impossible choice of either paying for housing,  medicine, and food, or keeping their lights on.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…percent more for their energy bills  than they were in 2010. Households simply cannot afford more expensive  mandates coming out of Washington.\n\nAt a time when Americans are struggling to pay their bills because of  inflation caused by the Biden-Harris administration's spending spree,  the Home Appliance Protection and Affordability Act takes important  steps…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…requirements for renewable energy: California,  New York, New Jersey, Massachusetts, Connecticut. That is where energy  costs have gone up the most. That is where people are struggling the  most to pay their energy bills.\n\nMr. Speaker, I would like to speak in support of H.R. 3617,  introduced by the gentleman from Michigan (Mr. James), my friend and  colleague.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…majority leader just listed speak volumes  about the scandalous corruption and carelessness of a bloated  government. Every dollar comes from working American families  struggling to pay both their bills and their taxes.\n\nNow, this waste is enabled by two classes of expenditures that we  should foreswear forever. One is grants, cash handouts to political…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692548/rescissions-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…deny the problem, the data is  clear. Let's be clear that every dollar spent on illegal immigration is  a dollar taken from a senior, a veteran, a child, and a family  struggling to pay the bills.\n\nFor the past 4 years, the pattern has been very clear. Migrants cross  the border and surrender to authorities. They repeat carefully  rehearsed lines, provided…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…therapy sessions  between April 2021 and March 2023.\n\nThis wasn't emergency aid. It was five-star treatment funded by  hardworking American families, families that are struggling to pay  their own rent and put food on their own table, much less providing  themselves with music, plant, and pet therapy.\n\nI know many taxpaying American families who would…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…time period, the very people who were breaking  the law were actually getting free things, whether it be rent, phones,  cash cards, and other things that Americans were struggling to pay for  every single day.\n\nCleaning up this mess has become our responsibility, the new  majority, the new administration that has committed itself to actually  keeping…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}]