[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…interesting exercise to watch some of our Republican colleagues wrap  themselves into pretzels claiming not to have voted for the Medicaid  cuts, but it was just an overall structure giving direction of how we  should cut these moneys.\n\nRemember, cut these moneys so that my colleagues on the other side of  the aisle can give a tax cut to their billionaire,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…regulators tasked with protecting Americans.\n\nAhead of the scheduled joint hearing between the Financial Services  Committee and the Agriculture Committee on crypto market structure  legislation, I presented a straightforward, acceptable, and  basic request to the Republicans.\n\nI told the Chair of the Financial Services Committee that I would  only give…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…BLUMENTHAL. Mr. President, as we all remember if we were here 5  years ago, this building was attacked. The Capitol was stormed.  Democracy was under siege, not just the physical structure, but our  lives, literally. Each of us had a memory of that moment.\n\nAnd I will never forget, I am sure most of my colleagues won't  either, how we left this Chamber, without…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…removal of the leaders of these  organizations. Thus, my proposal would remove the President from the  appointment process for all these positions and change it to a  commission structure. The commissions would be made up of House and  Senate leadership, as well as members from the relevant Congressional  committees. The House would now also have a say in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to help Venezuelans  reclaim their country? No. They said: We like dictatorships. We just  want a pliable dictatorship. So they said: We are leaving in place this  entire structure of corrupted military and government officials with  massive corruption, and yet we will have a new Acting President, who  has assured us that she will do what we want.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…definition just to cooperate on activities as simple as study abroad  programs. The University of California has said they do not have an  intelligence agency within their structure that can do this.\n\nThis is a completely unreasonable expectation of universities, and  that is because the real goal of the legislation is to completely sever  academic relations…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing crime and improving       quality of life…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…accompanied by extreme flexibility. Too deep of a cut is       unmanageable in any instance.\n\nInnovation is occurring in Minnesota within the current       financing and waiver structure. We are moving people with       disabilities into greater independence. Massive Medicaid       reductions could punish Minnesota for being such a strong       leader in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…digital asset industry is  growing, evolving, changing the way people around the world engage with  financial markets and emerging technologies. Without a clear regulatory  structure in place, we are seeing innovation move overseas not because  our talent isn't here, but because the rules aren't here.\n\nThe CLARITY Act provides us with an opportunity then…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…authorities--specifically, the  Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority--would have access, as the town of Minturn already  does, to the Bolts Ditch structure.\n\nIt builds on legislation that we successfully got across the finish  line several years ago. It is common sense. It is bipartisan, and it  means a great deal to the folks…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing crime and improving       quality of life…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…we are working to ensure that some of the critical  programs at the Federal level are funded in this bill which is an  important piece of this, we also have to support the structure  and the payment system that supports the people on the ground who are  doing this work.\n\nIt took us years to bring the study, bring the waiver, and prove that  this would…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…devastating impacts on  our financial stability, national security, and investor protection.\n\nWhile my Republican friends claim that this bill will regulate crypto  market structure, in reality, it eviscerates the longstanding history  of investor protections that have made our markets the envy of the  world.\n\nMost importantly, this bill, this push for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…BDCs saw lower job creation with employment falling by between  1.5 to 6.5 percentage points compared to pre-exclusion levels.\n\nThe rule also fails to recognize the unique structure and mission of  BDCs. Unlike passive funds, BDCs are actively managed and intentionally  incur higher costs in order to provide tailored investment and advisory  services…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…services--including industrial inputs and manufacturing equipment being  imported and exported along the way. The trade policies and trade  actions of the U.S. Government impact the structure, operation,  efficiency, and security of U.S. supply chains, and the Office of the  U.S. Trade Representative (USTR) plays a key role in developing and  coordinating the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692998/promoting-resilient-supply-chains-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…for development projects across the State.\n\nState ``assumption'' of the Section 404 program is an       important part of the Clean Water Act's cooperative       federalism structure. Assumption can streamline permitting       processes, reduce duplication of effort and overall       expenditures by state and federal authorities, while       providing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…LATTA. Mr. Speaker, all the reports that we have across this  country state that we have been producing more power, not less, and  hydropower plays an important role in our structure of energy in this  country.\n\nMr. Speaker, I encourage a ``yes'' vote on this legislation, and I  yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…House of Representatives and the Senate the results of the       review, which may serve as a guide for coverage increases       within the existing administrative incremental structure.\n\n``(b) Amount Described.--The amount described in this       subsection is the amount equal to--\n\n``(1) $500,000; multiplied by\n\n``(2) the average percentage by which the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…rates had gone up 198 percent in 6 years. In  commercial insurance in my State, it has gone up 29 percent--apples-to- apples comparison.\n\nThere is a very real problem with the structure of how ObamaCare  actually works. The request has been: Let's put more subsidies on top  of it, more subsidies on top of it and add billions and billions more  in taxpayer…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…today.\n\nIt goes back to the Framers in our founding. Federalist 51 is where  Madison wrote:\n\nIf men were angels, no government would be necessary.\n\nAnd so they came up with a structure, the separation of powers.\n\nOur Constitution has often been remarked upon as the greatest piece  of political architecture in human history because it kept the power of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Rooftop Garden Terrace\n\nThe term ``garden terrace'' in the 2021 submission refers       to the ground-level front lawn, which serves as the roof of       the parking structure beneath. Vegetated (green) roofs are       commonly used for stormwater management, building efficiency,       and roof longevity. Green roofs are found on other federal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…in 1992, and he  has faithfully served our community  for 32 years. Marshal Lacey was instrumental in helping protect our  community through his leadership in prioritizing structure and  vegetation management, as he established a nationally renowned wildfire  mitigation program.\n\nMarshal Lacey was onsite and led the efforts to combat the Waldo  Canyon…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…ensure critical consumer  protections so Americans retain their financial freedom.\n\nBefore basketball became the great sport that we know and love, it  needed rules. Without structure, the game could not grow and thrive.  The same is true for digital assets.\n\nInnovation depends on clear, reliable guardrails. For too long, this  space has been clouded by…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we don't extend those subsidies that somehow we  are denying people healthcare. That is just flat false. It is a lie.\n\nThe fact is, ObamaCare remains in place. Its subsidy structure  remains in place for better or worse, and those subsidies that they are  talking about would literally go into the pockets of insurance  companies whose profits have gone…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…perseverance, teamwork, and resilience, while  leading them to excel in competition.\n\nFurthermore, as check-in and checkout coordinator, Mrs. Harvey  ensures the students have the structure and support they need to thrive  at school. She mentors students and provides accountability to help  them stay on track, both academically and socially.\n\nBehind the scenes,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to fix any of this, but they want to  make it permanent at a cost of $400 billion. No thanks, Mr. Speaker.\n\nMr. Speaker, reverting these tax credits back to the original  structure that the Democrats designed means that 93 percent of  enrollees will still retain very generous subsidies next year. Mr.  Speaker, 60 percent of the enrollees will still…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…illicit finance.\n\nIn the hands of a good leader, it could. The reality is we know, as  our Founders recognized in Federalist Paper after Federalist Paper and  in the very structure of our government, eventually somebody who isn't  benign is going to have the power.\n\nFor ``The Lord of the Rings'' fans, they know that even the best  person, when they…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…comfortable going into the  holidays.\n\nMr. Speaker, ask the people affected and listen to their voices. That  is what this bill does. It makes sure we put in place a simple  structure that is permanent so that the vagaries of this town don't  change things on Main Street.\n\nMr. Speaker, I strongly support this measure. It is just common  sense.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…against friends, family members, or pets.\n\nMany of these networks rapidly emerge, create alliances, and then  quickly dissolve, making it difficult to determine leadership  structure. Many criminal actors are located overseas, and many of these  offenders are also minors themselves.\n\nThe most prominent example is the online extremist network known as…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the Coast Guard, the       Commandant, in coordination with the Secretary of the       Department in which the Coast Guard is operating, shall--\n\n(A) develop a plan on the structure, feasibility of the       Secretary of the Coast Guard position and the reorganization       and restructuring of the Coast Guard needed to incorporate       the new position;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]