[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Alabama's Seventh Congressional District, I ask my  colleagues to join me in congratulating our outstanding high school  basketball champions. I am confident that these young student athletes  have bright futures ahead of them.\n\nThis weekend, the city of Birmingham will host the NCAA women's  basketball Sweet 16 and Elite 8 in the Magic City. We welcome all…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…electric offense and stifling defense, the Blue Devils  shut out West Boylston at Gillette Stadium, capping off an undefeated  season with another championship.\n\nThese student-athletes have made their school and families proud and  proven to themselves and the Commonwealth that the town of Randolph has  the talent, commitment, and the tenacity to succeed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…University of South Carolina team by a margin of 23 points,  which actually is lower than really where it was for most of the second  half.\n\nIt is an amazing group of women student athletes who, again, rose to  the occasion to take the UConn women's basketball program into further  heights with its 12th national title. All records are made to be  broken,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Women's Golf Head Coach MaryJo McCloskey.\n\nIn 2006, Coach MJ helped found the women's golf program at George  Fox, and since then, she has coached hundreds of talented student- athletes.\n\nDuring her time coaching, she has put together an inspiring track  record. She is an 8-time NCAA Division III West Region Coach of the  Year, a 10-time Northwest Conference…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698083/congratulating-maryjo-mccloskey"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…tradition of excellence.\n\nThis championship reflects months of hard work, and a season defined  by focus and resilience. It is a testament to the commitment of these  student-athletes and the pride they bring to their school and  community.\n\nThe Galena Park North Shore Mustangs have once again given Texas 29 a  moment to celebrate. Their achievement…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Protecting Student Athletes       from Concussions Act of 2025''.       SEC. 2. MINIMUM STATE REQUIREMENTS.\n\n(a) Minimum Requirements.--Each State that receives funds       under the Elementary and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…BELL. Mr. Speaker, I rise to recognize the Washington University  women's soccer team, who just secured their second-straight Division  III national championship. These student-athletes reflect the best of  St. Louis.\n\nWhat they achieved this season didn't happen by accident. It came  from years of work, a culture of accountability, and a shared belief…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698090/recognizing-washington-university-womens-soccer-team"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…really care about public  education, let's be the wind at the backs of our teachers and our  schools.\n\nOf course, they have a bill to help the NCAA take advantage of  student athletes because what this Congress desperately needed was  another billionaire organization empowered to squeeze young people. It  is more of the same. It is more of the same.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…allow for  students to collectively bargain.\n\nAs a former gymnast and athlete, my allegiance will always be with  athletes and with the underdog. It is undeniable that student athletes  are not receiving equitable compensation for their labor, especially  those in high-revenue sports. A student athlete constantly endangers  themselves and risks great…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697301/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…determination, and perseverance on  behalf of the players and their coaches, and they did that the whole  season.\n\nAs an Anaheim High School alumnus myself, I congratulate our student  athletes, parents, coaches, and teachers. Again, they have made us  proud.\n\nI ask my colleagues today to join me in celebrating this great  victory for the Anaheim High School…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689231/congratulating-anaheim-high-school-girls-water-polo-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Regardless of what you think of that particular policy, it is  something that only affects a few students, and now the State of  California is depriving all of these student-athletes of the  opportunity to play their sport as well as subjecting them to onerous  new travel arrangements.\n\nI am urging the State of California to reverse this outrageous…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…fundraising events and supported multiple school  organizations. These funds have been used to purchase new equipment,  upgrade facilities, and provide scholarships for student-athletes.  Shae's innovative ideas and relentless drive have not only increased  financial support but also boosted community involvement and school  spirit. In addition to her…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…recognized for their academic excellence.\n\nMr. Speaker, I congratulate Christendom on this fourth President's  Cup in 6 years, which reflects a deep commitment to forming student  athletes who excel both intellectually and athletically.              recognizing salem high school boys' lacrosse team\n\nMr. CLINE. Mr. Speaker, today, I rise to recognize the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…the support of their coaches, none of this  would have been possible.\n\nI will always be grateful for the parents and coaches that pour so  much of themselves into our student athletes. The great achievements of  the Lady Indians belong to them as much as they belong to the players.\n\nMr. Speaker, all of southern Ohio is proud of our Lady Indians'  accomplishments,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693117/recognizing-hillsboro-high-school-lady-indians"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…propelled them to the State Semifinals for the  first time since 2007--an extraordinary milestone in the program's  history.\n\nBeyond their dominance in competition, these student-athletes  demonstrated the same level of excellence in the classroom, earning  recognition as an Academic All-State Team--a testament to their hard  work and dedication both as…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Cascade Cadets secured a commanding lead in the first  quarter and remained dominant throughout the game, ultimately emerging  victorious.\n\nI congratulate these outstanding student athletes on winning the  State championship, a fitting way to end their perfect season. The  students on Cascade's football team should be extraordinarily proud of  their tireless…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…titles in 1995 and 1996 under Coach David Wheat, a 2018  title with Coach Chuck Pound, and a shared championship in 2020.\n\nI would like to commend each of the dedicated student-athletes:  Addison Naff, Reagan Meade, Abby Kingery, Jaiden Dann, Madilyn  Winterton, Alicia Holmes, Madelyn Caron, Maggie Hoover, and Kayla  Windsor, and extended heartfelt congratulations…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…championship win.\n\nBenedictine forced five turnovers, including a critical interception  by Malachi Mingo that helped seal the shutout.\n\nI am honored today to recognize the student-athletes, coaches,  families, and entire Benedictine community for their remarkable  accomplishment, as well as for the pride they have brought not only to  Virginia's Fifth Congressional…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697026/recognizing-benedictine-college-preparatory-school-athletics"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…middle of what is known as  March Madness. I am not talking about budget reconciliation or tax  season; I am here to congratulate and say thank you to our outstanding  student athletes who have competed their hearts out on the court and on  the mat these last few weeks.\n\nFirst, I want to pay tribute to our Iowa teams who made it into the  NCAA Division…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school cheer team  in Ohio's 5th Congressional District. The young student athletes of the  St. Paul High School cheer team have represented their school ably on  their way to achieving the Ohio High School Cheerleading and Dance  Coaches Association…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697942/recognizing-the-st-paul-high-school-cheer-team-on-winning-the-division-v-ohscca-best-in-the-state-title"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…defined by those numbers. They responded with  discipline, toughness, and a belief in one another that reshaped  Indiana football.\n\nThis championship is a testament to the student-athletes who  committed to the rebuild, the staff who kept driving, and our Hoosier  fans, who stayed loyal for generations, awaiting this moment.\n\nMr. Speaker, as a former chairman…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698048/on-to-the-rose-bowl"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Basketball Association team in  the Western United States.\n\nFounded in 2019, this program embodies the values of leadership,  teamwork, positivity, and integrity, helping student athletes build  confidence, discipline, and independence both on and off the court.  These athletes balance the same rigorous demands as all EWU varsity  players--classes, practices,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school cheer team  in Ohio's 5th Congressional District. The young student athletes of the  Norwalk High School cheer team have represented their school ably on  their way to achieving the Ohio High School Cheerleading and Dance  Coaches Association Division…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698000/recognizing-the-norwalk-high-school-cheer-team-on-winning-the-division-iii-ohscca-best-in-the-state-title"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…recognize the outstanding  achievements of the Salt Lake Community College Cross Country Program-- a testament to the determination, resilience, and spirit of Utah's  student-athletes.\n\nIn Richmond, Virginia, at the National Junior College Athletic  Association (NJCAA) Cross Country Championships, the SLCC Bruins made  history by sweeping both the men's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…will lose your Federal funding.\n\nTo no one's surprise, the order is getting results. Right after  President Trump signed it, the NCAA, which oversees more than 530,000  student athletes, announced that it would comply with the order.\n\nFor more than a decade, the Nation's largest athletic association  allowed men to compete in women's events. It will be…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}]