[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…pollutants are not just numbers on a chart; they  are the reason millions of Americans are suffering from asthma, heart  disease, and other respiratory conditions. Several studies have shown  that air pollution can negatively impact maternal health and lead to  miscarriages and low birth weights. These health impacts will  particularly harm low-income…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…say--       has to do with the environmental record of our       administration, which is one of achievement in parks,       wilderness land, and wildlife refuges. According to studies       by the Environmental Protection Agency, the quality of our       air and water has continued to improve during our       administration.\n\nIn many big cities, the number…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Administration, NTIA.\n\nAmong its many responsibilities, ITS manages various technology  development programs for NTIA and the Department of Commerce and  oversees cutting-edge studies concerning the use of our country's  airwaves. ITS has played a significant role in furthering  telecommunication advancements for our country's benefit.\n\nH.R. 1455 recognizes…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693437/institute-for-telecommunication-sciences-codification-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…decisionmaking, it is important to be part of  the process of creating the evidence. Their cloud-based research tool  called `Spine-online' enables them to conduct multi-center studies and  partner with research teams both in the U.S. and internationally.  Active studies are currently occurring on robotic surgery, enhanced  surgical recovery, augmented reality,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…individuals or to the community which no condition of release       can dispel. The numerous procedural safeguards detailed above       must attend this adversary hearing.\n\nStudies show that whether a jurisdiction requires financial  conditions for pretrial release has no effect on the crime rates of  that jurisdiction. Instead, even small financial…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…forefront of this industry, especially as  the Chinese Communist Party is advancing in the remote sensing sector.\n\nAs a 2024 report from the Center for Strategic and International  Studies plainly put it: ``Should any one country dominate the  commercial remote sensing market, not only could it gain economic  advantages, but it would also control the information…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…unnecessary barriers to considering  things like sea level rise. The supporters are making up some risk,  suggesting that some of these funds may be worse than others. I think  the studies have shown that they are as good or better, in fact, than  others. Meanwhile, the Trump administration appears to be poised to  green light what are clearly consensus-held…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…University in Henderson, Tennessee, where she played collegiate  basketball. After joining the department, she continued her education  by receiving a bachelor's of professional studies in fire  administration in 2000 and a master's of professional studies in  strategic leadership in 2013 from the University of Memphis. She rose  through the ranks as a driver,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Naturally, the impacts on citizen       children are even more severe if the child is separated from       their caregiver through detention and deportation. Multiple       studies demonstrated that children who are experience this       type of family separation suffer increased rates of mental       health disorders, developmental delays, and long-term…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…and to recognize him for his acceptance of the distinguished Templeton  Prize.\n\nBorn Demetrios Arhondonis in 1940, His All-Holiness Bartholomew  completed his undergraduate studies at the historic Theological School  of Halki. He would also pursue graduate degrees in Italy, Switzerland,  Germany, and Greece. Before being ordained to the Diaconate in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…bogeyman. We must support financial innovation and not hide from the  future.\n\nEarlier my colleagues praised our wonderful private sector, and we  know now my friends do not like studies, but I would encourage them to  read the study from our biggest bank, JPMorgan Chase, explaining how  CBDC's can save $120 billion in cross-border payments. Please read the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…evidence and receiving legal instructions from the  judge, jurors enter a deliberation room. They test one another's  recollections and assumptions and assess witness credibility. Studies  show that, during deliberations, a jury polices itself. Individual  jurors remind others of the obligations of their oaths and the  requirements of the law as stated by the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…and more content is being put behind paywalls, and PBS is one of  the only sources of children's educational television that is still  accessible to every child for free.\n\nStudies show that kids who grow up watching PBS get better grades,  read more, are better at expressing their feelings, and have better  educational outcomes. Educational television,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Operation Iraqi Freedom.\n\nUpon leaving the military, Mrs. Baker continued to serve her  community through education. She went to school using the GI Bill, and  became a social studies teacher with an emphasis on supporting  education in urban communities. As an eighth-grade teacher at Mrachek  Middle School in Aurora, Colorado, she incorporates intensive…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689665/recognizing-jasmine-baker"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…industry pressure from  fossil fuel industry front groups.\n\nThis is a graph I have used repeatedly on the floor before. It is put  together by a scientist, Robert Brulle, who studies the science denial  operation as a social and economic phenomenon. Each of these dots  represents a group that propagates the fossil fuel industry's climate  denial fraud…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…by the left  at that time, made it clear that a goal of theirs was to get rid of the  nuclear family.\n\nHere is Kate Millett, who has been described as the mother of women's  studies classes which dot our universities around the country: ``The  complete destruction of traditional marriage and the nuclear family is  the `revolutionary or utopian' goal of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…based on  student performance across a wide range of academic indicators. These  include standardized assessments in English Language Arts, Mathematics,  Science, and Social Studies, as well as learning gains in English  Language Arts and Mathematics.\n\nAmong the most notable improvements were a 15 percent increase in  Algebra 1 proficiency, a 7 percent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…amended by section 2, is further amended--\n\n(1) in subsection (a)(3)(E)--\n\n(A) in clause (ii), by striking ``the study described in       subsection (b)'' and inserting ``the studies described in       subsections (b) and (c)''; and\n\n(B) by adding at the end the following new flush sentence:      ``The Secretary may require that such data and information…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…fellow citizens, but much of  the science doesn't support it, as well.\n\nThe science of playing to the delusions of these individuals is not  compassionate. It is cruel. Numerous studies have shown that not only  do these cross-sex hormones dramatically increase the risk of  infertility and sexual dysfunction, but they actually increase  depression, anxiety,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…delisted 2 percent of the hundreds and thousands of species that it has  listed.\n\nWe cannot handcuff America's military. Our enemies are not waiting  for environmental impact studies. They are advancing relentlessly.\n\nIf we vote against this, we are choosing endangered species over war  preparedness and defending this country. This is essential, and it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We are getting  basically the same percentage of the economy in tax receipts.\n\nThere is an article on the Manhattan Institute's website that does an  aggregation of a lot of studies, many of them from leftwing groups,  showing that if you raised every tax that functionally the Dems have  offered that has gotten scored, and then you adjust it for its economic…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…who is looked up to in  some universities, said one of his goals was to abolish the family.\n\nMore recently, in 1960, a woman who has been described as the mother  of women's studies--which is a major we make fun of in college.  Nevertheless, it is something that a lot of kids take as an elective.  Kate Millett, the mother of these classes, said: The complete…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, I rise today in recognition of our  Nation's aviation professionals and their need for mental health  support.\n\nScientific studies of aviation professionals reveal that many are  hesitant to seek mental health treatment due to fears of professional  consequences. For example, pilots often speak about…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of vaguely stated climate change goals. Current law is clear.  Requiring a statutory presumption in favor of exports are in the public  interest.\n\nPlus, the vast majority of studies show that not only do LNG exports  boost our energy security but they also help maintain low domestic  natural gas prices for Americans.\n\nThe Biden-Harris administration's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(A), by inserting       ``, some of which were'' before ``transferred to the       Secretary''; and\n\n(B) in subparagraph (M), by inserting ``, publish       reports,'' after ``studies''.\n\n(3) Rule of construction.--Nothing in the amendments made       by paragraphs (1) and (2) may be construed to expand or       contract the authority of the Commission.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…veterans affairs, and has done so with exceptional  diligence and precision.\n\nWhile working in my office, Michael also earned his master's degree  in national security policy studies. He quickly established himself as  an indispensable asset. I have often said that a good Member can become  a great Member with a great team, and Michael proved that every…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…his love of the people and rural communities.\n\nMore than anything else, he was a faithful follower of Jesus Christ.  I will miss Doug and our weekly Thursday morning Bible studies.\n\nI will miss his humbleness, his even temper, his humor, and his  presence in this body. I will miss hearing him call me Francis Gary  Powers after the U.S. spy plane pilot…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698735/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…change, the socialists mandated outrageously  expensive add-ons like solar panels and hermetically sealed windows.\n\nTo solve their environmental angst, they required pointless studies  that were endlessly time-consuming and outrageously costly along with  backbreaking, outrageous environmental fees, adding many tens of  thousands of dollars to the costs…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…schools that have a high level of flexibility as to how they run  their school but, in turn, are held to a greater standard of  accountability, have gotten tremendous results. Studies consistently  show that they outperform traditional public schools, and they have a  lot of students who are on their wait list. However, the teachers at  those schools are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…concerns.\n\n``(B) Include elements that promote basic understanding,       identification, and adoption of proper use cases of       artificial intelligence.\n\n``(C) Include case studies of practical application across       a range of business sizes and types.\n\n``(D) Are technology-neutral and relevant to technologies       that are accessible and suitable…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}]