[{"senator": "Grace Meng", "party": "Democrat", "sentence": "…their cooperation. I thank our ranking  member of the Appropriations Committee, Rosa DeLauro, and her team, for  her leadership. I especially thank our Appropriations subcommittee  staff, Bob Bonner, Jamie Wise, Nora Faye, and Faye Cobb, for their  tireless work on this, and also Tom Dinegar and Rebecca Lee from my  individual office, as well.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698751/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Speaker, I thank my Seapower and Projection Forces Subcommittee  colleagues, particularly Chairman Trent Kelly, for their outstanding  bipartisan work as well as the subcommittee staff: Phil MacNaughton,  Kyle Noyes, Kelly Goggin, and Abby Snyder.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I thank the ranking member for yielding. I  thank all of the Military Construction and Veterans Affairs  Subcommittee staff on both sides of the aisle for their work, and in  particular Farouk Ophaso and Tyler Coe.\n\nI am opposed to this bill, which will transfer billions of taxpayer  dollars…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I want to thank all of the Energy and Water  appropriations subcommittee staff for their hard work, in particular  Scott McKee, Anisha Singh, and Adam Wilson.\n\nI am opposed to this bill. Not only will it raise energy costs for  American households…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ranking Members Grace Meng, Marcy Kaptur, and Chellie  Pingree on the Appropriations Committee, who led these negotiations and  secured crucial funding for key programs. Subcommittee staff,  especially Bob Bonner, Rita Culp, Scott McKee, Adam Wilson, Nora Faye,  Jamie Wise, Faye Cobb, Jocelyn Hunn, Michael Schmeltz, and Ippo  Dellatolas worked through the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I thank the ranking member for yielding. I  also want to thank all the Defense Appropriations Subcommittee staff on  both sides of the aisle. In particular, I want to shout out Jennifer  Chartrand, Jason Gray, and Ed Etzkorn.\n\nThrough this bill, we have the solemn responsibility…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…supply without the  micromanagement of the Federal Government.\n\nIt does all these things while saving millions of hard-earned  American taxpayer dollars.\n\nI thank my subcommittee staff: Avery, Andrew, Doug, and Mary Beth for  their hard work and diligence. They have been indispensable throughout  this process. Please know that I am deeply grateful to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…every day, and it is our responsibility to make sure that they  have the resources that they need to carry out their missions.\n\nI will take just a moment to thank my subcommittee staff who worked  tirelessly on this legislation: John Rayfield, Reed Linsk, Lindsay  Sakal, Spencer Thompson, Nicole Bredariol, as well as Matt Dwyer and  the ranking member's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…America first.\n\nMr. Speaker, I thank Chairman Cole, Ranking Member DeLauro, and  Chairman Rogers for their steady leadership throughout this process,  and I thank the subcommittee staff for their hard work on this  legislation.\n\nMr. Speaker, I urge all Members to support this bill. Our time is  now.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…this in  an astounding fashion.\n\nI thank Chairman Rogers and Ranking Member Smith for their thoughtful  leadership on this essential piece of legislation.\n\nI thank my subcommittee staff: Michael Kirlin, Heath Bope, Caroline  Kehrli, Brooke Alred, and Andrew Smith.\n\nIn my office, I thank my lead Military Legislative Assistant, Andrew  Maloney; in the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…determinations and clarity they need to  move forward in a timely and responsible way.\n\nI thank Chairman Graves, Chairman Collins, and the Water Resources  and Environment Subcommittee staff for their work putting together a  bill that cuts red tape, reduces duplicative reviews, and gives  farmers, ranchers, utilities, and communities in Colorado and across…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…this legislation reflects  that reality and takes essential steps to address it.\n\nWe could not have accomplished this without the tireless dedication  and efforts of the subcommittee staff, Sarah Moxley, Caroline Kehrli,  Andrew Smith, Brooke Alred, Mireya Jurado, Michael Hermann, and Wendell  White.\n\nI also thank our ranking member, Ro Khanna, for working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695141/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…every day. The threat in  the cyberspace domain is real, and this legislation reflects that  reality and takes essential steps to address it.\n\nI thank the outstanding subcommittee staff that made this possible:  Sarah Moxley, Caroline Kehrli, Andrew Smith, Brooke Alred, Mireya  Jurado, Michael Hermann, and Wendell White.\n\nSpecifically, this NDAA helps…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697795/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…bipartisanship and his continued collaboration toward  stronger naval and projection forces.\n\nFinally, I thank Kyle Noyes, Kelly Goggin, Phil MacNaughton, and Abby  Snyder, the subcommittee staff. I also thank my personal staff, Semaj  Redd, and my fellow, Bobby Hsu.\n\nI am excited to highlight a few of the many wins for our national  defense in this year's bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "Mr. ELLZEY. Mr. Chair, I rise in strong support of this bill and I  join Chairman Calvert and Ranking Member McCollum in saluting the hard  work of the Defense Subcommittee staff, and of course, Chairman Cole. I  thank my colleagues on the Senate Defense Appropriations Subcommittee  for working with this body.\n\nAs of today, the Biden-era CRs,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Minority Member should be kept fully apprised of preliminary       inquiries, investigations, and hearings. Preliminary       inquiries may be initiated by the Subcommittee Majority staff       upon the approval of the Chair and notice of such approval to       the Ranking Minority Member, Minority Staff Director, or the       Minority Chief Counsel.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…the  floor quickly. The Defense Department cannot afford another 1-year CR.\n\nMr. Chair, I also thank Chairman Calvert for his vision and  commitment, and I thank the subcommittee staff, on both sides of the  aisle, for their hard work in crafting this legislation in a very short  time.\n\nThe bill before us today makes several notable and timely  investments.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…efforts. I also thank my colleagues in the Senate more broadly who have  been so willing to allow us to proceed to get to this point today.\n\nI want to thank the CJS Subcommittee staff for their hard work,  dedication, and long hours. A lot of work has gone on throughout the  year but with especially challenging time constraints within the last  few…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]