[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…support of H.R.  3633, known as the CLARITY Act.\n\nI am honored to serve as a co-lead on this legislation, alongside  Chairman Thompson, Chairman Hill, Ranking Member Craig, Subcommittee  Chair Johnson, and so many others who came to the table in good faith  to get this done.\n\nLet me also take a moment to thank the staff, both the majority and  the minority…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…of stakeholders who worked on this bill, and  particularly the consumer groups for their unwavering support of this  bill.\n\nOf course, I particularly want to commend Subcommittee Chair  Bilirakis and Ranking Member Schakowsky for their years of hard work on  this legislation.\n\nFinally, I need to acknowledge, Mr. Speaker, the contribution of my  late…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…authority to prosecute certain drug smuggling cases.\n\nI would also like to express my thanks for the bipartisan leadership  of Chair Sam Graves, Ranking Member Larsen, and Subcommittee Chair  Ezell.\n\nThis bill will strengthen the Coast Guard's ability to meet a core  mission, saving lives. As we all know, the Coast Guard is involved in  high-risk drug interdiction…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Grounds for the 44th Annual National Peace Officers' Memorial  Service on May 15, 2025. I thank the gentleman  from Pennsylvania (Mr. Perry) for his leadership as the subcommittee  chair.\n\nThis incredibly important event, which is hosted by the National  Fraternal Order of Police, will honor Federal, State, and local law  enforcement officers who lost…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…American Ships Act, and to express my thanks for the  bipartisan leadership of Chair Sam Graves, Ranking Member Larsen, and  also Coast Guard and Maritime Transportation Subcommittee Chair Ezell,  who cosponsored this important legislation.\n\nMy bill strengthens the American merchant marine by guaranteeing that  100 percent of U.S. cargo generated by the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…helped to get the bill  done, the majority team and our Democratic team of Erin Kolodjeski,  Laurie Mignone, Ed Etzkorn, and Jenn Miller. A most big thank you to  our subcommittee chair, Mario Diaz-Balart. We have known each other for  decades, dating back to our time in the State legislature. I am  grateful for his fine leadership and friendship.\n\nMr.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…this section, including in court filings. And so I aim to fix  some misconceptions, with the help of the Congressional Budget Office  and the relevant Republican House subcommittee chair.\n\nI have spoken a lot about the Greenhouse Gas Reduction Fund over the  past several months, on the floor and in the Judiciary and Environment  and Public Works Committees.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…strengthen our  domestic maritime sector by facilitating an increase in the pool of  qualified United States merchant mariners.\n\nI very much appreciate Ranking Member Larsen, Subcommittee Chair  Ezell, and Subcommittee Ranking Member Carbajal for working to reach a  bipartisan agreement on this bill.\n\nMadam Speaker, I urge support for this legislation, and I…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the minority is       present. Proxies shall not be considered for the       establishment of a quorum.\n\n(3) TAKING TESTIMONY. In any hearings conducted by the       Subcommittee, the Chair or the Chair's designee may swear in       each witness prior to their testimony.\n\n(4) SUBCOMMITTEE SUBPOENAS. Subpoenas for witnesses, as       well as documents…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688269/us-senate-subcommittee-on-border-management-federal-workforce-and-regulatory-affairs-rules-of-procedure"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…In May 2021, Seth joined the Subcommittee on  Health for the House Committee on Energy and Commerce when I served as  Subcommittee Republican Leader, and later Subcommittee Chair, under  Chair Cathy McMorris Rodgers. During his time under Chair Rodgers and  myself, Seth was an invaluable Professional Staff Member and under his  leadership--our committee…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…taking sworn or unsworn testimony.\n\nC. Proxies prohibited in establishment of quorum. Proxies       shall not be considered for the establishment of a quorum.\n\n3. Subcommittee subpoenas. The Chair of the Subcommittee,       with the approval of the Ranking Minority Member of the       Subcommittee, is authorized to subpoena the attendance of       witnesses…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688278/us-senate-subcommittee-on-disaster-management-district-of-columbia-and-census-rules-of-procedure"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…particular.\n\nMr. Speaker, I now yield 4 minutes to the gentleman from Georgia (Mr.  Austin Scott), chairman of the General Farm Commodities, Risk  Management, and Credit Subcommittee and vice chair of the full  Agriculture Committee.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I appreciate the  opportunity to speak in support of H.R. 4550. This legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you could change  the price of delivering government services.\n\nWe started almost a year ago in my capacity on the Ways and Means  Committee, chairing the Oversight Subcommittee.\n\nI now chair the Joint Economic Committee, and I thank Mr. Speaker  because he helped me actually have the capacity of hiring a Ph.D. in  healthcare economics.\n\nWe have dropped…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…January 2023, Molly became Counsel for the Subcommittee on Health for  the House Committee on Energy and Commerce under Chair Cathy McMorris  Rodgers while I was serving as Subcommittee Chair. When I became  Chairman in January of this year, I knew I wanted to keep her on my  team as an expert on health issues.\n\nAfter serving two Chairmen and three Subcommittee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…(Mr. Owens), the vice chairman of the House Education and the Workforce  Committee as well as the chairman of the Higher Education and Workforce  Development Subcommittee.\n\nMr. WALBERG. Mr. Chair, I yield 3 minutes to the gentleman from  California (Mr. Kiley), the subcommittee chair of the Early Childhood,  Elementary, and Secondary Education Subcommittee.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Chairman, I thank Mrs. Wagner for her work  as our subcommittee chair of Capital Markets in this Congress. I thank  our vice chairman of the full committee that you will hear from  tonight, the gentleman from Michigan (Mr. Huizenga) who…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…to present today.\n\nMr. Speaker, I rise in strong support to ask my colleagues to support  H.R. 3343, the Greenlighting Growth Act, a bill which I introduced with  the subcommittee chair, Ms. Wagner.\n\nThis bill will make business easier for small companies right here in  America. That is something we all agree on. Too often, regulations make  it harder…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…solutions to vote in  favor of H.R. 3898.\n\nMr. GRAVES. Mr. Chair, I yield 3 minutes to the gentleman from  Georgia (Mr. Collins), the Water Resources and Environment Subcommittee  chair and the bill's sponsor.\n\nMr. GRAVES. Mr. Chairman, before I yield, I would like to point out  that in the Transportation and Infrastructure Committee, we can  disagree,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and job creation  in our districts, but they are often limited from reaching their full  capacity or capability because of overregulation.\n\nThe bill introduced by our subcommittee chair, Ann Wagner, addresses  this challenge by directing the SEC to carry out a study and a  rulemaking to modernize the definition of a small entity and ensure  that small…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…investigation that targeted President Trump, elected Members of  Congress, including me, and hundreds--hundreds--of conservative groups  and individuals.\n\nNow, the subcommittee I chair is on Privacy, Technology, and the Law.  And we called before us the general counsels--legal representatives  from Verizon, AT&T, and T-Mobile--the three wireless carriers…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}]