[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…reasonable and bipartisan version of these  two measures is included in this legislation.\n\nI thank the ranking member and the chairman of both the full  committee and these subcommittees, as well as all the dedicated staff,  for their similar commitment to put in the hours, find common ground,  and move these essential bills forward.\n\nNotably, I express…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, I thank Congressman Tonko for his time. He  is such a leader. He doesn't have to be here this evening, but I know  how hard he works on his committee and on his subcommittees. I know how  grateful the people of New York are to have his service here.\n\nI thank him for helping to trace the history of the Great Lakes-St.  Lawrence Seaway, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "Mr. CUELLAR. Mr. Speaker, I rise in support of this bill, but first,  I want to thank the chairmen of the subcommittees and the full  committee and my ranking member for their leadership. Certainly, I also  thank the staff on both sides for the hard work that they have provided  on this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Madam Speaker, I rise in support of this as a member of the  Appropriations Committee, as well as of our Subcommittees on Defense  and Homeland Security.\n\nMadam Speaker, I join the vast majority of Americans in condemning  the actions of Immigration and Customs Enforcement. There is brutality…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…investments that helped build infrastructure across the country. That  was the responsibility that was so cherished.\n\nAnd there was a term for those who chaired the 12 subcommittees on  Appropriations, and that term--the colloquial term--was that they were  the Senate's ``cardinals.'' It was taken from the Catholic Church,  where cardinals helped steer…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…of the votes       cast in favor of and the votes cast in opposition to such       measure or matter by each member of the Committee.                            Rule 3. Subcommittees\n\nCreation of subcommittees shall be by majority vote of the       Committee. Subcommittees shall deal with such legislation and       oversight of programs and policies…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…but they also  provided the persuasion that is necessary both within our own ranks and  across the aisle.\n\nI thank especially the cardinals and the ranking members of the  subcommittees. The ranking member and I agree, and we have tried to  force decisionmaking down because we trust our cardinals and ranking  members. They know their subjects. They know…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…If I missed anyone, count it as my fault, not the staff who helped me  assemble that list and the following.\n\nI just wanted to also thank a number of the clerks of the  subcommittees with whom I worked: Evan Schatz, of course, who is  Senator Murray's chief clerk; John Righter; Jo Eckert; Jen Becker; Alex  Carnes, whom I am particularly thankful to…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…our  respective chairmen and ranking members: ``Hey, if you don't send us  anything up, you are making us happy. We want you to make the  decisions.'' The members of the subcommittees know the subject matter  better than anybody else. They have done the hearings. They have done  the work. They work well. The higher up the food chain it goes,  frankly,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…member, Rosa  DeLauro, who was part of this combination. We have seen them work  before in years past, both as the chairman of the full committee and as  folks on other subcommittees that have worked well. It has been a help  to all of us, and I thank them all publicly for their professionalism  and respect for each other in our process.\n\nI also thank…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…United States and all       nominations to the principal executive branch positions in       the field of foreign policy and diplomacy.                            rule 2--subcommittees\n\n(a) Creation.--Unless otherwise authorized by law or Senate       resolution, subcommittees shall be created by majority vote       of the committee and shall deal with…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "French Hill", "party": "Republican", "sentence": "…wilderness bill, S. 2125, almost a duplicate of       Bethune's. They indicated that they would hold public       hearings in Arkansas despite the fact that two House       subcommittees had already held extensive hearings in May       1983. Regardless of the two year delay, proponents now had a       House bill and a Senate companion. The delay also resulted…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…that is under consideration.\n\nTo make the record crystal clear, not once did the people's House  court a government shutdown during the appropriations process. The  various subcommittees of the Appropriations Committee did their jobs.  They worked collaboratively to deliver to the full House their  recommendations.\n\nAs Chairman Cole said more than once…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Science; Energy and Water Development; and  Interior and Environment Appropriations Act, 2026 is bipartisan,  bicameral, and built the right way--from the ground up, from  subcommittees up.\n\nIt strengthens our national security, restores American energy  dominance, backs law enforcement, combats illicit drugs, and supports  responsible land management,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…reflect many months of hard work and  deliberation from Members from both parties and from both sides of the  Capitol. They reflect input from nearly every Senator. Our  subcommittees received more than 31,000--31,000--requests from Senators  for these six bills alone.\n\nOver the last months, our subcommittees have worked through all of  these requests…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…that we divide  our appropriations bill into 12 separate bills--many bills, if you  will--and Members in some cases are assigned and in some cases choose  to serve on these subcommittees to draft a portion of the  appropriations bill. I have the privilege of serving as the chair of  the Energy and Water Development portion of the larger appropriations…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…considered at such meeting. This rule may be waived by       unanimous consent.           V. Broadcasting and Photographing of Committee Hearings\n\nThe Committee or any of its subcommittees may permit the       photographing and broadcast of open hearings by television       and/or radio. However, if any member of a subcommittee       objects to the photographing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688276/us-senate-committee-on-appropriations-rules-of-procedure"}]