[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "That cannot be  done without major assistance from subject matter experts such as those  at the Congressional Research Service.", "title": "Repeal Requirement for Congressional Research Service to Prepare Annotated Constitution and Supplements in Hardbound Version", "date": "2025-03-31"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "They aren't subject to the same transparency or accountability of the  campaign that a candidate runs.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Before dinner yesterday, these bills  to gut California's Clean Air Act authority were recognized as regular  bills, subject to the filibuster rule requiring 60 votes to move  forward, open to full debate and amendments, but somehow, after  dinnertime yesterday, once Senate Republicans were done with overruling  the Parliamentarian, these bills were now not subject to the  filibuster.", "title": "Providing Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''", "date": "2025-05-22"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Therefore, the ROD is subject to CRA's submission       requirements.", "title": "U.S. Government Accountability Office Legal Opinion", "date": "2025-07-10"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The Founders thought that Federal law would be strictly limited in two  different ways: one, according to the subject matter; and two,  according to number.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The gentleman from North Carolina, I think, tried to change the  subject as if one mob rampage justifies another.", "title": "Improving Law Enforcement Officer Safety and Wellness Through Data Act", "date": "2025-05-15"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "We just had colleagues in Minnesota who were the subject of  assassination attempts, and, of course, the former speaker of the  Minnesota House was killed, along with her husband, and a State senator  was wounded, along with his wife.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "These are people who are working on research that is  important to your State and mine about diseases, about cures, about  vaccines, about pandemics, things that--you know, American people are  entitled to have some confidence and security that we have the best  minds addressing health issues and focusing on cures to diseases that  all of us can be subject to or the people we love, that they will be  doing that job.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Both banks and nonbanks are already subject to Federal consumer  financial protection laws, but Consumer Financial Protection Bureau  supervision is a key tool to ensure that Big Tech follows the law and  does not misuse consumer data and that consumers are not being scammed,  defrauded, or unlawfully debanked.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''", "date": "2025-04-09"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "senators should have a right to collect at least $1  million in a jackpot bonanza payoff from the taxpayers simply because  they were subject to the exact same rules all other Americans were  subject to and are subject to now.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, the bills in this rule today are nothing more than a  cheap distraction and another smokescreen from House Republicans, who  are desperate to change the subject.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The CFO may be removed only for cause by the Mayor, subject to the  approval of two-thirds of the Council and a 30-day congressional review  and comment period.", "title": "Introduction of the District of Columbia Chief Financial Officer Salary Home Rule Act", "date": "2025-12-23"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "That is what they are blowing up with these CRAs, not to mention that  if these CRAs are signed into law, the validity of every single permit,  lease, and Federal approval that has been issued based on these RMPs  would suddenly be called into question and subject to litigation.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": null}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "In many States--and I suppose Kansas, but I  don't know--you are subject to the death penalty.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "(a) Conditional Basis for Status.--Notwithstanding any       other provision of law, an alien shall be considered, at the       time of obtaining the status of an alien lawfully admitted       for permanent residence under this section, to have obtained       such status on a conditional basis subject to the provisions       under this Act.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-12-04"}, {"senator": "French Hill", "party": "Republican", "sentence": "0          0          0 Spending Subject to Appropriation               0          4          5  (Outlays)..............................", "title": "Ofac Licensure for Investigators Act", "date": "2025-07-21"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "I told  everybody, this isn't cranky Thom; this is Thom trying to explain a  very serious subject.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "(a) Transfer of Four Corners Federal Land.--          (1) In general.--Subject to valid existing rights, the       Four Corners Federal land is hereby taken into trust by the       Secretary for the benefit of the Tribe.", "title": "Pit River Land Transfer Act of 2025", "date": "2025-12-15"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "It  helps to combat the teacher shortage that is particularly acute in  particular districts and particular subjects.", "title": "California's Disastrous Policies", "date": "2025-05-08"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "(c) Terms and Conditions.--The conveyance under subsection       (a) shall be--\n\n(1) subject to valid existing rights;\n\n(2) made without consideration;\n\n(3) made by quitclaim deed; and\n\n(4) subject to such additional terms and conditions as the       Secretary determines to be appropriate to protect the       interests of the United States.", "title": "Dalles Watershed Development Act", "date": "2025-12-09"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "For police departments, law enforcement officers can be unfairly  subjected to higher levels of liability exposure for discharging a  firearm than a less-lethal device.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Any witness       may be accompanied by counsel, subject to the requirement of       paragraph (b).", "title": "U.S. Senate Select Committee on Intelligence Rules of Procedure", "date": "2025-02-26"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Kiley pointed out in his very good comments on this subject,  the problem is when California keeps ratcheting up their regulations,  because they are a large economy, as has been pointed out, and because  several other States decide to join them, although still in a minority,  the manufacturers have to look at that and say: Are we going to  manufacture two different types of vehicles for each class, or are we  just going to follow what California has done?", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "As Chairman Cole said more than once in the Rules Committee, these  appropriators knew their subject matter better than anyone else and  presented to the rest of us their best effort.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "They are subject to the higher interest rates today than we  had 5 years ago.", "title": "Congress is A Math-Free Zone", "date": "2026-01-08"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, as we wrap up today on this final RMP, I  include in the Record this GAO report that found that the RMP is  subject to the CRA.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}]