[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…TASERs have only minor health impacts       were not only primarily funded by the manufacturer, they did       not mimic real-life situations, having exclusively healthy       subjects, a short exposure time, and no long-term follow-up.       Moreover, domestic violence continues or for some populations       even escalates during pregnancy, and there is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…identified 62 substantiated incidents of  rape, sexual assault, and sexual harassment perpetrated by at least 42  individuals. The Coast Guard took action on only two of those subjects.\n\nDue to the lack of oversight and the Coast Guard's mishandling of  this, these individuals were allowed to retire, some at the grade of  commander, with full benefits, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…number itself, but also about  what this day can represent for our country. One of the most important  investments that we can make is getting students interested in STEM  subjects--science, technology, engineering, and math. Since World War  II, over half of U.S. economic growth has been driven by science and  technology, and through the end of the…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Financial Services Committee. At that committee, as it is today  under the new name, we heard from the Chair of the Fed on the specific  amount of time required by Congress on two subjects. According to the  Humphrey-Hawkins law, they would report to us on inflation and  employment/unemployment, and that was part of the purview in their  communication with Congress…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…varied alien status, including permanent residents and  asylum seekers, arrest them, and either detain them indefinitely or  forcibly deport them. Lawyers representing the subjects have been  denied access to their clients as well as access to the warrants and  other official documents. Judicial orders have been blatantly ignored  and courts denied access…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…several days later and told me  that she had read my essay and was very disappointed in what I wrote. I  thought she had problems with the style, or maybe I didn't get the  subjects and verbs to agree.\n\nWhen I went into her office, she said to me she was disappointed  because I said in my essay that, upon graduating high school, I would  be leaving my…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…X, the social media platform  formerly known as Twitter, can ask its AI chatbot Grok to undress women  and underage girls in photos. Grok will comply with requests to show  subjects in various states of undress with images which I won't repeat  for the record, but they are horrible.\n\nEven after these reports, X still has not prevented Grok from  creating…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…math and reading gaps between  higher- and lower-performing students continue to rise, as Black  students continue to be more than 10 points behind their white peers in  all subjects.\n\nIn 2021, Democrats passed the largest one-time investment in  education in the history of the United States in the American Rescue  Plan Act (ARPA), to provide schools with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…innovation.\n\nImportantly, the arts help heal, and students and our Nation need  healing.\n\nFirst, scores of studies over several years show that students do  better in all subjects when they have arts education. Unfortunately,  arts education is often seen as an extra, or it is cut because it is  not included in the national test scores, but that is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to drive to a county board of elections and  prove that they are an American citizen when they have proven that over  the course of 20 years or more of voting.\n\nThis bill subjects local officials to hefty criminal fines if they  register someone outside of these rules. This is an expensive unfunded  mandate in Westchester, New York City, and all the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690010/safeguard-american-voter-eligibility-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…effectively halting our work on critical medical advances.\n\nFrom February to April, the administration terminated nearly 700  grants across 24 NIH institutes and centers focused on subjects such as  aging, cancer, child health, diabetes, mental health, and neurological  disorders.\n\nWe are not only losing the promise of progress and cures and climate  technology,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…one's own party. Political courage can be hard;  regaining a freedom lost even harder.\n\nAnd above all else, here in the United States of America, we know  that we are not subjects to be ruled; we are citizens to be heard. This  is America. This is where freedom rings. And perhaps these sound like  lofty principles. Well, I am from the ``Live Free Or…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…TASERs have only minor health impacts       were not only primarily funded by the manufacturer, they did       not mimic real-life situations, having exclusively healthy       subjects, a short exposure time, and no long-term follow-up.       Moreover, domestic violence continues or for some populations       even escalates during pregnancy, and there is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…incidents. Eighty-six       officers reported five or more uses of force, and 17 reported       at least 10. Use of force overwhelmingly targets Black       residents, who are the subjects in roughly 94% of documented       incidents. Importantly, these numbers reflect only cases       officers self-reported, meaning the true numbers are likely       far higher.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of  color on the south side of Mount Vernon and elsewhere.\n\nThis school serves all students grades K-8 with free breakfast and  lunch. They place a strong emphasis on core subjects, notably English  and math, foreign languages, enrichment classes, ELL, special ed  services, music, arts, after-school, and athletics.\n\nAmani honored four outstanding individuals…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "James Risch", "party": "Republican", "sentence": "…international       monetary purposes (except that, at the request of the       Committee on Banking, Housing, and Urban Affairs, any       proposed legislation relating to such subjects reported by       the Committee on Foreign Relations shall be referred to the       Committee on Banking, Housing, and Urban Affairs).\n\n11. Intervention abroad and declarations…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…life situations and so employers can benefit from students'       school learning of data science, computational thinking,       mathematics, statistics, and related subjects.\n\n(B) The role of community-based problems, service-based       learning. and internships for connecting students with career       preparatory experiences.\n\n(C) Best practices…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…two-time Hunterdon Art Museum Young Artist  Award recipient and has been featured in the Holland Brook School  Bobcat Bulletin. She also maintains straight A's in all core subjects.  I invite my colleagues to join me in honoring Sadie and her remarkable  achievements, and I look forward to seeing Sadie continue to be  successful both on and off the field…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…purposes.\n\nAs we are seeing, President Trump and America are winning. Over 75  countries have reached out to representatives of the United States to  negotiate a solution on the subjects being discussed relative to trade:  trade barriers, tariffs, currency manipulation, and nonmonetary  tariffs. These will mean wins for the American worker.\n\nPresident Trump…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Speaker, I thank my friend from Texas. He always  has some amazing stories.\n\nMr. Speaker, tonight is going to be a little tricky because I am  going to try and weave three major subjects together. Some of it is  going to be really technical. Some of it will be slightly sarcastic,  but the math here is really important.\n\nI am going to do it backwards from how…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Chamber has been made available live to the public, from  memorable moments--including televising 16 Supreme Court nomination  debates and 3 Presidential impeachment trials--to subjects that are  often very mundane.\n\nThanks to C-SPAN2, this public service allows our constituents to see  the swearing-in of newly elected Members, watch all-night sessions  during…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…of the  subcommittees. The ranking member and I agree, and we have tried to  force decisionmaking down because we trust our cardinals and ranking  members. They know their subjects. They know one another. They work  together. Without them--and they solved most of the issues that were  before us--we wouldn't be here. That model worked well because the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…distinguished ranking member  for his argument and advocacy today.\n\nI would just point out to the body that while my distinguished  colleague speaks with his usual passion on many subjects, the only  subject before us today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act. That is the sole  question in front…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…academic excellence is evident through numerous honors,  including being a Red Hawk Rockstar, a consistent presence on the honor  roll, and earning academic recognition in subjects like English,  Spanish, and Physics.\n\nBeyond her academic achievements, Kacee has demonstrated an  extraordinary commitment to service. She has dedicated her time to  uplifting…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that are absolutely tiny.\n\nWe have been told this piece of legislation actually is the biggest  savings bill in U.S. history. I beg of anyone that actually cares about  these subjects of taking on debt and deficits, help us. Help us explain  it to our brothers and sisters. Help us take on what will be, let's be  honest, a barrage of hate from the brokers,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Number one is that TFA places teachers in areas that need teachers. It  helps to combat the teacher shortage that is particularly acute in  particular districts and particular subjects.\n\nTFA partners with school districts facing persistent vacancies,  especially in low-income, urban, and rural areas. The districts request  TFA core members for hard-to-staff…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]