[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…leadership by ensuring outreach and vaccinations were  available during the pandemic; securing multiple sources of public  funding for a Center for Recovery and Wellness, a substance use  disorder outpatient center that  opened in October 2024; and numerous additional legislative  accomplishments.\n\nIn addition to some of the civic engagements already…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…rural neighbors often travel long distances to access care.\n\nI have a bill, the Home-Based Telemental Health Care Act, that would  expand access to remote mental health and substance use services in  rural America, specifically for individuals working in the farming,  fishing, and forestry industries.\n\nMr. Speaker, it is time we come together to pass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Stop Illegal Entry Act, is another  distraction to divert attention from this White House's ongoing issues  and the Epstein files. It is a messaging bill that is light on  substance, bad on policy, and just something shiny for House  Republicans to talk about other than the Epstein files.\n\nThe bill purports to be tough on undocumented immigrants, but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Chair, I will vote in support of H.R. 2483, the  Substance Use-Disorder Prevention that Promotes Opioid Recovery and  Treatment (SUPPORT) Reauthorization Act of 2025. This bill, which was  first signed into law in 2018, aims to fight…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692133/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…while allowing the  authorization for critical, vital counseling and training programs to  lapse. It doesn't make sense. Small businesses deserve better than  slogans over substance.\n\nMr. Speaker, I urge my colleagues to oppose this bill, and I yield  back the balance of my time.\n\nMs. VELAZQUEZ. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents do not like how the Members vote on local D.C.  matters, residents cannot vote them out of office or pass a ballot  measure. That is the antithesis of democracy.\n\nThe substance of this bill is irrelevant since there is never  jurisdiction for Congress to legislate on local D.C. matters. However,  I will briefly discuss it.\n\nD.C. allows noncitizens…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Chief McLin has played a  crucial role in supporting Granite Staters through the Adverse  Childhood Experiences Response Team (ACERT) and Comprehensive Opioid,  Stimulant, and Substance Use Program (COSSUP).\n\nIn addition to his decades in law enforcement service, Chief McLin is  a proud veteran of the United States Navy, serving from 1984 to 1990 in  Operation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Justice providing  Federal support for local violence reduction by community police,  community policing and prosecution, victim services, juvenile justice,  child protection, substance abuse and mental health treatment,  corrections and reentry, justice systems enhancements, research and  evaluation, and  other State, county, and local level public police…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…administration's proposed cuts to critical programs that support our  healthcare systems and save lives. These efforts have made a  difference.\n\nWe secured $7.4 billion for the Substance Abuse and Mental Health  Services Administration, SAMHSA, despite the administration's callous  attempt just 1 week ago to eliminate almost all discretionary grant  funding…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. This week, the Senate is expected to take up the first  set of appropriation bills for fiscal year 2026.\n\nOn the substance, a number of the bills negotiated in committee make  significant reversals of DOGE's horrible cuts. Of particular importance  are the reversals these bills make to DOGE's…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…does not come out of this  area of the world.\n\nBut this is one of the interesting things that happened just last  night: President Trump canceled $2 billion in grants for the Substance  Abuse and Mental Health Services Administration. These were grants  intended to fund overdose prevention work in communities, to provide  lifesaving reversal drugs, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…when it comes to Colorado and what we have been  able to do to address the opioid epidemic. In Colorado, we were able to  utilize the 1115 waiver by proving that by covering substance use  disorder treatment, we could save money over time.\n\nWhat happened in the reconciliation bill was language that said you  actually had to prove that it was cost neutral…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…families. This is what public  broadcasting means for Wisconsinites, but it applies to all the States  that we represent. That should be reason enough to oppose this bill on  the substance of it.\n\nBut the other reason is the extraordinary process that is being used  to make this change and the impact it would have on the ability of this  body to perform its…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…that the Republican majority could say they have an open process on  this flawed bill and avoid yet another criticism of all of their closed  rules.\n\nWith respect to the substance of the amendment, I am concerned that  it needlessly pits two things that are not in conflict, that is,  brokerage windows and the plan's designated investments.\n\nMy colleagues…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…can't let go of the gains that  have been made that make a difference in people's lives, in the  education of their kids and their health and their safety, of looking  at substance abuse and opioid addiction and how we can deal with that,  transportation, rent assistance, homeless assistance, maternal  mortality, childcare, and Head Start.\n\nThere are…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…or a       requirement to impose sanctions on the importation of goods.\n\n(b) Good Defined.--In this section, the term ``good'' means       any article, natural or manmade substance, material, supply       or manufactured product, including inspection and test       equipment, and excluding technical data.\n\nMr. Speaker, I rise in strong support of Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…traffic projections and                emergency response posture at ports of the United States. Sec. 323. Improving Vessel Traffic Service monitoring. Sec. 324. Controlled substance onboard vessels. Sec. 325. Cyber-incident training. Sec. 326. Navigational protocols. Sec. 327. Anchorages.              Subtitle D--Matters Involving Autonomous Systems…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…or requirement to impose sanctions on the       importation of goods.\n\n(2) Good defined.--In this subsection, the term ``good''       means any article, natural or man-made substance, material,       supply or manufactured product, including inspection and test       equipment, and excluding technical data.       SEC. 4. DEFINITIONS.\n\nIn this Act:\n\n(1)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…support.\n\nI commend the detailed work of our chairmen, Representatives Joyce  and  Diaz-Balart. Their leadership and careful stewardship of this package  ensured that the substance of the bill matched the responsibility of  the task.\n\nI thank their accompanying ranking members, Representative Steny  Hoyer and Lois Frankel, for their professionalism…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…counseling, and  peer support.\n\nThe SUPPORT for Patients and Communities Reauthorization Act of 2025  has the backing of more than 160 different organizations dedicated to  substance abuse disorder treatment and recovery, and it expands care  for pregnant and postpartum women, strengthens prescription drug  monitoring, and helps individuals in recovery…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…leadership, public affairs, multimedia production, space and missile  operations, communications, and emergency medical care. His extensive  professional training included the Substance Abuse Program Prevention  Course, Digital Multimedia Course, Instructor Training Course, Public  Affairs Course, Combat Lifesaver Course, NBC Defense Course, Joint  Tactical…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…right here. That is these people right here.\n\nWe have a criminal illegal alien from Vietnam who has been convicted  25 times for crimes including possession of a controlled substance;  second-degree robbery; cruelty toward the elderly; arson property;  taking vehicle without consent; and theft.\n\nI could go on and on. Those are the people who ICE is trying…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…support of this amendment, which directs the  Veterans Administration to begin preparing for the rollout of  breakthrough treatments for veterans battling PTSD, depression, and  substance abuse disorders.\n\nPresident Trump's first administration took a bold and necessary step  by granting breakthrough therapy status to MDMA and psilocybin  acknowledging their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…treatment and recovery opportunities,  bolster prevention initiatives, and fight the fentanyl crisis.\n\nThis bill is about offering hope to those in despair, those battling  substance use disorder, their families and loved ones, healthcare  heroes, and first responders who need continued support to help save  lives.\n\nI thank Congresswoman Pettersen and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dark matter.''\n\nWith respect to the ranking member, this is not a melodramatic term.  It is actually quite appropriate. In physics, ``dark matter'' refers to  the mysterious substance that makes up about 85 percent of the mass of  the universe, but no one really knows what it is. Similarly, all of  these guidance documents make up a great deal of the regulatory…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…or a requirement to impose sanctions on the       importation of goods.\n\n(B) Good defined.--In this paragraph, the term ``good''       means any article, natural or manmade substance, material,       supply or manufactured product, including inspection and test       equipment, and excluding technical data.\n\n(2) Exception to comply with international…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…address the criminal justice side of it.  However, my friend from New Jersey is correct, what also has to be  addressed are the issues affecting people that are suffering from  substance use disorder. We did that in the SUPPORT for Patients and  Communities Reauthorization Act of 2025 where we had over, I think, 350  votes on the floor. It was broadly bipartisan…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692351/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…or a       requirement to impose sanctions on the importation of goods.\n\n(b) Good Defined.--In this section, the term ``good'' means       any article, natural or manmade substance, material, supply,       or manufactured product, including inspection and test       equipment, and excluding technical data.       SEC. 6. DEFINITIONS.\n\nIn this Act:\n\n(1)…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Madam Chair, I yield myself such time as I may consume.\n\nMadam Chair, I rise today in support of my amendment. In 2018, the  Substance Use-Disorder Prevention that Promotes Opioid Recovery and  Treatment for Patients and Communities, otherwise known as the SUPPORT  for Patients and Communities Act, was signed…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…House Resolution 164       are laid on the table.         (b)(1) A motion to discharge a committee from       consideration of a bill or resolution that, by relating in       substance to or dealing with the same subject matter, is       substantially the same as House Resolution 23 shall not be in       order.\n\n(b)(2) A motion to discharge the Committee…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]