[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…species annually, connecting the rest of the United  States and also the world to this cradle of our natural heritage.\n\nEqually vital, the 9,000-strong Gwich'in Nation, whose subsistence  and culture depend on the caribou herd, reside along the herd's  migratory route, making any disruption not only a threat to  biodiversity but also an assault on indigenous…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…vote on a congressional resolution of  disapproval to overturn the management plan for the Arctic Refuge. And  instead of a targeted approached that emphasizes things like  subsistence hunting, wildlife conservation, and a focus on Tribal  consultation, a vote for this resolution will--redundantly--open up the  entire Coastal Plain of the refuge to be…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Tribal governments have spent years  working in good faith with the Federal Government to develop land  management plans that both allow for energy development and protect  subsistence hunting and fishing resources.\n\nThat is what they are blowing up with these CRAs, not to mention that  if these CRAs are signed into law, the validity of every single permit,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…called America's Serengeti; that is because of  the hundreds of thousands of caribou that migrate and depend on these  lands. Herds that Alaska Native Tribes rely on for subsistence and they  have been an essential piece of their traditional culture and way of  life.\n\nBecause it is one of the largest remaining untouched ecosystems on  our entire planet,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…``sweeping restrictions that curtail  responsible development, undermine congressional intent, and disregard  the well-being of the people who depend on these lands for both  subsistence and livelihoods.''\n\nThese communities are located in an area nearly the size of Minnesota  with no highway connections, extreme transportation costs, and a cost  of living…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…pipelines and other essential oil and gas  infrastructure and community infrastructure. The 2020 plan also  provided important protections for surface resources, particularly  subsistence uses by providing adequate protection for sensitive bird  populations and the Teshekpuk and Western Arctic Caribou Herds. All in  all, it was a phenomenal achievement by…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…competitive leasing of oil and gas in the Reserve.''\n\nThe Department is mandated to do that while protecting important  values, including sensitive areas, as well as providing for subsistence  use for Alaskans. This is generally Alaskan Natives who live in the  North Slope area.\n\nCongress really envisioned this as a balance here, where you had  responsible exploration…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…hypothetical future development of mineral deposits in the       Ambler Mining District, Wiseman East and West deposits, and       the Ray Mountains could ``significantly restrict subsistence       uses and have a disproportionate negative impact'' on certain       ``environmental justice communities'' as well as       ``significantly restrict subsistence uses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…effects of mineral and       geothermal exploration and development. The purpose of the       withdrawal is also to protect the health, traditional       cultural values, and subsistence-based lifestyle of the       Tribes that rely on resources in the region, such as wild       rice, which are particularly susceptible to adverse impacts       associated…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…support turning the community and  its surrounding land into a giant national park, claiming such an  action ``literally guarantees us a fate with no economy, no jobs,  reduced subsistence, and no hope for the future of our people.'' In  front of those gathered, Secretary Burgum committed to rectifying this  injustice.\n\nBecause of the opportunities provided…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…causes, ecological consequences or       physiological consequences on wildlife function, and economic       or cultural impacts, including food safety and security and       subsistence use, of harmful algal blooms;\n\n``(C) examine the effect of other environmental stressors       on harmful algal blooms;\n\n``(D) examine potential methods to prevent, control,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and appropriate for the protection of such values within       the'' NPR-A. The statute also authorizes the Secretary to       designate lands ``containing any significant subsistence,       recreational, fish and wildlife, or historical or scenic       value'' and requires that exploration in these areas ``shall       be conducted in a manner which will…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…finally connect two Cape Fox parcels and  honor a promise made decades ago.\n\nThis bill also paves the way for a renewable energy corridor and  year-round access to vital subsistence and tourism areas. It enables  local development, supports energy independence, and strengthens  southeast Alaska's economy, all while respecting Tribal sovereignty and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}]