[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…builder who tripled the size of his congregation during  his time as pastor at Mount Zion. McKinney was a founding member of  Seattle's First Human Rights Commission, which successfully fought for  the Seattle's first Fair Housing Act, establishing protection for  tenants of protected classes and marginalized communities. A lifelong  champion for racial…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…their wide variety of outdoor  spaces, the parks attract thousands of visitors every year.\n\nOver their 80 years of service, the Carmichael Recreation and Park  District has successfully maintained its parks and facilities through  many challenges. They continue to provide exceptional recreation  experiences and will continue to do so for many years to come.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…his fervent work  to support Ukraine.\n\nFor years following the fall of Communism and particularly after the  Rose Revolution in 2003, the people of Georgia have worked to  successfully build their democracy and their economy, all while  fostering aspirations to join the EU and NATO.\n\nThe United States, along with European partners, have played an  integral…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…critical habitats and engage communities in the  conservation process.\n\nThese communities of interest include the Native Hawaiians, who  stewarded our natural resources successfully through generations pre- contact as a matter of both kuleana (responsibility) and survival. By  providing a pathway for collaboration across local, state and federal  stakeholders,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…The FAST VETS Act is a critical first step to addressing the backlog.  It establishes clearer standards and prioritizes outcome-focused  planning to support more veterans successfully and efficiently moving  through the program and into the workforce.\n\nEnsuring every veteran gets the support they deserve helps prevent  housing instability, reduces food…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…she has served in several key leadership roles throughout her  remarkable career. She served as the Director of the Army Recruiting  and Retention Task Force, where she successfully integrated and  synchronized efforts across the Army Enterprise to address the  recruiting crisis that impacted recruiting for several years. During  the pandemic, she diligently…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…producing and distributing wide-release motion pictures and content for  all platforms. In pursuit of racial equity in advertising dollars and  channel carriage, he has successfully led lawsuits that secured  settlements with the major corporations McDonalds and Comcast. Allen is  also a noted philanthropist, helping to raise tens of millions of  dollars…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…leverage flexibility will ensure the  capital needs of small businesses in our critical technology sector are  met by the SBIC program. This will enable the SBA and DOD to  successfully implement their joint Small Business Investment Company  Critical Technology Initiative.\n\nIn addition, this bill provides another avenue to extend private  investment to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697258/investing-in-all-of-america-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…over time that the  extra risk is not as great as anticipated.\n\nIn the past 30 years, technological developments and time have shown  that many of these properties can be successfully repurposed for  alternative uses, increasing the market pool of potential buyers.\n\nFurther, the charge-off rates for special purpose and standard loans  are similar, demonstrating…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699165/main-street-parity-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…years in refugee camps. People go through extensive background checks  before they are even considered to come to the United States.\n\nIn this situation, those who have successfully made that journey are  once again in jeopardy with the new Trump policy.\n\nThe administration is reviewing again all legal immigration cases  already approved for individuals…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…1969 necessitated a months-long closure and heavy renovations to the  business. Still, care was taken to preserve as much of the original  diner as possible, and Henry's successfully reopened the following  year.\n\nIn the early 90s, a McDonald's opened directly across the street from  Henry's. Some feared this signaled a cultural shift and could spell…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…J., concurring).\n\nI am also keenly aware of the Fifth Circuit's decision in       Petteway v. Galveston County, 111 F.4th 596 (5th Cir. 2024)       (en banc). My office successfully briefed that case's       implications for Texas congressional districts earlier this       year. See First Amended Motion for Partial Judgment, LULAC v.       Abbott, No.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…has been able to secure millions of  dollars in funding to address cross-border pollution. For instance,  last year Ally worked with staff for the San Diego delegation to  successfully advocate for funding to support environmental  infrastructure in the Tijuana River Valley Watershed to be included in  the Water Resources Development Act.\n\nIt is impossible…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Phil first came to the committee, Congressman Ike Skelton,  the 14th Chair of the Armed Services Committee, took him under his wing  and gave him an education on how to successfully navigate the sprawling  annual task of passing the National Defense Authorization Act. He could  not have learned from a better teacher.\n\nAt Seapower, Phil diligently followed…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…healthy democracy--the  leader of the country micromanaging academic departments at major  universities to ensure that academic work aligns with the regime.\n\nNow, having successfully forced Columbia to bend the knee and quell  dissent on their campus, Trump is targeting other universities. Some of  them will sign similar agreements giving President Trump…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…in. They did not  stand up and do their duty.\n\nWe can show the people that the constitutional principle of the  separation of powers still means something and that we can successfully  challenge the Presidential attempt to raise taxes without the consent  of Congress.\n\nTariffs are taxes, plain and simple. Tariffs don't punish foreign  governments; they…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…contractors and major       subcontractors; and\n\n``(9) narrative descriptions of risks to cost, schedule, or       performance that could result in a program breach if not       successfully mitigated, including--\n\n``(A) the current risks to such program;\n\n``(B) any failure of such program to demonstrate a key       performance parameter or threshold during…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…career by enlisting in the United States  Navy in 2005 and has since held numerous assignments, including on the  USS Maryland (SSBN-738), USS John C. Stennis (CVN 74), and successfully  completed two deployments.\n\nThroughout his service, he has not only accumulated over 2,000 flight  hours in various  aircraft, but numerous military decorations, including…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…divisive concepts like energy equity and  environmental justice, which allocate tax dollars based on immutable  characteristics. Are you serious? This is America?\n\nWhile we successfully ushered in the end of the Inflation Reduction  Act, we have to continue because there is plenty more to do. Over 90  percent of the subsidies from this organization went…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…The Federal Government must close these loopholes and enforce  the law.\n\nAs chair of the Appropriations Subcommittee on Transportation,  Housing, and Urban Development, I successfully included language in the  fiscal year 2026 bill and report that builds upon the President's  Executive order to strengthen English proficiency requirements for  commercial…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…business contracting goals, but it fails to consider how  many of those contracts go to first-time participants. Without this  data, we don't know if new small businesses are successfully entering  the marketplace or if the same firms are winning contracts year after  year.\n\nIf small businesses can't break into Federal contracting, innovation  is stifled,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…levels.\n\nI represent many communities that receive funding through the Secure  Rural Schools program, and I remain committed to seeing the program  operate consistently and successfully. We must ensure that Congress  continues to fulfill our obligation to our rural counties and schools.\n\nMr. Speaker, I support this legislation, and I urge my colleagues…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…important family farms are. It is my honor  to advocate on their behalf in Congress.\n\nThe FFA plays a critical role in equipping our young people with the  tools they need to successfully lead the next generation of American  farming. Farmers across the United States and my district have  benefited from the FFA's commitment to advancing agriculture education…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691474/recognizing-luke-jennings"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…more than President Biden did  in 4 years. He has made clear to the Europeans that they need to step  up and assume greater ownership of their continental security, and he  successfully persuaded them to increase their defense spending and  enhance deterrents against future aggression.\n\nThe President's representatives have led several rounds of  negotiations…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Mr. BURCHETT. Mr. Speaker, I rise this evening to congratulate  President Trump on a successful first 100 days in office.\n\nUnder President' Trumps leadership, he has successfully closed the  southern border. For the past 4 years, our country has been invaded by  illegal aliens, many of whom are on the terrorist watch list, members  of the Taliban,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California.                                SpaceX Rescue\n\nMr. KILEY of California. Mr. Speaker, I would like to congratulate  and thank SpaceX and its Crew Dragon capsule for successfully returning  the two astronauts, Barry Wilmore and Suni Williams, who had been  stranded in the International Space Station for 286 days.\n\nMost Americans are now familiar…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…policymakers and regulators about the company, its products,  and processes. This expertise made him an effective advocate at the  global, federal, and state levels, where he successfully influenced  policy discussions.\n\nThroughout his career, Collis has dedicated himself to building and  leading effective teams and mentoring numerous colleagues. As a strong…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…working class and middle class of this country, the economic  patriots of the United States of America.\n\nJust over a year ago, I stood on this very floor and ultimately  successfully  called on the CEO of a local utility monopoly in my district which had  been screwing over my constituents, robbing them blind, literally  emptying their dwindling savings…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our Subcommittee on  Digital Assets, Financial Technology, and Artificial Intelligence,  Bryan Steil, who championed and worked through our committee through  markup in successfully designing, writing, and passing in committee the  STABLE Act.\n\nI thank my House colleagues for their principled approach to key  policies that guided and distinguished our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…BEBOT, the first  battery- and solar-powered beach-cleaning robot on the West Coast.  Through funding provided by the North Tahoe Community Alliance, the  team was able to successfully deploy BEBOT to the shores of Lake Tahoe,  maximizing beach cleanup efforts through advanced technology and in  partnership with local volunteers.\n\nThrough this innovative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]