[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…I rise today to recognize Alfonze Romero  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlfonze has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alfonze, develop crucial skills and a  work ethic that will guide…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690988/recognizing-alfonze-romero"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…I was  convinced then and am even more certain now that the partnership has  created a scalable and sustainable model for schools nationally.\n\nThe partnership is not only a success for L.A. but an example for all  of America. Their work demonstrates that when we invest in teacher  coaching, leadership development, aligned systems of support, and other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…rise today to recognize Julissa  Martinez for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nJulissa has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Julissa, develop crucial skills and a  work ethic that will guide…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691749/recognizing-julissa-martinez"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…military interventions abroad  would succeed. I have seen regime changes, nation-building efforts, and  elaborate reconstruction schemes launched with confident predictions of  success, only to have them collapse when encountered with the reality  on the ground.\n\nAnd the reality is this: When we rely on the U.S. military as our  primary tool of foreign engagement,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Miya Atencio  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nMiya has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Miya, develop crucial skills and a  work ethic that will guide them…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690283/recognizing-miya-atencio"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the organization is not limited to the summer months; its  work continues throughout the year, through crucial after-school  programming that extends the mission of academic success and personal  growth for students, while providing parents opportunities to finding  meaningful employment and attending school so that their families can  get ahead and stay…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Classic, which is a yearly  football game between two HBCUs at Soldier Field. The game is  accompanied by scholarships, workshops, and outreach for students.\n\nFrom business success to civic leadership, I am pleased to  congratulate Larry Huggins on a life of exemplary service and  achievement.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689205/congratulating-larry-huggins-on-a-life-of-service-and-achievement"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…did something that no  Congress had done in 30 years: It passed all 12 appropriations bills  before the start of the next fiscal year. One year later, Congress  built on that success by working with then-President Clinton to enact  the Balanced Budget Act and set enforceable budget caps.\n\nAnd what occurred after this series of bipartisan, commonsense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…annually through  partnerships with 130 local organizations. Their work not only  addresses immediate needs but also empowers parents and creates a  foundation for lifelong success--making Little Hands a shining example  of compassion, impact, and community leadership.\n\nThe Women of Impact in Education Award--Kayla Diaz: Kayla Diaz has  dedicated her…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…systems,  carried out cyber operations to shut down power in Caracas, and  executed a helicopter assault  on the Presidential compound to seize Maduro and his wife. The tactical  success of this mission is a testament to their capabilities and also  to the incredible courage and quality of the men and women of our Armed  Forces.\n\nHowever, military skill is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Giana Padilla  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nGiana has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Giana, develop crucial skills and a  work ethic that will guide…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691501/recognizing-giana-padilla"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Minnesota's 4th Congressional District, I  extend my warmest congratulations to Delta Air Lines on 100 years of  service and innovation, and I look forward to its continued success in  the century ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…They are the ones who should be making these decisions.  Promoting partisan legislation that fails to address the full  healthcare needs of students does not lead to academic success.\n\nMr. Speaker, I urge my colleagues to join me in opposing these bills,  reject H.R. 6359 and H.R. 6945, and instead stand up for those who are  making that personal decision…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Kai Weiss for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nKai has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Kai, develop crucial skills and a  work ethic that will guide them…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691740/recognizing-kai-weiss"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…entrepreneur.\n\nMr. Speaker, this is, after all, the fundamental promise of the  American Dream: that any person in this country can work hard, take  risks, and hopefully find success.\n\nYet, Americans with disabilities, like other underprivileged groups,  see fewer opportunities to make their entrepreneurial dream a reality.  There are 44 million people…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the pharmaceutical  industry, applying his college education and background to become a top  sales representative. Scott focused on advocating for patients and  helping drive success within his teams. Scott continues to work and  thrive in the industry by helping counteract the social stigmas  associated with the field. He has received several honors and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…a global plastics industry.\n\nAt each of these companies in my district, I witnessed the best of  Indiana: highly-skilled, hardworking Hoosiers who are contributing to  the success and the defense of our country.\n\nAbove all, I heard a common theme as I traveled my district: Let's  bring more Hoosier common sense to Washington.\n\nMr. Speaker, that is the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…in women's athletics. Sixty-seven percent of Democrats  say it is wrong to have men compete in women's athletics.\n\nIt is lost opportunity. It is lost recognition. It is lost success  for women.\n\nWhat ever happened to people on the left that supported women's  rights, women's safety, supported title IX? Obviously, they have thrown  it to the wayside.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Coach of the Year, these young men came mentally  prepared and demonstrated the power of teamwork and determination to  bring home the school's second State trophy.\n\nTheir success has united our community in pride and celebration. We  congratulate the following team players: Cam Pacheco, senior guard  named Player of the Year; Tyler Sprague, named first-team…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…They teach kids structure, respect, understanding and so  much more in a loving environment. The team really cares, and each  member is deeply invested in the kids' long-term success.\n\nIt is clear Carol Smith has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690147/recognizing-carol-smith"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…that we pass legislation that  creates a legacy and regulatory climate that allows our small  businesses to be competitive and to grow.\n\nSmall businesses are pivotal to the success of our Nation's economy.  I join my colleagues this week in celebration of the small businesses  that keep our country thriving, and I will work with them to ensure  that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…exemplified the best of civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success but by a  deeply rooted commitment to his community, his faith, and the  betterment of this country.\n\nOutside of his accomplished professional life, Marshall has devoted…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Cochise Community College has two campuses and four centers in  Cochise County and is known for its affordable tuition, small class  size, and programs that lead to real-world success. Cochise College  embraces what all colleges should strive to be in this amazing country.\n\nA product of community college myself, I know firsthand that Cochise  College remains…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…twice.  But his bill--Senator Sullivan's legislation that I just mentioned--is  now headed to the President's desk to be signed into law. Now, there is  no reason that that success that we tasted, just yesterday afternoon,  can't continue here with similarly situated, similarly  noncontroversial, unanimously passed bills.\n\nSo, again, I have got four…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and dance. Our friends  revert to demonizing and misrepresenting the big, beautiful bill. They  say you can't make this stuff up, but that is what they do.\n\nWe are having one success after another, and it is driving our  friends across the aisle to distraction.\n\nWhen they had full control of the levers of power just a few years  ago, they expanded the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…initiative and  desire to make an impact. Throughout the process, both students  maintained determination despite technical hurdles.\n\nTheir creativity and determination for success are truly inspiring. I  know both Ishan and Rikhin have bright futures ahead. I wish them  continued success as they pursue their academic and professional goals.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699627/recognizing-congressional-app-challenge-winners-for-indianas-third-district"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Speaker, I thank the Armstrong County Community Action  Partnership for their unwavering commitment to our community and wish  them many more years of service, support, and success.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Schnall and all of the players on a season to  remember. Their run inspired fans across the Nation and reminded us why  we love this game. We look forward to their continued success in the  years to come. Chants Up.                     Honoring Robert Franklin Childs III\n\nMr. FRY. Mr. Speaker, I rise today to honor the life and legacy of a  dear friend…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Conservation Coalition (ACC). They were       successful in their quest to set aside 91,000 extraordinary       acres of national forest as ``forever wild'' wilderness.       Their success to which I pay tribute today came on the       twentieth anniversary of the Wilderness Act of 1964. In 1964,       Congress authorized guiding principles that would carefully…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Volleyball Coaches Association's ``Mr. Volleyball of  Pennsylvania''--among other accolades--and was instrumental in their  championship with 43 assists. Also integral to their success was  veteran coach Craig Dietrich, who was awarded District Three coach of  the year.\n\nI include in the Record the following individuals contributed to the  Manheim Central…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}]