[{"senator": "Jim Himes", "party": "Democrat", "sentence": "…Permanent Select Committee on  Intelligence immunized from the sewage that flows through this Chamber,  the partisan attacks, the hideousness. By and large, we have been  pretty successful, with one exception, when that committee got involved  in the political investigation around Ukraine in the first Trump  administration.\n\nEvery single day, the leaders of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…ecosystem has been cut nearly in half.\n\nHaving this bill will make it easier for small business owners,  people who are already working around the clock, to make their business  successful for themselves, their communities, and their employees. They  will now have an easier chance of applying for a contract with the  Federal Government.\n\nI am hopeful when this…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691849/plain-language-in-contracting-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…assistance for children of veterans,  protections for Medicaid, clean energy jobs--and the list goes on. And  an expansion of the child tax credit, an idea that has proven  successful--all that was sacrificed to give billionaires tax cuts  instead.\n\nIn the end, three sensible Senate Republicans looked at this ugly  betrayal of a bill and agreed they couldn't…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…public safety       infrastructure and ecosystem. The effect of these       Congressional repeals would put our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws are necessary,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the war, Mr. Lomell returned to New Jersey, where he settled in  Toms River. He graduated from Rutgers University Law School, married  and had three daughters, and opened a successful law practice. He died  in 2011 at age 91, and his grateful hometown honored him with the  creation of Lomell Lane.\n\nI can think of no better way to honor Mr. Lomell and demonstrate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…of meeting with her in Mobile this past August, and her  dedication to building partnerships and advancing science-based  solutions is a big reason the program has been so successful in Mobile.\n\nIt could not be more fitting that, in the same year in which she  celebrates 16 years of leadership and her retirement, that her  Congressman has the honor of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…United  States. His meticulous attention to detail and deep understanding of  both British and American political landscapes ensured that these  engagements were not only successful but also meaningful, advancing  dialogue and cooperation at the highest levels of government and  society.\n\nIn addition to his work on political affairs, Nick demonstrated…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…But it should be within the overall framework of  immigrants like this little guy are not a problem. Our immigrant  communities are part of what makes our Nation great and successful. I  am tired, after more than 13 years, of hearing immigrants just dragged  down, called ``illegals''? Why don't we call people convicted of fraud  ``illegals''? Why don't…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…owners aren't asking for easy. They are  asking for a fair shake and a real shot. That is what the 7(a) loan  program is supposed to do: help turn grit and a good idea into a  successful business.\n\nThis program is the reason that someone with a solid plan or a good  business but without a big investor or family money can still open up  shop.\n\nWhen small business…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…money. The more efficient  the appliance, the less money people pay in their electricity bill. The  fact is that Federal appliance efficiency standards are one of the most  successful climate and consumer savings programs in American history.  And these standards have been around for decades.\n\nBack in 1987, I wrote the law. I am the author of the law that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and all three are  American companies.\n\nThe manufacturers that are in favor of this resolution and against  the standards are foreign manufacturers.\n\nIf this resolution is successful, Republicans are giving foreign  manufacturers an advantage over domestic manufacturers. Foreign  manufacturers are against the standards because they don't want to  spend…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…certainly       unconstitutional under the requirements set out by the       Supreme Court in United States v. Salerno. This bill would       reverse more than 30 years of successful, data-driven       pretrial policy reforms in D.C. and replace it with a wealth       based system that fuels mass incarceration, racial       disparities, and benefits the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today in full support of the  Successful Entrepreneurship for Reservists and Veterans Act, otherwise  known as the SERV Act. This bill would study the barriers that veterans  face when starting or owning a small…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…nonverbal, and he is relying on a feeding tube. Jamie told reporters  that one of David's medications ``can cost up to $1,000 a month.'' She  said that if Republicans are successful in cutting Medicaid, ``we would  have to choose--are we going to eat? pay the bills? or keep him  alive?'' She said, ``It is a life-or-death situation.''\n\nSo when Republicans…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…If I were to put it simply, PEPFAR saves lives. It has already saved  26 million lives. That is indisputable, and it should be enough to  continue to fund one of the most successful global health programs in  history.\n\nIf I cannot appeal to my colleague's humanitarian side, perhaps they  will listen to all the ways PEPFAR serves American interests. PEPFAR…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…fact that you don't want President Trump to arrest Maduro,  and you will condemn him no matter what he does, even though he brought  Maduro to justice with possibly the most successful law enforcement  operation in history.\n\nYour hypocrisy is clear, as you chant and you lead your no kings  protests, but when it comes to taking down a dictator, you crawl…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…who  live in Alaska could provide for essential services.\n\nWhile initial interest in the NPR-A was tepid, new oil finds closer  to the NPR-A boundaries led to a number of successful lease sales  generating millions of dollars in Federal revenues. Among the most  successful was the 2016 lease sale, which came following the discovery  of the Willow field.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…cared more about  opposing the President than bringing an oppressor to justice.\n\nI also thank the many nameless, faceless Americans who planned and  executed this daring and successful arrest. The public will never know  their names or see their faces. Americans who have suffered from drug  overdoses in their families brought on by illegal narcotics trafficked…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "James Risch", "party": "Republican", "sentence": "…itself from Iran's grip,  and America will be safer for it. To promote stability in the region  and protect our national security, we need to continue to support  Israel's successful efforts.\n\nPresident Trump, Secretary Rubio, and soon-to-be Ambassador Huckabee  will work day in and day out to make sure that American interests are  protected in Israel,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…That  is progress. But I believe the President was hired to address the issue  Joe Biden created. So we need to give the right tools to our law  enforcement officers to be successful.\n\nI encourage my colleagues on the other side of the aisle to work with  the White House and Senate Republicans to come up with a reasonable  compromise based on common ground…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…for firefighting that never seemed to fade.\n\nAfter graduating from St. John's University in Queens, New York, in  1969 with a degree in Business and Marketing, he pursued a successful  30-year career in men's fashion. Yet, the call to serve his community  never left him. In 1975, he answered that call by joining the Floral  Park Fire Department as a volunteer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…was responsible for prosecuting misdemeanor offenses and  General Session transfer cases. Mac showed tremendous initiative in  this role by developing and implementing a successful DUI curriculum  for local law enforcement personnel. This training program was so  successful that it was later expanded to the South Carolina Criminal  Justice Academy and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of our welfare programs are designed to  discourage people from getting married.\n\nWe know that people who get married and have children--well, all  types of families have successful children. I personally know many  people who, on their own, both men and women, have done a very good job  of raising children we would be proud of. In the long run, it is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…last night.\n\nThe strikes a couple of days ago were designed to shut down the  enrichment facilities used to make this weapons-grade uranium. I think  we were substantially successful, and I have never been more proud of  President Trump and our military. And I think we set back their  military program substantially.\n\nBut here is what we didn't do: We…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st class.\n\nAfter the Navy, Edward built a long and successful career in the  floral industry and was known for his love of fishing, golfing,  hunting, and making breakfast for his grandchildren. He was the proud  father of 3 sons, grandfather…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Central Intelligence Agency Director John Ratcliffe, and Gen. Dan  Caine, who is Chairman of the Joint Chiefs of Staff. They told us,  beyond a doubt, the Iran strikes were successful.\n\nTwo things are clear: one, President Trump protected our country;  and, two, America drew a redline on Iran--no nuclear weapons--and  President Trump enforced it.\n\nEvery…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…would permanently close the Nation's capital  airport to general aviation landings. Eventually, that seven-year  effort of Mary and her many colleagues led to the airport's successful  reopening through the DCA Access Standard Security Program (DASSP).\n\nMary has been an unfailingly genuine, wise, and shrewd contributor to  the interests of the general…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…mission because Merlyn Lewis is on  the front lines and in the trenches doing whatever is necessary to  ensure the organization and those served have all that is needed to be  successful.\n\nIt is clear that Merlyn Lewis has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities with…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691758/recognizing-merlyn-lewis"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…corporate jets for United Airlines and Delta  Air Lines before becoming a Captain at  American Trans Air, now ATA Airlines. Moreover, he founded Terrell  Materials, a very successful company that specializes in high-volume  concrete manufacturing for runways and taxiways at major airports.\n\nUnderstanding the power of influence, Pat served as a role model…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…daughters, Rebecca and Audra--while transforming their modest  beginnings into a thriving cattle operation spanning thousands of  acres. Together, they built Mazak Ranch into a successful cattle  operation with land in both Florida and Texas.\n\nFrom attending Florida CowBelles events with her mother as a young  girl, Reba has been a dedicated advocate for the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}]