[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…heights, strengthening  collaboration on defense, strategic technologies, and the Quad.\n\nIn mere months, Trump's reckless foreign policy style has unraveled  decades of progress, suddenly slapping India with 50 percent tariffs  because his fragile ego was so triggered.\n\nRepublicans have refused to go to bat for the U.S.-India relationship  when it really matters,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695025/trump-must-reverse-course"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…who says one thing and, in the case of  Secretary Rubio, who actually lived it--he was actually an ardent  advocate for defending Ukraine. Then you get into Trump zone, and  suddenly all your principles disappear, all your commitments disappear,  and you just become a tool of the Trump political operation. I have  seen that too often, so I am going to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…monoxide, the sulfur dioxide, the  benzene, and particulate matter that flood into our air and into our  children's lungs.\n\nNow, unless industry were to somehow decide to suddenly just do the  right thing, it is incumbent upon government to act. And that is what  California has done. But, of course, this discussion debate is more  than just about public…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…literally on her desk. As of today, none of that has  materialized.\n\nHowever, when Bondi told Trump in May that his own name appeared in  those files, everything changed. Suddenly, the files were too dangerous  to release. Then the Department of Justice claimed there was no client  list at all. Trump went from promising full transparency to calling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…U.S. Agency for International Development. Estimates  are that more than 760,000 people, including 500,000 children, have  died over the past year since American assistance suddenly vanished-- 760,000 people. Worse, millions more are expected to die in the next 5  years if the current trend continues.\n\nSo it is in that context that this bill is essential.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't understand how much $1,000 a month is to the people  I represent. Guess what. It is a lot. For most hardworking people, this  is a catastrophic amount of money that suddenly needs to be added to a  monthly budget. It is more than what a lot of people earn during a week  of work.\n\nRepublicans have known that this crisis was coming for some time.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and people with disabilities on Medicare.\n\nThis healthcare package had bipartisan support and was included in an  omnibus appropriation bill last year or a year ago and was suddenly  yanked by Republicans because of a tweet by Elon Musk when he was in  the President's graces. I am glad to see it will finally pass as part  of the Consolidated Appropriations…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699331/consolidated-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President says he will only send out SNAP benefits when the government  reopens. When it comes to feeding 42 million Americans, our most  vulnerable neighbors and friends, suddenly the Trump administration  appears confused and, once again, in disarray.\n\nWho in the world is in charge? But it has no problem remodeling the  White House bathrooms with marble…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…don't want to go back to  the ``Farmers' Almanac'' in order to make key business decisions.\n\nWe see hundreds of millions of dollars in water supply infrastructure  projects suddenly in limbo because of DOGE, while our colleagues across  the aisle say nothing.\n\nWe see the entire rural healthcare safety net, including nursing home  care, including services…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…here.\n\nIn Memphis, one of our great leaders in the State of Tennessee, in  the United States of America, and the world, in fact, was Frederick W.  Smith, Jr.\n\nFred Smith died suddenly this past weekend. He was 80 years old.\n\nFred Smith started a business called FedEx, the largest air cargo  system in the world. He started it with an idea that he came up…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…majority, directly or in our several conversations  with the Parliamentarian, was this score disputed.  The majority did express concern about EPA prevailing in litigation and  suddenly having nearly $20 billion back and, for this reason, pushed to  repeal the language. But the fact of the matter is, section 60002 only  rescinded EPA's administrative dollars…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…undermining the will of Congress. This is really  unprecedented. It has never happened--Republican President, Democratic  President--including Donald Trump's first term, where he suddenly said:  I am going to turn off the spigot of support to local law enforcement  agencies because I don't agree with your policies.\n\nI think that is a threat to the independence…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, the ACA polls at 65 percent. Donald Trump  is at 37 percent.\n\nPressley).\n\nMr. Speaker, I don't have enough time to rebut all the absurd claims  made by the other side. Suddenly, they all have an opinion on  healthcare. They had a decade to come up with a plan, and they came up  with nothing.\n\nI am glad they finally acknowledged that this is a dirty…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…age of 26.\n\nWhat was the result? It worked. For 15 years, it worked.\n\nWe achieved the lowest number of uninsured Americans in our country's  history. Millions more Americans suddenly had the peace of mind of  having quality healthcare.\n\nBut faced with high costs, from expensive medications to specialty  treatment, too many hard-working families  are struggling…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…problem voting to give the  Pentagon $8 billion more than it even asked for without so much as a  shrug.\n\nWhen it comes to working people, when they need affordable  healthcare, suddenly the story changes. Suddenly, there is hand- wringing. Suddenly, there is paralysis. Suddenly, the money is gone.  Suddenly, America can't pay for it.\n\nIf my friends on the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and they went and worked and became  terrorists.\n\nWhere do you think the tens of thousands of Venezuelan soldiers and  desperate civilians will turn when their livelihood suddenly  disappears? It may be the drug cartels. In its hubris, Washington may  very well empower the cartels and make the drug problem in our  hemisphere worse. Certainly, any war…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…cost down?\n\nMost of the time when people go to the hospital, they never know what  the cost is for anything. They have no idea because ``insurance'' is  covering that until, suddenly, they don't, and then it becomes a big  issue. That should be something we can all agree on as greater  flexibility and greater options on plans do nothing but help people.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…simple truths to share and so little time to do it  because I want everybody to have a break here.\n\nI just want to say this. It is really nice to hear Democratic  colleagues suddenly take an interest in working Americans again. Did  you pick up on that theme today?\n\nLet's be clear: Working Americans stopped trusting Democrats a long  time ago. That is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…California rule because it is at least as strong as the  national, other States could do it. So in the next few months, from  2022 and 2023, 11 other States adopt this rule. Suddenly, this is not a  single-State issue; this is a national issue. In fact, it would now  affect 40 percent of all the vehicles sold in America. This just  shifted. This is not…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it, and you take that much to market.\n\nWe have one analyst who is saying we will see a pop in U.S. interest  rates, maybe on the 10 year, hitting five, just, boom. Because suddenly  we are grabbing so much of the world's capital to finance what we have  been borrowing internally and now we have to pay it back.\n\nBe prepared. These aren't surprises. We…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…looking at,  if it doesn't include that as the core engine, we are not getting  anywhere.\n\nMr. BURLISON. Absolutely. I mean, when you give the choice back to  the people, suddenly the doctors are going to start paying attention,  as well.\n\nMr. BURLISON. They are going to--when people ask, what does this  cost? They are going to have to answer for it…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…say it, but we are seeing it happen.\n\nThis is among Americans in our country. These are our neighbors.  These are people right here in every town who somehow think that,  suddenly, it is okay. Now, there unfortunately has been a death.\n\nThe death that happened recently is so tragic and unfortunate. Ms.  Good, who lost her life, she could have protested…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…have all kinds of rules, rules of the  road, et cetera. Just because not everybody stops at a stop sign or not  everybody stops at a red light doesn't mean that we should suddenly  change the law and say people don't have to stop. That is the  circumstance that I think that we are in currently.\n\nMr. GRIFFITH. Mr. Speaker, may I inquire as to how much…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, over the weekend, we  marked a solemn day: Pearl Harbor Remembrance Day.\n\nOn December 7, 1941, our great Nation was suddenly attacked by the  Imperial Japanese Navy, killing more than 2,400 American servicemembers  and civilians and propelling us into World War II.\n\nOn the 84th anniversary of the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698053/pearl-harbor-remembrance-day"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…deployment. This customer       approached me in church with her head down, saying that she       was having a tough time with things. Some expenses surprised       her, and she was suddenly out of money for the month. She was       okay, as she had groceries, gas, and her bills paid, until       she got a flat tire on the way to a school function. She got…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…and other critical priorities for federally recognized Tribes  in the fiscal year 2026 Interior appropriations bill.\n\nIf the Tribal population eligible for these services suddenly grows  by tens of thousands of people, many of whom have no native ancestry,  resources will be spread too thin, and the Tribes with established  rights will suffer.\n\nThat…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…COVID crisis. People can't  get in to see their doctor right now, so we will allow them to call in,  and there will be this medicine mailed to them.\n\nSo for the first time, suddenly mifepristone, which actually causes  an abortion for a woman--that drug is now being mailed without ever  seeing a doctor.\n\nNow, some folks have alleged ``Oh, that is no big…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we are serious about taking on our debt  and deficit.\n\nMr. Speaker, have you ever heard the term ``bond vigilantes''? It  happened to the United States in the 1990s where, suddenly, we were  making the bond markets cranky. They were starting to demand premiums.  Our debt was a fraction of a fraction of a fraction of what it is  today.\n\nWe are on the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…President Clinton acted in Kosovo. President Obama acted in Libya.  President Biden even ordered strikes against terrorist leaders. In none  of those cases did Democrats suddenly discover a constitutional crisis.\n\nThe War Powers Resolution recognizes that the President may act first  and notify Congress afterwards. There is no legal requirement that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Republicans voted against, it is a stretch on germaneness,  although it was ruled germane. I do find it incredibly interesting that  our colleagues on the other side of the aisle suddenly want to force  this issue because it is politically expedient, even though they did  not release any of it when they were in charge.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]