[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…not  learned that cowering before this man only works until he decides you  are expendable?\n\nIt may be easy to look away when people are without welfare status,  when they suffer, or when people you don't like are targeted, fired, or  erased. It may be easy when the victims live in places like Cleveland,  Chicago, or Washington, but be clear: It never…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…United States of America,  I have got a punishment here in my hand, if you are convicted under 18  U.S.C. Section 871 of threatening the President of the United States,  you can suffer consequences including up to 5 years in a Federal  prison, fines of $250,000, a permanent felony record, possible  restrictions on future employment, firearm ownership, and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…when you protest and you ``get in the way,'' as the  Honorable John Lewis put it--when you protest and you get in the way,  there will be consequences. You must be prepared to suffer the  consequences when you get in the way, when you protest. You must. You  don't have to like the consequences, but you have to be prepared to  suffer the consequences when…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…folks to make those  decisions that have to be made right now about getting that community  back on its feet.\n\nEvery single one of us is horrified when the people we represent  suffer the result of a wild and catastrophic weather event. The loss of  life is horrifying. The destruction to the well-being of the community  is inconsolable. But we can help by…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…impacts from exposure to pollution and other environmental       challenges. So in my district the Ironbound section of       Newark, 25 percent of children living there suffer from       asthma. That is three times the state average.\n\nAnd it isn't just their health that suffers. When we talk       about environmental justice, we are talking about…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…done as much as we should to  tackle these issues that they face.\n\nThis bill requires the collection and analysis of critical data on  attacks on officers, injuries that they suffer, their mental health  challenges, and wellness program effectiveness. Without accurate data,  we are fighting blind.\n\nBy identifying trends, such as the frequency of attacks…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…students and families will be second.\n\nIf confirmed as Secretary of Education, the quality of our American  education will certainly decline, and our children will ultimately  suffer the consequences.\n\nI would urge my colleagues to vote no on Mrs. McMahon's nomination.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…assistance and healthcare away from those  who need it the most to give tax breaks to those who need them the  least.\n\nTry to spin it any way you want. Everyday Americans will suffer.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691426/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…standards will result in the release of  1.6 billion metric tons of pollutants into the air. That pollution will  imperil our children, our seniors, and the tens of millions who suffer  with respiratory illness like asthma and COPD.\n\nAs if the harm to our health and environment isn't enough, the GOP  proposals in each of these three measures will cost American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…100 times. But now, as a result of the Trump EPA and Senate  Republicans' abuse of the CRA, the people of California will be forced  to breathe more toxic air pollution and suffer increasingly devastating  impacts of climate change.\n\nTo hold the Agency's leadership accountable for their actions, I am  reaffirming my objection to proceeding to the four…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…McCLELLAN. Mr. Speaker, I rise today to commemorate National  Rural Health Day and National Rural Health Month.\n\nDue to a lack of infrastructure and support, rural communities suffer  from the worst health outcomes nationwide. Pharmacy deserts, maternal  health deserts, mental health deserts, worker shortages, and more limit  people's access to care, sometimes…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…WALKINSHAW. Mr. Speaker, I rise today to ask that my colleagues  join me in recognizing October as National Spine Health Awareness  Month.\n\nIn the U.S., 100 million people suffer from neck or back conditions  every year according to the CDC. Back pain is the number one cause of  missed workdays, the leading cause of job-related disability and pain…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…even when the person that the member of the constabulary is  approaching is disrespectful? That is our job. We are to be respectful,  notwithstanding the disrespect we have to suffer.\n\nI was a judge. I remember having a man come before me in court and  said some very unkind things with profanity. I could have held him in  contempt. All I had to do was say:…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Instead, AHA would take us back to the time that behavioral health is  tucked away in another agency and deprioritized. When the agency is  gutted, the programs and the mission suffer. Ultimately, the  individuals we are trying to help with their mental health and  substance use struggles will simply not get the support they need.  People will die.\n\nI beg…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…repeatedly, and cannot prevent new  images from being created. The consequences can be profound.\n\nVictims may endure threats to their employment, education, or  reputation or suffer additional criminal activity, such as extortion  and stalking. Many experience depression, anxiety, and fear of being in  public, and in the worst cases, victims have been…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…safety. Mr. Speaker, I have seen what  happens when you hesitate, when you retreat, and when you take your  foot off the gas. People die. Families are destroyed, and communities  suffer.\n\nThis resolution does nothing to promote peace. It invites danger,  continued chaos, and the loss of more American lives--more American  lives.\n\nIt tells terrorists and cartels…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…never about  healthcare. It was always about appeasing a far-left radical base.\n\nChuck Schumer said: Every day gets better for us.\n\nKatherine Clark said: Of course, people will suffer. We want to use  this as leverage.\n\nIt is an embarrassment to this country. You should all be ashamed of  yourselves for inflicting this pain on the American people, taking…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…actually brought in Newsom's labor  secretary, Julie Su, to try to do the same thing, targeting independent  contractors on a national level. They are the folks who will perhaps  suffer the most if these tax credits expire because they rely on that  individual market, and they don't really have any other option. They  will be forced to pay thousands and thousands…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…majority proposal for the appropriations bill.  If the majority does not like other spending measures, it can propose  to cut them, but Jews and Jewish institutions should not suffer because  of other priorities of the Republican majority and their appropriations  bill.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…services suddenly grows  by tens of thousands of people, many of whom have no native ancestry,  resources will be spread too thin, and the Tribes with established  rights will suffer.\n\nThat is the crux of the issue. If the Lumbee had a case that could  withstand the scrutiny of the OFA process, they would go through the  OFA process as set out by law. But…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…general debate on the floor later today.\n\nApparently, the only thing Democrats can agree on is that the  government needs to stay shut down and that the American people need to  suffer even more than they have already made them suffer.\n\nWe heard from Democrats repeatedly about the millions of people they  believe are going to be affected when their own temporary…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…percent of the $4.1 trillion this  country spends each year on healthcare goes toward chronic disease.  This is not surprising when you realize that 60 percent of Americans  suffer from some form of chronic disease, whether it be heart disease,  diabetes, or cancer.\n\nSo many Americans would benefit from having healthcare coverage that  is not only more…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…providers, and launching  pilot programs to bring these therapies from the lab into real world  care settings. Again, we can't wait 5 or 10 years while veterans  continue to suffer.\n\nEvery day we delay is a day someone loses hope or their life.\n\nIf there is a treatment that works, we have a responsibility to be  ready to deliver it. This isn't about politics.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Democratic whip made it very clear  during a recent interview--and I will quote her. She said:\n\nShutdowns are terrible, and of course there will be       families that are going to suffer. . . . But it is one of the       few leverage times we have.\n\nSo to the American people, realize that the Democrats you have  elected see you as pawns and leverage and pieces…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…years.''  It is just a 5-year extension to a bill that everybody agrees with.\n\nThese patriotic Alaska Native Vietnam vets deserve their allotments,  and they shouldn't have to suffer because of Secretary Haaland's delay  tactics.\n\nSo this bill has already passed the House. This bill passed the  Senate unanimously in December, and I am really hoping that…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Shandra's death was a preventable tragedy, and we will honor her  memory by strengthening guidelines and improving education for these  medical products, so no other family has to suffer through this again.\n\nMr. Speaker, I encourage my colleagues to support this bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692767/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…bizarre part is no one is quite  sure why, until one of their leaders said the quiet part out loud. The  House Democratic whip acknowledged that Democrats are allowing people  to suffer because of the shutdown but said:\n\nThere will be families that are going to suffer . . . but       it is one of the few leverage times that we have.\n\nThis is the second highest…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…access to mental health support helps ensure pilots receive  the care they need without fear of professional repercussions.\n\nWe cannot allow these essential professionals to suffer in silence.  Instead, let's create a system that supports their well-being and keeps  our skies safe.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…information in this file are  ``embarrassment, reputational harm, or political sensitivity.''\n\nI would just submit that if you were going to be embarrassed, if you  were going to suffer social harm, and that is all the encompassed  activity that you were a part of, you will be named in this petition.\n\nI resent that. Innocent people should not be harmed when…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…servicemembers who are capable of high  performance under extreme operational stress, yet we face a readiness  crisis. Suicide rates remain high. One in four servicemembers suffer  from PTSD, and over 40 percent meet the criteria for alcohol use  disorder.\n\nMeanwhile, access to mental health support remains limited,  especially in key military regions.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}]