[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…the  American people of a shared tradition:\n\n``Never to be indifferent toward despair. . . . never to turn away  from helplessness. . . . never to ignore or spurn those who suffer  untended in a land that is bursting with abundance.''\n\nIndeed, Medicaid saves lives and is a pillar of health, security, and  justice for tens of millions of Americans.\n\nPeople…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…many, not all the  outlets--not all of them, but a good many of these major outlets have  decided that they will determine when a problem that African Americans  are having to suffer--they will determine when it is worthy of being  televised, worthy of when it should be challenged, when the problem  itself should be taken on, and they will decide who is…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Israel has  done nothing that would warrant Hamas to take babies as hostages. Then,  for those babies to be returned in caskets, it is heartbreaking.\n\nThose parents had to suffer immeasurable heartache as a result of  what happened to their children. Those babies were young babies,  infants.\n\nHamas is not--is not--an organization that seeks peace. If…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…who bought  this debt at 20 cents on the dollar but may get paid $1 on the dollar  or is this just flat-out enrichment? They didn't lose. They are winning  as other people suffer. So is this really a bailout or just a flat-out  ``Hey, fellas. Here is $40 billion. I love you, Donald Trump''?\n\nMr. WELCH. Well, I appreciate that.\n\nI yield to the Senator.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…and  trail maintenance. They also protected people during snow season in  snow parks. These are year-round, family-sustaining jobs, and these are  people without whom we all suffer.\n\nThere is another worker from my district who was fired who was  actually working on harvesting timber. That timber is then sold and  actually makes money for the Federal…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…more than $1,000, which she simply cannot afford. She  is in her sixties and will be left with no health insurance.\n\nIt is not just those eligible for the tax credits who will suffer.  That is because when people lose coverage, they don't stop getting  sick. They delay preventative care. They skip prescriptions. They end  up in emergency rooms. Emergency…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, budgets are a statement of values. Republicans  are showing they have none.\n\nPeople will suffer. People will die. It will be at the hands of  Republicans who vote ``yes.''\n\nThe top 1 percent are salivating over getting an extra $300,000 a  year because of this dangerous…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693181/one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the Crime and Federal  Government Surveillance Subcommittee on Committee on the Judiciary. To  be forced into a human-trafficking network, like the Epstein network,  is to suffer a double trauma. There is the original trauma of the  exploitation and the abuse, and then there is the added trauma of being  stigmatized yourself as being a criminal: a prostitute…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…standards will result in the release of  1.6 billion metric tons of pollutants into the air. That pollution will  imperil our children, our seniors, and the tens of millions who suffer  with respiratory illness like asthma and COPD.\n\nAs if the harm to our health and environment isn't enough, the GOP  proposals in each of these three measures will cost American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Honorable John Lewis, who was a Member of this House, a  colleague, said: No, we march.\n\nThey did march. They marched, knowing there would be harm that they  would have to suffer. They knew this. They saw the constabulary as they  approached the crest of the Edmund Pettus Bridge. They knew what was  going to happen, but they marched on.\n\nIf they could…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, in just 1 short year, our constituents have  already begun to suffer the consequences of the Trump administration's  agenda to undo lifesaving environmental protections.\n\nThe latest rollback is expected to target key parts of the EPA's 2015…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699294/consequences-of-delaying-coal-ash-cleanup"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…learned  that science became very much focused upon during the whole COVID  crisis. They don't care about making STEM more inclusive, and they  certainly don't care if Americans suffer as a result.\n\nThis isn't just wrong, it is a blatant attack on scientific  integrity. Integrity in research is essential, essential to scientific  excellence and to maintaining…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…smart. I am not here because of brilliancy or good looks. I am  here because people made great sacrifices. It was incivility, and it  was disruption, but they were prepared to suffer the consequences.\n\nWe are going to have to resort to the same tactics that we used in  the sixties, but we did it for a worthy and noble cause. Calling the  people of Congress…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Instead, AHA would take us back to the time that behavioral health is  tucked away in another agency and deprioritized. When the agency is  gutted, the programs and the mission suffer. Ultimately, the  individuals we are trying to help with their mental health and  substance use struggles will simply not get the support they need.  People will die.\n\nI beg…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health coverage. And if Isaiah loses Medicaid, he will no longer be  able to afford his insulin and other medications. He may face a  diabetic complication or coma or even suffer a stroke. What will that  mean to his 12-year-old son?\n\nIt is unconscionable to think that the other party would pull the  plug on lifesaving health coverage and deny food…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…make much money, and then  you withhold their pay. Those are the people that are working paycheck  to paycheck. Let them out of our political dysfunction. Don't make them  suffer for our political misfunction and dysfunction.\n\nI want to also thank any Democrat who will listen and be  compassionate towards your Federal workers in your districts.\n\nThis…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…never about  healthcare. It was always about appeasing a far-left radical base.\n\nChuck Schumer said: Every day gets better for us.\n\nKatherine Clark said: Of course, people will suffer. We want to use  this as leverage.\n\nIt is an embarrassment to this country. You should all be ashamed of  yourselves for inflicting this pain on the American people, taking…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…majority proposal for the appropriations bill.  If the majority does not like other spending measures, it can propose  to cut them, but Jews and Jewish institutions should not suffer because  of other priorities of the Republican majority and their appropriations  bill.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…future generations of Inupiat continue to       reside in our communities and have access to essential       services. Without a stable economy, our communities will       suffer, along with our ability to fully engage in and sustain       our Inupiaq cultural traditions, including our vital       subsistence way of life.\n\nThe North Slope of Alaska…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…preventable outcomes. Governor  Hochul and Democrats have doubled down on procriminal policies that put  violent offenders back on our streets, leaving families and communities  to suffer the consequences. The American people deserve better. New  Yorkers deserve better. People in Washington, D.C., deserve better, and  President Trump has already stepped in to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…to be voluntary. It  has to be voluntary.\n\nIt is okay to invest in that ESG fund, but it is not okay, Mr.  Speaker, to force someone into that ESG fund who is then going to  suffer for that decision because of a lack of return.\n\nThe gentleman cited one study, and I am actually familiar with the  study. I can show you five studies for every one that is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…biggest hearts I know. He stands up on this floor  every week to ask us to end hunger now because he deeply feels the  pains of hunger that too many young children in America suffer from.\n\nGiven that huge heart, my colleagues can only imagine the love he  poured into Molly. We don't even have to imagine it. We all saw the  love he poured into Molly. He…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…general debate on the floor later today.\n\nApparently, the only thing Democrats can agree on is that the  government needs to stay shut down and that the American people need to  suffer even more than they have already made them suffer.\n\nWe heard from Democrats repeatedly about the millions of people they  believe are going to be affected when their own temporary…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…servicemembers who are capable of high  performance under extreme operational stress, yet we face a readiness  crisis. Suicide rates remain high. One in four servicemembers suffer  from PTSD, and over 40 percent meet the criteria for alcohol use  disorder.\n\nMeanwhile, access to mental health support remains limited,  especially in key military regions.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…actually brought in Newsom's labor  secretary, Julie Su, to try to do the same thing, targeting independent  contractors on a national level. They are the folks who will perhaps  suffer the most if these tax credits expire because they rely on that  individual market, and they don't really have any other option. They  will be forced to pay thousands and thousands…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Shandra's death was a preventable tragedy, and we will honor her  memory by strengthening guidelines and improving education for these  medical products, so no other family has to suffer through this again.\n\nMr. Speaker, I encourage my colleagues to support this bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692767/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…who are left without shelter following  Hurricane Helene, I ask: Should your tax dollars go to housing illegal  aliens, to transporting illegal aliens while you continually suffer?\n\nAgain, I say definitively: Under no circumstances is this  appropriate.\n\nI urge all of my colleagues in Congress to join me in reversing this  perverse incentive structure…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…providers, and launching  pilot programs to bring these therapies from the lab into real world  care settings. Again, we can't wait 5 or 10 years while veterans  continue to suffer.\n\nEvery day we delay is a day someone loses hope or their life.\n\nIf there is a treatment that works, we have a responsibility to be  ready to deliver it. This isn't about politics.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…policy change would actually reduce border  crossings significantly. When we do that, we take away the power that  the cartels have. When the cartels are in power, human beings suffer.  There is no other way to look at it.\n\nCustoms and Border Protection data from earlier this month show that  Southwest border crossings are the lowest they have been in recorded…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Democratic whip made it very clear  during a recent interview--and I will quote her. She said:\n\nShutdowns are terrible, and of course there will be       families that are going to suffer. . . . But it is one of the       few leverage times we have.\n\nSo to the American people, realize that the Democrats you have  elected see you as pawns and leverage and pieces…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]