[{"senator": "Al Green", "party": "Democrat", "sentence": "…my  censure. I accepted it. It doesn't mean that I agreed with it, but I  accepted my censure because I believe that if you protest, you have got  to be prepared to suffer the consequences. I was prepared to suffer the  consequences. I don't agree with them. I believe that when we do things  that contravene the law, things that are not in harmony with…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…and families will be second.\n\nIf confirmed as Secretary of Education, the quality of our American  education will certainly decline, and our children will ultimately  suffer the consequences.\n\nI would urge my colleagues to vote no on Mrs. McMahon's nomination.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…not here because of brilliancy or good looks. I am  here because people made great sacrifices. It was incivility, and it  was disruption, but they were prepared to suffer the consequences.\n\nWe are going to have to resort to the same tactics that we used in  the sixties, but we did it for a worthy and noble cause. Calling the  people of Congress lunatics…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, in just 1 short year, our constituents have  already begun to suffer the consequences of the Trump administration's  agenda to undo lifesaving environmental protections.\n\nThe latest rollback is expected to target key parts of the EPA's 2015  and 2024…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699294/consequences-of-delaying-coal-ash-cleanup"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…I did it intentionally. I said  that when you do things and you do them with intent and if it is a form  of protest in my case then you have got to be prepared to suffer the  consequences. I have been prepared to suffer the consequences. It  doesn't mean that I agree. You don't have to agree with the  consequences you suffer, but you have to be prepared.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…protest and you ``get in the way,'' as the  Honorable John Lewis put it--when you protest and you get in the way,  there will be consequences. You must be prepared to suffer the  consequences when you get in the way, when you protest. You must. You  don't have to like the consequences, but you have to be prepared to  suffer the consequences when you get…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…States of America,  I have got a punishment here in my hand, if you are convicted under 18  U.S.C. Section 871 of threatening the President of the United States,  you can suffer consequences including up to 5 years in a Federal  prison, fines of $250,000, a permanent felony record, possible  restrictions on future employment, firearm ownership, and other…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…And as my colleague from Colorado pointed out, a better  mathematician than I, that is a fractional portion of the American  public.\n\nAnd make no mistake, they would suffer the consequences if they did  vote illegally, these noncitizens. But we do not need a complete  overhaul of our election systems and to strip millions of American  citizens of voting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…outcomes. Governor  Hochul and Democrats have doubled down on procriminal policies that put  violent offenders back on our streets, leaving families and communities  to suffer the consequences. The American people deserve better. New  Yorkers deserve better. People in Washington, D.C., deserve better, and  President Trump has already stepped in to end cashless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…whose car caught fire during the  attack, expressed frustration at the lack of progress for peace,  saying:\n\nThey can't agree on anything, and we are the ones who       suffer the consequences.\n\nAn 18-year-old student said:\n\nPeople are just suffering all the time . . . It's still       very hard to see our country constantly being destroyed.\n\nPresident Trump…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]