[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…future that spearheads responsible innovation and growth.\n\nRemember the predatory mortgages from the financial crisis? Those  were also sold as innovative products without sufficient guardrails.  Instead, they caused millions of people to lose their jobs, their  homes, their savings, reversing and worsening any gains that had been  made in Black and Latino…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…that they have the right to a  high-quality public education, know that it is our responsibility to  make sure that they thrive and are prepared for life and being self- sufficient.\n\nAgain, I thank all of my colleagues for showing up tonight, and I  will continue to fight not only for these children and these families,  but for all of the educators…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Congress and last, I have been particularly  outspoken about the risks of retail investors investing in private  securities. Amongst other things, private securities lack sufficient  transparency, have longer lock-up periods, and are much more volatile  and less liquid than their public counterparts. It is critical that  anyone who invests in these risky…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…can muster.\n\nOne way we can do that is by ensuring we have the right folks in the  right roles. This legislation seeks to help that at BVA by focusing on  hiring those with sufficient experience to best serve our veterans.\n\nWe can and should look to staff the Board of Veterans' Appeals with  attorneys that have demonstrated expertise in this area, attorneys…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…traumatized and decimated this year, while we  continue to put bills forward that put more work on the backs of those  that are left and ignore the fact that there is not a sufficient  workforce to do any of the work that we have in these bills that keep  coming to the floor. It is lunacy, and we need to get back to reality.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…yearn for an opportunity to rebuild where they live and have  their kids be back in school and to be safe.\n\nThe cease-fire acknowledges that there must be a force that has  sufficient authority to quell Hamas violence. This is the peacekeeping  force that was in the 20-point Presidential plan. If we are going to be  successful, we have to redouble our…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…and to prescribe extreme violence onto the people of Los  Angeles, California, who were exercising their First Amendment right to  free speech. This resolution is in no way sufficient. It is a way to  roll back free speech.\n\nLet's be clear. We do not have a democracy if we erode the right to  free speech. We will not have a democracy if the President of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…``beyond repair,'' and ``a ball of worms'' that  needs to be eliminated. He claimed that there is a ``gigantic fraud  loophole'' where government funds given to NGOs lack sufficient  oversight.\n\nIn March, Elon Musk called Social Security ``the biggest Ponzi scheme  of all time,'' and policy followed his comments.\n\nThen this week he said that: ``If the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692137/which-elon-musk-to-believe"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…(NCUA) announced that it would no longer require federally       insured credit unions with more than $1 billion in assets to       disclose income from overdraft and non-sufficient funds fees,       and NCUA therefore ceased publishing this information for       individual credit unions (withdrawal of the Reporting       Requirements). NCUA stated that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…advantage.\n\nThird, there is no nuclear strategic gain from deploying more  warheads on more delivery vehicles. Our massive, largely invulnerable  nuclear arsenal is more than sufficient for deterrence.\n\nFourth, increasing our strategic forces might incentivize China to  accelerate its nuclear buildup.\n\nLastly, it would cause us to funnel billions more taxpayer…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Joseph is most  passionate about sharing his love for automobiles with students, seeing  them grow more confident as they acquire the knowledge and skills to  become self-sufficient with automotive operation and upkeep.\n\nBy using real-world scenarios and hands-on projects, students gain  practical experience with modern repair technologies, preparing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…then the troops go into war knowing that the civilian  leadership of this country have had the hard debate in view of the  American public and decided that the stakes are sufficient to ask  people to make the ultimate sacrifice.\n\nBut how dare we--how dare we--and I say this as the father of a U.S.  marine: How dare we ask people to make the ultimate…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…approached by a  member of the constabulary in a rather aggressive way--and I am being  kind, because with that aggression was an insufficient amount of  profanity, more than sufficient. It was really insufficient, not  necessary, profanity.\n\nNow, do we expect the constabulary to approach people and in this  process swear at them, or do we expect them to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…week, I asked the Secretary of Defense point blank if he would  provide the video of the boat strikes to every Senator. A simple yes  from Secretary Hegseth would have been sufficient because, frankly,  asking for the tapes is not a crazy request; it is basic oversight-- something Senators are certainly entitled to see. It is part of our  responsibility…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…require  construction inspections for federally funded highways to be conducted  by public employees. Our bill would allow State or local transportation  departments lacking sufficient inspectors to contract privately  employed inspectors temporarily. Our bill ensures public safety by  requiring that all federally funded bridges, tunnels, and roadways are…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…States Code;\n\n(D) estimated recruiting resources and costs for each       fiscal year from 2027 through 2032; and\n\n(E) estimated resources and costs required to achieve       sufficient training capacity for growth in enlisted and       officer corps for each fiscal year from 2027 through 2032;       and\n\n(2) the Commandant may not delegate the briefing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…being       conducted in accordance with generally accepted government       auditing standards. Those standards require that we plan and       perform the audit to obtain sufficient, appropriate evidence       to provide a reasonable basis for our findings and       conclusions based on our audit objectives. We believe that       the evidence obtained…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…therefor is filed with the Commissioner of U.S.       Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(1) to locate the entry; or\n\n(2) to reconstruct the entry if it cannot be located.\n\n(c) Payment of Amounts Owed.--Any amounts owed…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…affidavit or sworn testimony of an       anti-human trafficking service provider or clinician; and\n\n``(ii) may consider any supporting evidence the court       determines is of sufficient credibility and probative value,       including sworn testimony from a law enforcement officer       detailing the role of the movant in coercing other victims of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…plant emissions as  recently as 2020. After the risk and technology review, the EPA  concluded that the pollutant thresholds and emission regulations  already in place were sufficient and protected public health with an  ``ample margin of safety.''\n\nMadam Speaker, under the Clean Air Act, this should have been the end  of it, as the EPA is only required…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…including by testing in real-world       conditions.\n\n3. The stipulation of conditions for retraining or       decommissioning artificial intelligence capabilities.\n\n4. Requiring sufficient post-award monitoring and       evaluation for effectiveness of the artificial intelligence       system in achieving documented mission outcomes, where       appropriate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…workers.\n\nThe reestablishment of the National Coal Council couldn't come at a  better time. It is no secret that our energy demands are rising. If the  demand isn't met with sufficient supply, we risk ceding leadership in  the next-generation economy to China, while raising costs on American  households along the way.\n\nWe are seeing the demand for reliable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…There was always trade, of course--this  is a natural and good privilege of productive surplus economies--but in  a republic, there was also trade between sovereign, self-sufficient  communities. The citizen of the classical republic had no need for  cheap trinkets, fashion, and sweatshops halfway across the globe. He  and his neighbors were the ones…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…regulations and statutes, and  the American people often have no idea that they might be in violation  of something that would come with a penalty that might include jail  time or sufficient fines, and so forth, and they potentially could  become a felon.\n\nThis bill is pretty simple. It just directs the Federal Government  and the executive branch to count the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…by my colleague  Congressman Evans from Colorado.\n\nH.R. 3628 directs State public utility commissions to consider  implementing measures that would ensure utilities retain sufficient,  reliable generation through their integrated resource plans to maintain  the stability and affordability of their electric grids.\n\nOver 35 States utilize resource plans…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…reserve and disclosure requirements to ensure these assets remain  secure and trustworthy.\n\nCritically, this bill prohibits the issuance of algorithmic  stablecoins lacking sufficient collateral, guarding against  destabilizing risks that could ripple through the broader financial  system. Also reinforcing the primacy of the U.S. dollar, this bill  ensures…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the State and shall set aside amounts       as described in subparagraph (A).\n\n``(C) The Secretary, in consultation with the States, shall       develop a process to ensure sufficient and timely review of       comprehensive plans submitted by States under paragraph (1)       and final approval of the wildlife conservation and       restoration program…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697624/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…sterilization, and food deprivation.\n\n(15) Former detainees also confirmed that they were told by       guards that the only way to secure release was to demonstrate       sufficient political loyalty to the PRC Government.\n\n(16) Popular discourse surrounding the ongoing atrocities       in the XUAR and advocacy efforts to assist Uyghurs remains…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…signature of the identifiable       individual (or an authorized person acting on behalf of such       individual);\n\n(ii) an identification of, and information reasonably       sufficient for the covered platform to locate, the intimate       visual depiction of the identifiable individual;\n\n(iii) a brief statement that the identifiable individual       has…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…subparagraph (B).\n\n``(B) Qualifications described.--An applicant for a new       covered funding award shall include in the initial       application a proposal containing sufficient detail and       documentation for the Commission to ascertain that the       applicant possesses the technical, financial, and operational       capabilities, and has a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690153/rural-broadband-protection-act-of-2025"}]