[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Even after last Saturday's strikes, still  no briefing. Not until yesterday did the administration come to  Congress to answer the most basic of questions, and only after  suggesting, it was reported, that they would potentially choke off  further information to the Congress.\n\nThe Constitution demands otherwise. The Founders split the  government's wartime…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "But as it pertains to these bills, I think we need to find a similar  bipartisan approach on the Energy and Natural Resource bills that the  Senator from Alaska is suggesting that we approve by unanimous consent.  I am more than happy and eager to sit down with my colleague and the  chair and ranking member of the committee to put together a larger…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696139/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…nonprofit that       reportedly received funding from Musk. It contributed more       than $35 million to super PACs that spent heavily on       seemingly pro-Harris ads falsely suggesting that her campaign       supported divisive policies.                           Congressional Leadership\n\nThe presidential election was not the only race to attract…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…In the past week, conservative activists have been posting       on social media the names and phone numbers of child care       providers, including in San Diego County, suggesting without       evidence that they are benefiting from public funding but not       actually providing child care.\n\nSeveral local providers say that since then, they have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…know who was sending the  emails. That was until February 14, when he was emailed that he had  been terminated for poor performance, despite there being zero  documentation suggesting lackluster work and glowing appraisals from  his managers.\n\nHe was given no severance or benefits. He was gutted. He had never  been fired from a job before, and he loved…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…unclear what barriers law enforcement faces in  using long-range tasers. I have never received a complaint from law  enforcement in my district, nor have I seen any reports suggesting that  this is a problem. Long-range tasers are already used by law  enforcement--and listen to this--in all 50 States, and in all 50  States, law enforcement pays zero excise…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…producing components that can help  us lead in the world when it comes offshore wind.\n\nSo where is the emergency? I look through the President's declaration  and can see nothing suggesting that the United States was in an energy  emergency. But you declare an emergency for a reason, and the emergency  was declared not because there was an emergency but because…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…insurance.\n\nConsequence two is people who have insurance see their premiums go up  dramatically. Premium notices are coming out from insurance companies  in Virginia, and they are suggesting that premiums this year in  Virginia will go up by at least 20 percent.\n\nWhy does that happen? There are two reasons: The reconciliation bill  that was passed by the Republicans…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…from Chinese manufacturers, as well as content denigrating  U.S. companies. The research pointed it out--and it resulted in tens of  millions of views on Chinese products, suggesting the platform  influenced the user and drove behavior that changed at a massive scale.  That is to say, now, TikTok is being used against us in a trade war.\n\nI am also concerned…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…to go in the wrong direction. For  example, H.R. 2988 will impose unnecessary barriers to considering  things like sea level rise. The supporters are making up some risk,  suggesting that some of these funds may be worse than others. I think  the studies have shown that they are as good or better, in fact, than  others. Meanwhile, the Trump administration…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…economy.\n\nMy question to my Republican colleagues is: Without providing  protections for Community Advantage Small Business Lending Companies in  the text of this bill, are you suggesting we eliminate this crucial  program? Why would you threaten to remove a way for veteran-owned small  businesses to access capital? What is your message to American  entrepreneurs…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…moment: Maybe,  just maybe, the only way they have to feel normal and to silence those  voices is to take a hit on that crack pipe and have 30 seconds of calm.  I am not just suggesting it. It is a horrible way to do it. However, if  you have nothing else, you have no resources, no doctor, no family, and  no one to care for you, you have discovered that,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…time  and resources on communications with lawyers and the Department of  Energy as everyone tries to figure out how to move forward.\n\nMy colleagues on the other side are suggesting they are cutting red  tape, but it seems to me they are creating more red tape with this  resolution. Absolutely no one opposed the Department of Energy's final  rule on…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…as those in uniform. They are left to care for  that servicemember when their time is done, and they do so willingly  and with courage.\n\nMr. Speaker, to denigrate them by suggesting the system of veterans'  benefits is overgenerous is grossly insulting to me, and I am sure to  Americans, as well. If anything, we know there are still a great deal  of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…caught in the doorway  while the insurrectionists beat him with all of their weapons that they  brought back that day.\n\nNo, it is not a fund for them that President Trump is suggesting. He  wants a fund for the rioters. He wants a fund for the families of the  insurrectionists.\n\nAs Sergeant Gonell said recently, it seems like he believes that the  rioters…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…fact, all of our free-trade agreements  provide exceptions for when parties can remove economic benefits,  including on national security grounds.\n\nI don't recall anyone suggesting that the Biden administration could  not impose sanctions on Nicaragua last year because it was a CAFTA  party. Instead, we recognized that legitimate national security…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…this rule. The agency should not be rushing this       process that has the effect of creating a presumption against       oil and gas development in the NPR-A. RDC is not suggesting       environmental standards and protections should be reduced for       the Special Areas designated within the NPR-A. However, this       is a major change to the long…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Chicken Little: ``The sky is falling.'' I heard the Senator from  Rhode Island suggest that we are trying to privatize Social Security.  There is no one--absolutely no one--suggesting that. This is what is  called a straw man. You erect a phony argument, and you knock it down,  and you claim victory.\n\nThe truth is, Mr. Musk and the Department of Government…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…false or no records to       verify their identities and incomes.\n\nOf GAO's 24 applications, 23 were approved. Eighteen       enrollees were still covered as of September, suggesting that       the exchange and insurers didn't verify information even       after enrollment. The subsidies paid to insurance companies       for those 18 applicants totalled…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…instead, what we are hearing is some pretty  aggressive rhetoric from the Trump administration and some members of  Congress. There are statements that we are seeing that are suggesting  that not only is a taking by force or coercion or other related method  not only an option but perhaps a priority. And that, as a priority for  the United States to take…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…institution, and the broader financial system  only underscores the need to stop this price control before it is too  late.\n\nThe CFPB also creates a false narrative of choice by suggesting that  banks and credit unions can either offer an overdraft service at this  federally mandated price fixed cost of $5 or comply with extending that  as credit and, therefore,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…by the previous administration.\n\nThe previous administration blocked their ability to select and  receive their lands. To hear my colleagues, Mr. Speaker, in this  Chamber suggesting that somehow Republicans are standing in the way of  Vietnam-era veteran land conveyances in my home State is ludicrous. It  is simply not true.\n\nIn fact, my bill extends…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…system that addresses fraud       risks.  The Federal Marketplace Approved Subsidized Coverage for Nearly All of     Our Fictitious Applicants in Plan Years 2024 and 2025, Suggesting                             Weaknesses Persist\n\nOur covert testing of enrollment controls in the federal       Marketplace suggests weaknesses have persisted since our…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…system that addresses fraud       risks.  The Federal Marketplace Approved Subsidized Coverage for Nearly All of     Our Fictitious Applicants in Plan Years 2024 and 2025, Suggesting                             Weaknesses Persist\n\nOur convert testing of enrollment controls in the federal       Marketplace suggests weaknesses have persisted since our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…nominees the Senate has confirmed so far  been confirmed with Democrat support? Why are Trump nominees emerging  from committee with bipartisan support? Is the Democrat leader  suggesting that his own Members are supporting historically bad  nominees?\n\nOn Monday, the Senate Judiciary Committee chairman came down to the  floor and asked for unanimous consent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}]