[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…classified documents therein will  not be released and documents that might relate to an ongoing  investigation which President Trump authorized going after Bill  Clinton, Larry Summers, and others on the Democratic side which are  false and improper investigations where Ms. Bondi said there was  nothing there, will not allow for material to be disclosed.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…need. We have  taken away protections for clean energy to change the rate of growth of  global warming that affects our planet and affects our future with  hotter and hotter summers, flash floods, fires and disasters. It will  increase our reliance on fossil fuels, which make the air dirtier and  people sicker, all while we are taking away people's health…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…read ``E.P.A. to Stop  Considering Lives Saved When Setting Rules on Air Pollution.'' It  sounds like parody but, sadly, these destructive efforts are real. All  of this while summers grow hotter, some winters grow colder, wildfires  rage, hurricanes intensify, and insurance markets collapse. The  President calls this energy dominance, but dominance over…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…this  parish, with Father Andrew George, Father Nicholas Lanzourakis, Charlie  Samaras, Denise Panichas, and other proud parishioners, celebrated a  touchstone of Rhode Island summers, the Church's 39th annual Cranston  Greek Festival. Thank you for all that you have done for the Cranston  community and the State of Rhode Island.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…know if you have ever been to Washington State.  If you have, you will know that outdoor recreation is our pride and joy  and is what sustains us. Those beautiful springs and summers, that is  what sustains us when we have the rainy fall and winter.\n\nWe have already seen some of these outdoor trail accesses closed. In  fact, there is one called the Denny…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, Arizona has suffered year after year after  year of record-breaking temperatures. Our summers are getting hotter,  lasting longer, and providing little relief at night. This heat is  incredibly dangerous for our health and for our economy.\n\nLast summer, tragically,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…people.\n\nLynne attended St. Catherine of Siena and graduated from St. Pascal  Baylon High School. She loved to dance and attended Johnson Dance  Studio during her youth. Her summers were enriched, and she formed  lifelong bonds at Camp Minisink, a camp for African-American youth in  New York City.\n\nLynne met her husband of 47 years, William O. Wagstaff,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…bodies.\n\nWe have taken away protections for clean energy, to change the rate  of growth of global warming that affects our planet and affects our  future with hotter and hotter summers and more and more problems: flash  floods, fires, and disasters.\n\nThis Congress has earned an ``F.'' We do not deserve any more.\n\nI am ashamed to be a part of this Congress,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694052/this-congress-deserves-an-f"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…families across the country: affordability, the escalating  costs of the overheating climate, what that is doing, higher insurance  costs, and higher electric bills because their summers are longer and  more intense. Back in the Tampa Bay area, we are trying to rebuild from  the most devastating hurricane season that we have ever experienced.\n\nThe changing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…never want to hear the Republicans lecture  about fiscal responsibility again. The last President to actually  balance this budget was Bill Clinton. Today, Bob Rubin and Larry  Summers wrote an op-ed in The New York Times that every American should  read.\n\nTheir budget will take the deficit up to 8 percent of GDP. It is  historically unprecedented in the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693228/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…found the Congressional  Lowering Utility Bills Caucus, to push real, practical solutions that  put consumers first.\n\nUpstate New York knows extreme weather--long winters, hot summers-- but weather alone doesn't explain why utility bills have become  unmanageable. Families in my district are projected to pay hundreds  more each year, even when usage stays…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…compelling force  for change.\n\nAward-winning filmmaker, screenwriter, and producer Ava DuVernay grew  up in the communities of Lynwood and Compton, in California, and spent  her summers visiting her father's home state of Alabama. It was in  Alabama that DuVernay found her passion for film through cherished time  spent with her aunt, Denise Sexton.\n\nSetting…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…husband to his wife Diane, and an incredible father to their four sons,  John, David, Michael, and Andrew. In retirement, John will continue to  serve his community, enjoy his summers at the beach, and complete his  10th Boston Marathon.\n\nI want to extend my sincere congratulations to John for his  distinguished career and significant contributions to John…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "John Thune", "party": "Republican", "sentence": "…years to  come.\n\nStrong small businesses mean a strong America. I will always be  grateful for the lessons I learned getting my start working in small  businesses. During the summers, my parents, who were educators, ran a  motel in my hometown of Murdo, and as is common in a lot of small  businesses, the whole family helped out.\n\nLater on, my first job…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…infamously predicted Armageddon for  America--fear-mongering, plain and simple. The Tax Cuts and Jobs Act  led to historic growth and economic gains in this country.\n\nLarry Summers, a well-known Democrat, described progrowth forecasts  as ``tooth fairies'' and predicted a long recession. That is fear- mongering. We got the opposite, a historic economic…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…75-year anniversary.  Hebard Insurance Solutions is a family-owned, independent insurance  agency in Loomis, California, a town located in Placer County.\n\nChristine Hebard-Summers, who began working for the family business  at an early age, is the third-generation owner. Her grandfather, Roy,  started the business back in 1950. Roy would take Christine…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…investigation in any way. That is a great thing because that  investigation is yielding results.\n\nWe now know that one of Jeffrey Epstein's closest confidantes was  apparently Larry Summers, a Cabinet member in the Clinton  administration. We now know that a Democrat Member in this body, Stacey  Plaskett, was colluding with Jeffrey Epstein in real time during…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…FOX NEWS; Sudworth, John: BBC; Sugg, Anna: NEXSTAR       MEDIA GROUP; Suh, Stefan: WASHINGTON EXAMINER; Suite, Joseph:       NBC NEWS; Sullivan, Keely: FRANCE 2 TELEVISION; Summers,       Patrick: FOX NEWS; Summers Markland, Juana: NATIONAL PUBLIC       RADIO (NPR); Sumpolec, Zachary: NBC NEWS; Sundbom, Per:       SWEDISH BROADCASTING; Sung, Joy: WASHINGTONPOST.COM;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]