[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…in their  facilities. Mr. Speaker, three people have died in just the last 6  weeks at a privately run tent camp in El Paso.\n\nFossil fuel and mining companies pour enormous sums into elections to  block climate action while communities like mine in Arizona face record  heat, drought, and wildfires and continue to deal with the devastating  impact to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…continue it?  I refuse to change my position. I stand now where I stood then.\n\nIt goes on to indicate: setting in motion $536 billion in cuts to  Medicaid. Mr. Speaker, that sums it up.\n\nI stand now where I stood then. I am a liberated Democrat, unbought,  unbossed, unafraid, censured, not silenced. I stand for the people I  have been faithful to in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and the economic stability of the Nation. The act does  not offer anyone, either individually or collectively, an easy life,  nor was it ever intended so to do. None of the sums of money paid out  to individuals in assistance or in insurance will spell anything  approaching abundance. But they will furnish that minimum necessity to  keep a foothold,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…greater danger, and our families at  greater risk of retaliation.\n\nHe does not care that this campaign is draining military resources,  hurting its readiness, and wasting untold sums of taxpayer money.\n\nHe probably isn't aware of the second- and third-order security  consequences of his decisions. He probably doesn't even know that  already, because of his…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in       2100, followed by damages in non-use values amounting to . .       . $224 billion, and non-market use values adding up to $182       billion in annual losses. That sums to over $2 trillion a  year, and it is for sure an undercount.\n\nAgain, there is a lot here that is not yet included in ocean social  cost of carbon calculations, damages that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and at the rotten root of  it all is the influence of big money in politics. That is because  Citizens United opened the door for corporations and billionaires to  dump untold sums of money on to our elections anonymously and calling  corporations people.\n\nMr. Speaker, corporations are not people. The American people are  whom we represent. It is not the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…United unleashed.\n\nSince 2010, more than $10 billion in corporate and dark money has  saturated every aspect of our politics. Super-PACs and dark money  groups now spend vast sums to influence, and sometimes determine,  election outcomes while shielding their donors from public scrutiny.  Compounding the problem, the Federal Election Commission has too…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Sullivan. He was sextorted by two men claiming to be a woman on  Instagram. They threatened Jack. They told him they would post intimate  images of him unless he paid huge sums of money. He paid and he paid.  When he could no longer pay their demands, Jack took his own life. We  must do better for Jack and every other victim of these crimes.\n\nAs a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…ads  for the latest wonder drug--$6 billion.\n\nWhy? Why would they spend all this money to advertise drugs and say,  Talk it over with your doctor? They spend such astronomical sums to  promote their drugs because it increases their profit margins.\n\nBig Pharma thinks if they hit you hard enough and often enough with  ads on television, not only will you…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Since Citizens United, we have watched a parallel political system  take shape, one dominated by super-PACs and dark money organizations  that can raise and spend unlimited sums and operate with fewer rules,  less transparency, and the ability to determine election outcomes long  before voters cast a ballot. A small number of wealthy donors now wield…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…poised to gut Medicaid and threaten healthcare for one in four Rhode  Islanders.\n\nI recently met with Pranoy. He said simply: ``I am only getting  started.'' That sentence sums it up. It is what keeps his family and  myself up at night. These Republican Medicaid cuts would hinder  Pranoy's potential.\n\nI am standing here today because I stand with Pranoy.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691367/i-stand-with-the-disability-community"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…always narrow. It always was honest about what it was trying to  solve and explainable to the public. It was always consistent with the  law, and it was always involving modest sums--modest by standards of  the national budget.\n\nCertainly, now, this scoring rule that had been proposed by the  Republicans, it was not bipartisan. It was not narrow. It was…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…issues of such concern to the American people.\n\nI want to focus my question on the corruption of the Trump regime.  This corruption is rampant and unending, from making untold sums off  meme coins to the latest outrage, demanding that the Department of  Justice pay him more than $200 million. That is taxpayers' money that  he wants to get his hands on.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696353/trump-administration"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Appropriations Committees, when  they wrote in 2019 to President Trump that ``[w]e supported the budget  deal and did so in good faith. Preventing agencies from obligating such  large sums seems an abdication of this bipartisan agreement, and  Congress thus expressed strong opposition to this precise exercise last  year. Furthermore, the U.S. Government Accountability…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have no choice but to go to the ER because they don't  have a doctor.\n\nPatients will be sicker. Doctors and nurses will be stretched thin.  Hospitals will be left with large sums of uncompensated care, which  will be passed on to everyone with insurance in the form of higher  monthly premiums. This isn't just about the ACA, but it is most  important…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…families.\n\nWhether it is raising funds to send airmen home for the holidays or  educating the Nation on nuclear deterrence, Minot leads with pride and  purpose. Their motto sums it up best: Only the Best Come North.\n\nAgain, congratulations to the city of Minot on this well-earned  recognition, and thanks to this amazing community for standing behind…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690742/minot-north-dakota-named-a-2025-great-american-defense-community"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…methane  emissions, some smaller operators who were once below the waste  emissions threshold are now at risk of seeing their reported methane  emissions inflated and owing large sums under the natural gas tax.\n\nIf not repealed, this rule will arbitrarily increase the costs and  burden of reporting under subpart W, motivated by the Democrats'  interest in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…problem back in 1984, when he  said these famous words, ``We could say they spend money like drunken  sailors, but that would be unfair to drunken sailors,'' which just  about sums it up.\n\nFor somebody like Elon Musk, who is reportedly one of the most  wealthy--maybe, the most wealthy person--on the planet to spend his  time and effort and to assemble…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…our K-12  schools. It is not for their stated purpose of cultural exchanges or  diplomacy, but to push propaganda.\n\nThe Chinese Communist Party, for example, has spent untold sums  across hundreds of schools to indoctrinate or influence thousands of  children. These so-called little red classrooms were sold as  opportunities to teach Chinese language…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…could have gone toward improving access to care for  legal California residents.\n\nThe partial repeal is not a solution. For one thing, it will continue  to cost us enormous sums in State tax dollars. For another, it could  lead to the loss of billions and billions of dollars every year in  Federal funding.\n\nAs I called on the Governor before to repeal…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Conaway.\n\nThe SBA microloan program provides entrepreneurs with access to  small-dollar loans through qualified lenders. Sometimes, entrepreneurs  do not need to access large sums of capital for their operations. That  is where the SBA microloan program can help entrepreneurs get just  enough capital to meet their exact needs.\n\nUnder current law, the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699176/northern-mariana-islands-small-business-access-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…2029''; and\n\n(2) in paragraph (2)--\n\n(A) by striking ``National Oceanic and Atmospheric       Administration'' and inserting ``Secretary of Commerce''; and\n\n(B) by striking ``such sums as may be necessary for the       period of fiscal years 2023 through 2024'' and inserting       ``$470,000 for each of fiscal years 2026 through 2029''.\n\nMr. STAUBER.  3176,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…less than  $2.32 billion. That raises an important question: Why would a country  that certainly doesn't have the best interests of American students in  mind pay such enormous sums to American universities?\n\nThis bill will get to the bottom of it.\n\nThe DETERRENT Act includes language from my own legislation, the No  Contracts With Foreign Adversaries Act,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]