[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…health conditions from dirtier air.\n\nNow, I want to talk about that for a moment because I know there are  many who take for granted our air, just as we take for granted that the  sun will rise or set. While air that we breathe may feel like a given,  we cannot lose sight of the fact, for 135 million people--more than 4  in every 10 Americans--they live in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…normally go to the SEC. But, of  course, there is no regulation.\n\nBidders aren't hiding the pay-for-play scheme either. The winner of  Trump's contest--the grand winner--is Justin Sun, who faces a civil  fraud case from the SEC over allegations of market manipulation and  unregistered asset sales.\n\nSince the election, Justin Sun has poured nearly $100 million…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…several ongoing cases for Trump  donors and Trump's crypto investors.\n\nFor example, the Securities and Exchange Commission recently  suspended its enforcement action against Justin Sun, founder of the  TRON Foundation. The SEC's own complaint detailed how Sun sold  unregistered crypto asset securities, manipulated trading to  artificially inflate the prices…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is, and ever  shall be. By any name, You created air, the breath of life. By any  name, You created water, the elixir of life. By any name, You created  the star that we call Sun, the light and warmth of life. By any name,  You created the terra firma that we call Earth, the foundation and the  home of life. And by any name, I beg that You would understand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…cost of running most fossil coal plants. So it  is no surprise that in 2024, 94 percent of the new energy on the grid  came from renewables, from harnessing the power of the sun and the  wind.\n\nPrioritizing expensive fossil fuels over cheap renewables drives up  the price of energy that families pay on their bills every month. That  is Trumpflation.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…something no other team has done before, and went on to  represent our State in the Little League Senior League Baseball World  Series.\n\nThrough every hard day of practice under the Sun, these young  athletes build character and grow into independent adults.\n\nCongratulations to the Burbank American Little League for their hard  work. I look forward to many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694916/congratulating-burbank-american-little-league"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…particularly  problematic to the neighbors back home I represent in the State of  Florida. The State of Florida, the Sunshine State, you would think  would be powered by the sun, Mr. Speaker, but we are 75 percent reliant  on gas to generate electricity.\n\nNow, Mr. Speaker, you are saying: Okay, Floridians, you are already  being crushed by utility bills,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to us, and we  are about to face energy shortages.\n\nThe reason, for instance, Texas, of all places, has not had blackouts  and brownouts is because solar can absorb wind; the Sun is high. It is  108 degrees, and everybody is pumping their air-conditioners. That also  happens to be the point in time and the point of the day when all of  the solar farms…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…go solo, where no scholar went       before.\n\nAnd at first the chimps would scatter, running fearful       through the trees, But she sat there day and nighttime under       sun and rain and breeze. `Til one ancient male named David       with a beard of silver-gray, Took a nut from Jane's kind       outstretched hand and gently squeezed to say:\n\n``You…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…abandoned airfield deep in the Florida  Everglades.\n\nIt is a place where nearly 1,000 humans are being forced to live in a  tent city in the middle of the hot Florida summer, hot sun, where folks  are not getting enough food. Detainees are exposed to the heat, and  wildlife, and mosquitoes that can potentially carry disease. They are  being stripped of their…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…calls  relating to the homeless population.\n\nThrough the use of this Federal funding, CIRCLE will now expand to  more communities in my district, including North Hollywood and Sun  Valley.\n\nBy meeting people where they are, CIRCLE helps prevent crises from  escalating and connects individuals with the service and long-term  support that they need.\n\nThe…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…who  had signed up to serve and there was no waiting line, and when he comes  home to this country and he wants to vote, he finds out that there is a  waiting line in the hot Sun for hours; he finds out that his vote in  one location, which he figures out, for the primary is different from  where he votes in the general and then is different from where…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…these circumstances.\n\n10. The Child Nutrition Programs, which include the       National School Lunch and Breakfast Programs, Summer Food       Service Program, and Summer EBT (SUN Bucks), provide       critical, nutritionally-balanced meals and food assistance       benefits to millions of children every day. Through the       National School Lunch Program…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…debris, which  is a big problem right now. The technology used includes satellites,  drones, and AI to find the best route to locate debris and the focus of  the power of the Sun's rays to destroy the debris.\n\nI am eager to see what our students continue to do with their company  in the future, and I wish them the best of luck in tackling  sustainability…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the path back to the American Dream.\n\nThis is our vision of economic patriotism and populism, and it is a  winning one. It is one that can resonate from the Rust Belt to the Sun  Belt and everywhere in between in this great country.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…we?\n\nIt reminds me, Mr. Speaker, at the Constitutional Convention in 1787,  Benjamin Franklin famously looked at the chair behind the presiding  officer that was carved with a Sun and he asked a question that still  echoes throughout history: Was the Sun rising or was the Sun setting?\n\nIn that moment, a fledgling Nation hung in the balance, and even the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Award: Firefighter Rob Day       of East Manatee Fire Rescue, Firefighter/Paramedic--Company       Fire Captain Ralph Mascaro of Hillsborough County Fire       Rescue, and the Sun City Center Emergency Squad.\n\nPreservation of Life Award: Firefighter/Paramedic Jacob       Campbell, Fire Captain Clifford Davis, Firefighter/Paramedic       Anna Inman, and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…electricity generation by 2050.\n\nPeople say that is great. Isn't that good? It is good if you don't  care if you can't turn the lights on because the wind is not blowing  and the sun is not shining. We are going to have rolling brownouts and  blackouts because that is what is going to happen, like in California.  Americans in the 21st century are going to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…remarks. I am biased,  of course.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Florida  for his remarks. I feel ready to go out for the second half now, so the  Sun is rising. I wish there was a second half to play.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from the  Commonwealth for his comments.\n\nIt is common among Members…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…3 detachments located  worldwide. It operates 48 aircraft, including multiple variants of the  RC-135 and the EC-130H and EA-37B Compass Call electronic attack  aircraft. The sun truly never sets on the Fightin' Fifty-Fifth.\n\nOver the last 85 years of war and peace, missions and aircraft have  come and gone, and operating locations have changed as the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Harvard University  in 1959.\n\nMr. Murphy went on to serve as the editor and publisher of the San  Francisco Examiner, and then he became the publisher and CEO of The  Baltimore Sun.\n\nThroughout his life and career, Mr. Murphy stayed true to his morals  and strong ethical compass.\n\nMr. Murphy is survived by his wife, Diana; daughters, Karen and  Susan;…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…this: Keep pressing  forward, unrelenting, undeterred, and unapologetic, to advance the  America First agenda.\n\nMy response, Mr. Speaker: Yes, ma'am. Yes, sir, as sure as the Sun  rises, we are just getting started.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…week prior to President Trump starting to sink their boats that  they were bringing to the United States of America, that is as imminent  as it gets. It is as imminent as the Sun rising. That is how prevalent  that threat has been.\n\nThe President is finally bringing it to an end. Nobody fights harder  than the  President of the United States of America.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…wartime and post-military  service. I include in the Record their names:\n\nNelson Betancourt of Valrico who served in the U.S. Army       outside of war time.\n\nBenny Blackshire of Sun City Center who served in the U.S.       Army during the Vietnam War.\n\nJeffery Camp of Parrish who served in the U.S. Army and       Army National Guard during the Iraq and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…D.C., to  deliver results for the people of the Big First District, and that is  what I will continue to do.\n\nThe Big First is home to farmers and ranchers who get up before the  sun and work until the job is done. It is home to small business owners  and families who balance budgets, meet payroll, and expect the same  discipline from the Federal Government.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…have left ratepayers footing the bill  for two grids. One grid props up wind and solar with massive  transmission costs. The other is the backup power we all rely on when  the Sun is not shining and the wind is not blowing.\n\nThis measure puts reliability first. It follows the lead of major  grid operators who know the danger of relying too heavily on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of green energy or clean  energy. I am for all of the above, but if you remember what the  Secretary said, he said he is for the best of the above. There are  areas where the Sun shines and the Sun shines bright, and it shines  bright on my old Kentucky home. There are areas for that. There are  areas where solar makes sense, where wind makes sense,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…interest in the industry.\n\nFollowing his tenure in the Navy, Bruce worked for a newspaper in  Connecticut and later returned to Pennsylvania and worked for the  Williamsport Sun-Gazette as a photographer. In 1973, Bruce accepted a  position as assistant director of public relations at Mansfield State  University and left after 6 years to fully pursue…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…across the aisle will leap to their feet and scream bloody  murder about how the waste we are targeting simply doesn't exist and  how we are laying siege to everything under the Sun.\n\nAu contraire. We have the receipts to back everything up.\n\nHere is just a small sampling of the mind-boggling discretionary  waste that we will be slashing in foreign funding:…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Butler, Joaquin       Galindo, Malaika Hayat, Daniel Johnson, Tessa Leon, Mckenna       Leon, Roshni Nagarakanti, Noureen Nakshbandi, Merissa Richey,       Nicole Spry, Yiyi Sun, Nolan Takeuchi, Rabia Zehra Unver,       Tyler Wang\n\nCA: Benjamin Ahmad, Ashley Ahn, Roshan Ambegaonkar, Iris       An, Betul Zeynep Arat, Lucy Ariunbayar, Sawyer Ashland,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}]