[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…explains to the American  people what is at stake here.\n\nWhat happened in that raid to remove Maduro from office?\n\nMost of the details are an amazing display of military superiority,  which the United States enjoys, but there were other questions that  were raised, too, during the course of this.\n\nIn addition, the question is, Where do we go from here?…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Maintaining American       Superiority by Improving Export Control Transparency Act''.       SEC. 2. LICENSING TRANSPARENCY.\n\nSection 1756 of the Export Control Reform Act of 2018 (50       U.S.C. 4815) is amended…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…our warfighters. We  have earned the nickname ``The Rocket City'' because innovation and  national defense are in our DNA.\n\nSpace Command is charged with ensuring America's superiority in the  most demanding, contested domain of the future. To protect the United  States, we need a headquarters located where talent, research, and  mission readiness intersect.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Control Act                             Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The AIM-260 Joint Advanced Tactical Missile (JATM) is a       GPS-aided air superiority missile with increased range and       effectiveness over existing air-to-air weapons with Precise       Positioning Services provided by Selective Availability Anti-…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…decentralized peer-to-peer digital economy.\n\nFor many years, innovators and investors were forced to operate in a  legal gray zone while agencies jostled for regulatory superiority over  the digital asset ecosystem, leaving blockchain developers to pack up  and move abroad.\n\nThe CLARITY Act fixes this by creating regulatory guardrails tailored  to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Member-driven approach of this process is a  testament to the leadership of my friend and fellow Oklahoman, Chairman\n\nTom Cole.\n\nThis package will strengthen American military superiority and fund  the E-7 Wedgetail program at Tinker Air Force Base. It also ends open- border policies of the Biden era, champions measures to make America  healthier, and allows…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699306/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, today, we are bringing a very  important piece of legislation to the floor, the Maintaining American  Superiority by Improving Export Control Transparency Act, a key piece  of legislation to ensure our country stays ahead of our adversaries.\n\nBusinesses and universities in the United…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…relative to the  original orphan drug. Congress codified these regulations in 2017.\n\nCongress has long recognized that the ``major contribution care''  prong of the ``clinical superiority'' standard is meant to be a high  bar. We did not intend for minor modifications such as changes in  dosing frequency or formulation to erode the exclusivity protections…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…for the Air  Force's F-47 and the Navy's F/A-XX sixth-generation aircraft programs,  as well as 47 additional F-35 aircraft. These investments will  guarantee America's air superiority around the globe.\n\nThe legislation also supports shipbuilding. It supports the  construction of a third Columbia-class ballistic missile submarine and  an additional Virginia-class…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Defense appropriations bill. Chairman Calvert  and his team have, once again, delivered a strong, thoughtful proposal  that makes  strategic investments in American military superiority, strengthens our  southern border, and, most importantly, takes care of our troops and  their families.\n\nI am especially proud that the rule makes in order several of my…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…this defense pact is working as  intended.\n\nBureaucratic delays to the AUKUS agreement undermine our ability to  counter threats and to maintain technological and defense superiority.\n\nI urge my colleagues to support this bill to send a strong message to  our adversaries and friends alike that the United States is serious  about preserving a free and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Navy, our joint force, and our future  combatant commanders need this aircraft.\n\nRelying only on the Air Force's sixth-generation fighter, the F-47,  does not solve our air superiority challenge.\n\nI am a fervent supporter of the F-47 and would have done everything  necessary to ensure that it was built. Unfortunately, some in the  Pentagon think this is…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…judge,'' as we call him back in the freest and  greatest State in the Union, for his leadership.\n\nIn the last week, the world witnessed the might of America's  unparalleled air superiority and what a critical role our strategic  bombers and the men and women who pilot and maintain them play in  keeping our enemies, like Iran, in check.\n\nFor nearly 40 years,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…and military families I represent. Bryan's sharp, strategic  mind was also instrumental in getting my first piece of legislation  signed into law--the Maintaining American Superiority by Improving  Export Control Transparency Act. Whether serving as Legislative  Director, Deputy Chief of Staff, and eventually my Chief of Staff,  Bryan was essential in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…technical correction in an underhanded  effort to close powerplants that provide affordable electricity and  jobs for American workers and help us progress in this race for  superiority in the race to AI. We need more energy, not less; and the  CRA is a deliberate attempt to shut down powerplants in Indiana that  are not popular. They are coal-fired power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…and the Upper Peninsula by winning the Michigan Division 7  State championship, capping off a 14-0 season.\n\nThis wasn't luck. This was discipline, toughness, and outright  superiority.\n\nWhat makes this championship even more special is how the U.P. made  it possible. With just days to prepare for the long trip to Ford Field,  the Maroons suddenly needed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697511/recognizing-menominee-maroons"}]