[{"senator": "Julia Brownley", "party": "Democrat", "sentence": "…these  benefits.\n\nToo often, that wait stretches from months and sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves far too slowly for the urgency of their lives.\n\nAcross our district offices, our caseworkers hear directly from  veterans…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bipartisan  legislation.\n\nFor too many veterans, the transition from military service to  civilian life comes with uncertainty about how to build a new career  and support their families. By expanding in-person and hybrid training  options for skilled trade programs, we are bridging skills gaps across  the country, empowering our veterans, and contributing…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…removal to a country indisputably in       the throes of unrest. It provides access to work       authorization, so that protected individuals can lawfully       work, support their families, pay taxes to the federal and       state government, and contribute to the economy. Most       importantly, it is a status authorized by Congress for       nationals…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…retaliatory  tariffs by other countries hit agriculture and manufactured goods. This  hurts consumers. It hurts businesses. It hurts our port workers and  truck drivers who support their families, thanks to trade with other  countries.\n\nTrump and his billionaire donors won't feel any of it. They don't  feel it when the cost of a can of soup is up a couple of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…french fries.  If you are a parent whose child is dealing with the devastation of  illness, you have heard of Ronald McDonald House. Providing housing,  resources, and support for families with children who are ill or  injured, the nearly hundreds of Ronald McDonald House programs across  the world keep families traveling for their child's medical needs…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…amid these reckless Federal cuts. Governor Maura Healey,  her administration, and local advocates are forming the Anti-Hunger  Task Force to adopt long-term solutions to support families in  Massachusetts and work to finally end hunger now.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694156/impacts-of-the-big-ugly-bill-on-massachusetts"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…we  enjoy in the 4th District. That is why I urge my colleagues to reject  H.J. Res. 142, which would overturn local tax credits designed to  reduce child poverty and support families facing economic hardship.  Congress should never prevent a municipality from using its own locally  raised funds to strengthen their community. Today, I will vote to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699844/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…dependable ways to get information out when  disaster strikes a community. I have witnessed this firsthand. That is  why the Federal Government must do everything it can to support  families in crisis and ensure that they have the resources and  information they need to stay safe. Stripping $1.1 billion from public  broadcasting puts millions of lives at…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…who are able to fill  the gaps.\n\nThis is not efficient at all. This is neglect. This administration  must step in, make changes now, and end the unnecessary reviews.  Support the families instead.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699654/disability-determination-renewals"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…long-overdue debate about how to       address this challenge, which should involve reforms to       remove Medicaid's bias toward institutional care and       increased support for families who take care of their loved       ones at home. Large-scale cuts, however, threaten millions of       seniors with disruption to the care they need.\n\nListen to AARP:…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…little, tiny boots with little, tiny bootstraps so they can  pull themselves up.\n\nThese aren't just budget choices. They are moral ones. They are the  wrong ones. We should support families and the farmers who feed them,  not punish them.\n\nMr. Speaker, I urge my colleagues to reject these cruel cuts and  stand with families and farmers like Shannon and Eugene.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691489/gop-tax-scam-hurts-women-and-families"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…we create a level playing field and that we  pursue policies that create that level playing field, that provide  access to education, and that provide the necessary support for  families who are in need. We can do better.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Madam Speaker, I rise today because the House has a  critical opportunity to support families and small businesses who are  struggling to afford healthcare for 2026.\n\nI am thinking of the parents I have talked to who will drop coverage  for their families because…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…homeowners--homeowners--of the  ability to save money on energy bills, breathe safer air indoors at  home, and ensure a livable future for their families. And it also  removes support for families looking to buy a clean vehicle, an  electric vehicle, and saving money at the pump.\n\nIt imposes draconian restrictions on large-scale solar and wind  incentives.  That…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…stop.\n\nMr. Speaker, these bills reflect what the pro-life movement has  always stood for: dignity, opportunity, and hope. I urge my colleagues  to support the rule, support these families, and stand on the side of  life.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…referral for gender transition  procedures such as gender surgery or medication.\n\nThe Exceptional Family Member Program, otherwise known as EFMP,  should be used fully to support families with special needs and chronic  illnesses, not for gender transition procedures, as has been mentioned.\n\nThe program, as it was intended, specifically lists certain things…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…served  this Nation.\n\nIdaho is home to over 115,000 veterans and 8,700 service members. I  am deeply grateful for the heroes who protect our freedom and am proud  to support our military families and veterans in our great state.\n\nMilitary Appreciation Month can be honored in various ways, such as  through parades, tributes, flying the American flag, or simply…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…those accounts to  watch those grow over time. It is a game changer and something we are  really excited about.\n\nMr. Speaker, we are voting on legislation this week to support  families and pregnant women. We just passed the Supporting Pregnant and  Parenting Women and Families Act, ensuring that young families have  access to prenatal vitamins, formula,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…teams to claim back- to-back state titles--their third in just four years.\n\nTheir success is built not only on talent but also on the dedication  of their coaches, the support of their families, and the spirit of  their communities. I am proud of these young men and honored to  celebrate the Grand Mesa Senior All Stars for the way they represented  the Western…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695294/recognizing-colorado-state-champions-the-grand-mesa-little-league-senior-all-stars"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…for their livelihood, for their hope, for their jobs, for their  benefits in many cases, and for filling their days because they,  obviously, have to work in order to support their families and pursue  their dreams.\n\nWe cannot overstate the importance of small businesses to all of us,  the people we represent. Yet, that often doesn't get reflected in the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Nearly one-half of those  workers live in Iowa. It also contributes over $1.2 billion annually to  the economy of the Quad Cities region. These are good-paying jobs that  support families, grow our communities, and, most importantly, provide  the backbone of our military supply chain.\n\nAs a 24-year Army veteran, I know how vital these arsenals are, not…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…provisions stemmed from legislation that  my team and I have been pushing over the last several months, including  a permanent increase to the child tax credit and additional support for  families in the range of $500. Families are going to get a $2,500 tax  credit with respect to their dependents.\n\nIt also makes the adoption tax credit partially refundable up…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…retirees.\n\nAmericans set aside money in their 401(k)'s and pension plans to  retire with dignity. They do it so that they can pay their bills, cover  medical costs, and support their families. They do not invest their  hard-earned savings so that Federal bureaucrats can push ideological  priorities.\n\nThat is exactly the concern here. ESG investing has become…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…note,  again, the Forest Service plan states mining and timber harvesting are  desired activities.\n\nThis PLO sacrificed thousands of good-paying union jobs that would  support families for generations, along with billions of dollars of  revenue for our schools, State and Federal governments, and, most  importantly, our Nation's mineral security.\n\nIt…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…worker. Yet, they oppose H.R. 2262,  which simply increases opportunities for hourly employees to  voluntarily take training classes to better their careers. They claim  to support families. Yet, they oppose H.R. 2270, a bill that makes it  easier for small businesses to offer childcare benefits.\n\nThe American people are tired of a government that treats…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…policy year. Known as the  Super Bowl of tax colloquially, I believe that we have a real  opportunity to extend tax policies that benefit hardworking Americans  and that support families.\n\nLet's remember that the child tax credit was $1,000 pre-2017, and  Republicans doubled it without a single Democrat vote in 2017. We are  going to go at this alone,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…will allow America to return to being the land of  opportunity, where hard-working men and women who have a dream for a  better life can build a business to support themselves and their  families and have something to pass on to the next generation and, at  the same time, to provide jobs for people who want to work and provide  for their families.\n\nSo…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…firsthand. In my  humble opinion, these heroes are our Nation's most sacred treasure, and  it is our obligation, as Congress, to do everything in our capacity to  support them and their families.\n\nCurrently, each Medal of Honor recipient receives a special pension  that totals roughly $1,500 per month, or $18,000 annually. The last  update to the special…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…lack access to high-speed internet, which means rural families  are isolated from critical healthcare options, as well as business and  education opportunities that could support families and alleviate some  of the stress that providers are feeling.\n\nCongress must tackle this problem holistically. In this case, getting  broadband to our rural families could…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}]