[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…continued skyrocketing insurance premiums and property damage.\n\nFarmers and ranchers are collateral damage. This bill green-lights  more drilling and mining that will spoil water supplies used for  irrigation and livestock, poisoning the land while fossil fuel CEOs  profit.\n\nPublic lands belong to all Americans, not billionaire donors, but  Donald Trump and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Secretary of Defense, with the       concurrence of the Secretary of State, to provide assistance,       including training; equipment; lethal assistance; logistics       support, supplies and services; salaries and stipends;       sustainment; and intelligence support to the military and       national security forces of Ukraine, and to other forces or…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…introduced a new sodium-ion       battery that it calls Naxtra. At the moment, mainstream EV       batteries are reliant on lithium, creating a potential       bottleneck around supplies of the material. CATL says sodium-      ion batteries, if mass-produced, could help reduce its       dependence on lithium.\n\nSodium-ion batteries are made from a sodium compound…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…straightforward amendments to protect public health:  One to require cumulative impacts and groundwater reviews for projects  near community drinking water aquifers, like the one that supplies  Memphis; a second one to restore oversight and public participation for  nationwide permits, protections that would have prevented the Byhalia  pipeline from being rushed…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698033/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Madam Speaker, in just 19 days, government funding  expires. Right now, Americans across the country face rural hospitals  that are closing, higher prices for back-to-school supplies, and  double-digit increases in healthcare premiums. What is the Republican  majority spending their time on? This terrible bill.\n\nWhat a giant abdication of the huge responsibility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…on a month ago. A tariff is nothing more than a sales tax. It  is a sales tax on the products that everyday Americans use, especially  groceries and clothing and building supplies, for farmers, the cost of  fertilizer that they need as they are engaging in spring planting.  Trump's worldwide tariffs are nothing but a new sales tax.\n\nAnd the analysis,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…providers are facing challenge upon  challenge upon challenge. At Grays Harbor Community Hospital, I saw  firsthand how tariffs are driving up costs for medical devices and  supplies, adding financial strain to already stretched rural  facilities.\n\nThe hospital recently invested in a new MRI machine, a critical  upgrade that offers faster scans and higher…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…away vital departments like human       resources and acquisitions. There is no one to answer       personnel questions, and we are expected to perform without       basic supplies. This is not a well-thought-out plan, but       something executed with malice by an organization supposedly       focused on eliminating waste, fraud and abuse.\n\nOn February…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…distinguished career, he has served as a  firefighter, paramedic, fire captain, and assistant fire chief. He has  worked tirelessly to ensure the community has the medical supplies and  equipment it needs at all times.\n\nHis impact on the community extends well beyond the firehouse walls.  Mr. Fountain committed countless hours to mentoring newly minted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…large-scale emergencies, the ability to respond  quickly and efficiently has never been more critical. Good360 and its  partners ensure that life-saving assistance and high-quality supplies  reach those who need them most.\n\nGood360 collaborates with the Federal Emergency Management Agency  (FEMA)'s Donations Unit as well as a wide range of national nonprofits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Trump's tariffs will cost your average American family $2,300 each  year. That is $2,300 that families need to pay rent, to buy groceries,  and to afford clothes and school supplies for their kids. Trump decided  to make everything more expensive, even the energy we buy.\n\nThe inconvenient truth that Republicans don't want to acknowledge is  that clean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…being squeezed hard every time they try to buy a home, buy a car,  afford health insurance, go to the grocery store, or go shopping for  clothes, toys, tools, and school supplies. It is a reality that our  Nation functions under the weight of unfair global supply chains.\n\nWhile we can all agree that it is great to manufacture as much as  possible in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…hundreds of thousands of  American jobs overseas as other countries continue to develop their  next-generation energy sources, decreases our American-made domestic  energy supplies, forces us to be more reliant on foreign energy  sources, and erodes our economic competitiveness and energy dominance.\n\nIt does not have to be this way. The last time we…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…after dropping his 15-year-old son off at school,  Marwan was detained by ICE. This is a man who founded the largest Boy  Scout troop in north Texas, who delivered food and supplies to families  across our community during the pandemic, and who is recognized by the  city of Richardson for his outstanding service to our community.\n\nTomorrow, Marwan faces…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696969/marwan-marouf-needs-humanitarian-parole-now"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from entering Gaza by Israeli Prime Minister  Netanyahu. The World Food Programme and NGOs have been forced to close  their programs or are using the last of their dwindling supplies.\n\nFor the first time, lab technicians with the American Near East  Refugee Aid organization are detecting signs of starvation in the lab  work of one-third of all blood and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691407/gaza-needs-immediate-humanitarian-aid"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Donna Telesco has made as a volunteer with United  Way of Hernando County. Donna not only coordinated relief supplies  inventory at our Family Resource Center (FRC) daily for 2 weeks, she  was a lead volunteer when it came to identifying unmet needs and  residential trends as individuals…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…water is life, yet over 95 percent of rainfall evaporates  before it can even recharge aquifers. Even a small increase in recharge  could substantially boost underground water supplies in Arizona.\n\nDrought cycles and Federal restrictions have idled vast areas and  threatened water security. My amendment promotes recharge efforts on  Federal lands, giving…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…tenacity, and compassion for those in  need have led the Community Food Bank to grow from supplying 1-2  million meals each year to over 5 million nutritious meals and critical  supplies to fill the meal gap and basic needs for over 70,000 of our  neighbors in need. She has taught the entire team to ``BELIEVE that  they will end hunger because they are BETTER…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…support to these Helene-affected areas. At the same time,  Clay County Emergency Medical Services coordinated efforts to deliver  much-needed medical personnel and essential supplies to communities in  need.\n\nThe Clay County Sheriff's Office and Emergency Medical Services were  flooded with donated supplies from area churches, local businesses, and  citizens.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…They  support domestic energy production, resulting in lower costs for  American families and businesses, and invest in water infrastructure to  address drought and protect supplies for communities across this  country.\n\nThese appropriations bills that are included in the rule spend hard- earned tax dollars responsibly, reduce spending below current levels,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Eagle Scout project was to replace a retaining wall at the fire  department in Gardiner, Montana. He arranged the preconstruction  meetings, organized the delivery of the supplies, and was even able to  get a price reduction to save money. He then rallied his football team  and his troop to replace the wall, completing the job in 20 hours and  placing…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689243/recognizing-eagle-scout-colter-lumley"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Phillips was a strong advocate for bringing in government  and non-profit resources…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…child's education annually. This means fewer after-school  programs, outdated textbooks, and more teachers having to reach into  their own pockets to fund basic schoolroom supplies.\n\nIt should come as no surprise that the previous administration  finalized this RMP over the strong objections of the State of North  Dakota. The State's concerns were ignored.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…infrastructure has led to waste, delay, and avoidable  gaps in care.\n\nThat is why I introduced this bipartisan and commonsense approach to  improving how the VA manages medical supplies. This bill authorizes the  Secretary of Veterans Affairs to develop or acquire a cloud-based  inventory management system to help ensure VA clinicians always have  the right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…people are indicating in clear majorities  that they think we ought to help.\n\nBy one recent poll, more than 6 in 10 Americans support--support-- sending more arms and military supplies to help Ukraine win. That  includes--listen to this: A clear majority of Republicans support  helping Ukraine. And the recent voting history of the House of  Representatives…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Pass, Atqasuk,       Kaktovik, Nuiqsut, Point Hope, Point Lay, Utqiagvik, and       Wainwright. None of our communities are connected by a       permanent road system; all supplies must be flown or barged       in, making the cost of living extremely high and economic       opportunities generally low.\n\nOver fifty years ago, the Federal Government directed…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate for bringing in government and  non-profit resources…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…H.R. 3617, Mr. Speaker, will absolutely enhance the work being done  by the Trump Administration by  leveraging the expertise of the Department of Energy, to secure our  supplies of critical energy resources.\n\nWe know what is at stake with the next-generation economy: cutting- edge technologies, like AI and advanced manufacturing, hold tremendous…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…supply chain is no different.\n\nApproximately 10 percent of the active pharmaceutical ingredients  required for domestic prescription drug manufacturing comes from  foreign supplies.\n\nSimply stated, the prescription drugs that save the lives of millions  of Americans every year are at severe risk. American patients cannot be  reliant on countries like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Smith was a strong advocate for bringing in government and  non-profit resources…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}]