[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…official record, but in the very landscape of the community  that he loved.\n\nMs. HOYLE of Oregon.  Pou).\n\nMs. HOYLE of Oregon. Mr. Speaker, I urge my colleagues to support the  legislation, and I yield back the balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…return to Senator Rubio, rather than  what is a disheartening and nonstrategic policy that we have seen from  the State Department today.\n\nMr. Speaker, I strongly support this legislation and encourage my  colleagues to do so, as well, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I rise today to encourage every Member of  this Chamber to support this legislation honoring one of Santa Barbara  County's own, Brigadier General Frederick R. Lopez.\n\nMy bill would name the South Patterson Avenue post office in  recognition of General…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…here taking an opposite position is because they  are ashamed. If they are ashamed that means they know they are wrong.  If they know they are wrong, they ought to support this legislation or  tell the public I believe in enriching myself and I am not going to  support it.\n\nNow, I represent a place that sometimes is referred to as ``Chiefs  Kingdom.''…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691222/stock-trading-ban-for-members-of-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Representative Torres for his leadership on  this issue, and I also thank Representative Clarke for championing this  bill in our committee. I urge my colleagues to support this  legislation. Again, I will stress that without CPSC enforcement, this  legislation is not going to mean much.\n\nMr. Speaker, again, I don't want to take away from these bills.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…potentially self-defeating precedent where new statutory language  becomes necessary every time a new terrorist group or event emerges.\n\nNonetheless, we strongly support this legislation today, whose  purpose is incontestable and essential. I hope we can both pass this  bill and return to our bipartisan and bicameral practice for dealing  with visa…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…this bill.\n\nI invite all of my colleagues to join me fishing on the Great Lakes.  It might be good therapy for this institution.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  yield back the balance of my time.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…bankruptcy  judges.\n\nThere is still some cause for concern. This legislation, by  establishing sharing guidelines for active district court judges, will  certainly help.\n\nI support this legislation because this is about making the American  taxpayer dollar go further and making more sensible investments. I urge  my colleagues to do the same.\n\nMr. FIGURES. Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…stations. This will  ensure that parents with young children on Amtrak trains can use  accessible, safe, and comfortable changing facilities.\n\nMr. Speaker, I am pleased to support this legislation to create a  safer, cleaner, and more accessible experience for parents and  caregivers traveling with young children. I urge my colleagues to  support the Baby Changing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692157/baby-changing-on-board-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…as a matter of  public health and racial justice. However, we must do more at the  federal level to address these inequities. I call upon my colleagues in  Congress to support legislation such as the Black Maternal Health  Momnibus Act, which aims to expand access to healthcare, invest in  community-driven solutions, and promote policies that will save…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…who is the Democratic sponsor of the bill and who  is also the ranking member of our committee's Energy Subcommittee.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan support for this  legislation. It is another consumer protection bill, like the TICKET  Act, that provides transparency where it doesn't exist right now.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan work on this bill.\n\nMr. Speaker, I urge my colleagues to support H.R. 1765, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan support for this  legislation, and I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…these Federal dollars are used  responsibly and as Congress intended.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMs. RANDALL. Mr. Speaker, I support this legislation, and I urge my  colleagues to do so, as well.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Representative Landsman for his leadership on  this issue, and I urge my colleagues to support this bill.\n\nMr. PALLONE. Mr. Speaker, I have no additional speakers. I urge  support for this legislation, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today in support of my legislation,  H.R. 804, the Rural Small Business Resilience Act.\n\nAs the ranking member of the Subcommittee on Rural Development,  Energy, and Supply Chains, I am pleased to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I thank my good friend, the chair of the  subcommittee, for yielding.\n\nI rise today in support of my legislation, H.R. 866, the ROUTERS Act.\n\nRouters and modems play a key role in communications networks. They  are the entry point through which the public accesses the internet.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690156/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…intellectual  property, and our national security are protected from the malign  influence of the CCP.\n\nMr. Speaker, I urge all of my Republican and Democratic colleagues to  support this legislation.\n\nMr. PFLUGER. Mr. Speaker, I will point out that this bill was  actually brought up during the Biden administration and has nothing to  do with one administration…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…highest quality defense materials.\n\nI am proud to sponsor this legislation to streamline the direct  commercial sales process, and I urge my colleagues to join me in  support of it. This legislation makes America safer and our economy  wealthier.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…Act  was included in this package, as well as supporting language for the F- 35 sustainment center and utilities upgrade for future F-35 squadrons.  I wholeheartedly support this legislation.\n\nWe live in a dangerous world now. We had an administration before  that wanted to make things about social justice in our military.  Military is about defending…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692939/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…to exert influence outside their borders. The fact that they are  targeting our kids should be a significant cause for concern.\n\nThat is why I urge my colleagues to support this legislation and  demonstrate that Congress will always fight to protect our children and  national security.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…commonsense legislation that will help local Coloradans and  improve the operational efficiency of this important water  infrastructure.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.\n\nMr. WESTERMAN. Mr. Speaker, again, Mr. Neguse's bill is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Wisconsin (Mr. Van Orden), who is the  chief sponsor of the bill.\n\nMr. VAN ORDEN. Mr. Speaker, I thank the chairman for yielding me  time.\n\nMr. Speaker, I rise in support of my legislation, the Veterans  Education Transparency and Training Act, or the VETT Act.\n\nThis bill addresses critical barriers that veterans currently face  with accessing educational…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…U.S.C. 2305(a)); and\n\n(2) used in accordance with that Act (43 U.S.C. 2301 et       seq.).\n\nMr. GOSAR.  1043, the bill now under consideration.\n\nMr. Speaker, I rise in support of my legislation, H.R. 1043, the La  Paz County Solar Energy and Job Creation Act.\n\nMy bill requires the Secretary of the Interior to convey 3,400 acres  of BLM land to La Paz County,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Florida--can continue to  provide quality care to patients at home. More than 140 leading  healthcare organizations, including hospitals, healthcare providers,  and patients support this legislation.\n\nI thank Mr. Smucker, Mr. Evans, and Ms. Moore for their friendship  and bipartisanship on this bill. I thank Leader Scalise and Whip Emmer  for bringing this to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697172/hospital-inpatient-services-modernization-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Madam Speaker, I rise today in support of my legislation,  H.R. 3486, the Stop Illegal Entry Act.\n\nLet me first start by saying I think it is rich that we stand here on  the House floor and are lectured by the other side…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Indiana (Mr. Shreve) for his  leadership on this legislation and the gentlewoman from D.C. (Ms.  Norton) for working on this bipartisan bill.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. Speaker, in closing, H.R. 3426 as amended, will rightsize Federal  courthouses, reducing unneeded space and potentially…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Madam Speaker, I rise today in support of my  legislation, H.R. 452, the Miracle on Ice Congressional Gold Medal Act.\n\nWho can forget those words from legendary announcer Al Michaels:  ``Eleven seconds. You've got 10 seconds…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of the domestic mining sector; a letter of  support from the Essential Minerals Association; and a November 2025  op-ed published by RealClearEnergy, expressing support for this  legislation.                                                   January 16, 2025.\n\nZero Emission Transportation Association (ZETA) is an       industry coalition representing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…innovation, protect privacy, and  ensure the next generation of finance is built on American values, not  Federal overreach.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…illegal aliens to get off lightly  when committing fatal acts, such as vehicular manslaughter under the  influence.\n\nMadam Speaker, I urge my colleagues to vote in support of this  legislation to help bring back common sense to our immigration and  legal systems after these 4 years of pure chaos.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}]