[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…driving       innovation across industries and improving the quality of       life for millions of people. The semiconductor industry,       including DRAM manufacturing, supports millions of jobs and       contributes significantly to the United States' global       leadership in technology.\n\nWhereas, As we celebrate National DRAM Day, we honor the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691950/recognizing-dynamic-random-access-memory-dram-day"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…of the world-class research ecosystem in the United States  that is currently being eroded and under attack.\n\nThese stories show the risks we take when we cut funding that  supports critical scientific advancement. China is far outpacing us in  the research and development space. If we are going to keep up, we have  to put up. If those of us in this body…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Democratic Caucus colleagues and I  are urging the Trump administration to deliver nearly $34 billion in  disaster funding to help Californians recover. This includes funding  that supports rebuilding homes and schools, restoring critical road and  water systems, reopening small businesses, and helping communities  achieve lasting wildfire resilience.\n\nMr. Speaker,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Mr. Chair, SAMHSA's stated mission is to lead public health and  service delivery efforts that promote mental health, prevent substance  misuse, and provide treatments and supports to foster recovery while  ensuring access to better outcomes for all.\n\nIt is not an exaggeration to say that the public servants at SAMHSA  work  every day to prevent overdoses…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the hands of private  institutions who do not face the same standards and protocols as public  schools.\n\nThe Department of Education protects students with disabilities,  supports rural and low-income schools, and helps make college more  affordable for students across the country.\n\nIn Delaware, $530 million in Federal education funding supports  teachers…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697941/condemning-the-illegal-efforts-to-dismantle-the-department-of-education"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…certainty. However, I firmly believe that we can find a solution that  protects these sanctuary resources and treats all stakeholders fairly.\n\nWe can find a win-win solution that supports innovation, continues to  support our local economies, and ensures that the American taxpayer  gets a fair return for use of our natural resources.\n\nMr. Speaker, that is why,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…outpace the national average on all       tested subject areas. We boast free, full-day Pre-K access       serving more than 13,200 young learners--an investment which       supports our children and our workforce. DC ranked top of the       nation in parental satisfaction regarding school choice.       Mayoral control, council oversight, and deep, targeted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and the High Performance Data Facility at the  Thomas Jefferson National Accelerator Facility, commonly known as JLab,  in Newport News, Virginia, and my fourth amendment supports the U.S.  Army Corps of Engineers' ongoing oyster restoration work in the  Chesapeake Bay. Unfortunately, only one of these amendments will be  considered on the floor.\n\nMy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…get robbed  blind as the richest people in the world suck money out of our schools  and communities that need it the most. They are going to cut off  funding that directly supports our students and teachers and send it  straight to the pockets of unaccountable private and for-profit K  through 12 schools.\n\nAnd on standing up for our students, standing…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…for cocoa, coffee, and other goods  that the United States cannot produce at home.\n\nAmerican businesses understand the value of supporting robust U.S.- Africa trade, which supports more than 450,000 jobs across the United  States.\n\nFor this reason, the U.S. Chamber of Commerce, the American Apparel &  Footwear Association, and countless other business…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…whole-of-government  approach to addressing the unique needs of underrepresented businesses.\n\nThe North American Securities Administrators Association, or NASAA,  strongly supports this legislation, particularly as it would strengthen  collaboration and coordination between regulators.\n\nIn a letter to my office, written in support of this bill when it…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692704/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…communities abroad, they actually stimulate  local businesses and economies right here at home. Feed the Future,  which is a part of the U.S. Agency for International Development,  supports local farmers by purchasing their products and distributing  them to people in need around the globe. If Republicans pass this bill,  those farmers will lose.\n\nFeed the Future…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…outpace the national average on all       tested subject areas. We boast free, full-day pre-K access       serving more than 13,200 young learners--an investment which       supports our children and our workforce. DC ranked top of the       nation in parental satisfaction regarding school choice.       Mayoral control, council oversight, and deep, targeted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Agriculture to convey  approximately 150 acres of Federal land in the Mount Hood National  Forest to the City of The Dalles, Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its annual water supply. Local ownership of this land will  allow the City to better manage its water resources, protect water  quality, and plan for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cancer research by 19 percent. All of these reductions  are in real areas of opportunity, which we are walking away from under  Trump. This is a fundamental blow to how America supports medical  research and has real implications for the progress we made.\n\nInstead of ushering in the next wave of medical breakthroughs, which  could save you or your loved one…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…would  direct the Secretary of the Navy to review the challenges NAWCWD is  facing and report back to Congress on how they are working to address  them.\n\nMy third amendment supports Edwards Air Force Base by extending an  existing provision for several more years, helping to further  strengthen the base's vital mission. With new technology like the B-21,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…bill not as a  partisan measure but, much like it was last year, in fact, bipartisan  when it was voted on in the House.\n\nThis is a commonsense, cost-saving initiative that supports law  enforcement and the American taxpayers.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. FRY. Mr. Speaker, just to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…private  landowners for fair market value. This bill will free up the land for  economic development and prevent further Federal interference. It is a  good governance bill that supports the local community, encourages  economic development, and reduces the burden on the Federal Government.\n\nMr. Speaker, I thank Representative Matsui for this effort on behalf…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…America's economic and national security by advancing  domestic mineral production--something we didn't talk about enough  today--which reduces our reliance on foreign sources and supports job  creation here at home.\n\nFinally, a ``yes'' vote on this rule enables us to consider  legislation that preserves equal debate, protects the rights of the  minority, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to contribute his time  and talents wherever needed. His dedication and positive attitude are  respected by fellow volunteers, Habitat staff, and the partner families  he supports. Neil Quinn's commitment embodies the spirit of Habitat for  Humanity, making a tangible difference in the lives of families  striving for safe, stable, and affordable housing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the 2022 plan  ``are especially severe for the North Slope. Oil and gas development in  the NPR-A funds the Borough's schools, emergency services, and  infrastructure. It supports jobs for Inupiaq shareholders and  residents. It underwrites the continuation of our communities, even as  we maintain our subsistence way of life. By arbitrarily locking…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Treasury's (USDT) full support for H.R. 2189 and H.R. 4242.       DOJ and USDT's leadership are critical to ensuring federal       law aligns with modern technology, supports de-escalation,       and advances the safety of both officers and the communities       they serve.\n\nIf you have further questions, please contact Allie Esau,       Deputy…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Government of Israel formally declared war on Hamas in       accordance with its Basic Law.\n\n(U) Israel has the right to defend itself, and the United       States strongly supports Israel taking necessary action to       defend its country and protect its people from Hamas       terrorists, consistent with international law,       including the law of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…every  domain, including land, air, sea, space, and cyberspace. It provides  for next-generation systems and emerging technologies, strengthens our  nuclear deterrent, and supports investments in cyber capabilities to  defend against 21st century threats.\n\nImportantly, this legislation continues bipartisan efforts to improve  military quality of life,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Launch System for the Artemis IV and  V missions. That investment will support Utah jobs and power new  American advancement in space.\n\nThe One Big Beautiful Bill Act also supports a strong national  defense by investing in America's UAS industrial base to boost U.S.  drone capabilities. In my district, companies like Vector, a veteran- owned drone manufacturer,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and Human Services Robert F. Kennedy, Jr., has  also voiced support for returning whole milk to school cafeterias. He  recognizes its value as a nutrient-rich option that supports child  development and academic success.\n\nMilk provides 13 essential nutrients, including calcium, vitamin D,  and potassium. These nutrients support bone health, immune function,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Medicaid is that they are only  accessing State health systems, not the Medicaid program. I will point  out in a news flash that Medicaid is a State administered program that  supports State health systems.\n\nMr. Speaker, don't take it from me. Let me quote the Congressional  Research Service: ``Medicaid is a joint Federal-State program . . . The  Federal…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…stability and economic progress in the Middle East.''\n\nMadam Chair, I include in the Record an article dated July 12, 2025,  which shows that the current Trump administration supports military  funding to the LAF.                    [From L'Orient Today, July 12, 2025]     US Approves Potential $100 Million Sale to Lebanon for A-29 Super…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…with graduation, persistence, transfer, and job placement rates among  the best in the country. The college generates more than $276 million  annually in economic impact and supports more than 4,000 jobs across  its region, while enrolling nearly 10,000 students each year in credit,  workforce, adult education, and dual enrollment programs.\n\nDr. Karolewics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Madam Chair, I rise in support of my amendment  No. 147 to H.R. 3838.\n\nMy amendment to the NDAA supports the C-130H (and planned C-130J) Air  National Guard Formal Training Unit in my district.\n\nC-130J aircraft are critical to the Arkansas National Guard.\n\nThe planned C-130J…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695158/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]