[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…commitment and grit.\n\nMadam Speaker, I applaud Mr. Stauber, who spoke with such passion and  such knowledge, and the other sponsors of this bill. I urge my  colleagues to support this measure, and I reserve the balance of my  time.\n\nMr. SHERMAN. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, this legislation awards three Congressional…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…majority of American people support prohibiting  nonconsensual, sexually explicit, deepfake images, with one survey  finding that 85 percent of Republicans and Democrats support this  measure. That is why I am hopeful it will pass today and be considered  favorably by the House, and that is why, last Congress, the Senate  unanimously passed this measure.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…achievements.\n\nI look forward to seeing the items chosen for the time capsule, which  I may not be able to see when they are opened, but I do encourage my  colleagues to support this measure. It is an important measure. It is  an important part of our history and our legacy, and I look forward to  its passage.\n\nMadam Speaker, I yield 3 minutes to the gentlewoman…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I thank my colleagues for this unified  support for a measure that is eminently reasonable, and I thank the  leader of our side, Senator Schumer, for advancing this proposal.\n\nIt is a compromise. It is simple and plain. And I…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, I rise in strong support of this measure to  rein in President Trump's unlawful boat strikes.\n\nThese strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Congress has to offer to show the American people that we can work  across the aisle to keep them safe and our economy moving forward.\n\nMr. Speaker, I urge my colleagues to support this measure, and I  yield back the balance of my time.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…organ harvesting and trafficking.\n\nThis bill will help inform Congress so that we can ensure the U.S.  can respond appropriately.\n\nMr. Speaker, I urge my colleagues to support this measure, and I  yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…use-of-force incidents. It provides clarity for  agencies, manufacturers, and regulators without--let me repeat,  without--weakening gun laws.\n\nMr. Speaker, I strongly support this measure.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…communities and restore local pride.\n\nThese are responsible investments that respect taxpayer dollars and  deliver real results for working families. I urge my colleagues to  support this measure.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…I respect greatly, that  we have much work to do. However, this bill goes a long way to fix an  issue that can simply not wait any longer to be addressed. I urge  support for this measure.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…opposition to H. Res. 878. While I respect the  sponsor of this resolution and appreciate very much her work on behalf  of her constituents in southwest Washington, I cannot support this  measure.\n\nMy friend and classmate from the 116th Congress, Representative Chuy  Garcia, embodies the highest ideals of the American Dream.\n\nBorn in Mexico, Representative Garcia…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…several years ago. It is common sense. It is bipartisan, and it  means a great deal to the folks that I represent in western Colorado.\n\nI hope that my colleagues can support this measure. I look forward to  doing everything that needs to be done to get it to the President's  desk.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…ensuring that TSA leadership retains the  ability to manage the workforce appropriately and maintain security  standards.\n\nMr. Speaker, I urge all Members of Congress to support this measure,  and I yield back the balance of my time.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I appreciate that we are considering S. 2392, the  Veterans' Compensation Cost-of-Living Adjustment Act of 2025 today. I  rise in strong support of the measure, and I thank Senator Moran for  introducing the bill and appreciate Representatives Morgan Luttrell and  Morgan McGarvey for leading the House version.\n\nWe have a uniquely…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…several issues in this Congress. Both sides worked in good faith to  get this bill done last Congress and again here today.\n\nMr. Speaker, I encourage my colleagues to support this measure, and I  reserve the balance of my time.\n\nAs I have indicated, I support this bill because sanctions have a  role in curbing the opioid crisis, but they are only a sliver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…that the United  States will no longer tolerate sending U.S. tax dollars to terrorist  organizations in Afghanistan and across the Middle East.\n\nI urge my colleagues to support this measure, and I yield back the  balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…officers because they have been subject to the enforcement  of the law over the course of a career, upon retirement those old  animosities often linger.\n\nThose of us who support this measure and support it strongly  understand and argue that it is essential to the safety of our existing  officers and to the safety of our retired officers that we recognize…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…where the organization is actually based and  honors its close connection to John A. Logan and the southern Illinois  communities that support its work. I am proud to support this measure  and am grateful for the opportunity to assist an organization that has  done so much for veterans and our communities.\n\nThe Woman's Relief Corps stands for patriotism,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…strong  majority, and I expect it will receive similar support today.\n\nMadam Speaker, I urge my colleagues to support this pragmatic  approach to foreign policy and support this measure, and I reserve the  balance of my time.\n\nMr. MAST. Madam Speaker, I yield 4 minutes to the gentleman from  South Carolina (Mr. Wilson), the sponsor of this legislation.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…livelihoods. A shutdown doesn't score points. It only hurts  those we serve.\n\nMr. Speaker, I urge my colleagues to do the right thing, put the  American people first, and support this measure.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695824/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…does. It makes sure we put in place a simple  structure that is permanent so that the vagaries of this town don't  change things on Main Street.\n\nMr. Speaker, I strongly support this measure. It is just common  sense.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…hard-earned tax dollars of every American who  pays taxes. This bill plays an integral part in the noble endeavor.\n\nMr. Chair, for that reason, I urge my colleagues to support this  measure.\n\nMr. DIAZ-BALART. Mr. Chairman, before anything else, I will tell you  what I have told Mr. Crane privately. I will say it publicly. I revere  his service to the country.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…reopen the government, and she voted against reopening the government.  That is something that I think she must have mistakenly omitted from  her remarks.\n\nAgain, we support every measure that can be done to reduce crime and  to get criminals that have committed crimes and keep them in jail. They  deserve due process, but we can't continue this trend…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Federal dollars  involved. The issue here is just allowing the DC Government to proceed  to spend its own tax revenues.\n\nAccordingly, I urge all of my colleagues to support this measure to  correct a true inequity.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}]