[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…lab of  Dr. John Morrison, current President of the Society for Neuroscience,  and learned more about his research into Alzheimer's disease.\n\nIt is essential that we keep supporting neuroscience research to  enable world-class researchers to continue their vital work on a wide  range of conditions, including Alzheimer's and Parkinson's diseases,  autism…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688941/recognizing-brain-awareness-week"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…should be the birthright of every American. What a far, far cry from  Republican leadership then to the Republican agenda today.\n\nBut the bottom line is, colleagues, by supporting this measure,  Republicans are simply making it harder for California to improve air  quality in California.\n\nAs I did yesterday, I also just have to acknowledge what it…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States do about it?\n\nI thank the Senator from Vermont for offering these resolutions this  evening. It is painful for many of us who devoted our congressional  careers to supporting Israel, standing by them through difficult times.  It is impossible to explain or defend what is going on today. Gaza is  starving and dying because of the policies of Benyamin…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…abandoned our leadership  position in arms control and non-proliferation. Note: For the first  time ever, the U.S. was the only country to vote no on a recent UN  resolution supporting the Comprehensive Test Ban Treaty and the global  nuclear testing moratorium. Not even North Korea opposed it. What kind  of signal does this send? Amidst all this nuclear…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…multiple Paul Harris Fellow honors.\n\nBeyond formal roles, Bob embodies the essence of ``Service Above  Self.'' Whether he's packing food for the Northern Illinois Food Bank,  supporting families through CHIP IN Batavia, participating in roadside  cleanups, or doing yard work for neighbors in need, Bob is always the  first to volunteer.\n\nHe is also a steward…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…rationale for this  ancient and outdated restriction has always been argued as national  security, to maintain a strong U.S. shipbuilding industry and merchant  fleet capable of supporting the military in times of conflict.\n\nBut today that argument, if it has any merit at all, is being  dangerously undermined, and not by our adversaries, but by the very  companies…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…stand up for our rural communities.\n\nFor New Mexico, this is real money with real impact. Our rural  communities have been missing more than $9 million that should have  been supporting schools, roads, and essential services. I am proud to  be bringing that money back to the families and communities that have  waited for far too long.\n\nI also want to take…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…understanding. He has advanced Christian-Muslim relations in  such places as former Yugoslavia, advocating for peace-building  measures to diffuse global conflict in the region, while supporting  many traditionally Orthodox countries emerging from decades of wide  scale religious persecution and oppression behind the Iron Curtain.  Moreover, he has initiated international…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…will now bear his name. The  USNS Billy Frank Jr. will offer salvage, rescue, ocean-going towing and  other support capabilities for U.S. Navy fleet operations, while also  supporting missions such as oil spill response, humanitarian  assistance, wide-area search and surveillance.\n\nOn this momentous occasion I send my congratulations to the Frank  family…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…celebration of this  accomplishment and years of innovation, empowerment and progress, I  call on my colleagues to recognize the goals and ideals of Sarcoidosis  Awareness Month by supporting federal activities that improve the lives  of patients impacted by Sarcoidosis, and to raise awareness and shine a  light on the 1.2 million people living with Sarcoidosis.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Network. This award  recognizes his efforts to help make cancer a national priority.\n\nAfter losing his wife, Betsy, to metastatic cervical cancer, Vince  became dedicated to supporting families affected by cancer and fighting  for a cure. As an American Cancer Society Cancer Action Network  volunteer for the past six years, Vince has worked tirelessly alongside…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…of skilled workers in high-need industries.\n\nCTE graduates have the skills and dedication that Maryland and  American small businesses need, and I thank my colleagues for  supporting this commonsense bill.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691768/supporting-cte"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…helps ensure  that every family can rely on a healthcare system that is accessible,  affordable, and built to meet their needs.\n\nI urge all of my colleagues to join us in supporting this bill.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697515/supporting-healthcare-apprenticeships"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…today to recognize the 50th  anniversary of American Legion Post 667 in Universal City, Texas.\n\nSince its chartering in 1975, Post 667 has stood as a cornerstone of  service, supporting veterans, active-duty service members, and families  across northeast Bexar County.\n\nFor five decades, the Post has served as a hub for camaraderie,  patriotic education,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…them from  accessing $10 billion in already appropriated funds for TANF and  childcare.\n\nRepublicans rejected every one of these amendments.\n\nClearly, this bill is not about supporting pregnant women and  families. It is about shielding deceptive actors, supporting Trump's  revenge tactics, and using public funds to advance an extreme anti- abortion agenda.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…legislative team.\n\nMr. Trejo has risen through the ranks of my office, beginning as  Staff Assistant to currently serving as my Legislative Director. He has  always taken on a supporting role, working tirelessly to ensure my  legislative agenda is met. He is a mentor to not only the legislative  team, but also to other members of my staff.\n\nIt is important…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692740/congratulating-mr-travis-trejo-on-8-years-of-service-to-marylands-first-congressional-district"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…has been especially proud of the work of Library Director  Peter Lehu, whom she praised as ``the best Library Director the  township has ever had.'' She hopes to continue supporting the library  and other community institutions in the years ahead.\n\nHer advice to the incoming 2026 Board is to support newly elected  Supervisor Mary Owens, ``hold tight''…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…on  cost-effective efficiency standards will lower costs while continuing  to improve household appliance performance.\n\nMadam Speaker, I urge my colleagues to join me in supporting H.R.  4626, the Home Appliance Protection and Affordability Act to protect  consumer choice, to modernize EPCA authorities, and to lower costs for  American families.\n\nMr.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…restores congressional intent. It  restores certainty for Alaska's communities. It restores America's  strategic energy reserve.\n\nMr. Speaker, I urge my colleagues to join me in supporting S.J. Res.  80, and  to stand with Alaska, with energy workers, with the Inupiat people of  the North Slope, and with an American future grounded in abundant,  affordable,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…rules and pass  the bill (H.R. 2503) to require the development of a strategy to  eliminate the availability to foreign adversaries of goods and  technologies capable of supporting undersea cables, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2503\n\nBe it enacted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…wages declined. Just 6 months into the Trump  administration, most new jobs are now taken by Americans, and real  wages are growing once again. That is not a coincidence.\n\nSupporting this impoverished, illegal population costs American  taxpayers an estimated $160 billion a year. It flooded classrooms with  non-English-speaking students, packed emergency…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.\n\nI thank my colleagues for supporting this critical legislation and  engaging in this meaningful discussion.\n\nBefore I close, I want to highlight another statement from Director  Leavitt, which she offered during…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…President's  commitment so that they know this is going to be a long-term effort to  make certain that we address crime.\n\nNow, in the Senate, we have several bills that are supporting this  effort. My Ending Cashless Bail in our Nation's Capital Act, which  would require Washington, DC, to use the highest level of cash bail  necessary for dangerous offenders…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…small to be overlooked or to matter, and that we are  committed to building a stronger and more equitable nation for all.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 3095.  Let us give these communities and the millions of Americans the  representation, the recognition, the resources, and the respect that  they rightfully deserve.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Taiwan  Conflict Deterrence Act of 2025.\n\nThis excellent bill, introduced by our Conference chair, Mrs.  McClain, demonstrates that the United States is a vital partner in  supporting Taiwan. We must remain committed to supporting Taiwan as  China continues to increase its military presence across the Taiwan  Strait.\n\nThe U.S. and Taiwan have maintained…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…weapons systems.\n\nThey would be voting against increased stability for servicemembers  and their families, against training and equipment for an agile,  capable force, against supporting the supply chain production, against  deterring the Chinese Communist Party and foreign adversaries, and  voting to prevent taxpayer dollars from funding abortion travel.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…lose sight of the underlying problem and continue  to prioritize policies that restore timber production and the original  intent of our Federal land management agencies: supporting multiple use  and healthy forests through proactive management strategies while  meeting the needs of surrounding communities.\n\nI appreciate all of the Wyoming stakeholders…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…continuing my work for the people of Iowa this year, as I  always do.\n\nOne issue that is on my mind is lowering healthcare costs, expanding  access to high-quality care, and supporting research and innovation.  The U.S. healthcare needs more reform and accountability, but we don't  need to turn it into a socialized, government-run healthcare system.\n\nI…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…citizenship requirements are consistently enforced.\n\nBy requiring a photo ID in Federal elections, this congressional  action will work to prevent fraud before it even starts. Supporting the  SAVE America Act means promising every voter that their voice matters  and that their vote will not be diluted. This action signals a long  overdue step towards election…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I thank the chairman for the opportunity  to speak. I am so proud to rise today in support of my legislation,  H.R. 6945, the Supporting Pregnant and Parenting Women and Families  Act.\n\nFor too long, previous Democrat administrations have weaponized the  Department of Health and Human Services against pregnancy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}]