[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…country.\n\nI thank Representatives Finstad, McIver, and Garbarino for their  partnership in this legislation and Chairman Williams and Ranking  Member Velazquez for their strong support.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill and  for the Senate to expeditiously take it up so we can unlock more of the  potential of American entrepreneurs.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to  better do our job to support servicemembers, veterans, and their  families. This legislation passed the House last Congress, and I  encourage my colleagues to support it once again.\n\nMr. Speaker, I now yield 3 minutes to the gentlewoman from the State  of Washington (Ms. Strickland), my good friend and author of this bill.  She currently serves on…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…guaranteeing  that veterans receive prompt and effective assistance.\n\nThese measures will improve program effectiveness and ensure veterans  benefit from high quality and timely support.\n\nMr. Speaker, I urge my colleagues to support this bill, and I  encourage the Senate to act quickly.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695446/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…inspected.\n\nThe bipartisan United States Grain Standards Reauthorization Act of  2025 is critical for the global grain trade. Mr. Speaker, I urge my  colleagues to support this bill.\n\nMr. Speaker, I thank Chairman Thompson, Ranking Member Craig, and  Chairman Scott for their work on this bipartisan bill.\n\nAs a member of the House Committee on Agriculture,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…strategic next steps to bolster our Nation's supply chains.\n\nI thank our Democratic sponsor, Representative Schrier, for her work  on this bill. I urge my colleagues to support the bill.\n\nMr. PALLONE. Mr. Speaker, I support the legislation, and I yield back  the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690288/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…anecdote and evidence for  aviator cancers so pilots and aircrews can get the care and the  benefits they deserve.\n\nThat is what this bill hopes to achieve, and I strongly support it.\n\nMr. Speaker, I thank the gentleman from Texas for bringing the bill  and for his service, and I encourage all of my colleagues to get behind  this effort. While this is one…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…work to support our veterans, like the National Woman's Relief  Corps, are more important than ever.\n\nUltimately, this bill is a straightforward administrative fix, and I  support it.\n\nMr. Speaker, the Woman's Relief Corps began as a way for patriotic  women to show their continued loyalty to the Union and support Civil  War veterans.\n\nMore than 140 years…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to  strengthen and improve our laws to address these new and dangerous  crimes and to keep our children safe online.\n\nMr. Speaker, I encourage all of my colleagues to support H.R.\n\nMr. RASKIN. Mr. Speaker, to close, I strongly support H.R. 6719, the  Combating Online Predators Act. I encourage all of our colleagues to  support it, and I praise the gentlewoman…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…is way too long for the American  public, and we need to do something about it. That is why this  particular bill's resolution is common sense. I ask my colleagues to  support it.\n\nMr. Speaker, I am excited about the strong bipartisan support that  H.R. 1155, the Recovery of Stolen Checks Act, has received. The bill  will take a critical step toward…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…jobs, and continue to  revitalize American manufacturing.\n\nMr. Speaker, I commend Representative Landsman for his leadership on  this issue, and I urge my colleagues to support this bill.\n\nMr. PALLONE. Mr. Speaker, I have no additional speakers. I urge  support for this legislation, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…interests of the American people, and we see the  economic prosperity that we have enjoyed because of it. That is what  Ukraine is about and why we should continue to support them.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. SMITH of Washington. Mr. Chair, I demand a recorded vote.\n\nMr. SMITH of Washington. Mr. Chair, I claim the time in opposition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Mr. DELUZIO. Mr. Speaker, I thank the gentlewoman for yielding and  the gentleman from Texas (Mr. Gill) for his support.\n\nMr. Speaker, I rise today to ask this Chamber to honor and  memorialize a beloved western Pennsylvania community leader, local  historian, and author by voting ``yes'' on H.R.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…our national security when it comes to commercial airline security.\n\nI thank my colleagues for working in a bipartisan fashion to advance  this measure, and I am glad to support it.\n\nMr. KENNEDY of New York. Mr. Speaker, I rise in support of my bill,  H.R. 862, the TSA Commuting Fairness Act.\n\nYear after year, through holiday seasons and spring breaks,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Madam Speaker, I believe it is time to equip eastern North Carolina's  veterans and beyond with the training and skills they so need. I  encourage my colleagues to support this bill.\n\nMr. TAKANO. Madam Speaker, I yield myself the balance of my time to  close.\n\nMadam Speaker, I again express my qualified support for H.R. 1458,  the VETS Opportunity Act…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…controllers, food inspectors, law enforcement, and public safety  officials. They impact every part of our lives, and we take them for  granted. We cannot hurt them. We must support them.\n\nMr. Speaker, I thank my Republican colleagues who have joined us on  this bill and encourage those who have not yet recognized this is an  opportunity for all of us to work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Collins and Congressman Rouzer. They have all said we need  to step up. Our environment is worth fighting for, and that is what the  Bean amendment does. I ask for your support.\n\nMr. Chair, I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, I thank my friend and colleague, Mr.  Foster, on the other side for working on this.\n\nMr. Speaker, I rise today in strong support of Mr. Foster's  legislation, the Financial Stability Oversight Council Improvement Act,  and urge its immediate adoption.\n\nMr. Speaker, in response to the 2008 financial crisis,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…legislation would prevent those situations while recognizing our  commitment to honor those who have served this country.\n\nMadam Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Madam Speaker, at this time I yield such time as she may  consume to the gentlewoman from New York (Ms. Stefanik), the sponsor of  this bill.\n\nMr. BOST. Madam Speaker,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…atrocities in Ukraine, including the  abduction of Ukrainian children. This legislation reflects American  leadership, strength, and moral clarity, and I urge my colleagues to  support it.\n\nMr. Chairman, while the FSGG bill contains many important provisions,  I would like to touch base on one key provision that is important to  the folks back in North Carolina.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…and the VFW for supporting this bill last Congress  and for their tireless work on the Hill advocating for this  legislation.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. Speaker, I ask all of my colleagues to join me in supporting this  bill, and I yield back the balance of my time.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…small businesses, not fraudsters.\n\nMr. WILLIAMS of Texas. Mr. Speaker, this important legislation will  hold these fraudsters accountable, and I urge my colleagues to support  it.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I have no further speakers, and I  am prepared to close.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…openness and accountability the American people expect and deserve.\n\nMr. Speaker, I thank Ms. De La Cruz for this important measure, and I  urge our colleagues to support it.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the Congressional  Budget Office estimate for this bill.      H.R. 225, HUD TRANSPARENCY ACT OF 2025, AS REPORTED BY THE HOUSE…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…unreasonable risk to bystanders.\n\nI thank Representative Clay Higgins for his leadership on this  critical local policing reform legislation, and I urge my colleagues to  support his bill.\n\nMr. COMER. Mr. Speaker, I include in the Record a letter from  Representative Min that clarifies that he meant to vote ``yes'' on H.R.  5143 in committee.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…any of the  analogues that may help people who are afflicted having been addicted  by accident or on purpose to fentanyl.\n\nMr. Speaker, I urge all my colleagues to support S.\n\nMr. GRIFFITH. Mr. Speaker, I now yield 2 minutes to the gentleman  from Georgia (Mr. Carter), the chairman of the Health Subcommittee.\n\nMr. GRIFFITH.\n\nMr. GRIFFITH. Mr. Speaker,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…done to have greater notice for the American  people.\n\nI come together in good faith with my colleagues across the aisle and  hope that my colleagues in the Chamber will support it.\n\nMr. Speaker, I thank the gentlewoman from Georgia for her comments. I  thank the gentleman from Tennessee for his kind remarks, the gentleman  from Maryland, all of my colleagues…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…self-determination, strengthens care delivery, and  empowers a trusted partner to do even more for our communities.\n\nThis is a narrowly tailored, fiscally responsible bill with broad  support. Mr. Speaker, I urge my colleagues to join me in advancing this  measure and helping more Alaskans get the care that they deserve.\n\nMr. BEGICH. Mr. Speaker, I rise in support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…WAGNER. Mr. Speaker, in closing, H.R. 3352 supports  entrepreneurship, encourages capital formation, and reflects how  innovation actually happens. I urge my colleagues to support Mr.  Lawler's bill, H.R. 3352.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…supported by the administration.\n\nMr. Speaker, I thank our veterans service organizations for their  support of this commonsense bill. I urge all of my colleagues to  support H.R.\n\nMr. BOST. Mr. Speaker, I have no further speakers, and I am prepared  to close.\n\nMr. BOST. Mr. Speaker, I join with the ranking member and ask all of  my colleagues to support…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…uniform and go to work  and they know they may not come home. We owe these people a lot more  than just a thank you. We owe them respect, admiration, and our  unwavering support.\n\nMr. Speaker, I encourage my colleagues to do the same and to honor  the life of Deputy Sheriff Brad Reckling. May we always appreciate the  men and women in blue.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…called home.\n\nI thank Chairman Westerman and Senator Cornyn for their leadership  and support on these efforts. I also thank my Democratic colleague  across the way for her support.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this very  commonsense legislation. We can never bring back Jocelyn, but we can  commemorate and memorialize her for the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}]