[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I supported passage of S. 1582, the  GENIUS Act, because it creates new Federal regulations and consumer  protections for payment stablecoins. Specifically, the bill was amended  to…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692635/genius-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…efforts of the administration team of Elisa Mendez, Nick Stella,  and Teddy Kohlhaas, all under the leadership of Christi Mayer, helped  to keep everyone on track and to feel supported, and Thomas Weber  ensured our IT resources never let us down. Toni Coverton, from the  Office of the Clerk of the House, led the gifts and commemoratives  section of the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…aid  to Israel.\n\nThis is not a vote to retract a single dollar of that $18 billion in  aid; it is a vote to say that defense aid to Israel, which Democrats  overwhelmingly supported, should be defensive in nature, not offensive  weapons that are likely to lead to unnecessary civilian suffering and  destabilization in the region.\n\nI support defensive…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694436/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…put this all together and figure out how to  pay for this. I urge our President to immediately approve Governor  Evers' request for a Federal disaster declaration, a request supported  by the entire delegation on both sides of the aisle.\n\nMr. Speaker, this just shows us the irreplaceable role of the Federal  Government in helping to put victims' lives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695324/recognizing-milwaukees-severe-flooding"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for The Ohio State  University Young Scholars Program as this week's Champion of the Week  for Ohio's 13th Congressional District.\n\nThroughout her career, Lisa helped and supported countless students  in Canton City Schools who aspired to be the first member of their  family to attend college.\n\nThrough her work, she has made a lasting impact on our…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691972/recognizing-lisa-gissendaner"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…$300,000 in fees.\n\nMr. Phillips' selfless service and steadfast leadership have helped  ensure financial stability for countless Dallas residents. He has also  mentored and supported fellow volunteers, strengthening the very fabric  of our community.\n\nI am deeply grateful for Robert's contributions and proud to  represent him in Congress. I congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…message that trans healthcare is illegitimate, even though those of us  who live in reality know that trans healthcare is safe, effective, and  medically necessary. It is supported by every major medical association  in the U.S., representing more than 1.3 million U.S. doctors.\n\nLet's be clear by what we mean by gender-affirming care. We don't  only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, for those of us who have long supported  U.S. diplomatic leadership in pursuit of a secure, democratic Israel  alongside a demilitarized, independent Palestinian state, the  protection of due process and the rule…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that Congress and the American people  promptly receive detailed information from GAO and others on what went  wrong and what should be done to promptly fix it.\n\nThis bill is supported by Americans for Financial Reform and Public  Citizen.\n\nMr. Speaker, I urge my colleagues to support this bill, and I yield  back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697287/systemic-risk-authority-transparency-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…malnourished children.\n\nRhode Island's Edesia Nutrition has helped save 25 million lives with  this ready-to-use therapeutic food manufactured in North Kingstown,  Rhode Island, supported by USAID. Yet, that work is now in jeopardy.  Trump is now 3 months into his administration, and funding is still cut  off, throwing Edesia's operations into chaos.\n\nMr.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690893/impact-of-volatility-and-policy-reversals"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…professions students across the State. I cannot  stress enough how important the New Hampshire AHEC is for our  communities and how important it is that the program continues to be  supported by Congress. AHECs not only address current healthcare gaps  and challenges, but they recruit, train, and bolster our future health  workforce. On behalf of my constituents…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…along with 42 of his Senate  colleagues--Democrats and Republicans--petitioned then-Secretary of  Energy Jennifer Granholm to vacate the AEC's flawed decision. And they  were supported by distinguished members of the U.S. scientific  community, including the Director and former Directors of the Los  Alamos National Laboratory.\n\nOn December 16, 2022, Secretary…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…them keep threatening  benefits. That is going to hurt people everywhere, from seniors who  count on their monthly checks right now to the parents of kids with  disabilities supported by Social Security, to every American who is  paying into the program now for results later on down the line.\n\nSocial Security, by the way, is more than just a retirement…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…from PEPFAR, a paragon of American  leadership that has saved the lives of 26 million mothers and fathers,  sons and daughters. Instead of facing a death sentence, people  supported by PEPFAR are raising families, building their communities,  and helping their communities grow and develop.\n\nThis is a bill that puts America last. When we retreat from…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Federal Register, searched for what  fell within the Congressional Review Act window, and then randomly  selected an obscure, noncontroversial rule, one that is, by the way,  supported by American manufacturers.\n\nThat is why we are here today. We are not here to talk about  Republican cuts to Medicare or DOGE's raid of the Federal Government or  Trump's…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…and nothing but wishful  thinking.'' Nothing could be further from the truth.\n\nOperation Absolute Resolve was a masterfully, meticulously planned  law enforcement operation supported by the U.S. military.\n\nI don't know how much clearer we must be with our colleagues on the  other side of the aisle, but the U.S. is not at war with Venezuela.  None of the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contagious, inspiring both staff  and fellow volunteers. She has a unique ability to lift others up,  ensuring that every person who walks through our doors feels welcomed  and supported. Her kindness is not just in her words but in her  actions--consistently stepping in wherever she is needed without  hesitation. Without individuals like Teresa, the impact…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…the political gamesmanship  that is being played out right now.\n\nI am happy to report that the Shutdown Fairness Act, as I now amended  it by adding furloughed workers, is supported by the American  Federation of Government Employees, the Federal Managers Association,  the Federal Law Enforcement Officers Association, the National Air  Traffic Controllers…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…Florida to my home State  of Oklahoma, our Nation's agricultural land must be protected. That is  why a bipartisan group of Members from over 20 States across the  country have supported me in this effort.\n\nI am grateful we took a positive step in the last Congress to include  this language in our annual appropriations process, but we must cement  this requirement…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…retired law enforcement officers and ensure they  are able to protect themselves and to protect others no matter where  they are in the United States.\n\nThis legislation is supported by the Association of State Criminal  Investigative Agencies, the Federal Law Enforcement Officers  Association, the Major Cities Chiefs Association, the Major County  Sheriffs…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…from $245 billion, when ObamaCare  was originally passed, to $1.4 trillion in 2023. I love it when  private-sector company growth happens. I am a big supporter of it. I  have supported tax policy to ensure that can happen.\n\nThat type of increase, when ObamaCare gets established, to see that  rampant amount of growth, there is a problem there. We can celebrate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Cancers Examination Study Act, or  the ACES Act.\n\nFar too many of our military aviators and aircrew are being diagnosed  with cancer at troubling rates. A 2021 Air Force study supported by  additional Department of Defense research found that aviators face a 29  percent higher likelihood of testicular cancer, a 24 percent higher  likelihood of melanoma,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…opportunities for exports increases overall U.S. production, putting  downward pressures on prices for everyone.\n\nThe U.S. LNG industry contributed $44 billion to the economy and  supported 220,000 good-paying jobs while providing $11 billion in taxes  and royalty payments.\n\nIn response to Russia's unprovoked invasion of Ukraine in 2022,  American energy producers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…as the father of five, with my youngest  daughter attending her very first cross-country practice today, I rise  to commend the remarkable work of Active4Youth, a community-supported  nonprofit that is transforming lives in Spokane.\n\nMr. Speaker, we have too many fat kids in America, and we need to get  more of them out running cross-country.\n\nFounded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…wrong to have men compete in women's athletics.\n\nIt is lost opportunity. It is lost recognition. It is lost success  for women.\n\nWhat ever happened to people on the left that supported women's  rights, women's safety, supported title IX? Obviously, they have thrown  it to the wayside.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…systems to dishwashers, refrigerators, and  freezers.\n\nIf this were such an unserious endeavor as my colleagues across the  aisle claim, then why did the administration they supported for 4 years  issue at least 31 regulations covering a vast array of different  appliances and other products out of the DOE and the EPA? Is $60  billion foisted on to our…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary Club, and supported  Wallace State Community College through the Future Foundation and  Alumni Association. He also served on the Cullman Area Chamber of  Commerce Board of Directors and helped…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Subcommittee on Oversight and Investigations  where she has been a critical team member in leading investigations  into Anti-Semitism in medical schools and hospitals and supported the  Committee's role in the bipartisan AI Task Force report that came out  in the 118th Congress. Kristen was also essential in Committee efforts  in writing letters pertaining…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…service weapons, this  provides a starting point to keeping them safe so that they may protect  their communities as well as themselves and their families.\n\nThis legislation is supported by 10 law enforcement organizations,  the Association of State Criminal Investigative Agencies, Federal Law  Enforcement Officers Association, the National Fraternal Order…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…measures that will save billions of  dollars from the fraud that we know is far too pervasive in this  program. It enacts reforms to a program called Medicare Advantage that  are supported by the AARP because we have seen that insurers have been  overcharging in this program to the tune of tens of billions of dollars  over the course of a decade.\n\nMr. Speaker,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]