[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…provide professional  development for educators to improve teaching and student outcomes.\n\nTitle III grants provide English language learners with the  integrated academic support they need to learn English and meet State  standards.\n\nTitle IV, part A grants are designed to give students access to a  well-rounded education. That is what students need: to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Foundation.\n\nFor the past fifteen years, Corey has poured her heart and soul into  organizing this annual concert, driven by a deep desire to give back to  her community and support those in need. Her tireless efforts have  brought together artists, volunteers, and supporters from across  Colorado, all united in a common cause.\n\nThe Colorado Professional Firefighter…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…gutted, the programs and the mission suffer. Ultimately, the  individuals we are trying to help with their mental health and  substance use struggles will simply not get the support they need.  People will die.\n\nI beg my colleagues on the other side of the aisle: Let's reverse  course. We have an obligation to protect SAMHSA's mission and all of  our constituents…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…TRiO Programs at  Virginia State University. These are federally funded programs run by  the Department of Education to work to ensure that children like her  have the support they need to go to and graduate college.\n\nMy parents understood how important a good education is not only to  individual opportunity, but to a thriving, healthy economy, community,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the development of new trusted manufacturers, including  those in the United States.\n\nThis bill helps bridge a gap by providing small communications  providers with the support they need to determine whether Open RAN is  an appropriate network solution for them. Under this bill, the  Assistant Secretary of Commerce for Communications and Information will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…reach out for help.\n\nAs Brown, Providence, and Rhode Island continue to heal, I join  countless others in making sure our community, our city, and our State  have all the support we need to recover. We are on a long journey, but  I know we are on it together.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699251/brown-students-return-to-campus"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Corral Fire.\n\nAt the 1st anniversary of this wildfire, I recommit to doing  everything in my power to ensure our firefighters and emergency  responders have the federal support they need and deserve to continue  keeping our communities safe from these disasters.", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…It is hard to imagine a more antifamily agenda. The Republican plan  pressures women to have more children then abandons them, gutting the  healthcare, education, and support they need to be healthy and to  thrive.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Imagine a walkable neighborhood with vibrant shops, restaurants, and  community-led events for all residents, a neighborhood that sets up  families with the resources and support they need to own a home, a  neighborhood where sustainability and accessibility are priorities.\n\nThis is Beaverton's dream, and they are making it a reality. At a  time when too…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693977/recognizing-the-city-of-beaverton-and-mayor-lacey-beaty"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Carolina.\n\nIn August, I had the chance to visit and hear directly from several  affected communities. Time and time again, I heard the same thing. They  need more Federal support, and they need it faster.\n\nWe are lucky to have the steady leadership of Governor Stein guiding  the recovery effort, but the Federal Government needs to do its part,  too.\n\nUnfortunately,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695772/recognizing-the-one-year-anniversary-of-hurricane-helene"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…gap. The people in the communities that we       serve have lost services, and they are quick to, frankly       speaking, look towards other options for [the] . . . support       that they need.'' Dan Schwarz, Vice President at Management       Sciences for Health            People Are Dying Because Of Cuts To Foreign Assistance\n\n``About the claim that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…into food assistance so that the women in college, the people who are  students who get pregnant, who have a tough decision to make, would  have all of the resources and support they need to make the decision  that is right for them.\n\nIt is not our job to tell a student what decision is right for them.  It is not our job to tell any high school graduate…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…improve the administration  of Federal justice for all of our citizens.\n\nIt is critical for attorneys who practice in the Federal judiciary to  have the professional support that they need to illuminate the legal  issues that they are litigating on and to advance the interests of  their clients.\n\nThe Foundation of the Federal Bar Association provides…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697184/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Early intervention care alters the  course of a child's life for the better, dramatically improves health  and educational outcomes, and gives working families the support they  desperately need.\n\nRepublicans in this body need to remember the sacred promise made to  children with disabilities 50 years ago and stand by it rather than  turn a blind eye. Democrats…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Stephanie have  gone above and beyond to support Hope Services as part of the  organization's Dream Team. They are always committed to helping others  and are a wealth of support to those in need. They give generously of  their time, talents and treasure. Their kindness, generosity, and  tireless efforts have made a lasting difference with the clients we  serve…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691801/recognizing-ralph-and-stephanie-stevens"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…communities that feed this country and  keep the economy strong. It supports our troops and Federal workers. It  ensures our servicemembers and their families have the support they  need, and it honors the promises we have made to those who have served.\n\nYes, it reopens the government, restores stability, and resumes  regular order.\n\nSo let's be honest…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…how vital their service is to our  national security and to our prosperity.\n\nThe Coast Guard Authorization Act gives our guardsmen the tools, the  resources, and the support that they need to meet today's threats,  whether it is stopping fentanyl at sea, stopping illegal migrants, or  responding to natural disasters.\n\nThis bill is about backing the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694196/coast-guard-authorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…immigration laws.\n\nWe enforce our immigration laws, or they are meaningless. We either  grant ICE the mission of fulfilling its mandate, or we don't. We either  give them the support they need to confront, stand face-to-face, and  arrest the world's worst criminals, or we don't.\n\nMr. Speaker, President Trump has reset our standing in the global  market after…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…child.\n\nI share my story because I want women to know this: You are not  alone. Others have walked the road that you are on, if you find  yourself pregnant and without the support you need--you think you  need--to make it, and there is a grateful child, one day, who will,  hopefully, tell you that.\n\nYou don't have to walk that road by yourself. There is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…candidates at the local, state, and national level. She has given  countless hours of her time to ensure that our Party's message is heard  and that our candidates have the support they need to succeed.\n\nCam has set records in the State of Michigan for the most phone calls  made in support of Republican candidates, an achievement that  demonstrates not only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…they should not face  additional difficulties in accessing capital and resources. With  transparency and increased reporting, we can better ensure that they  get the support that they need and the support that they deserve. I am  proud to co-lead the SERV Act with Representatives Davids and Conaway.\n\nThis bill, Mr. Speaker, is a win for our districts,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…consistently and avoid  confusion or unnecessary disputes.\n\nThis is a commonsense, compassionate measure that promotes  transparency and ensures pregnant students have the support they need  to create a better future for themselves and their child.\n\nMr. Speaker, let's cherish life for both the child and his or her  mother who dreams of academic success.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…disaster areas in their  own districts know exactly what I mean.\n\nFor communities that have been impacted by disasters, it is critical  that they have timely access to the support they need to begin the  recovery process and get their lives back on track.\n\nThis also, Mr. Speaker, includes regulatory relief. Filing season can  be long, and it can be burdensome…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…field and bring justice to American workers.\n\nMr. Kimmitt has pledged to use America's trade tools strategically,  enforce our laws vigorously, and give our exporters the support they  need to succeed globally. I know he will deliver on these promises. His  deep understanding of how trade policy intersects with our national  interest will serve this Nation…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and resilience, while  leading them to excel in competition.\n\nFurthermore, as check-in and checkout coordinator, Mrs. Harvey  ensures the students have the structure and support they need to thrive  at school. She mentors students and provides accountability to help  them stay on track, both academically and socially.\n\nBehind the scenes, Mrs. Harvey is…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…is real.  Some are facing a 40 percent cut. This puts rural services and teaching  jobs at risk.\n\nFortunately, the One Big Beautiful Bill Act delivers the kind of  support that they need and deserve.\n\nNow, it is time for the Senate to act. Let's get it to the  President's desk and deliver for rural America. Our communities have  waited long enough.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…spearheaded efforts that  have uplifted countless lives. She raised over $50,000 for the American  Heart Association's ``Go Red for Women'' campaign, ensuring critical  support for those in need. She has honored our nation's heroes by  organizing reunions for the 75th Ranger Regiment and playing a key role  in the 50th Anniversary commemoration of the end…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…this year's NDAA strengthens America's  military readiness. It invests in cutting-edge defense capabilities. It  ensures our servicemembers have the training, tools, and support they  need to confront the growing threats that we face at home and abroad.\n\nMr. Speaker, I rise today to express my strong opposition to the NDAA  provision that seeks to circumvent…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}]