[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…forms now. We see it in this push to engage in gerrymandering around  the country. But we see it in closing down polling stations in urban  areas. We see it in efforts to suppress the vote of certain  communities. We see it in the purging of voter rolls. We see it in  affirmative efforts to discourage people from voting. We see it in the  demonization…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…to a time when power was hoarded by the few and  denied to the many. We are marching forward with ballots, not bullets;  love, not fear; and with hope, not hate.\n\nWhen you suppress the vote, you suppress the American Dream. You  suppress the worker, the teacher, the farm laborer, the preacher, the  nurse, the single mom juggling three jobs just to make…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…it harder for Americans, especially  women and people of color, to participate in our elections. We have  seen these tactics before, creating barriers to the ballot box to  suppress the vote, and yet Republicans continue to find ways to  undermine democracy.\n\nMr. Speaker, I urge my colleagues to take a hard look in the mirror  and ask themselves: Do you…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…so, and yet  I was still denied access to meet with my constituents due to so-called  scheduling issues.\n\nThis is not transparency. This is an attempt to control access,  suppress oversight, and manipulate the narrative.\n\nInstead of terrorizing our communities, Trump needs to get back to  the real work of solving the affordability crisis.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699128/ice-operations"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…fair elections are the foundation  of any functioning democracy. The SAVE Act is a blatant attempt to  undermine our election system, weaken American democracy, and unfairly  suppress millions of eligible citizens from voting.\n\nIf the SAVE Act becomes law, eligible Americans would have to provide  either a passport or a birth certificate to register to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…United States. He was put  in handcuffs for representing the people of California.\n\nNow, if you are not yet convinced that President Trump and his  administration are trying to suppress free speech, then just watch the  video. Watch the video. If you are not yet convinced that President  Trump and his administration are trying to undermine the foundations…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…aircraft parts, which are acceptable  for commercial sale to persons or entities that contract with the  government for the delivery of fire retardants or water by air to  suppress wildfires. The aircraft and parts could only be used for fire  suppression.\n\nThis bill will help the U.S. suppress wildfires and recognizes the  unfortunate reality that fire…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691859/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…backlash in the civil rights movement of Dr. King was a Southern  strategy that intentionally carved a wedge between Black and White  communities--it was intentional in order to suppress the vote--and the  murder of our leaders who fought to change those laws and to change the  system.\n\nWe are in that backlash right now. We have a choice, and Dr. King  spelled…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…people, women,  students, indigenous people, and anyone who can't afford the burden of  a new bill.\n\nThe SAVE America Act is yet another Republican attempt to intimidate  and suppress the votes of anyone who threatens their extremist, white  supremacist agenda.\n\nDon't take my word for it. Just look for the threats that surround  the polls, the gun-wielding…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700017/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…will continue to show up. The American people will  continue to demand more of us, not less of us. They will continue to  demand that we protect and expand democracy, not suppress voters.\n\nWe say and continue to say that it is our responsibility for such a  time as this to be reminded why we decided to come to the people's  House, and who we represent…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to help do some of the dirty work. In fact, President Trump  has weaponized several Federal Agencies against you, the voters. He is  using these Agencies as instruments to suppress your vote.\n\nThe Department of Homeland Security and the Department of Justice  have both taken alarming actions in recent months targeting the vote.  At DHS, a senior Department…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't want to protect  elections. We do. We want to protect them from you. We want to protect  them from Trump. We want to protect them from all of you who are trying  to suppress the vote, who are constantly in denial over the results of  our elections.\n\nLast night, we had Republicans come before the Committee on Rules,  and they couldn't even bring…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…demonstrated fact recognized by all sound science  on the topic, but human beings have been aware of this scientific fact  for over a century. The fossil fuel industry has worked to suppress  that fact for nearly 60 years, but it is still a fact.\n\nOne hundred thirty years ago, in 1896, Swedish scientist Svante  Arrhenius concluded that greenhouse gas emissions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…has been spilled in the effort to secure it--is a storied  bedrock of our American history.\n\nAnd, now, again--as there has been throughout our history--there are  efforts to suppress that right for political reasons, for political  gain. That is what we have in the SAVE Act, an effort to erect  obstacles and to require documentation that, very simply,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690539/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…good people who caused  good trouble in the fight against demagogues from McCarthyism to Father  Coughlin, to big people who showed such small character when they tried  to suppress others. I want to cause good trouble and prove worthy of  those who came before.\n\nThis is not normal. Listen to America. Listen to Americans. They seem  to always be ahead…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Instead of listening to the people and changing the behavior  of the regime, the regime is engaged in a terror campaign of  extrajudicial killings, imprisonment, and beatings to suppress the  people. And I think this body and the civilized world should condemn  what is going on in Iran right now.\n\nAs to negotiations to solve the Iranian nuclear ambitions,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…viability by taking away their capacity to walk into  Federal buildings, ending Federal contracts. Why? Because if you can  control who a law firm is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and accomplished firms--Perkins  Coie, Jenner & Block, WilmerHale--investigated, denied access, sued for  representing the President's…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…shopkeepers, and assault people on the streets while leftist  politicians egged them on.\n\nWe see the growing physical attacks on law enforcement. The left used  the FBI to suppress debate on critical issues ranging from COVID  lockdowns to Biden family influence peddling to climate hysteria. It  has called for government commissions to regulate it. In…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…voice in their own government.\n\nYet despite widespread global condemnation, the acting Government of  Burma continues to entrench its power, exploit state resources, and  suppress democratic aspirations of its citizens, all while seeking  access to new streams of international financing.\n\nThe No New Burma Funds Act responds directly to this challenge…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…target our education system.\n\nOften disguised as cultural exchange programs, the CCP efforts to  infiltrate America's universities are intended to manipulate  curriculum, suppress academic freedom, and monitor Chinese students  here in the United States.\n\nLet's be clear. The Chinese Government isn't investing in these  programs to teach language. They…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Sanctuary cities are in open defiance of Federal law. They actively  prohibit their officials from cooperating with  Federal immigration officers. They release violent offenders, suppress  gang databases, and do everything in their power to prevent the men and  women in law enforcement from enforcing our laws. That is what they are  doing in sanctuary cities…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…increase in voter participation.\n\nWhy? Again, they would tell you if you actually increased the  integrity of elections by requiring picture ID that somehow it is going  to suppress votes, but the opposite happens, Mr. Speaker. What really  does happen is that voters now have confidence in the sanctity of  elections. More people will participate because…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…That is what is happening in California. There is this farce of  democracy, this fraud that the Governor is perpetrating on the  electorate. There is a systematic attempt to suppress voters in order  to return our State to the era of partisan gerrymandering.\n\nIndeed, we even now have reports that the leaders of the legislature  itself who pushed this measure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…it, we have been an abject failure.\n\nLet me tell you where your taxpayer dollars are really going. Where  they had been going is to pressure advertisers to demonetize and  suppress American political speech by naming the ten riskiest cites to  include the New York Post, the Federalist, Newsmax, The Blaze, The  Daily Wire, RealClearPolitics, Reason, One…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699045/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Governor has called a sudden, impromptu, off-year, low- turnout special election, asking a partial electorate to overturn the  will of our full electorate. To further suppress voter participation,  he has thrown election rules out the window in a hyper-accelerated  timeline unlike anything our State has ever seen, meaning fewer polling  places,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…have an opposition to  just doing something like that--but it is much more complex. Vertically  integrated health plans, pharmacy benefit managers, and other  intermediaries suppress competition, pocket valuable drug discounts,  and increase prices for consumers--all unrelated to the list price of  the drug.\n\nLast Congress, the Senate Finance Committee,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}]