[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…interest.  They go on to talk about facts. If you want to talk about people who  studied this, let's talk about the Department of Energy.\n\nThere is an LNG export terminal, I am sure you are aware of it, in  Freeport, Texas. In June 2022, it was shut down because of a fire for  about a month. That gave us real-time experiments on exactly what  happens when…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…anti-Semitism should work.  Mr. Van Drew has demonstrated that he certainly is willing to do that  and we are certainly grateful that he worked closely across the aisle  to make sure that this is not a partisan issue.\n\nMr. Speaker, as an American Jew, as a Member of Congress, if anti- Semitism is used as a partisan weapon, if Israel is used as a partisan…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…because they  trust him, and they look forward to the playful banter he brings along.  They know that he knows their names, their stories, and their teams.  They know he will make sure they leave with enough food for the week  and maybe a little extra.\n\nFresh is the longest serving employee at the Food Bank of Delaware.  He is a model for compassion, the kind…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…place,  participating families are saving over $1,000 a year. That doesn't make  up for the tariffs, the pain inflicted and the higher costs that people  are paying, but it will sure help. Every dollar will help working  families right now.\n\nIn Florida, I know my neighbors are very eager to take advantage of  the $346 million in cost savings that will come…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Speaker, I am so proud to stand here today to  talk about one of the most important leaders in the city of Chicago for  many, many years, helping person after person, making sure that his  community and our communities have been safe, to stand up and fight for  the people of the city of Chicago, a city that my colleague does not  really understand the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…All you have to do is go to the board of elections or BallotReady and  recognize that in 2024, in his last election, his opponent got 30  percent of the vote. I want to make sure that facts matter here, and  when there is misinformation, I wanted to clarify that.\n\nLet me go ahead and say at a moment when so many Members of Congress  have conceded their…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…people know whether they  are going to stand with them and the Nation's number one antipoverty  program for the elderly and children or stand with Elon Musk and Trump  to make sure that $2 trillion is cut so that it can make way for  further tax cuts for the Nation's wealthiest 1 percent.\n\nAt over $500 billion, I would think Mr. Musk might say: Do you…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…targeting organized labor, hardworking  men and women, including those who are part of the Federal workforce.\n\nWhat is it that Federal employees do each and every day to make sure  that they are providing services to the American people? The list is  too numerous to mention, but we know that hardworking Federal  employees, our public servants, each and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…it and to prevent others like it, they have our  appreciation and full support in their work.\n\nFinally, to my constituents, we will do anything and everything we  can to make sure a tragedy like this doesn't happen again.\n\nMr. Speaker, it will take a long time to come to terms with this  loss, but I know that our community is resilient. It has warmed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688367/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…name on the ballot, but when I  win, we are all going to Washington together. I made that promise  because, as a Representative of my district, it is my responsibility to  make sure that my constituents' needs are being addressed here in  Washington.\n\nThe people in Ohio's 13th Congressional District need lower costs.  The people in Ohio's 13th Congressional…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…We won't even know what we missed with some of these cuts. We won't  know what innovations we could have made but for these cuts.\n\nI want to end by saying that I am pretty sure these firings and cuts  to science and research aren't about waste, fraud, and abuse or  government efficiency. If they were and if this administration actually  cared about…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…reverse themselves.\n\nWe all support making Agencies like FEMA more efficient. Americans  support cutting waste. Americans support improving the Federal  response. But Americans sure as hell don't support DOGE-like cuts to  vital places that can often be the difference between life and death.\n\nThe American people do not support this kind of chaos, this chain-saw…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…contracts in  a timely manner. While there are many steps to onboarding new  clinicians at VA, including necessary processes such as credentialing  and privileging, we must make sure that VA does everything in its power  to bring new staff on quickly, especially in the case of prospective  providers who have proven themselves willing to serve the veteran…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695433/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…supplement the  contingency fund.\n\nBack in September, USDA's--the U.S. Department of Agriculture-- website noted that it planned to use the contingency funds in order to  make sure that SNAP was delivered in November, but then in October,  last month, it deleted that language, and the President said: My hands  are tied. America's most vulnerable families…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…hurting our  people, especially in New Mexico. It is not just the cost of healthcare  that is going up, but our hospitals, clinics, and providers who are  struggling to make sure that they can stay afloat, especially after the  big, ugly bill gutted and promised to take $1.5 trillion out of the  public healthcare system.\n\nIt is why I have been working…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…catastrophic flooding, and helped save 165 lives.\n\nThe men and women who serve in the Coast Guard carry out heroic acts  each and every day, and it is our responsibility to make sure that they  have the resources that they need to carry out their missions.\n\nI will take just a moment to thank my subcommittee staff who worked  tirelessly on this legislation:…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…on his retirement and thank him for 16 years of dedicated work  to the Pennsylvania Biotechnology Center and Baruch S. Blumberg  Institute. His leadership and dedication are sure to leave a lasting  mark on the community.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…income individuals of our society are taxed  at.\n\nThese small businesses are taxed at a significantly high rate,  oftentimes higher than other corporations. We need to make sure that  199A is extended and, if not just extended, made permanent. The Tax  Cuts and Jobs Act made our small businesses more competitive, and we  want to continue to pursue policies…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…awareness of important tools within States and localities.\n\nMany times, there are tools there that people or local governments  are not aware of. This is going to extend and make sure everybody is  aware of the full scope of tools that are available to address the  scourge of this fentanyl crisis.\n\nBy closing this knowledge gap, we are going to help patients,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that we  disagree with, my colleagues on the other side of the aisle want to try  to make this a partisan issue when, in fact, Senate Democrats were  equally involved in making sure that this provision got inserted. In  fact, they were very specific about only wanting a provision if it was  only focused on the Senate.\n\nThey didn't want it to be used, for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…murderers from Mexico, Sudan, Burma,  Laos, Guatemala, and Somalia. I wish I didn't have to continue to  repeat myself about what ICE is really doing. What ICE is about is  making sure that our streets are safer.\n\nAs for the claim about the One Big Beautiful Bill Act not doing what  it is supposed to and only giving tax cuts to  billionaires, I had mentioned,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…highest court,  actually turned that down and said: No, only citizens can vote in our  elections. That is New York State law, and that is our national law.\n\nI just want to make sure that that was your response to Mr. Burchett  to make sure you understood that we have addressed this in New York,  and we have established that only citizens can vote. We want…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…served as a police officer on the honor guard who has stood with  our colleagues in Boulder when they lost an officer in 2021 in an  active shooter event.\n\nI am focused on making sure that we have a conversation around how do  we prevent this from happening again. Unfortunately, in sanctuary  States like Colorado, local law enforcement is prohibited from…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…debate on an issue that has been important to me  ever since I got into public service. I think it is no small  coincidence as I was able to wear my kippah up there. I am not sure  whether that has happened before as a debate like this happened.\n\nI thank Representative Wasserman Schultz for bringing this forward  and saying that we should stand together…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…California, and the  immigration laws will not be enforced?\n\nI will tell you what would happen. What would happen is, in a given  period of time, I think we would find ourselves--I am sure it would be  easy to find 100 million Chinese who would come here; 100 million  people from  India could come here; or 100 million people from Africa would come  here. America…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…developmental disabilities.\n\nLaunched by Project Inspire, this league is about more than just  soccer. It is about bringing people together from all walks of life and  making sure that everyone has a chance to experience the joy and  connection of sports.\n\nToo often, athletes with special needs are left without access to the  kinds of opportunities so…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Geoffrey Nice KC, lead prosecutor of       Slobodan Milosevic at the International Criminal Tribunal for       the Former Yugoslavia (ICTY), has concluded ``unanimously,       and sure beyond reasonable doubt--that in China forced organ       harvesting from prisoners of conscience has been practiced       for a substantial period of time involving a very…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…accomplished. Our aviation system is fragile,  and over the last year, Congress has passed significant legislation  investing in that airspace to increase the safety and to make sure that  all who fly can be and are safe and feel safe.\n\nNow is not the time to take any steps backward, and that is what we  were worried and concerned about that the NDAA provision…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…authority when it  comes to the Federal enclave.\n\nHe also talked about Florida's laws. Let's be very clear: Florida has  established itself as a beacon of law and order, making sure that our  citizens are safe throughout all of our jurisdictions. If there are  some abilities for some measures of flexibility, Florida has proven,  beyond a shadow of a doubt,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…29 from Wichita, KS, to Washington, DC, we should be  doing everything we can to make certain that our air traffic system and  the necessary components are in place to make sure that traveling  American citizens and the citizens of the world who use our airline  system have a safe and secure flight when they board a plane in the  United States. The…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]