[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…there are acronyms all over our  Nation's Capital. WIC is the program for Women, Infants, and Children.\n\nHow are we going to make decisions across the country to make sure  that we are going to provide food for the most vulnerable in the  richest Nation in the world? Everyone seems to be worried about that  except for President Donald Trump.\n\nThe reason…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…something that just stuck. He said: If you pull the thread of Medicaid  out of my life, it will unravel.\n\nHe had been sleeping in his car before Medicaid. He wasn't sure if he  was going to have employment before Medicaid. And even he and his wife  thought about what impact it might have, whether they were able to stay  married or whether he would have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…from Connecticut (Ms. DeLauro),  the leader on our side of the aisle on the Committee on Appropriations,  for initiating this effort. I took this time because I am not sure we  are going to have time on the other bill. I urge Members on the  Republican side of the aisle, do not object to this unanimous consent  because it does what Republicans say we…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700218/homeowner-energy-freedom-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…day, to  whitewash it and to pretend it was a normal tourist visit. I was here,  Mr. Speaker, here in this Chamber where you are sitting right now, and  you can be damn sure I am not going to let anyone pretend that January  6 was a normal tourist visit. However, Republicans, the gentleman from  Virginia included, refuse to even display a plaque to honor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Friday, and they have no choice but to  charge consumers more. Their most popular product comes from Brazil. So  this is a big hit to their business, and they can't be sure how this is  going to impact their sales.\n\nWe should be clear: The United States has a trade surplus with  Brazil. This threat is just because the President wants Brazil's  independent…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…people, Lester said, and not knowing what  the price is going to be because of a stalemate in Congress adds  uncertainty. Everybody is feeling the anxiety.\n\nLester is not sure what he is going to do. I have told stories of  constituents in Virginia who found a plan they could afford but with  higher deductibles. They are worried. They say they are just going…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…nuclear. We listened to him talk about how he was going to  get North Korea. I support efforts to try to do that.\n\nIf we ever succeed in getting one of these deals, for sure we are  going to need to have experts we trust that can go in there and make  sure nobody is cheating. Unfortunately, what we are seeing is the  gutting of those budgets in that capacity.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…effect of tariffs, the price effect of retaliatory tariffs, but some  are also being driven by the uncertainty.\n\nThere is a chaos penalty on the economy. When you are not sure what  is going to happen, you slow your investments, and that is why you see  a decline in manufacturing.\n\nThe Trump new sales tax, again, as proof from Reuters, ``Trump  tariffs would…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…financial institutions, when they say ``chaos,'' they  grab on tightly and say ``We better not lower anything. We better keep  things high because we are not exactly sure what is going to happen''  because when there is chaos in the Fed, there is chaos across the  economy, and rates go up.\n\nThat is what financial institutions do in times of uncertainty.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…tariff  taxes will be felt by small businesses in all of our States.\n\nI was here, a month ago today, sharing stories from businessowners in  New Hampshire who weren't sure how they were going to keep operating if  specialized machinery that they can only get from Canada suddenly costs  25 percent more. Since that time, I have heard from even more people…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…served their needs?\n\nI worry about that. I worry about that mother who wakes up one  morning, bleeding, 9 weeks away from her due date who goes to the  hospital and isn't sure how she is going to pay that bill, if she makes  it.\n\nI worry about that mother whose child has to stay in the NICU for 6  weeks who doesn't know how she is going to pay that bill.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Do not tarry in the evacuation. If evacuations are requested, please  comply. These are very drastic situations, and we need the public to  understand that. So I am sure you are going to hear a lot more from  your local forecasters, your county executives, your emergency response  teams, but just know that we are under an unbelievable weather event,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…history of the country--one of the most  unpopular bills in the history of the country. Now that it is law, we  don't have to imagine anymore what might happen; we know for sure what  is going to happen to tens of millions of people all across the  country.\n\nI want to focus on five things that are going to happen--five things  that are going to happen because…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…10 percent.\n\nNow, what does that mean? That means we are not going to tell our  friends in local government whether to increase housing starts or  decrease, and we are sure not going to tell them how to do it. They  don't have to do a damn thing if they don't want to. But if they do  increase housing starts, they are going to get extra money from the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…amendment.\n\nMr. LEE. Mr. President, the fact that the acting president and CEO is  a DOGE individual doesn't disqualify him from making this statement. It  is corruption. Sure, it has been going on since the eighties, but so  have a lot of things that are corrupt. We must defund this now.                                Vote on Motion", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…rat's rear who  they are, how great they are, how spectacular they may be--I don't care  what their credentials are--the message to me is I have to vote no. We  darned sure aren't going to let them have it the easy way. We are  darned sure never going to do 46 percent of the next President's  nominees with a voice vote or unanimous consent because the…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, I am sure what you are going to  hear on the floor today is what you have heard in the past, these  rumors that somehow those mean, nasty Republicans are going to cut  Medicaid.\n\nIt reminds me…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…not practical, and that is not what the Founders meant.  They put a single person in charge of the military, and that was the  President of the United States. They made sure that going to war was a  group decision. And in this country, we have used that process five  times in 250 years.\n\nSo not only did President Trump have the constitutional authority…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}]