[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "I will do whatever it takes to push back and to make sure that  every vulnerable American has the services that they need.", "title": "Medicaid", "date": "2025-02-26"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "I first want to thank my colleague for taking the floor and showing  the American people how horrible this administration is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "I ask you and all of my colleagues  who I serve with to make sure that we protect Social Security, keep it  solvent, and ensure that we are protecting the benefits that they have  earned for hard work over several years and decades of service.", "title": "Social Security Administration is There to Help, Not Hurt, Americans", "date": "2025-04-30"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Now, the problem is, I find nominees' statements hard to believe up  against the power of that pressure from the White House and from Musk  and from the Secretary of Commerce and from whoever else is trying to  accomplish the Republican extremist goal for decades of getting rid of  Social Security.", "title": "Nomination of Frank Bisignano", "date": "2025-05-05"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "With Canada, Texas buys steel and  lumber to build homes to ensure families have a roof over their heads.", "title": "Understanding Tariffs", "date": "2025-03-26"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "It provides  oversight and makes targeted investments that directly help States and  local communities to make sure that we help folks like firefighters and  other folks.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "But  we must be vigilant in making sure there is a real and thorough  drawdown.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "I reject this bill that will close hospitals and kick people out of  their nursing homes--not only in my district but across the country,  especially in urban inner-city communities and rural communities for  sure.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Speaker, what about the accountability for making sure that  election officials don't screw up and tell a citizen of this country  that they don't get to vote?", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-01"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "They know he will make sure they leave with enough food for the week  and maybe a little extra.", "title": "Recognizing Shae Parks", "date": "2025-11-19"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "If  Congress doesn't act to pass this measure, Americans will be forced to  jump through more hoops just to get health insurance, and 1.8 million  Americans will lose their coverage.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "I want to end by saying that I am pretty sure these firings and cuts  to science and research aren't about waste, fraud, and abuse or  government efficiency.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "For many years, the Health Professionals Scholarship Program has  allowed VA to provide financial assistance to future medical  professionals in return for a promise of service at VA facilities to  ensure VA can meet its staffing needs.", "title": "Health Professionals Scholarship Program Improvement Act of 2025", "date": null}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Those funds are funds that were needed to  ensure that our kids get a great education.", "title": "School Funding Slashed", "date": null}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "We will make sure that they stop  allowing and don't allow noncitizens to vote in their municipal  elections because we are exercising our constitutional responsibility  to protect our elections.", "title": "Prohibiting Voting By Noncitizens in District of Columbia Elections", "date": "2025-06-10"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "By every measure, Taiwan is a sovereign, democratic, and independent  nation, and any claims to the contrary are simply false.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "We finally have a secure border, thanks to the work of our  President leading by example and making sure now, with the big,  beautiful bill, they will actually have the funding to make sure that  is a long-term solution.", "title": "Elections Matter", "date": "2025-06-24"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "The Wall Street Journal, just this week, aptly summed up the current  crisis stating: We ``have a system under pressure that now just has  another 100 pounds of weight on it.''\n\nThe failure to pass a continuing resolution is slowly crushing our  aviation system.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "James Lankford", "party": "Republican", "sentence": "The specific question was: How  can we make sure that this is not a rule; that this is an order?", "title": "Congressional Review Act", "date": "2025-05-22"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "I am really looking forward to hearing from my good friend from  New Mexico on why they are going to object, but I am pretty sure I know  why.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Extension of Deadlines in Standards of Performance for New, Reconstructed, and Modified Sources and Emissions Guidelines for Existing Sources: Oil and Natural Gas Sector Climate", "date": "2025-11-19"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Remember the statistics of how well people do here and make sure that  our next generation is not polluted by this because we have way too  many people floating around this country who got a certificate in DEI  or a major in DEI, and they are up to no good.", "title": "Diversity, Equity, and Inclusion", "date": "2025-04-07"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "We may come at these things from slightly different perspectives on  different issues that come before us, but we are bound and joined  together here in wanting some commonsense, good government to make sure  that we know what we are dealing with, with respect to criminal laws.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I can assure you that this Senator will be on the lookout for any  destabilizing actions that threaten the peace in Bosnia.", "title": "Bosnia", "date": "2025-11-05"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Finally, Congress needs to ensure that we continue good stewardship  of hard-earned taxpayer dollars.", "title": "Following Through on Americans' Priorities", "date": "2026-01-08"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Back in 2023, it was my distinct pleasure to have Commander Taylor  Burks of Missouri's Fourth Congressional District testify at a Small  Business Committee hearing on veteran entrepreneurship.", "title": "Successful Entrepreneurship for Reservists and Veterans Act", "date": "2025-02-24"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "From helping guide messaging on vital legislation and making sure  that the media is getting the real story to amplifying Members'  priorities and offering advice to aspiring communicators, I can  guarantee that almost all of your comms directors have worked with  Lauren at some point in time.", "title": "Recognizing Lauren Fine", "date": null}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "In his pursuit of ensuring the safe operations of  the campus, he led two expansions during his tenure that improved  infrastructure for the biotech research teams, bringing old lab spaces  up to code to ensure that the latest safety and technical requirements  were being met.", "title": "Recognizing Mr. Konrad Kroszner's 16 Years with the Pennsylvania Biotechnology Center and Baruch S. Blumberg Institute", "date": "2025-11-18"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Charlie believed in the promise of  America, and his life's work  was making sure we lived up to that promise.", "title": "We Are Better Together", "date": null}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "The people  who I have spoken with, the landowners, the Alaska Natives, who were  not consulted by the previous administration in the development and  approval of this resource management plan, have stepped forward and  said: We need to remove  this plan, and we need to make sure that something like this does not  happen again in the future.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": null}]