[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Representatives Chu, Finstad, and McIver, will strengthen and grow the  SBIC program by allowing banks and Federal savings associations to  invest up to 15 percent of their capital and surplus into SBICs.\n\nThis change will correct a discrepancy caused by a historical  drafting oversight and bring the Small Business Investment Act of 1958  in line with the Office…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…innovation,  entrepreneurship, and growth in our small businesses nationwide.\n\nCurrently, banking rules allow financial institutions to invest up to  15 percent of their capital and surplus in SBICs. Small business  investing rules cap these same investments far lower at just 5 percent  of capital and surplus.\n\nThe Investing in Main Street Act of 2025 simply…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…body--finally,  enough is enough; we are asserting our power. You are not going to be  able to just put a 40-percent tariff on Brazil, a country with which we  have a trade surplus, simply because the guy is facing a trial there,  and the President doesn't like it. No, this is not how this works. It  is not how it works under the Constitution. It is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…comes from Brazil. So  this is a big hit to their business, and they can't be sure how this is  going to impact their sales.\n\nWe should be clear: The United States has a trade surplus with  Brazil. This threat is just because the President wants Brazil's  independent judiciary to stop the prosecution of Brazil's former  President.\n\nHow is any business supposed…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…goes on from there.\n\nThe President claimed that there was a national emergency in Brazil  to justify slapping a 50 percent tariff on a country where the U.S. has  run a trade surplus for over a decade. There is no emergency.\n\nHe shouted about the Epstein files, and now his administration is  saying there are no such files.\n\nThis all, once again, is to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…from those of  a business or family budget. Revenues come from taxes and fees, and  expenses from government operations. When revenues exceed expenses, the  government runs a surplus. When expenses exceed revenues, the  government runs a deficit.\n\nThe federal budget operates on a fiscal year, meaning surpluses and  deficits are calculated annually. When…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…claim can be made that they are either catastrophic or       constitute a national emergency.\n\nIn technical terms, the U.S. current account deficit is       offset by a surplus in the capital account. There is no       inherent threat to our economy if our trading partners invest       in U.S. companies or buy Treasury bonds instead of purchasing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…we voted on yesterday suspending  the emergency authority on which the President was acting to impose a  tariff on Brazil, a country, by the way, with whom we have a trade  surplus.\n\nWe are 9 months into this trade war with tariffs at the forefront. It  is a war with Canada. It sort of started with them. That is a big deal  for Vermont. We are a border…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…unemployment and inflation rates reached their lowest  levels since the 1960s. Unfortunately, that was the first time since  1969 that our country had experienced a budget surplus, and  unfortunately we have not achieved it since.\n\nBut the moral of the story is that progress is possible when we set  politics aside, work in a bipartisan way, and enact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…another extreme proposal that riddles  our gun laws with loopholes and politicizes what should have been a  simple, bipartisan measure.\n\nThe bill before us today would allow surplus firearms to be sold not  only to active Federal law enforcement officers in good standing, but  also to retired law enforcement officers.\n\nBecause the bill now has no background…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, the United States has not had a trade  surplus in over half a century. Trade deficits translate into lost jobs  and lost wealth for the American people. Balancing U.S. trade accounts  is an imperative and a worthy objective,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…acre parcel of land in Kentucky to the city of Paducah through the  Federal Lands to Parks Program.\n\nThis program allows States, counties, and local governments to  acquire surplus land for public recreational purposes, an incredibly  impactful alternative to the Trump administration's public lands  selloff scheme.\n\nAlthough the land was conveyed to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…yet again,  there were massive tax cuts for the wealthy, the well-off, and the  well-connected.\n\nIn fact, the Republican President at that time in 2001 inherited a  budget surplus from President Bill Clinton and immediately turned  around and took that budget surplus and turned it into a deficit. He  exploded the debt.\n\nDon't ever lecture us about fiscal…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…funds to the CVF. We include specific protections  for government reimbursement and whistleblower rewards. Those dollars  remain untouched. This bill simply ensures that the surplus damages  collected from those found liable for fraud in Federal court are used  to support victims of crime.\n\nThis temporary infusion of resources will stabilize the CVF,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…understood, the art of self-government is about people's  ability to rely on themselves. There was always trade, of course--this  is a natural and good privilege of productive surplus economies--but in  a republic, there was also trade between sovereign, self-sufficient  communities. The citizen of the classical republic had no need for  cheap trinkets,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…We don't  want excuses. We expect results.\n\nAfter President Trump's first term, the Biden administration  inherited near-record lows in inflation and an agricultural trade  surplus of $6 billion. After 4 years of failed Democratic policies, we  were left with a 21.5 percent increase in prices and an agricultural  trade deficit of $40 billion.\n\nWhen a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Institutions. Sec. 610. American Access to Banking. Sec. 611. Promoting New Bank Formation. Sec. 612. Rural Depositories Revitalization Study. Sec. 613. Discretionary Surplus Fund.               TITLE I--BUILDING SMARTER FOR THE 21ST CENTURY       SEC. 101. HOUSING SUPPLY FRAMEWORKS.\n\n(a) Definitions.--In this section:\n\n(1) Affordable housing.--The…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to  address today.\n\nBy the way, this is relevant whether we are running a $1 trillion or  over a $1 trillion increase in debt every year, or whether we were, in  fact, in a surplus situation.\n\nI am going to look at some programs, which, again, maybe  intentionally, maybe unintentionally, penalize people who are raising  children while they are married.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "French Hill", "party": "Republican", "sentence": "…would collect $3 million in additional fees       over the 2025-2035 period to cover operating costs.\n\nFinally, section 315 would reduce the size of the Federal       Reserve's surplus fund. CBO estimates that enacting that       provision would increase remittances to the Treasury by $15       million in 2035.\n\nCBO estimates that enacting H.R. 3633 would…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}]