[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…factories to produce  cruise missiles, and so, nightly, Ukraine is hammered with hundreds  now. So it just means more resolve by the United States, more resolve  by Europe.\n\nI am surprised to hear that the Europeans collectively are spending  more on defense than the United States. If that had been a trivia  question, I would have failed. But there it is, and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…consumers would  vote for electric cars if there were more charging stations, if there  were batteries that took them longer distances without having to  recharge.\n\nI am kind of surprised that the President of the United States isn't  having a showroom on the White House lawn for all electric vehicles,  not just for Elon Musk's Tesla. Why not provide that…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…the American Cancer Society and their  partners, our bill has bipartisan support. Mr. Speaker, 295 House  Members and 62 Senators have cosponsored it.\n\nLast Congress, Jodey surprised me by renaming the legislation in  honor of my late mother, Nancy Gardner Sewell, of Selma, Alabama, who  passed away in 2021 from pancreatic cancer.\n\nWho was she?\n\nMy mom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…retroactively rewrite  the law and set up the opportunity for special financial payments to a  select group of Senators.\n\nWhen our House colleagues learned of this, they were as surprised as  most all of us that were here in this Chamber. Our House colleagues did  the right thing. They quickly and unanimously--that is right, the House  unanimously--that doesn't…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…the Constitution. He doesn't have a mandate. He doesn't  have the votes in Congress, and he doesn't have a legal agenda, so he  wants to ignore the law.\n\nWe should not be surprised by this. Trump said he was going to be a  dictator on day one. He told us this is what he was going to do. I  personally don't know of any dictators who stop being a dictator…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…crisis--\n\nI am going to pause there. When I ran for President and moved around  the country, in townhall meeting after townhall meeting after townhall  meeting, I was even surprised with how many Americans--I don't think we  had a townhall where someone didn't want to stand up and tell me about  the mental health crisis in America and how poorly we were…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…tariffs, the uncertainty is as difficult for them as the tariffs.\n\nSo I am disappointed that Senator Crapo decided to block this  commonsense legislation. Sadly, I am not surprised. But this bill would  do so much to help families and businesses in all of our States. It  would shield them from higher costs.\n\nWe have been hearing about some of these…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…President, and others to discuss highly, highly  sensitive and imminent attack plans, but they also bungled their way  into adding a random person into the chat.\n\nWe should not be surprised in the slightest that the Trump  administration treats our Nation's secrets this way. This is the same  man, after all, who had our nuclear codes sitting in his bathroom…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the bone in order to  finance a tax cut for the very, very wealthy.\n\nOne of the things I just wanted to set up for you here is, you know,  just to note that Americans may be surprised to know that 24 percent of  Americans are actually on Medicaid today, because some Americans may  say: Well, my insurance isn't Medicaid. My insurance is through  MississippiCAN.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…more likely to respond by  passing legislation that benefits corporations and the richest  Americans while making life more expensive for middle-class Americans.  If you are surprised about affordability, Mr. President, this is how  real Americans have to live because of your policies and the people who  preceded you.\n\nOur Nation and the world are experiencing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…have on the health and the well-being of people in Louisiana and  all across the country.\n\nThey have accused us of fear-mongering and making misrepresentations,  and so I was surprised to learn, Mr. Speaker, that the Louisiana State  Legislature--the Louisiana State Legislature that has a Republican  supermajority--the Louisiana State Legislature recently…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…same from them. They  refuse to address healthcare affordability, and this afternoon, they  continue to ignore the crisis with regard to electricity.\n\nI guess we shouldn't be surprised. After all, they just blindly  follow President Trump, who simply does not care. He does not believe  the affordability crisis is real. In fact, he recently said:  ``Affordability…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…a  machine but from a person, concerning their hard-earned benefits. These  are just more ways to cause Americans to question this vital Federal  program so that nobody is surprised if, one day, the payments are late  or the trust fund is insufficient.\n\nWe have had one current Member of the United States Senate, a  Republican, who has declared that what…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Homeland Security Appropriations Act of  2024, which is Public Law 118-47.\n\nAm I shocked? Let me be honest. I am not shocked. We were illegally  denied entry. While we weren't surprised, it was pretty disrespectful  for Members of Congress to not be able to do their job.\n\nI want my colleagues to visualize this. There are four Members of  Congress, all of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump's campaign. They literally bought votes  during the last election and even sponsored Stalinist military parades  to celebrate the President's birthday.\n\nNo one should be surprised that these same Republicans' next order of  business is to validate, legitimize, and endorse the Trump family's  corruption and efforts to sell the White House to the highest…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…another  one that changed the end date, in that case, from March 31 to January  30.\n\nJanuary 30 was set to be the agreed upon end day for this accounting  trick. So I was pretty surprised when January 30 comes and goes, and  then we get this new provision saying: No we are actually now going to  extend this all the way out to July 31.\n\nLet's go out further…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…issue. Everyone, on both sides of  the aisle, should want our government to operate as effectively and  efficiently as possible.''\n\nHe adds: ``Outrage over Elon Musk's email surprised me.\n\n``I couldn't believe the outrage on social media and broadcast news  because DOGE asked government employees to write down five things they  did at work the previous…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…that Congress doesn't have  the stomach--but the reality is we don't have the guts, Mr. Speaker--to  sacrifice their own bottom line for the good of the country. I hope I  am surprised, and I hope that Congress takes action. I doubt we will,  seriously.\n\nMr. Speaker, we are public servants. We serve the people who we  represent. We aren't elected to come…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…I disagreed with, but I think they  did it for the right reasons. It is just another example of where--in  this case, according to the President's public comments, he was  surprised about the indictment. It is another example of who in there  thought this was a good idea?\n\nNow, because it is a current investigation, we will just have to wait  and figure…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…congressional disapproval procedure  under the Congressional Review Act, or CRA, to restore coal leasing in  Wyoming's Powder River Basin.\n\nMany on the East Coast of America might be surprised to learn that  the Federal Government owns massive amounts of the western States.\n\nIn Wyoming, the Federal Government owns about half of our surface  estate and 60 percent…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…person.\n\nThe Founding Fathers empowered Congress with tools to ensure that the  liberties of the people would not be threatened by one-person rule. The  Founders would not be surprised that the Executive would attempt to  aggrandize power at the expense of the legislature. They would have  expected it. Indeed, they did expect it. But they would be surprised--…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Speaker, or if it is built into  your machine, then that is going to cost more, and it is unnecessary.  We are making everything more complicated.\n\nMr. Speaker, you will be surprised to know that at one time in my  life I was a Virginia certified pool operator. That is why I brought  this over. I keep this on my desk. When the baby pool pump--that would…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Venezuela.''\n\nI guess any jurisdiction that would elect a new mayor like a  democratic socialist, Mamdani, that is probably what you would expect.  So I don't think anyone was surprised.\n\nBut the message of Operation Absolute Resolve to our allies and  adversaries around the world could not be more clear: America is back.  The Trump administration will act…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the President's  desk.\n\nMr. Speaker, if you told the American people that wasteful spending  overtook Washington during the Biden-Harris administration, they would  not be surprised. Their jaws would not drop, and their pupils would not  dilate in utter shock.\n\nThe American people saw the fiscal ruin that was created by the  previous administration.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…behalf  of taxpayers actually has a clearly defined and reinforced independence  from the IRS.\n\nMr. SMITH of Missouri. Mr. Speaker, I imagine the American people  would be surprised and no doubt disappointed to learn that the very  organization whose mission it is to advocate on behalf of taxpayers  relies on legal advice provided by attorneys who are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…exclusive of her husband's deployment. This customer       approached me in church with her head down, saying that she       was having a tough time with things. Some expenses surprised       her, and she was suddenly out of money for the month. She was       okay, as she had groceries, gas, and her bills paid, until       she got a flat tire on the way…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…over the other. That  argument is irrelevant because I am passing a Democrat bill and a  Republican bill. So this is even stephen when it comes to the parties.\n\nI am very surprised that he is objecting on behalf of Senator Padilla  because, when Senator Padilla objected to my bill a month ago, he  literally said: Hey, Dan, work with us. Pair it with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…never  compete in women's sports in California again.\n\nToday, the Governor, on his newly established podcast called ``This  is Gavin Newsom,'' came out with a statement that surprised many on  this topic. He said that when it comes to men competing in women's  sports, he said: ``I think it is an issue of fairness.'' It is an issue  of fairness. ``It is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…For example,  cross-checking applications for unemployment against the prison rolls,  something that almost every other State did, and California didn't do.  I would not be surprised to learn that there were similar oversights  here with respect to the community college fraud.\n\nWe look forward to getting back the results of this investigation,  and urge…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…mentioned before one of the crises we have in the  United States is we don't have enough young people? We have introduced  a talent-based immigration bill. Now, I am actually surprised I haven't  taken more beatings, but I am sure they are coming.\n\nWe are functionally the only country left in the industrialized world  that uses a familial-based immigration…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}]