[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Along with his wife, Reverend Viviana DeCohen, he has led his home  congregation in worship, Bible study, and community outreach to those  in need in the Mount Vernon and surrounding communities. He serves as  president and chair of the United Black Clergy of Westchester County.\n\nHe is living Matthew 25's spiritual direction every day to show faith…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…certainty. I really don't understand  why House Republicans are so fixated on trying to repeal and block the  work of the EPA.\n\nMadam Speaker, for the health of workers and the surrounding  communities and for the sake of clean air, I urge all of my colleagues  to vote ``no'' on this resolution that puts the whims of billionaires  and corporate polluters before…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…of rubber and tire manufacturing. This industry has provided decades  of local jobs, economic development, and financial stability to  countless families in Akron and the surrounding area.\n\nWithout rubber manufacturing, Akron would not be what it is today. In  fact, Mr. Speaker, my family fled the segregated South to find jobs in  these rubber factories,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…energy power  source? Many of them are already permitted and constructed.\n\nIn April, the administration issued a stop-work order for the Empire  Wind offshore wind project surrounding New York. Even though the order  was lifted in May, that delay cost the developer $955 million.\n\nThe President is actively trying to revoke permits for the Revolution  Wind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Chief. While in this position of leadership, he did a commendable job  modernizing and expanding North Metro Fire, and he improved  collaboration for emergency services in surrounding communities.\n\nChief Ramos honorably served this community for decades through  numerous challenges, and he has been widely regarded as a mentor and a  friend to many. Throughout…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695834/recognizing-fire-chief-david-ramos"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…have today.\n\nIn California, we have been dealing with the impacts of air pollution  for a long time. California's unique geography, with its valleys,  coastal basins, and surrounding mountain ranges, creates natural  barriers that trap pollutants and contribute to unique air pollution  challenges. As a State, we have long recognized the dangers of air…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…out military or economic action against the sovereign  country;\n\nFive, annexation of the Gaza Strip, involving the forced resettlement  of the Palestinian population to the surrounding countries. Donald John  Trump has stated that the United States will take over the Gaza Strip  and own it. His proposal of taking over the Gaza Strip and the  expulsion…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…crimes and instead stand firm in protecting the       women and children he harmed. Stand up against abuse of       power. Take action to end the silence and speculation       surrounding this criminal. There should be equal protection       under the laws in the United States of America. This is one       country, not two. The rich and powerful should answer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…the Las Vegas  Valley. Mountain's Edge sits at the foothills of the Spring Mountains,  and was envisioned as a place where residents could live, work, and  thrive with the surrounding natural beauty.\n\nOver the past two decades, that vision has become a reality for the  more than 40,000 people that call Mountain's Edge home Today, its  residents can enjoy…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…call. I expect him and Secretary  Hegseth to come tomorrow prepared to answer tough questions from  Senators about what exactly is going on with our forces in the  territory surrounding Venezuela. The Senate also demands to see the  full and unedited tapes showing exactly what happened during strikes on  the alleged drug boat on September 2.\n\nLast week,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…grow and  prosper while facing serious piracy threats. We cannot allow violent  criminals and terrorists to continue stunting the economic development  of Somalia and the surrounding region.\n\nBeyond direct threats to the United States and Somalia, piracy is  often linked to terrorism and crime. This bill reaffirms the United  States' position as a global…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, I also want to draw attention to the  crisis surrounding medical research in this country, created entirely  by this new Trump administration.\n\nTen years ago, I met with Dr. Francis Collins, then the Director of  the National…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…providing backup. Had it not been for that footage, which was recorded  and released by that local police department, the public would not have  had access to the circumstances surrounding Mr. Ghaisar's death.  Moreover, the footage revealed concerns about the Park Police's pursuit  and engagement policies.\n\nBody and dashboard cameras for federal law enforcement…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…steady heart of Dino's Family  Restaurant in Maumee. I know Dino defines family not just as his family  but the family he created, as he created  community in Maumee and the surrounding neighborhoods.\n\nFor more than two decades, Tim showed up before dawn, fed neighbors  with kindness, and reminded us that dignity lives in every service. His  tragic loss…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…host. They have failed to adequately  police harmful content on their sites, despite their terms and  conditions mandating them to do so.\n\nWhile most of the conversation surrounding section 230 focuses on Big  Tech, it is important to take into consideration small community-based  platforms that are also protected by section 230. These platforms do…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…assist states in assuming their own 404       permitting authority, this bill requires the Environmental       Protection Agency to review its regulations and procedures       surrounding the 404 approval process. This will help       streamline and ease administrative burdens states face when       attempting to assume their own permitting program.\n\nA key…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the University of  Utah Research Park Act, which passed unanimously out of the Natural  Resources Committee in September.\n\nThis legislation addresses legal uncertainties surrounding the  University of Utah's use of land initially conveyed to the school by  the Bureau of Land Management back in 1968. At that time, the  university requested land on the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…bolster United States energy security,  foster economic growth, and promote environmental sustainability. At  its very core, the bill aims to streamline the regulatory process  surrounding the exportation of LNG, thereby unleashing the full  potential of America's abundant natural resources.\n\nNow in north central Florida, not many people know this, but we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…80 acres of BLM land that will be transferred into trust for the Tribe.  These parcels have suffered from various management issues, which have  led the Tribe and other surrounding landowners to raise concerns about  increased wildfire risk. Despite lacking ownership, the Tribe has  performed needed management functions on this land, a fact that  reflects…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and colleague from Arkansas, Representative Hill.\n\nThis legislation directs the Secretary of Agriculture to convey a  vacant Forest Service building and less than 1 acre of surrounding land  in Perryville, Arkansas, to Perry County.\n\nThis property has sat vacant for years, and the Forest Service has no  plans for its use. In the meantime, the building…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…founding as a volunteer fire department in 1875, the WFD has  grown into a career department, providing essential fire protection  services to the residents of Westfield and the surrounding area. Over  the past 150 years, they have answered the call in times of need--often  under dangerous and demanding conditions--a true testament to the  courage, duty, and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692630/recognizing-the-westfield-fire-department-on-their-150th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…false tax returns, and making false statements  to the FBI. The main conduct being alleged involves theft of campaign  funds totaling $225,000, tax fraud, as well as fraud surrounding a PPE  loan.\n\nThe indictment lists a number of co-conspirators, including the  former chief of staff for California's attorney general, including a  high-powered lobbyist,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…original  intent of our Federal land management agencies: supporting multiple use  and healthy forests through proactive management strategies while  meeting the needs of surrounding communities.\n\nI appreciate all of the Wyoming stakeholders who brought this issue  to my attention and have remained engaged on this legislation  throughout its consideration…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…leasing, the mine wouldn't be able to access  additional reserves and would have to close. In doing so, the mine  would have to lay off hundreds of workers and devastate the surrounding  communities that depend on the coal mining industry to drive their  local economies.\n\nWith tears in his eyes, this electrician asked me to save his job and  save his livelihood…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rehabilitate and rebuild the  Bolts Ditch Headgate prevented new development in the area, which would  have required the expansion of Bolts Lake to provide a water supply for  surrounding homes.\n\nCongress corrected this error in 2019 by allowing the town of Minturn  to access Bolts Ditch for maintenance and repairs. H.R. 1729 builds on  this legislation by…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…small- scale manufacturing that proved to be not only self-sufficient but also  the backbone of its economy. By the mid-19th century, improved roads  connected Leeds to other surrounding communities that made it a center  for agriculture and, eventually, recreation. Today, Leeds' natural  beauty has led to the rise of boating and fishing on Androscoggin…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…generated by investments selected and monitored  by plan fiduciaries.\n\nWhat does that mean in plain English? It means basically, do you want  to be involved in the decisions surrounding your investments?\n\nMost defined contribution plans, like 401(k) plans allow participants  to direct their investments from a menu of options selected by  investment fiduciaries,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…built over these  past 100 years will only continue to grow in the years to come. Their  efforts have made a lasting and meaningful impact in the city of  Lincoln and the surrounding region, contributing towards the quality of  life and well-being in our community.\n\nIt is my distinct honor to represent exemplary organizations, such as  the Rotary Club…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the NTSB, Jennifer Homendy, took the  unprecedented step of publicly stating that the National Defense  Authorization Act does not adequately address the safety concerns  surrounding the mixed airspace at DCA.\n\nAnd while the NDAA is critical to bolstering our defense  capabilities, I have major concerns with the portion of the bill that  is being fixed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…average permitting length  of an original license process spans from 5 to 7 years, and the average  relicensing process takes between 7 and 10 years.\n\nTo increase transparency surrounding the status of hydropower  licensing and relicensing applications, H.R. 3657 would require an  annual report from FERC to Congress detailing the status of projects  that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}]