[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…everyday experience,       and it is time for all of us to concern ourselves with the       way real people live in real life.\n\nThe great question of the seventies is, shall we surrender       to our surroundings, or shall we make our peace with nature       and begin to make reparations for the damage we have done to       our air, to our land, and to our…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…or not, let's not leave it up to chance.\n\nThe decision of whether to make war is perhaps the most important  responsibility Congress has under the Constitution. Let's not surrender  our responsibility to a President who speaks so casually about taking  over other nations. Our men and women in uniform deserve better than  that, and our country deserves…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…friends, pay attention. Be informed. If we want to understand how a  tyranny operates, look at the film on YouTube. It takes 30 minutes. It  is called, ``Freedom Means Never Surrender.'' It is a documentary about  how a tyranny functions. It just won the Telly Award. Take the time to  do it. Recall the preciousness of the liberty we enjoy.\n\nMr. Speaker,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…about. There are many  people who have said to me that the tie is old, that it appears to be  soiled and stained, but it is my favorite tie. It is a tie that I will  never surrender. It is a tie that means something to me because it  stands for something.\n\nIt stands for the Pledge of Allegiance. More appropriately, it stands  for some specific words…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…due process, and the 10th Amendment, rights that are  reserved for the States and the people from the Federal Government.\n\nOur rights don't come with an asterisk. We don't surrender the First  Amendment or any others to political convenience.\n\nOn this Constitution Day, let us remember the greatest threat to  democracy is not exercising our rights. It…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…You want to disappear people from California? Just say that new  members of the latest criminal organization were found crossing the  southern border. You want Americans to surrender their rights? Well,  fearmonger and tell them that a special interest alien from a criminal  organization is operating a cell in their neighborhood.\n\nThe Trump administration…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…or may not become a  member of the NATO alliance, just as his Soviet predecessors could not  stop the membership prospects of Poland or Hungary or Germany. To  preemptively surrender admission to NATO is national security  malpractice and only benefits Vladimir Putin.\n\nFinally, Secretary Hegseth declared that Europe and NATO are no  longer priorities…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tax giveaways to the wealthy.\n\nThis is not beautiful. It is ugly. It is revolting.\n\nAs the bill proceeds, perhaps the most dramatic change that occurred  overnight is the surrender of America's clean energy future to China.  Republicans are condemning Americans to higher energy costs and killing  hundreds of thousands--even millions--of good-paying…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the county of Kent''--\n\nThat would be Kent County, RI--\n\n``I am the sheriff of the county of Kent, God damn you. I       have a warrant to apprehend you, God damn you. So surrender,       God damn you.''\n\nThe officer drew his sword and repeated his warning. Some       of the sailors under his command joined him, weapons at the       ready.\n\nIn one of…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…dictators, charlatans, plunderers, and fools?\n\nYour call is to bold leadership from a new generation of freedom  lovers. Let us all rise to answer that call. Freedom means never  surrender.\n\nBravo, Ukraine. Bravo, President Volodymyr Zelenskyy. You inspired  freedom lovers across our globe.                            JD Vance Visits Toledo\n\nMs. KAPTUR. Mr.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…healthcare system to build on--a  functioning healthcare system, as challenged as it is, that includes  Medicaid.\n\nAs Americans, we don't shrink from challenges. We don't surrender to  cynicism and lies. We work together. We do hard things. We do what it  takes to build a better future for our country, and we do it in a way  that brings all of us along…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Conference with Winston  Churchill and Joseph Stalin in November 1943. It was also on the USS  Iowa in Tokyo Bay, where Johnson would watch the Japanese sign the  Instrument of Surrender on the USS Missouri.\n\nAfter the war, Johnson returned home to Waltham and married Ruth  Hills. Together they raised three daughters, Diane, Edie, and Cindy.  For many years,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696706/recognizing-freeman-johnson"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…average American household over  $1,000 per household in the last year alone, according to the  nonpartisan Tax Foundation.\n\nToo many of our Republican colleagues would rather surrender their  congressional authority than stand up to Trump. They would rather cross  their fingers or pray that the Supreme Court settles this.\n\nLet's be clear. A vote for this…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699899/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…permanent display in the Capitol rotunda, just steps away from here and  to the left of the monument of three great suffragists, a famous oil  painting by John Trumbull of the surrender of the British General  Burgoyne at Saratoga.\n\nThe State of New York began efforts to preserve the battlefield in  1927, establishing a park known as the Saratoga Battlefield…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…we also issue a warning. Today it  is Latinos and other immigrants under attack. Tomorrow it will be  others. Once institutions are built to target and control, they don't  surrender power, they expand it.\n\nLike the military-industrial complex, they find new enemies and new  missions, new excuses to keep the money flowing and the machinery of  fear alive.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…14 factors to decide whether to pursue a fleeing suspect.  One of those factors even requires an officer to determine whether  anyone in the suspect's car had a chance to surrender a weapon. That is  absurd. Officers rarely have time or information to work through such a  checklist when a suspect takes off.\n\nThis legislation repeals those restrictions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…not a day, to countenance endless  emergencies, endless states of emergency without congressional  oversight in defiance of every principle I have ever fought for and to  surrender our own power as Members of the House in relation both to our  own leadership and the executive branch. That is something I was not  going to do. There was bipartisan support…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…fixes this. It lifts restrictions on the import and export of natural  gas and allows American LNG to flourish once again.\n\nMr. Speaker, America should never ever voluntarily surrender its  energy advantages, not when our production strengthens families, their  paychecks, and communities, and certainly not when Texas and our Gulf  Coast stand ready to supply…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…injuries in Europe, Mr. Stevens continued his service, which concluded  in 1945 in the Pacific theater, where he personally witnessed the  signing of the Japanese Instrument of Surrender in Tokyo Harbor,  bringing World War II to its official end.\n\nAfter the war, Mr. Stevens returned to his home in west Texas, where  he worked as a carpenter, helping to build…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…patrols in the Pacific, sinking multiple Japanese vessels, capturing  enemy prisoners, and rescuing downed American airmen, even being  present in the Tokyo Bay for the Japanese surrender.\n\nBy the time she was decommissioned in 1970 the Razorback had earned  five battle stars for its service during World War II, four stars for  Vietnam, and two awards of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…forward.\n\nMr. GIMENEZ. We must reject this resolution and make clear to the  world that the United States has the will to confront narcoterrorism  head-on and that we will never surrender to the very people who are  killing our children.\n\nToo many Americans have already died because we turned a blind eye to  this threat.\n\nFor the sake of our national security,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…must reject this resolution and send a clear message: The United  States will confront narcoterrorist regimes in our hemisphere, stand  with the Venezuelan people, and never surrender to terrorist regimes  that threaten our security. Too many Americans have already paid with  their lives because this threat was ignored.\n\nFor the sake of our national security,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Yet, they continue to stand, continue to march, and continue to  hope. When the free world faced aggression in the 20th century, voices  like Winston Churchill refused to surrender to hopelessness. He spoke  truth when others stayed silent. He strengthened resolve when others  faltered. He understood that a single courageous leader speaking  plainly,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…vehicular  attacks, and an 8,000-percent increase in death threats against them  and their families.\n\nThis is not the time to play defense or seek some kind of negotiated  surrender; it is time to go on offense.\n\nWe have two goals: Deliver mass deportations and crush the violent,  lawless campaign of leftwing sabotage that stands in our way.\n\nThat is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…whose father also served in this campaign, in recognizing  the personal and collective sacrifices of these heroes.\n\nThe Italian campaign spanned 602 days, culminating in the surrender  at Caserta, just north of Naples, on April 29, 1945, when nearly 1  million Axis troops capitulated--the largest surrender of German forces  at that point in the war. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…taken from a senior, a veteran, a child, and a family  struggling to pay the bills.\n\nFor the past 4 years, the pattern has been very clear. Migrants cross  the border and surrender to authorities. They repeat carefully  rehearsed lines, provided by NGOs, to meet the bare minimum threshold  for asylum. They are released into the country and set a court…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…can pursue that car.\n\nWhat D.C. has done, one of the factors, Mr. Speaker, is if anyone in  the suspect motor vehicle was afforded an opportunity to comply with an  order to surrender any suspected dangerous weapons.\n\nWhat the hell? There is no way a police officer can know that. There  are too many factors, which basically means D.C. has made it illegal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to deprive Israel of the weapons it needs; the solution is in the hands  of Hamas. This could end in a moment. Hamas could release the hostages,  lay down their arms and surrender, and not one more bullet would be  fired. But until this happens, we can't let up on these terrorists who  have committed the atrocities against Israel, have caused this…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}]