[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…through Medicaid. I cannot       work a typical job. It is important that he receives these       therapies and supports for Medicaid as well as me so that our       family can survive and he has the brightest future possible.       If anything is taken away from him or us, it will be       detrimental. Please give my son and our small family a       fighting…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…collapse.\n\nAs Julio was falling into the Patapsco River, he prayed to God,  giving thanks, asking for protection over his wife and family and  asking for forgiveness. Determined to survive, he was able to hang onto  a piece of the bridge to stay afloat. He immediately started calling  for his coworkers, including his brother-in-law and his 18-year-old  nephew,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…mother who just moved to  Cincinnati to escape domestic violence. She is raising a daughter with  disabilities and relies on Medicaid and food assistance. She relies on  both to survive.\n\nThere is a 62-year-old woman on a fixed income. Food assistance is  the only way she has enough food.\n\nThese stories matter because Trump and congressional Republicans are…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692006/cuts-to-healthcare-and-food-assistance"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…in their rent,  they are struggling to make ends meet.\n\nNo one should have to make the choice of paying for their rent or a  visit to the doctor that they need in order to survive. Unfortunately,  these are the decisions that this administration is forcing everyday  Americans to make. Republicans must work with House Democrats to bring  these costs…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Public Radio, valued services will be eroded.  For many smaller stations in rural communities across the country,  these cuts will prove utterly devastating. They will not survive,  resulting in news deserts for these communities.\n\nThis bill also rescinds billions of dollars in lifesaving and life- affirming international assistance--another in a long…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…raised at our committee's markup of this  legislation back in December of last year. I am very pleased to support  this bill today, which I think is legally seaworthy and will survive  any constitutional challenges.\n\nMr. RASKIN. Madam Speaker, I yield 4 minutes to the gentlewoman from  Georgia (Mrs. McBath).\n\nMr. RASKIN. I have no further speakers, Madam…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698878/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…grandparents?\n\nSome facilities may be forced to make impossible decisions like  reducing staff or raising prices for those who don't qualify for  Medicaid. Others simply will not survive.\n\nI know how worrisome it is to watch aging parents need to leave the  home they loved. I know how critical it is to find them the best  possible care. I saw it with my own…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694077/nursing-homes"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…a time when local businesses are working hard to keep their doors  open and their workers employed, this bill would make it even harder to  access the capital they need to survive.\n\nBy adding new documentation requirements around age and citizenship,  it slows down the loan process and risks excluding legitimate  applicants, particularly those from…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…prosperity, and       rights depend on a strong DOJ--to speak out against its       destruction.\n\nOur democracy is only as strong as the rule of law, and the       rule of law can't survive without the principal institution       that enforces it.\n\nWell, that is a powerful letter from these 292 former career  employees of the Department of Justice.\n\nI was very…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…they were getting 25  bucks a day for food, but they are getting 6 bucks, and 5 million  people will now have an enormously difficult time trying to figure out  just how to survive the day--and I mean that quite literally, survive  the day--to find the calories within their $6 or $8 or $12 budget.\n\nFinally, people are going to pay hundreds of dollars…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…while  sitting in a warehouse. This is food that had already been paid for,  had already been produced, and was just waiting to be shipped to  starving people who needed it to survive. Instead, it is being  incinerated.\n\nIn my district in Rhode Island, 87,000 boxes of lifesaving nutrition  are sitting in Edesia Nutrition's warehouse. It is already paid…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694042/incinerating-500-tons-of-emergency-food-aid"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…everyone.\n\nTake Jake, a high school student who uses a wheelchair. He relies on  a Medicaid waiver for school support and depends on our healthcare  system to move, thrive, and survive. Cutting his Medicaid isn't just  wrong, it is cruel.\n\nThis legislation amounts to the largest transfer of wealth from the  pockets of the most vulnerable and working families…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691781/opposing-medicaid-cuts"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…of  that is endangered by this reconciliation bill.\n\nI ask my Republican colleagues: Who are they to decide who gets the  care that people like Kristen need and depend on to survive? All of  these cuts are for what? So that billionaires and big corporations can  get even more handouts?\n\nLet's stand with people like Kristen. Protect Medicaid and the  families…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691479/gop-tax-scam-hurts-women-and-families"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…threaten our democracy today,  as Donald Trump practices deliberate deception and escalating  extremism.\n\nDemocracy is fragile, and it demands our constant defense. It can  only survive when we act to protect it each and every day.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698551/january-6-attack"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…also a nurse in primary  care settings. My story is from the front lines. . . . If you cut  Medicaid, Americans will die. People will get sick. They'll lose jobs.  Some won't survive. It's not an exaggeration. It's reality.\n\n``This bill doesn't cut waste. It cuts the heart out of programs that  help Americans meet their basic needs: healthcare, nutrition,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…is not the  bureaucrat in Washington or the corporate executive on a conference  call. The person paying the price is the worker who depends on that  retirement account to survive. That is why H.R. 2988 is needed.\n\nMr. Speaker, this bill restores the proper purpose of retirement  investing: financial security. It makes clear that retirement plan  decisions…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Americans. When combined with  what this majority did for energy development in the One Big Beautiful  Bill Act, we are shoring up centuries of energy production.\n\nWe cannot survive in this country without Wyoming coal, the majority  of which is produced in the Powder River Basin. Demand for Wyoming coal  is only increasing, both here and abroad. If you…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Assessment Act.\n\nWhen the Assad regime was toppled in Syria late last year, the threat  of terrorism did not disappear. It just actually shifted, adapted, and  found new ways to survive.\n\nFor decades, the Assad regime gave terrorist groups a place to train,  organize, and plan attacks. You don't just swipe away the leadership  and make the terrorism go away.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the highest inflation in 40 years that made it  impossible for working families to survive. That is why the American  people sent Donald Trump back to the White House with a mandate. Now it  is up to Congress to deliver on that mandate, to make our economy work…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…lowering the cost  of prescription drugs is a top priority of mine--no more than it is  Senator Durbin's. Without their prescription medication, millions of  Americans would not survive.\n\nAs a nation, we are blessed to live in a country where investment and  innovation unlock cures and treatments--some of them we even refer to  as miracle cures. But the escalating…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trust fund, add in what is coming out of your payroll  taxes--I know it is political suicide around here to tell the  truth about programs like this. But if you want it to survive, we just  get the math right. I can make it work. It is not going to make some  people completely happy. We can make the math work, but you first have  to accept the fact…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…return on our  investment in veterans, in dignity, in opportunity, in real jobs. It is  about ensuring our veterans transition with the resources that they  need, not just to survive, but to thrive.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to vote  in support of H.R. 3579. Stand behind our veterans not just with words  but with this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695443/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…like Shane  Sawyer, an Air Force special operations combat veteran who helps lead  the Quad Cities Veterans Network. He brings veterans together, not just  to socialize but to survive, to reconnect with the tribe they lost, to  rediscover their identity, and to talk to people who understand what  they have been through.\n\nHis work saves lives. It is that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…what the  previous functionally 3\\1/2\\ years of inflation did to wealth and the  working class. When you inflate up people who have assets and crush  those who are trying to survive, congratulations. Remember, before the  pandemic under the TCJA, the tax reforms of 2017, it was the fastest  closure of income inequality in American history.\n\nWhat is being…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…child and,  recognizing the urgency of the moment, rushed the child to Jamaica  Hospital in their patrol vehicle. Tragically, despite their heroic  efforts, the child did not survive.\n\nMr. Speaker, Detective Gonzalez demonstrated extraordinary courage,  composure, and selflessness in the face of life-threatening danger. It  is my great honor to recognize…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691108/recognizing-nypd-detective-fabio-l-gonzalez"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…there is so much of this  tax policy that both sides of the aisle share a common vision on.\n\nWe did an awesome bipartisan tax bill last year. I wish it would have  been able to survive in the Senate, but it didn't. There is so much  good that will come out of what we are going to extend here.\n\nI shared a lot of this with my newsletter followers yesterday.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…telehealth and infrastructure, and  preserving access to critical resources like the 340B drug program, a  key revenue stream for rural hospitals.\n\nRural hospitals must not only survive but thrive. We need to keep  that because it is not about ZIP Codes.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…remained the top concern. In fact, 98 percent of small businesses  report that healthcare costs will become unsustainable in the next 5 to  10 years, threatening their ability to survive and remain competitive.\n\nThis is not because small businesses do not want to offer healthcare  benefits. Small business owners work very hard to provide for their  employees.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…repair critical water  infrastructure.\n\nI am proud to lead legislation that helps alleviate the struggles  that rural communities face in obtaining the infrastructure needed to  survive. When water infrastructure ages well past its intended  lifespan, Congress should support and advocate for programs that help  rural communities, not leave them behind.\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is, will lie about  it, but the economics are incredibly important.\n\nIf you are going to move this country to raise its productivity so we  can raise wages so we actually can survive what is happening in the  actuary reports of Medicare and Social Security, guess what? You almost  can't close the numbers unless you do something like this.\n\nThe reason I…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]