[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…scientists in this country who have  been researching this, and they are at the point of clinical trials.\n\nMr. Speaker, I don't know if you know anyone in your family who is a  survivor of breast cancer or any other kind of cancer. Oftentimes, when  you go in and the surgeon puts you under to take it out, they don't  know if they have gotten all of it out.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…account.\n\nAs you heard from my colleague from Virginia, $1,000 doesn't go a  long way in our healthcare system. It is $70,000 a day for the NICU  system. I am a kidney cancer survivor. A thousand dollars sure wouldn't  have covered my insurance for the surgery that I underwent. As a matter  of fact, it wouldn't have even covered the MRI that allowed us…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker.\n\nI want to mention, as I think about and reflect when I was first  elected to Congress, there was a Congressman from California named Tom  Lantos. He was a Holocaust survivor. He was from Hungary, and he was  imprisoned by Hitler. He used to come to the floor, and he fought so  hard for the fall of the Soviet Union and for liberty across Europe.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…would be remiss, however, if I didn't also point to other  legislation that we can and should be taking up to improve benefits for  survivors. I have introduced H.R. 2278, the Survivor Benefits Delivery  Improvement Act, a bill that puts new tools in the VA's hands to aid in  reaching survivors where they are and better inform them of the  benefits they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…7,  mere weeks before the murder of Alex Pretti.\n\nMr. Speaker, as co-chair of the Tom Lantos Human Rights Commission,  named after our former colleague, the only Holocaust survivor to serve  in the United States Congress, I have spent years documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I rise today to stand with truth and  justice, to stand with every survivor of sexual assault, and to demand  the release of the Epstein files now. I say to the one man on planet  Earth who has the power to do so, Mr. President, it is time to release…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…cancers, respiratory diseases, and other debilitating  conditions from the toxins at Ground Zero.\n\nThat is why I was proud to help reintroduce the bipartisan 9/11  Responder and Survivor Health Funding Correction Act, which would  permanently fix the current funding shortfalls in the World Trade  Center Health Program.\n\nWe owe it to our 9/11 first responders…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…premier institutions  that do medical research that makes a difference here in the United  States and around the world.\n\nHe is cutting medical research on cancer. I am a cancer survivor. It  is important to folks like me, and there are a lot of folks who are  cancer survivors. The only reason we are still here is because of the  medical advances that were…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace, justice, and community. As a three- time cancer survivor currently in treatment, I want her to know that we  are with her as she continues this fight.\n\nOn behalf of Illinois' Third Congressional District, it is my sincere  honor…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…burned half to death by a terrorist 7 days ago.  The least you can do is list the right number.\n\nMr. Evans' resolution also says that ``reportedly one victim was a  Holocaust survivor.'' She is not reportedly a survivor. She is a  Holocaust survivor. There is no doubt to that. There is no allegation  to that. I know because she is my constituent. The word…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…disclose  sexually explicit deepfakes, while knowingly or recklessly disregarding  that the person depicted did not consent to the content.\n\nI am proud to have collaborated with survivor advocates on this bill.  Their lived experience and leadership have shaped this legislation.  Congress needs to act. It is past time to give victims of  nonconsensual, sexually…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…complicit in  having young children with cancer at a children's hospital die because  we have cut cancer research funding.\n\nAs I say this, I think about my mother, a breast cancer survivor who  wonders every day if it will come back. Boy, how do you think it gets  me right in the craw to have to tell her that this country doesn't care  if she lives or dies because…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…never given up.\n\nThe legislation in front of us at its core is about something very  simple. The survivors deserve justice. The American people deserve the  truth.\n\nTo every survivor watching, their courage is inspiring. They are the  reason why this vote is happening today. Protecting women and children  from pedophiles should not be a Democratic issue.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696813/epstein-files-transparency-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "Mr. SCHNEIDER. Mr. Speaker, I include in the Record remarks from  Rose-Helene Spreiregen, a holocaust survivor.\n\nNever, as a young Jewish girl hiding in France during World       War II, could I have possibly dreamed of standing where I am       now. Never could I have imagined addressing…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…until I was well into my adulthood on my first  trip to Japan visiting Hiroshima and visiting Kikue, who was there  taking care of her mother, that I learned that she was a ``survivor'';  ``Hibakusha,'' that is the Japanese word for survivor, of the atom  bomb.\n\nShe lived in the outskirts of Hiroshima. If you have been there, it  is mountainous. It is a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…appropriations.\n\nI will close by just citing one conversation I had yesterday.\n\nI spoke with a small business owner from Delaware. Her name is Jan.  She is a stage IV cancer survivor. She is a small business owner.\n\nShe told me yesterday that, without the Affordable Care Act, she  would have died 10 years ago because insurance would have dropped her.…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…family of Laken Riley; to the family  of Jocelyn Nungaray; to a heroic Border Patrol agent; to the widow of  an officer who was killed in the line of duty; to a 13-year-old  survivor of brain cancer, such an inspiring young man; to a young man  admitted to West Point; to a history teacher who has finally been  brought home after being a political prisoner…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…true  patriot, Mr. Vaughn P. Drake, Jr. of Lexington, Kentucky. Mr. Drake  passed away on April 7, 2025, at the age of 106 and has been recognized  as our Nation's oldest survivor of the attack on Pearl Harbor.\n\nMr. Drake was born in Winchester, Kentucky on November 6, 1918. He  attended the University of Kentucky's College of Engineering. At the  age…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…promising futures in front of them.\n\nIn Australia, two terrorists opened fire on a Hanukkah celebration.  They murdered 15 people, including a 10-year old girl and a Holocaust  survivor.\n\nWe know that anti-Semitism is a sickness. It is spreading across the  globe, and world leaders must do more to protect their Jewish  communities.\n\nOur Nation's prayers remain…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the VA has used automation tools, like  AI, to draft letters and gather documents. That same technology has not  been applied to other types of claims, such as pensions or survivor  benefits. This has led to a growing backlog and, in some cases, missed  benefits altogether.\n\nMy bill takes steps to fix this. It requires the VA to expand the use  of automation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…we bring attention to the plight of  those who have had breast cancer and educate others on the importance  of early detection.\n\nMy wife Barbara is a 38-year breast cancer survivor. We are fortunate  that her breast cancer was detected very early. We know with certainty  that early detection can dramatically increase a woman's chance of  defeating breast…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…There are individuals that their family was truly forever changed.  And now, 30 years later, they still get together and talk and visit,  catch up with each other. There are survivor networks that still engage  and still keep in contact with each other, remembering what happens  when out-of-control anger took the lives of 168 people.\n\nOn that sacred ground,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…805(b)(2) of the Federal Lands Recreation       Enhancement Act (16 U.S.C. 6804(b)(2)) is amended by adding       at the end the following:\n\n``(D) Any individual who is a survivor entitled to--\n\n``(i) a death gratuity under section 1475 of title 10,       United States Code; or\n\n``(ii) dependency and indemnity compensation under chapter       13 of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…that have worked  tirelessly to get this bill to where it is today, including CPAC  Foundation's Center for Combating Human Trafficking, NCOSE,  Rights4Girls, Street Grace, survivor leader Hollie Nadel, and so many  more.\n\nLast Congress, a bipartisan group of attorneys general wrote a letter  in strong support of the Trafficking Survivors Relief Act.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…only have a  handful of doctors and that you have a massive copay or some other kind  of limitation on your ability to choose a doctor. For example, in my  case, as a cancer survivor, on ObamaCare, I can't go back to M.D.  Anderson, which saved my life, because ObamaCare doesn't have M.D.  Anderson as an option.\n\nThat is not coverage. That is fake. Democrats…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…meals, and rescuing animals, like Charlie the dog and Gus the goose.\n\nMr. Chapman was also known for his work ethic and perseverance  despite the challenges faced as a polio survivor.\n\nToday, I ask that we all take a moment to remember Ben Chapman and  his contributions to his local community.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…resolution.\n\nThis resolution uses anti-Semitism, uses Jews, for a political  objective. This was an anti-Semitic attack. The victims were Jewish.  One victim was a Holocaust survivor. There is no question that the  motivation of the perpetrator was anti-Semitism. It has nothing to do  with how he got into this country.\n\nIf you want to have an immigration…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…government. Most importantly, he will never forget that behind every  case number is a person and that every beneficiary matters, whether  they are a senior, whether they are a survivor, or whether they are  someone with a disability. Social Security works because Americans can  trust it month after month, year after year. With Arjun, that trust is  in capable…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Government, have messed  up their lives quite vociferously.\n\nMr. ROY. We distort, and so they want help. I get it. Yet, what do I  do? Do I vote for food stamps?\n\nI am a cancer survivor--you know that--and I have cancer groups  coming in and asking for money. I look at them, and I say: Well, can  you go find some way to pay for it?\n\nA lot of my colleagues…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I would note just an observation: One of our  colleagues on the other side of the aisle who is a cancer survivor--and  God bless him for it--was raising issues about government funding and  about what funding should or shouldn't exist and what this  administration may or may not be doing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}]