[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Biden administration fully cooperated with the  Senate investigators on that case. The Finance Committee staff went to  the Treasury Department to see the Epstein files and suspicious  activity reports.\n\nDemocrats understood that this was an ongoing investigation. We  applauded the Biden administration for cooperating, and that was the  right course.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…survivors--some of them were as young as 13 and 14  at the time--and they told us over and over again to follow the money.\n\nThe Treasury Department, Mr. Speaker, is sitting on suspicious  activity reports on Epstein's financial network, detailing thousands of  transactions totaling more than $1.5 billion. In fact, J.P. Morgan knew  about these suspicious…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696833/epstein-remarks"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…to help sell it, and  we are going to hopefully make some profit off of that.''\n\nThe only problem is the oil companies are still extremely, extremely  cautious and sort of suspicious of this plan. These plans to invest in  Venezuela would involve them investing a ton of money upfront and just  hoping that long after Donald Trump leaves, they are going…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…clear legal rationale, it does not  have to explain the decision to strike rather than to interdict.\n\nWhen you ask the basic questions and you are not given answers, you  get suspicious that the answers are not forthcoming because there  aren't good answers to the questions that we asked.\n\nWe did have a followup hearing, the Armed Services Committee, in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…very important.\n\nThis concept is similar to, as you have heard by our ranking member,  Mr. Speaker, a keep-open letter, which is when the government asks a  bank to keep a suspicious illicit account open. As it stands now,  private financial firms are currently limited to their capacity to  engage with sanctioned entities due to a robust sanction regime.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…to report to OFAC monthly on their findings. This is similar  in concept to the keep-open letters that government officials provide  to financial institutions to keep open suspicious accounts so the  government can watch the transactions and follow the money.\n\nThat is because H.R. 1450 would help investigators better follow the  money to make their sanctions…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…that prior  administrations had covered up the identities of the rich and powerful  people to whom Epstein had trafficked the girls and the facts  surrounding his allegedly suspicious death.\n\nThey came into office pledging to seek accountability for the  horrific crimes by revealing Epstein's client list and other  information, but recently backtracked…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…other side of the aisle.\n\nWe know this data is extremely valuable to bad actors and foreign  adversaries. In fact, after DOGE infiltrated the National Labor  Relations Board, suspicious attempts were made to access the data from  an IP address in Russia.\n\nCongress should be working to fulfill our obligations to the American  people and safeguard their data.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…analytics and threat detection software       that incorporate artificial intelligence and machine learning       algorithms to identify and flag in real time anomalous or       suspicious vehicle behavior, as well as associated       technologies to disable or divert a vehicle before it becomes       a threat.\n\n(iii) Innovations in cybersecurity to prevent…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Americans should think about this. Democrats are pushing back on this  because they don't want the citizens of America to know what special  interest aliens, who participated in suspicious travel patterns, came  into our country illegally in 2021, '22, '23, and '24. Because you know  how many are coming in in 2025? Zero are coming in. That is how many.  That…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…is not good for rebuilding  trust in the U.S. House of Representatives or the U.S. Senate.\n\nThe reason we introduced this is because there have been widespread  reports of suspicious transactions associated with public officials and  it raises a lot of concerns about what we are doing here in this great  body.\n\nIf you want to run for the U.S. House of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…conducted interviews with two  key witnesses, both of whom were Republicans.\n\nThe Trump administration has provided us with Department of Justice  materials and access to suspicious activity reports. Unfortunately,  throughout this investigation, Democrats have chosen to manufacture yet  another anti-Trump hoax instead of pursuing justice. They have…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in Federal custody ever since,  but his partner and other associates have not been.\n\nThe Reedley lab was discovered in December of 2022 when a code  inspector came upon a suspicious warehouse. Inside, she found many  Chinese nationals wearing white lab coats, glasses, masks, and latex  gloves, along with thousands of vials of biological substances and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…talked about the nonprofit involved in feeding  the so-called hungry children called Feeding Our Future. The rank-and- file employees in the Welfare office started getting suspicious when  the claims went up, and they contacted Feeding Our Future. They said:  Hey, what is going on here? We are going to start cutting off these  claims because it is getting…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…direction?\n\nShouldn't we be cleaning house rather than just accepting bad deals  because they are already in motion?\n\nLet's put it in terms we can all understand: If you saw a suspicious  charge on your credit card, would you just shrug it off and pay for it?  I think not. You would demand answers. You would challenge it. That is  exactly what DOGE is doing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}]