[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…START while we negotiate yet another treaty to  further reduce the number of nuclear weapons. But, unfortunately, last  February, Putin announced the Russian Federation's suspension of New  START, and there has been minimal discussion between our two countries  about any further agreements.\n\nWhen New START does expire, unless a new agreement is in place,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…neediest and  most vulnerable of our districts, in rural areas as well as urban; and,  of course, the damage to our fundamental freedoms, women's reproductive  freedoms, the suspension of title X grants, and the assault on women's  healthcare--other freedoms: the basic due process of people who should  have a right to receive notice and the opportunity…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Regrettably, the President is doing the above things that I just  mentioned in tandem with expressions of American citizens being  deported while condoning the potential suspension of the great writ of  habeas corpus, another fundamental constitutional right.\n\nI cannot in good conscience, as a Member of Congress, having said  what I have said, knowing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…accepting even a donation from a nonprofit that would want to help us  with the issue.\n\nMr. Chair, I say let's get out of the way. H.R. 1948 passed out of  the House on suspension in June of this year, and I hope to see it  become law on any topical legislative vehicle before us. In this case,  our amendment would authorize additional funding sources…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…legislation that  reauthorizes the SUPPORT for Patients and Communities Act.\n\nLast Congress, this bill passed with strong bipartisan support right  here on the House floor under suspension of the rules. Today it is  coming up under a rule because a lot has changed since last year. There  is a new administration, and the Trump administration is attacking  mental…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…legal profession.\n\nThe following are illustrative examples of the concerning       actions and statements:\n\nOn February 25, 2025, the President issued a memo titled       ``Suspension of Security Clearances and Evaluation of       Government Contracts'' targeting Covington & Burling LLP.\n\nOn March 6, 2025, the President issued a memo titled       ``Addressing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…working on. First and  foremost is H. Res. 100. It is a resolution I introduced in the House  with 19 other Members. It supports arms control and condemns Russia's  purported suspension of its participation in the New START Treaty.\n\nThe current extension of the New START Treaty is set to expire in  under a year, and anyone who remembers previous arms control…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…embassy remains closed to       normal visa operations due to instability and dangerous       conditions. The evacuation of consular officers from the U.S.       embassy; the suspension of normal consular operations for       several years; reports of active gunfire between U.S. Marines       guarding the embassy and violent gang members; and Department…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…our great nation.\n\nBased on BOEM's initial review of this classified       information, the particularized harm posed by this project       can only be feasibly averted by suspension of on-lease       activities. In coordination with DoW, BOEM will determine       whether the national security threats relating to this       project can be mitigated and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…hospitals, and community health centers  because of the type of care which they provide.\n\nNo. 39, froze funding for community health centers in our country.\n\nNo. 40, ordered the suspension of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Madam Speaker, I rise today in strong opposition to the  Department of Commerce's decision to terminate the Tomato Suspension  Agreement and slap a 20 percent tariff on tomatoes imported from  Mexico.\n\nThis is a political choice that directly raises prices on American  families and hurts American…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694013/terminating-tomato-suspension-agreement"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…record high, 79 percent, of U.S.  adults say that immigration is a good thing for the country. A Pew poll  showed 64 percent of Americans disapprove of President Trump's  suspension of most asylum applications, which was ruled unlawful in  Federal court.\n\nThe American people now see that the Trump administration has  continually lied about what they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…U.S. to add       nearly 250 gigawatts of new capacity by 2030--down by almost       50% from last year's projections--as a result of fresh import       restrictions, the suspension of new offshore wind leasing and       a crackdown on permitting for onshore wind and solar projects       on federal land.\n\nPresident Trump has vowed to boost the oil-and-gas…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Donald Trump's interests.\n\nIt also looks to be great news for people like Lynne Patton, who is  returning to work for President Trump this week after finishing up a 2- month suspension from Federal service after she improperly used her  position with the Department of Housing and Urban Development for  political purposes during President Trump's first term.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the Setting Consumer       Standards for Lithium-Ion Batteries Act, in advance of the       U.S. House of Representatives' possible consideration of the       bill under suspension of the rules the week of April 28,       2025. We support this bipartisan product safety legislation,       which would ensure that the Consumer Product Safety       Commission…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.   EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION OF THE RULES IN THE HOUSE OF                                     REPRESENTATIVES WEEK OF FEBRUARY 9, 2026 ----------------------------------------------------------------------------------------------------------------…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…paper- clipped together for purposes of getting it passed by unanimous consent  over here--over there.\n\nWhen they do it over there, they use a procedure in the House known  as suspension of the rules. Under suspension of the rules, you have got  to have 290 votes to pass it rather than a simple majority of 218  votes. That feature ends up replicating, to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…legislation and regulations to address the unique issues faced by our  senior investors.\n\nMr. Speaker, H.R. 1469 has received strong bipartisan support in the  past, passing by suspension in the last three Congresses. It remains a  commonsense solution to ensure that senior investors receive adequate  protection against fraud and exploitation.\n\nAgain, I thank…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…prepared to close, and I reserve the  balance of my time.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the CBO estimate  for this bill.       Legislation Considered Under Suspension of the Rules\n\nThe Majority Leader of the House of Representatives       announces bills that will be considered under suspension of       the rules in that chamber. Under…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of a fraud ban.\n\n(2) Commission.--The term ``Commission'' means the Federal       Trade Commission.\n\n(3) Fraud ban.--The term ``fraud ban'' means the       termination or suspension of the account or profile of a       member of an online dating service because, in the judgment       of the online dating service provider, there is a significant…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…balance of my time.\n\nMr. HILL of Arkansas.  I include in the Record the CBO estimate for this bill.   EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION OF THE RULES IN THE HOUSE OF                                     REPRESENTATIVES WEEK OF FEBRUARY 9, 2026 ----------------------------------------------------------------------------------------------------------------…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…called LaMalfa-isms, overcomplicated government  explanations for simple things, like saying that the transportation  infrastructure is undergoing a temporary operational suspension pending  structural optimization instead of just saying that the bridge is  closed for repairs.\n\nDoug loved this institution. He loved the West. He loved 1-minute  speeches.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698710/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to stop the sanctionable  conduct and not threaten the United States' national security interests  or our allies, period.\n\nThe fact that we are considering this bill under suspension of rules  is hugely significant. It shows that eliminating this sunset is not a  partisan issue. Republicans and Democrats agree that we need durable,  long-lasting, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Hadley            (For Phillip L. Swagel, Director, Congressional Budget                                                            Office).      Legislation Considered Under Suspension of the Rules\n\nThe Majority Leader of the House of Representatives       announces bills that will be considered under suspension of       the rules in that chamber. Under…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the provisions of       subsection (a) of this section at any time as to any or all       securities issued or guaranteed by the Association during the       period of such suspension. The Commission shall include in       its annual reports to the Congress such information as it       shall deem advisable with regard to the operations and effect…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…take care  of this country.\n\nNow, there are a lot of bills that come to this floor to rename  things. They might not be the most important bills, but usually they go  on a suspension vote because both sides agree we can do renaming, but  this one got elevated to a much higher level, so here we are under a  rule bill debating whether or not we call the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the deadline prescribed under       subsection (b) shall be subject to appropriate penalties as       determined appropriate by the Postal Service, including       fines, suspension of contracts, or termination of contracts.       The Postal Service may take into account the severity of the       applicable traffic crash and the frequency of noncompliance…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…regulations.--Nothing in this section may be construed to       prevent the harmonization of cylinder standards otherwise       authorized by law.\n\n(5) Other cause for suspension or termination.--The       Secretary may suspend or terminate an approval of an FMOC on       determination that the FMOC knowingly or intentionally       misrepresented…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Lumbee Tribe has been introduced  in Congress more than 30 times with broad bipartisan support. In the  past two Congresses, in fact, the House passed this legislation under  suspension, most recently on December 17, 2024.\n\nOutside of Congress, the Lumbee Fairness Act has the support of 236  Tribes across the country that have repeatedly cited the unfair…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I missed the suspension votes today due to  travel delays getting back to Washington, DC. Had I been present, I  would have voted YEA on Roll Call No. 57 and YEA on Roll Call No. 58.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699818/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}]