[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Interior, all led by  billionaires.\n\nThese people don't shop for themselves or they don't worry about  paying rent. They don't care about us. Trump said he would drain the  swamp. What a bunch of BS. He moved the swamp into the Lincoln bedroom  for God's sake.\n\nThe bottom line is simple: He has not done a single damn thing that  he promised to do. Not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…stormed into office on the promise to lower  costs, to fight for ordinary Americans, to unrig a rigged system. He  ran, in other words, as a populist who promised to drain the swamp and  end inflation.\n\nBut Donald Trump is not a populist; he is a posturer. He throws out  these populist ideas to try to persuade people he is on their side, but  he never…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, President Trump campaigned around the  country to drain the swamp. Yet, one of the first things he did was to  reverse President Biden's executive order that banned White House  officials from accepting gifts from lobbyists.\n\nToday, I am…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688124/ban-on-acceptance-of-gifts-from-lobbyists"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…investigators and are designed to combat waste, fraud, abuse       and misconduct . . . without regard to political affiliation.       They are the ultimate [drainers of the swamp].\n\nOne of Donald Trump's very first acts after taking office was to fire  these independent investigators. In less than a year, he has gutted the  integrity and independence…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the public interest at all  times: today, tomorrow, always, and forever.\n\nIt is extraordinary to me, Mr. Speaker, that you have folks in this  town talking about draining the swamp. Guess what? You are the swamp.  You are the swamp. You are the swamp.\n\nWe have never seen anything like this, the type of corruption that  has been unleashed on the American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the conflicts is  ridiculous, it is astonishing, and it is unacceptable. The National  Review, not exactly a liberal rag and not exactly a liberal bastion,  has said that the swamp is under new ownership.\n\nSo much for the commitments that he made to the American people when  he first ran and when he ran again to so-called clean up the swamp.\n\nHere we…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the facts. But if he does nothing  else, what I would like to see him do is show some respect for our  veterans. He has called them suckers and losers. They have been called  swamp creatures or deep-staters by members of this administration. Part  of the mindset here that is responsible for these firings is that  disrespect for our veterans.\n\nTwo of my…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…them. Well, Montford Point Marines were those Black  marines who were not allowed to be trained at Camp Lejeune alongside  White soldiers. They were sent to a mosquito-infested swamp in Montford  Point, and that is where they served from 1942 all the way through  1949.\n\nI am pleased that this body, in its wisdom, saw it fitting and proper  to give the Congressional…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…the crypto industry everything it wants at the  expense of retail investors, consumers, and the overall health of our  financial system. These bills are products of the D.C. swamp that so  many of our colleagues usually condemn.\n\nMr. Speaker, every time our Republican colleagues write a finance  bill, it leaves us less safe and more prone to financial…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…our Republican colleagues would join us in  asking the question that is on more and more Americans' minds: What the  heck is going on?\n\nThis administration is not draining the swamp. They are torching the  country. The global economy is in chaos. We are teetering on the brink  of recession. Administration officials are telling us we should perhaps  prepare…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…stewards from around the globe. Nationwide, 95 million birders generate  over $90 billion annually for our economy.\n\nThe biggest week in American birding is sponsored by the Black Swamp  Bird Observatory in Oak Harbor, Ohio. This event leverages public- private partnerships to promote conservation of migratory bird  populations and promote millions of dollars…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…HPSP scholarship  recipients will be given offers of jobs within 90 days post-graduation.  They will not wait. Veterans will not be forgotten. We are going to  drain the VA swamp one regulation at a time.\n\nOur bill also requires an annual report to Congress on hire dates and  placement rates. Transparency generates performance.\n\nWe are not just addressing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Dr.  William Clark, who is stepping down as chair of the Okefenokee Swamp  Park Board of Trustees after 15 years of hard work and dedicated  service.\n\nSince 2010, Dr. Clark has advanced the mission of Okefenokee Swamp  Park, promoting a community…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…has weaponized the Clean Water Act, paving  the way for critical infrastructure projects to move forward and be  free from the regulatory shackles imposed by this Washington swamp.\n\nFor too long, the Federal Government and environmental activists have  waged legal warfare on our farmers, small businesses, and job-creating  projects, causing endless delays…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…haven't hopped on a plane to fly home because we had our final vote  on a Thursday morning and we are going to come back on a Monday night  in our usual way of doing things in the swamp, not doing what we should  do, does anybody believe that this is going to save the fiscal health  of America?\n\nLike I said, I haven't decided if I am going to vote for it or…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…defund the National Endowment for Democracy.\n\nAlthough its name suggests a force for good, its mission has drifted  far from its Cold War origins. This is a classic tactic of the swamp  where bad policy and corruption hide behind a noble title.\n\nI thank Mr. Mike Benz and other patriots. We have learned that this  organization has engaged in global censorship,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Florida. Mr. Speaker, I rise to recognize and  celebrate the 100th year anniversary of the City of Polk City, Florida.\n\nPolk City, known locally as the Gateway to the Green Swamp, is in the  northern part of Polk County, Florida. The city officially received its  charter on April 3, 1925, thus marking the beginning of its formal  governance and development.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694002/recognizing-the-100th-anniversary-of-the-city-of-polk-city-florida"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…just in Kentucky's First Congressional District, but all across  Kentucky.\n\nThe mandate was to do two major things. First of all, obviously, the  mandate involved draining the swamp. That is what President Trump  campaigned on; and, secondly, to pass an America First agenda.\n\nWith respect to draining the swamp, President Trump nominated  disrupters to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}]