[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President, summer camp is a great memory for so many  of us. You think about the good times we had, at the right moment in  life, with a lot of friends, learning the basics of swimming, archery,  target shooting, and other things, like camping out--memories you carry  for a lifetime, wonderful memories, a rite of passage for many  individuals and families,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…coach of the Anaheim High School boys' and girls'  water polo teams.\n\nDenise took on the challenge to rebuild Anaheim High School's aquatic  program after 20 years with no swimming pool and no swimming program.  Under her leadership, the girls' water polo team captured the first- ever CIF division title in women's sports in the school's history.\n\nBeyond…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…election to try to stop Congress from regulating  artificial intelligence is because of the Citizens United decision,  because that decision allows those companies that are swimming in money  right now to be able to write an unlimited check into this next  election.\n\nSo you can understand why people feel powerless today, why people  feel like this whole…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…School's class of 2025.\n\nThis class has a lot to be proud of. In their time as Knights, the  girls' soccer team made history by winning their first State title. A  member of the swimming team earned a State title at this year's  Virginia High School League Swim and Dive State championships.\n\nThe students performed in musicals and theater productions, including…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…healthcare, Andrea is going to feel the  impact significantly. She makes just too much money to receive Apple  Health, our version of Medicaid. She is pregnant. She will be swimming  in medical debt. She says she is the only one who provides for her and  her children.\n\nOur neighbors deserve better, and they deserve us to keep fighting,  not just for this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Club.                             Providence District\n\nMale Athlete: Ben Ochsendorf Basketball, McLean Select/Nova       Cats AAU; Female Athlete: Ryan Elizabeth McIntosh, Swimming,       Poplar Heights Crush/Coach Mark Cruz, Volleyball, Vienna       Youth Inc. Parent: Mary Wong, Volleyball, Vienna Youth Inc.                             Springfield District…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…National Girls and Women in Sports Day Wilma Rudolph  Courage Award.\n\nAmy's athletic career started at Washburn High School in Minneapolis  where she was a standout athlete in swimming, track, basketball, and  soccer.\n\nThen, playing for Howard University, she went on to become the first  soccer player from a historically Black college and university to earn…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689662/recognizing-amy-cooper"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…report earnings to the IRS, suddenly  these corporations and private equity firms are out there hollering  about poverty. Forget that they told the shareholders they were  swimming in cash; suddenly, they claim they owe little to nothing in  taxes.\n\nThis kind of tax rate gamesmanship is why Democrats created the  corporate alternative minimum tax in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…girls from 950 championship titles, medals, scholarships,       and records they should have rightly won, including at least       28 women's sports titles in volleyball, swimming, mountain       biking, track and field, weightlifting, and cycling.\n\nWe look at the policies that have been enacted to protect women and  the imperative to make certain they…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…their hard work, talent, and dedication.\n\nWith a squad of just 11 boys, Glenvar scored an impressive 280  points, outpacing second-place Radford High by 75 points. Of the 11  swimming events contested, the Highlanders won 5 and were runners-up in  2 others.\n\nCongratulations to team members: seniors Avery McClanahan, Alec  McIlwain, Kees VanGerven, Connor…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…bill, large universities must offer 14 to 16 different sports,  which will ensure that non-revenue-producing sports are still  supported. I personally hope this will include swimming, but the  universities get to make that decision.\n\nThis bill would also protect athletes from unscrupulous agents. As I  said before, the SCORE Act affirms the right of student…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…repair;\n\n(B) a summary of equipment upgrade backlogs;\n\n(C) an assessment of necessary improvements, including       improvements to essential training equipment (including       swimming pools, operational simulators, and marksmanship       training ranges) to enable the Coast Guard to achieve all       operational training objectives;\n\n(D) a description of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…building.\n\nBetty's servant leadership in the borough stretches from the mid- 1960s, when she was instrumental in the creation and early operation of  the former Littlestown Swimming Pool.\n\nWith professionalism and integrity over the last 16 years, Betty has  most certainly personified the ideals of representative governance.\n\nOn behalf of constituents…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698629/recognizing-the-dedicated-public-service-of-betty-bucher"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of a well-rounded student and active community  member. Bryony is an active volunteer and tutors at a local education  center. She is a varsity athlete in cross-country and swimming, and she  is co-captain of the varsity swimming and diving team.\n\nHer focus on service to others is an extremely valuable attribute  that will contribute to her military career…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…more money.\n\nIt also has a DOE expansion in data collection. In one example  regarding the data collection, Mr. Speaker, you have to collect the  data for dedicated purpose swimming pool pump motors.\n\nHistorically, DOE only collected data demonstrating compliance with  efficiency standards. However, in this final rule, DOE aims to expand  reporting requirements…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…freedom feels like, but what does it mean to stand up for your freedom?  Standing up for your freedom is not always loud, not always quiet.  Standing up for your freedom is swimming against the school, looking  for those who may follow. It is a war cry against the face of tyranny  and injustice. It is a tough battle, one that we as Americans must be…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…in 2034.\n\nIf you travel across the State, Mr. Speaker, you will find  communities with baseball fields, football fields, soccer fields,  pickleball courts, tennis courts, swimming pools, ski resorts, and golf  courses. Utahns value sports, and we are good at them.\n\nUtah is an international center for technology, including space tech.  Just south of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…biopolymer recipe, could substitute for traditional soft plastic  lures which can break off hooks and sink to the bottom of waterways.  Mr. Albright cites his early memories of swimming and fishing on the  Susquehanna River with his father as the driving motivation for his  desire to keep our community's waterways clean and plastic-free.\n\nI want to congratulate…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…Brian.\n\nDrafted into the Army during the Vietnam war, Bob served honorably as  a medic in Seattle.\n\nAfter the war, he returned home to Hinckley, where he spent happy  days swimming in the lake and enjoying barbecues with his family and  friends. Bob built a distinguished career as a respiratory therapist at  Metro Health Systems in Cleveland, working…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}]