[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…States into another extended war in the Middle East.\n\nThat is not how our Founders designed our Nation through the  architecture of the Constitution. In fact, each Member here swore an  oath to uphold that Constitution that places the responsibility for  declaring war upon this body, not upon the individual who sits in the  Oval Office. To be sure, the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…rates,'' projected to save ratepayers ``hundreds of millions of  dollars.''\n\nIn January--just now--in the litigation about the second stop work  order, an affidavit was filed that swore that Revolution Wind would be  a new source of low marginal cost power in New England; that ``once  operational, Revolution Wind alone will provide hundreds of millions of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…community, my State, my fellow veterans, and the country that  I deeply love in a different way than I served it on the battlefield.  When I put the uniform on as a teenager, I swore an oath to the  Constitution, and I stand here today to uphold that oath.\n\nI came here to represent a State that has been racked with trauma:  Columbine, Aurora Theater, Club…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…letters, they have posted, and they have demanded disclosure. Donald  Trump, Jr., the President's own son, has tweeted dozens of times about  this case.\n\nFBI Director Kash Patel swore under oath in front of the Senate that  he would be transparent with the American public and release the  Epstein files. He said: ``Make sure the American public knows the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…appropriately urged current members of the military and intelligence  communities to adhere to the Constitution and the laws of our country.  They specifically said: ``Like us, you all swore an oath to protect and  defend this Constitution. Right now, the threats to our Constitution  aren't just coming from abroad, but from right here at home. Our laws  are clear.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…childcare. People's health insurance  premiums are doubling and tripling because this majority has failed to  act.\n\nDuring election season, we heard from Trump and Republicans who swore  up and down they would bring down prices. They promised the American  people they would reverse inflation and focus like a laser on  affordability. They have broken that promise.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to sound the alarm for our  Republic and our Constitution.\n\nEvery one of us here in Congress swore a solemn oath to protect and  defend our Constitution against all enemies foreign and domestic. We  did not give any President a blank check for war.\n\nPresident Trump is over…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…families.  While gun violence became the leading cause of death for all children  and teenagers in 2020, it has been the leading cause of death for Black  children since 2006.\n\nI swore my first oath of office just 3 months after Hadiya was shot  in the Second District. Since then, I have never, ever stopped fighting  for her, and I will never stop until we…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…exercise their constitutional right to protest,  President Trump has deployed the National Guard and the Marines, and  now an administration that ignores the Constitution it swore to  preserve, protect, and defend seeks to intimidate, assault, and arrest  Members of Congress exercising their oversight duties outlined in that  same constitution, like…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…complete waste of time, the Gulf of America Act.\n\nWhile Americans are struggling with real problems, while Trump is  trampling over the constitutional rights of the citizens he swore to  protect, Republicans are wasting this Chamber's time with performative  nonsense.\n\nHere is the choice this comes down to:\n\nWe could focus on helping 40 million Americans…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690744/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…almost `loved' me to death.''\n\nIf we really intend to support our officers, they should not be  feeling this level of betrayal and disappointment in the government  that they swore to defend and protect. Officers who put their lives on  the line for us deserve better.\n\nMr. Speaker, I will take a point of privilege to say that when I lost  my son, Jordan,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…left  wondering whether critical research to prevent and treat their  conditions will be abandoned, and they will have to reckon with the  fact that the same government that swore to help them turned its back  on them, all so Republicans can find more money to give billionaires  new tax breaks.\n\nVital programs like the Division of Blood Disorders should…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690579/blood-transfusion-oversight"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…job. She was the one who  sat in front of many of us for Senate confirmation. And she has done  nothing to defend the values that she claimed when she held her hand up  and swore to protect them.\n\nNow, I will tell you, back a year ago, I was one of those people who  voted for Kristi Noem. I voted yes on her nomination. I come from the  State of Michigan.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…fear the uniformed military who have given  their lives to protect them for so many years.\n\nBut all of us in this Chamber and certainly those of us who have  served in the past swore an oath to the Constitution--not to a King,  not to a party, not to any one person. Nobody gets to rewrite the  Constitution--not a President, not an adviser, no one.\n\nIf the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and our Posterity, do ordain and establish this       Constitution for the United States of America.\n\nWhich each one of us, each one of us in this body, went down there  and swore an oath to uphold. Those are the first words of this, Chris.\n\nAnd, God, I remember your agony.\n\nFolks, I want you to know, when I came to this body, my staff was  talking about…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…enters  every home.'' There is no denying Islam's intent to dominate Western  civilization. Their stated objective is to destroy us from within.\n\nAll who serve in this Congress swore to support and defend the  Constitution of the United States against all enemies, foreign and  domestic. This is a time for choosing. Either we defeat the sharia  advances…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…vulnerability disclosure policy and Federal Government. I  will do it for rape victims not just in my district, but in my State  and in my country. I will do it because I care. I swore an oath to the  Constitution to serve my constituents, to serve my State, and to serve  my Nation every possible way that I can.\n\nMr. Speaker, I urge my colleagues to take…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…government has been shut down. What is similar in  them both is the reason because Democrats have put the priorities of  illegal immigrants over the priorities of the people that we swore an  oath to protect; that is, the American citizens.\n\nA few months ago, the shutdown was to try to give illegal immigrants  free healthcare, and now the shutdown is simply…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]