[{"senator": "Al Green", "party": "Democrat", "sentence": "…don't like  authoritarianism and who would vote, in theory, for impeachment? Yes.  Before the election that brought Donald John Trump to the Presidency  this time, before he was sworn in by the Chief Justice of the Supreme  Court, there were many among us--and I am one of the many--who talked  about this very topic and who prognosticated this very behavior…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…detail improved all our  plans, and her calm professionalism and decisive leadership preserved  essential elements of the ceremonies while still ensuring the  President-elect was sworn in on time. Stefanie Muchow from Leader  Thune's office provided invaluable support to Julia backstage as she  expertly addressed challenges.\n\nFor Mike Wagner, our executive…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it has been 6 months since I was sworn in to  serve Oregon's Fifth Congressional District. Since then, we have seen  the programs we rely on cut, costs rise, and the needs of the American  people ignored.\n\nThat…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693419/speaking-out-for-oregonians"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…War  Powers Act being debated on the floor, Senator Kaine reminded us of  that historic moment when the Founding Fathers decided to write this  Constitution, which we have all sworn to uphold and defend. And leading  that Constitutional Convention, of course, was the greatest general  then and still in the history of the United States: George Washington.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…was a major driving force in terms of why he prevailed on  November 5. In fact, he said that in a number of interviews after the  election.\n\nHowever, then-President Trump was sworn in on January 20, and to this  day, despite over 100 executive orders, countless rescissions that have  come out of the White House, not one has been directed in terms of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Madam Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…turn, we failed to do so. Now  we must correct that failure.\n\nPresident Trump began laying the foundation for this operation--all  the operations in Venezuela--the moment he was sworn in. On his first  day in office, he designated multiple drug cartels as terrorist  organizations. Shortly thereafter, he ended temporary protected status  for some 350,000…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…hours of debate, and then we have  amendments.\n\nWe are very close to the point of making this tragic mistake. And I  know that many of my new colleagues who were just recently sworn in, in  January, have been folks who said we need fiscal discipline. You can't  campaign on fiscal discipline and tell your constituents you are going  to uphold that after…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in support of H.R. 3497, the Medal of  Sacrifice Act.\n\nEvery year, over 100 sworn law enforcement officers and over 100  firefighters die while on duty or from hazardous conditions related to  their service.\n\nWhile there are a number of different memorials…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699503/medal-of-sacrifice-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in the       Armed Forces; or\n\n(II) in the case of an alien who has been discharged from       the Armed Forces, has received an honorable discharge; and\n\n(E) the alien has sworn under penalty of perjury that the       alien--\n\n(i) has no unpaid applicable Federal tax liability, which       is assessed and is not being disputed;\n\n(ii) has entered into…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…days since President Trump was inaugurated.  Since then, the President of the United States has questioned his role  to uphold the Constitution, an oath he made when he was sworn into  office. He has also questioned whether Americans are entitled to due  process, a foundational civil protection. He has endlessly flouted the  rule of law.\n\nAs a matter…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…message reads with a reference, and the reference is: ``My reason  for impeaching the President: The threat that we said Donald John Trump  posed to democracy prior to his being sworn in on January 20, 2025, has  become our reality.''\n\n``To whom it may concern:\n\n``I pen this communique with a heavy heart, driven by a conscience  that will not allow me to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…country, forced out of their positions  simply for investigating crimes committed in the January 6  insurrection. These were professionals following the law, performing  their sworn duties, and yet their service was treated as disloyalty.  Careers were ended and decades of expertise were discarded just for  doing the job they were entrusted to do.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…academic, veteran, and businessman  from an important part of our Nation. I have had the sincere privilege  of collaborating on legislation with the gentleman since we were first  sworn into Congress.\n\nMr. Speaker, we are again partnering on H.R. 1350, and I urge my  colleagues to vote in support of this bill, as I have done in other  sessions, so that we…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…this room that we as Senators should  be able to voice the concerns that we have about the direction of our  country and the problems that our Nation faces, that we get to be sworn  in as U.S. Senators, that we try to do our best, that we are U.S.  Senators--United States Senators--that we represent this entire Nation  as a body.\n\nAnd the idea that just--as…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…have. They couldn't fire one missile without Iranian support because  that is where all their rockets come from.\n\nSome cast of characters here. The recent new President was sworn in,  in Iran. During the swearing-in of the Iranian President, the crowd  started chanting: ``Death to America,'' ``Death to America'' during the  swearing-in of the new President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Minnesota, and important  Democratic officials who are saying something is wrong here.\n\nLet us not forget: Every year in this country, 850,000 people are  naturalized. They are sworn in as new citizens. We are at an all-time  record of the number of foreign-born people in this country. The United  States has nothing to apologize for about the number of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699125/united-states-naturalizes-people-every-year"}, {"senator": "David McCormick", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. McCormick). On this vote, the yeas are 54,  and the nays are 44.\n\nThree-fifths of the Senators duly chosen and sworn not having voted  in the affirmative, the motion upon reconsideration is not agreed to.\n\nThe motion was rejected.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695998/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…ethic, he rose through the  ranks, and in 2021, was appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn in as Chief of Police, becoming  the first Hispanic police chief in the bureau's history. During his  tenure, the bureau achieved accreditation from the Pennsylvania Chiefs…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mrs. Hyde-Smith). On this vote, the yeas are  54, the nays are 46.\n\nThree-fifths of the Senators duly chosen and sworn not having voted  in the affirmative, the motion is rejected.\n\nThe motion was rejected.                             Motion to Reconsider", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696360/cloture-motion"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…his  swearing-in ceremony, not the Bible. He used a book that advocates for  the killing of all who don't believe in Islam or refuse to follow  Islamic teachings. He was also sworn in at an abandoned subway--a  subway station symbolizing what New York City will soon look like when  freedom-loving Americans flee for their lives and Sharia law becomes…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Curtis", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Curtis). On this vote, the yeas are 50,  the nays are 44. Three-fifths of the Senate, duly chosen and sworn, not  having voted in the affirmative, the motion is not agreed to.\n\nThe motion was rejected.", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696248/cloture-motion"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…State's Pecking Order\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to celebrate a special  tradition of the congressional delegation of Washington State.\n\nJust 1 year ago, I was sworn in to the 119th Congress and welcomed as  one of the two new members of the Washington congressional delegation.  If you are wondering why I have an oil painting of a baby…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…what, 1919 or 1920? In fact, in the State of South  Carolina, we didn't elect our first Republican woman to the U.S. House  of Representatives, to Congress, until 2020. I was sworn into office in  January of 2021.\n\nWe have fought hard. There are so many opportunities for women. Yet  we have never had a female President of the United States. I am not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…conservatives where our  warnings of the past echo upon a nearly empty Chamber as we discuss the  horrors of the day and the crimes that have been committed upon the  citizens we are sworn to serve that need not have been committed. This  is because of the culture that we have allowed to spread across our  country, as my friend has spoken on, that we have allowed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…reconciliation bill that Republicans have been  working on diligently to get to President Trump's desk. It cannot be  overstated. Our debt crisis is out of control.\n\nWhen I was first sworn into office in 2010, our Federal Government  had $9 trillion of debt. When I left temporarily in 2017, despite our  efforts to curb spending, it had doubled to $18 trillion…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that we should have done.\n\nWhat can we tell the people who feel we are being unnecessarily  cruel? Every year in this country, about 850,000 people are  naturalized. They are sworn in to become American citizens. I like to  show up at these ceremonies. They have them in Milwaukee, Wisconsin. I  try to show up at one or two a year. It is kind of thrilling…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…northwest Florida  and rise to offer a special congratulations to the Northwest Florida  State College women's basketball team.\n\nOn April 1, 2025--actually the same day that I was sworn into  office--the Lady Raiders took on Alabama's Shelton State Buccaneers,  and took home their third national championship in 5 years, with a  final score of 62-53. Their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…talk about the fact that in the prior 3  years--it goes up and down by year--but if you take a rolling average,  in the last 3 years, we have over 800,000 people every year sworn in as  new citizens legally in this country. How often do you hear about that?  There are 850,000 people who did it right. It is not impossible to make  your way here.\n\nBy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…renowned in our community as a selfless and  caring servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November 2018 and sworn into office  the following month, she went on to serve as Mayor from December 2020  through December 2023. Debra was instrumental in championing Measure P,  which expanded…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}]