[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…cause  cancer, that climate change is a hoax invented by China, that Tylenol  use in pregnancy causes autism--the list goes on and on. And over this  past year, we have seen systematic attacks on scientists at CDC, at  NOAA, the EPA, and the NIH--career professionals driven from public  service for the crime of publishing findings the President doesn't…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…foster national unity, artistic expression, and America's creative  spirit, not to feed the ego of a single individual.\n\nUnfortunately, over the past year, we have watched the systematic  takeover, with board members fired, loyalists installed, programming  politicized, and artists walking away in droves. The consequences were  immediate.\n\nThough Donald Trump's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…justice.\n\nOf course, this whole litany of the way Trump attacked the referees  was a prelude to the absolute assault on the referees that occurred  during this year in such a systematic fashion, in such an expanded  fashion.\n\nThe Trump administration also mounted efforts to sideline       key players in the political system. President Trump's       rhetorical…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…but it must remain just that, a  supplement, not a substitute. Veterans should be referred to community  care only when the VA cannot meet their needs, not as part of a  systematic effort to privatize the entire system.\n\nOccam's razor reminds us that the simplest explanation is often the  correct one. Here, the simplest explanation for this unprecedented…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…landscape in a way that America will not recognize.\n\nTrump is attempting to strip power from the States, consolidate it  for himself, and subvert the will of the people. It is systematic, it  is strategic, and it is deeply and urgently serious.\n\nToday, I am beginning an extended effort to elevate this issue and  sound the alarm--because voters will go to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…about the negotiations that are taking place right now. He wages war  not only with artillery and armor but with cyber attacks, propaganda,  disinformation, energy blackmail, systematic brutality. And he believes  that time is his ally. He believes that democracies grow weary and that  America will blink. And we must prove him wrong.\n\nThe Senate has demonstrated…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…deserve better than to be  ripped off by big corporations.\n\nLast month, the Guardian exposed dollar stores for quietly  overcharging customers. The report found evidence of a systematic scam  where companies like Dollar General and Family Dollar leave the wrong  price tags on products and hope that customers don't notice when it  rings up higher at the register.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698519/lowering-costs-for-working-families"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Trump's second term, his administration removed the sanctions on Levi  and other violent settlers.\n\nWe need to call these actions what they are: terrorism--part of a  violent, systematic effort, supported by the Israeli military, to  forcibly remove Palestinians from their land.\n\nAwdah worked with film directors Basel Adra and Yuval Abraham on  their Oscar-winning…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Security ``reform''  of raising the retirement age to 70 given that it would  disproportionately harm Black men and communities of color who have  lower life expectances. Systematic inequalities in socioeconomic  status, education, food security, and access to healthcare play an  intricate role in life expectancy. The life expectancy for Black men is…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Constitution and the  rulings of the Supreme Court, as well as the foundational principles of  due process and rule of law.\n\nC. Directed and permitted the deliberate and systematic violation of  laws duly enacted by Congress.\n\nSpecifically, he has terminated inspectors general, the officers  responsible for detecting and preventing waste by auditing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…matter who they are or how they learn,  deserves equal access to a quality education.\n\nYet, this anniversary comes at a time when the Trump administration  continues its systematic efforts to eliminate the Department of  Education, gut the Office of Special Education Programs, and undermine  IDEA, a landmark law that fundamentally changed how we educate…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Secretary of State, then-committee  chairman Senator Rubio.\n\nAnd what did that assessment actually conclude? I think every one of  us understood that Russia conducted a sweeping, systematic campaign to  interfere in our 2016 election; that Moscow's goal was to sow chaos, to  undermine faith in American democracy, and specifically to boost Mr.  Trump's candidacy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…profit.\n\nThe corrupt administration would rather protect the rich and  powerful, their billionaire donors, and stop the truth from coming out.\n\nSurvivors of this horrific and systematic sexual abuse deserve  justice, and the public deserves to know the full truth.\n\nDon't be fooled. President Trump has the power to release the full,  unredacted files right…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696833/epstein-remarks"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…law--an outside monitor who can take  complaints, who can oversee and report to the public. And, at some  point, maybe we need a truth and justice commission to look at the  systematic failure of this Agency.\n\nRigorous use-of-force training and policies are an absolute must. As  attorney general of the State of Connecticut, I advised police forces  about…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…electric vehicles, do away with all the tax breaks  for chargers. They are going to do away with all the tax breaks for  battery storage technologies to be developed.\n\nThis is systematic. This is a plan that our country has to pull us  out of the competition with the largest industry in the world, this  automotive industry, tied to the oil industry--just…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…aims to break down barriers and provide  greater opportunities for individuals with disabilities nationwide.\n\nFar too many individuals with disabilities continue to face  systematic  challenges when trying to enter the workforce or start a small  business. As Congress, we have a responsibility to recognize their  talents and create opportunities that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691777/thinkdifferently-about-disability-employment-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…identifies those responsible, including  members of the Chinese Communist Party, who have been credibly accused  by human rights organizations and U.N. experts of orchestrating  systematic, state-run organ harvesting, primarily targeting prisoners  of conscience from religious and ethnic minority groups.\n\nThis is not speculation. The evidence is overwhelming.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of the exercise.\n\nThat is what is happening in California. There is this farce of  democracy, this fraud that the Governor is perpetrating on the  electorate. There is a systematic attempt to suppress voters in order  to return our State to the era of partisan gerrymandering.\n\nIndeed, we even now have reports that the leaders of the legislature  itself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…less coverage, and is plagued by fraud,  waste, and abuse.\n\nMr. Speaker, I recently had a constituent write to me, outlining her  and her husband's experience, demonstrating systematic fraud within the  ACA marketplace. Her husband has been repeatedly enrolled in an ACA  plan without consent since November 2023 in a scheme where brokers and  agents are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…would also establish a family advisory board to  share best practices, highlight financial obstacles facing foster  families, and keep foster families at the center of the systematic  changes for improvement.\n\nWith the right tools and right resources, we can find a caring home  for every child in our foster care program. That is why this bill is so  important.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688407/recruiting-families-using-data-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President, in early November, the U.S. Citizenship  and Immigration Service announced improvements to their voter  verification system. Now, States can use a program named the Systematic  Alien Verification for Entitlements to verify that only citizens are  voting in the Federal elections. This is welcome news.\n\nSo here is why it is welcome news: During the…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…medieval human rights atrocities  of our current time.\n\nAs we stand on the precipice of this vote, I ask you to join me in  taking a stand against the Chinese Communist Party's systematic  persecution of Falun Gong practitioners.\n\nSince the early 1990s, the Falun Gong, a spiritual practice rooted in  the principles of truth, compassion, and tolerance, has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…population, further illustrates  the point.  One particular event in Bucha stands out. Russian troops intentionally  massacred more than 400 civilians, apparently as part of a systematic  clearing operation to secure their path to the capital, Kyiv. Russian  paratroopers from the 234th Guards Air Assault Regiment interrogated  and executed unarmed men of…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…cities overtaken by antifa. These are not rhetorical or  theoretical concerns; we watched it happen in real time.\n\nIt is not the product of social conditions or inequity or systematic  this or that; it is the inevitable result of a civilization that has  lost its moral nerve, a civilization that is too wracked by guilt to  punish its criminals, to enforce…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Uyghurs are held in mass  detention camps, where they face torture, forced labor, constant  surveillance, and forced sterilization. This is not just about abuse.  It is a systematic campaign of genocide.\n\nThe Uyghur Policy Act of 2025 pushes back. It directs the Secretary  of State to prioritize support for the Uyghurs and other persecuted  groups and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}]