[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Speaker, I rise today to oppose the cruel and  morally bankrupt healthcare agenda moving through this Chamber that  would gut Medicaid; gut Medicare; collapse our healthcare systems; and  cut food assistance to millions of children, seniors, and veterans  across this country.\n\nYou don't have to take my word for it because Elon Musk, himself,  called this…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691917/reconciliation"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…community.\n\nSince opening an organic dairy farm in Whitefield with her husband,  Michael Moody, in 2013, Annie has dedicated her life to building strong  and resilient local food systems in our state. She is currently  President of the Maine Dairy Industry Association and has served in  leadership roles of the Northeast Organic Family Farm Partnership,  Maine…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are foreign powers all over the world who would like nothing  better than a Qatar plane to be carrying the President of the United  States--potentially bugged, infiltrated by systems that could be hacked  by them, not just by Qatar or other Mideast nations.\n\nIt is a threat to our national security to have the President of the  United States riding in this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the 1930s. We see it in our grocery bills, but it is also impacting  electricity costs. Costs are way up for poles and wires and things that  we import for our electricity systems. Those are being passed along to  consumers.\n\nThe Trump administration has canceled hundreds of projects across  America, some that were permitted and approved, ready to bring…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…built on forecasts and information generated by  the National Weather Service and its array of scientists, satellites,  and equipment.\n\nNOAA's tornado and hurricane warning systems provide local emergency  managers critical information to prepare and respond to storms, often  up to a week in advance.\n\nNOAA's aviation forecasts help ensure planes can…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…from  pregnancy-related causes than White women. This is absolutely  unacceptable. We must address it at the Federal level. Yet, here we  are, Mr. Speaker, because we have systems right in place and  institutions have failed our folks, but here we are saying: We are also  going to take away your healthcare coverage.\n\nCutting Medicaid, again, is going…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…awarded to small  businesses every year, and the SBA plays a vital role in promoting  small business participation; however, over the years the SBA's  outdated and inefficient IT systems have made it harder for  entrepreneurs to access the resources they need.\n\nAfter repeated unsuccessful attempts to develop and deploy a platform  that would be a one-stop-shop…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…clarity, and I want to underscore one of the  most basic points that has to be made. And this is how times have  changed.\n\nWe have changed what we are talking about because energy systems  change, prices change, needs change, and the load changes. Right? But  hearing the Senator from Kansas, it could have been 1998 or 2008 or  2018. It is the same talking points,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…estimate--just think about this--Cleveland,  Ohio, a big city--I had the privilege of representing part of it for a  long time. There, their water and wastewater purification systems are  the highest cost for that city.\n\nThe energy cost of wastewater processing is the largest cost in any  city. Think about that. Every year, the purified water is thrown…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…important to  understand what the Bureau of Reclamation does and the fact that places  like I represent have enormous environmental debt because we had to  self-finance our water systems and so forth.\n\nIf I go to the South and I look at the Tennessee Valley Authority,  they take our jobs because of their ability to produce power because of  the Federal Government's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…2024-cycle was $2.6 billion. I think we are at a point now where  some of our elections, the money is just outrageous. People want to  feel trust in our institutions and our systems, but you want to get to  a place where you can do that. What we are experiencing now is  affecting our policymaking. It is affecting every single part of the  way this institution…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…America--not overseas, not  China.\n\nThese chips are vital to so many parts of our lives--our phones and  computers and our cars and our national security and even to the AI  systems that are already changing the world. Albany NanoTech will  specifically focus on what is called EUV, extreme ultraviolet  lithography research. It will be one of only two…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…programs. Taken together, these  investments will grow the workforce, expand access to care, and improve  health outcomes.\n\nProviders and patients need certainty now. Rural health systems are  fragile, and delays have real consequences. Passing this bill will  change lives and save lives, and we cannot afford to wait.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…nuclear arms control agreement between the United  States and the Russian Federation.\n\nNew START places verifiable limits on deployed strategic nuclear  weapons and delivery systems and provides for data exchanges,  notifications, and onsite inspections that give us direct insight into  Russia's nuclear forces.\n\nNew START followed a long line of arms…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…H.R. 1717, the  Communications Security Act.\n\nOne of the many vital functions that the Federal Communications  Commission serves is ensuring that our Nation's communications systems  are prepared to deal with cybersecurity threats and natural disasters.\n\nWe know that threats to critical infrastructure that put our  communities in harm's way are on the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…for the Department and for the Municipal  Police Officers Training and Education Commission. He is also certified  by the federal government in National Incident Management Systems and  Federal Motor Carrier Commercial Vehicle Inspections.\n\nMr. Speaker, I am honored and privileged to congratulate Chief Steven  Kingsborough's selfless, tireless, dedicated,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…requirements in Federal law governing Federal  workforce training.\n\nVarious reports and memos from agencies such as the GAO, Office of  Personnel Management, and the Merit Systems Protection Board indicate a  need to improve relevant educational opportunities for Federal  supervisors.\n\nThe Federal Supervisor Education Act, a bipartisan bill dating back…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…to become a Senior SUAS Operator. He  later transferred to 6th Marine Regiment Headquarters Battalion,  expanding his technical and operational expertise in unmanned aerial  systems.\n\nMr. Moceri's service included multiple overseas assignments in  challenging environments. Early in his career, he joined a Special  Purpose Marine Air-Ground Task Force…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Army at Red River Army Depot in 1972, where he would  serve for 39 years until his retirement in 2011. He applied his  expertise in electronics by working on cobra helicopter systems and  subsequently advanced from technician to senior management.\n\nBeyond his professional career, Dennis has demonstrated exceptional  dedication to civic and political engagement.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…power system.\n\nDuring my tenure in Congress, I have remained focused on the security  of the bulk power system and have championed efforts to enhance the  resilience of our systems, particularly for small and rural utilities.\n\nThe Electric Supply Chain Act will boost these efforts by putting DOE  in the driver's seat to attentively monitor emerging threats…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…district that is home to more than 78,000 veterans, I know how  essential it is to ensure our veteran health system works efficiently  and effectively.\n\nUnfortunately, outdated systems and fragmented logistics have created  real obstacles within the VA. These failures aren't just technical.  They are personal. They affect real people and real families.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…must win the rare earths and       critical minerals race with China to support our economy and       guarantee our national security.\n\nWith the Pentagon manufacturing weapons systems using over       80,000 parts subject to Chinese critical minerals export       controls, the U.S. can no longer treat critical minerals as       commodities that can be managed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Web3 technology as we go into seeing the  benefits of writing applications on a blockchain. We will see  competition in blockchains, just as we saw competition in operating  systems in computing. I think that breeds a lot of excitement.\n\nNo one can actually do that if we don't have clear rules of the road.  We have spent this morning debating those rules…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…fathom the grief of the loss of  her son, especially during the past 12 years.\n\nProtecting kids is a multifaceted process. We are talking about just  one aspect in our school systems today. That does not mean we  disregard. We may have different approaches, but I certainly want my  friend to know we hear her. I guess I will leave it there at this  point.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the position in the county's history.\n\nThroughout her tenure, she oversaw significant projects such as the  modernization of county infrastructure, updates to administrative  systems, and the implementation of long-term strategic planning  efforts.\n\nColleagues, elected officials, and staff throughout Michigan have  come to respect Karry Hepting's professionalism,…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…public spaces and  functional public buildings--simply could not be provided. The Oxford  Public Works team works every day to rebuild, improve and safeguard our  transportation systems, structures and facilities.\n\nMr. Speaker, please join me in recognizing National Public Works Week  and thanking the City of Oxford's hardworking Public Works  professionals,…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…States--\n\n(1) to combat international trafficking in persons for       purposes of the removal of organs;\n\n(2) to promote the establishment of voluntary organ       donation systems with effective enforcement mechanisms in       bilateral diplomatic meetings and in international health       forums;\n\n(3) to promote the dignity and security of human life…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…precipitously  in the years to come. How do we make sure we meet that demand? How do  we make sure we have not just the generation sources in place but also  the transmission systems that work together to make sure that we are  working against any sort of large-scale failure scenarios that make a  problem for us in the long term? We have to address those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…time. This real-time resilience  optimization for military readiness tool could track fatigue, deliver  tailored solutions for the wearer, and integrate with military health  systems all while keeping data secure.\n\nAdopting this amendment provides a targeted solution to the  challenges we face and ensures that American warfighters remain the  most prepared,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…These investments will support critical infrastructure and local  priorities that communities themselves identified, bringing  improvements from shoreline protection, to water systems, to supporting  economic development that will directly benefit residents across the  Ninth District.\n\nTogether, these bills reflect a disciplined approach to governing by…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]