[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…reports are critical for firefighting communities in  Maryland and around our country because they save lives. When released,  crews across this country gather around kitchen tables and read the  reports together.\n\nIn Maryland, our firefighters have told me that in those moments and  for the first time they were able to walk through an incident guided…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…down that protection. Under this bill,  an employer could say that you earned a tip once this week, so every  hour you work now counts as tipped work.\n\nA worker could wait tables one night, earn a few tips, and then spend  the rest of the week cooking, cleaning, or washing dishes and still be  paid as little as $2.13 an hour for that work. That is not…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698970/tipped-employee-protection-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…before Christmas? That is what the Republicans are setting up  across our country--22 million people who are all going to have this  financial bomb go off on their kitchen tables. It is going to make it  harder to buy presents. It is going to make it harder for these  families actually to plan for 2026. And it is all because these  Republicans aren't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…constitutional. Where is  the Federal jurisdictional nexus for us to be overriding State medical  boards in order to bulldoze into people's living rooms and their  kitchen tables to usurp the family decisionmaking process of Americans  across the country?\n\nMadam Speaker, I yield 1 minute to the gentlewoman from Oregon (Ms.  Salinas).\n\nMr. RASKIN. Madam…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…affects our children, who can't get healthcare for  themselves; our seniors, who also depend on others; and everyday  Americans across the country, who are at their kitchen tables tonight  or at their workplaces or are with their families, wondering: When will  it happen? When will I get sick, not just with a virus or the common  cold? When will there…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…my  students about irony. This bill is more aptly titled the Republican  invent new ways to pay workers less bill.\n\nHere is a closer look at the bill. For jobs like waiting tables,  which regularly generate a large proportion of pay from tips, employers  may pay their employees a small portion of the minimum wage, a mere  $2.13 an hour, as long as what…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698962/tipped-employee-protection-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…entire lives to support themselves and paid into a system that  promised to one day support them.\n\nOur seniors rely on Social Security to pay their bills, to put food  on their tables, to keep a roof over their head, and if the Social  Security Administration makes a mistake, it can be addressed in time.  However, our seniors can't afford to foot the bill…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Mexico leaders who are making history  as we stand on this floor tonight, who are leading the way, whose  voices are not only needed but necessary and who must be at all the  tables where decisions are being made.\n\nAs we know, these voices are currently being threatened by systemic  attacks on diversity, equity, and inclusion, as thousands of Federal…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…with disabilities.\n\nThey insist moms and kids won't lose food assistance, but this bill  will cut SNAP benefits for over 7 million Americans, stripping food  from families' tables.\n\nThey say new red tape will improve efficiency. Come on, we know  better. New GOP paperwork hurdles will cause millions of eligible  Americans to lose Medicaid and SNAP, not…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691438/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Somehow days stretch into weeks and then stretch into months  when it comes to healthcare for hardworking families.\n\nEvery night, those families are sitting around their kitchen tables  trying to figure out how to pay for childcare so they can get to work.  They are trying to figure out how they can pay their rent so their kids  have a safe place to grow…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cases, quadruple.  Families could see their premiums increase as much as $1,000 a month.\n\nOpen enrollment deadlines have already passed. Parents have sat at  their kitchen tables and realized that between rent, groceries,  childcare, and Trump's tariffs driving up the cost of damn near  everything, health insurance is something they could no longer…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…under the false pretense of targeting  waste, fraud, and abuse. If that were truly the case, they would be  part of the farm bill. Instead, this legislation rips food from the  tables of those in need to pay for tax breaks for the most wealthy.\n\nI have seen the need firsthand: miles-long lines on 61st Avenue as  families wait for the food bank to open. My…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692186/slashes-to-snap-benefits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…workers--people who  all rely on SNAP, the Supplemental Assistance Nutrition Program, to  help purchase food when times get tough, Republicans want to rip it  away, take food off the tables of hungry Americans.\n\nThis is a program that is there for all of us. If you lose your job,  if your hours get cut, if you become disabled or have trouble paying  bills, you…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689041/impact-of-proposed-snap-cuts"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…passed; and that the motion to reconsider be considered made and  laid upon the table.\n\nMs. ROSEN. Mr. President, food should never be a bargaining chip.  People's kitchen tables, their refrigerators should never be a  bargaining chip. This is not a partisan issue, feeding people in the  United States. We should not be mixing natural resources with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…facts. It slashes Medicaid, cuts Medicare, and dismantles  the ACA. It shutters rural hospitals, closes nursing homes, and wipes  out health centers. It takes food off kitchen tables, throws clean  energy workers out of jobs, and spikes utility bills. Why? So  billionaires and oil companies can  cash in. Big Oil gets handouts. Billionaires get tax breaks.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Republicans are working to extend the program. I want a bill to fund  SNAP, but it looks like we will not have Democratic support to pass.\n\nThere are a lot of empty dinner tables and a lot of children going to  bed hungry. Democrats have voted against reopening our government 13  times. Thirteen times they have voted to deny children food, sending…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…hard-earned  paychecks of tipped employees across the country and right at home in  my Third District of Arkansas, the people who work day in and day out  to put food on the tables of your favorite restaurant, as well as on  their own kitchen tables at home.\n\nThis bill, Mr. Speaker, is how we deliver bigger paychecks to our  constituents back home.\n\nOne…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…the party of the elites  and had stopped meeting people where they are, not understanding the  pain that they are feeling in their lives and their families at their  kitchen tables when they get up go to work and come home exhausted at  night.\n\nDemocrats need to learn from their mistakes. This moment is not  ideological. It is about who fights for the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Living's bucket  list.\n\nIn the Hostess City of the South, it is only fitting that lunch is  served with true southern hospitality. At Mrs. Wilkes', this means  gathering around tables set for 10 where guests take a seat, share a  meal, and leave as friends. Every day at 11 o'clock, the doors swing  open, inviting everyone to enjoy a rotating menu of classic…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…use  to file their taxes.\n\nThey say that they are the party of the working class. They are the  party of the taxing class because they do not want the people who are  waiting tables in Washington, D.C., to have no tax on tips because they  believe that they can spend their hard-earned dollars better than they  can. That is the difference between the Republican…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699682/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…missed.\n\nIn a town full of self-important figures, Doug was authentically  normal. I will certainly miss his wisdom, his sense of humor, and  incredible friendship. I turned the tables on Doug when it came to  nicknames. I affectionately named him the ``Governor of Jefferson,''  and he eagerly accepted that.\n\nDoug was a man of great faith, and I find comfort…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Josephine, four generations of the DeLeo family have embraced the  family business that today has an inventory that includes arcade games,  pinball machines, digital jukeboxes, pool tables, dart boards, skill  games, and ATMs.\n\nIn addition to supplying the region with entertainment options, DeLeo  Games has also been active in the community, sponsoring charities…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Capitol grounds in the Rayburn  foyer. Displays will include camping equipment, a canoe, a rocket,  robotics, knot tying, and Pinewood Derby car racing, alongside  educational tables sharing the story and scope of modern Scouting.\n\nThere will also be a dynamic panel discussion moderated by Scouting  leaders and alumni, highlighting the diverse ways this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…fueling the world. Not a single Member in this body wants  to see people go hungry, and I am personally offended by these lies.\n\nWe want families to be able to put food on their tables. The  difference is, Mr. Speaker, we want these programs to actually serve  the most vulnerable communities for generations to come: the single mom  taking care of kids too…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…tells you where the  material is moved. In this case it is not an open-pit mine. It is  subsurface.\n\nI would invite my colleagues to look at the science and look at the  water tables. They say 100 percent of the mines in the past were  pollutants. They are not pollutants if you have a mining plan that  undergoes the scrutiny that this one has.\n\nLastly,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 248) to require Amtrak to install baby changing tables in  bathrooms on passenger rail cars.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 248\n\nBe it enacted by…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…backbone of southern Ohio, our region is  home to countless farmers, ranchers, and producers who work hard to  secure our Nation's food supply and put food on our families' tables.  They work long hours out in the fields, often on their own, trying to  turn a crop and a profit in a challenging farming economy.\n\nBeing isolated from the resources that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…delivered a historic win  for the working class with no tax on tips and no tax on overtime. Many  folks--me included--at some point in their adult lives end up working  waiting tables or in some sort of service industry. So the idea now is  that more folks working their way up the economic ladder can now enjoy  no tax on tips and no tax on overtime, which…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Committee on Oversight  and Government Reform, or their respective designees, on each bill. The  rule provides for one motion to recommit for each bill.\n\nFinally, the rule tables H. Res. 581 upon the transmission of a  message to the Senate that the House has passed H.R. 4405.\n\nMr. Speaker, after over 40 days of the Democrat government shutdown,  the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is exactly the kind of hands-on, forward-thinking program we  need to develop the next generation of farmers, scientists, and  entrepreneurs.\n\nAgriculture puts food on our tables, clothes on our backs, and fuel  in our vehicles. Programs like this ensure it continues to do so for  generations to come.\n\nMr. Speaker, I commend the leadership, educators,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692938/recognizing-st-marys-area-school-district"}]