[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…could also be started  at any moment by Vladimir Putin, Xi Jinping, or any other leader of a  nuclear weapon state. Or it could be triggered by mistake.\n\nA single use of a tactical nuclear weapon, either by accident or  design, could trigger a flurry of escalating responses with far more  powerful strategic weapons that would cause incalculable loss…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…this brutal  war for good. The future of the Ukrainian people, the future of Europe,  and the future of democracy are dependent on how we meet this moment.  This is a moral, tactical, and strategic imperative.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…when all else is equal.\n\nAlso, Mr. Chairman, it has many exemptions that prevent impacts to  readiness and makes this a nonproblematic, commonsense provision. These  include tactical vehicles that are entirely excluded from this  preference policy.\n\nThe policy can only be put in place if the alternative-fuel vehicle  fully meets the needs of the Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Here we are with the other  side of it, which is where that energy might wind up, and that is in  the electric vehicle, nontactical to be sure, although there are places  for tactical vehicles.\n\nAt the same time, I think I finally figured out what we have here,  why we want to rename the Department of Defense the Department of War.  It is the war on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…being at an ICE facility to conduct oversight.\n\nHe has also violated the right to due process by dispatching armed,  masked, unidentifiable people, wearing plain clothes and tactical gear,  onto the streets of select American cities. They pull up on people,  jump out with assault weapons, force them into unmarked cars, and  disappear them. Their families…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…fashion and to Chairman Wittman for what he does each and every day to  make sure that we work together to make sure we support our  warfighters.\n\nThis bill continues the Tactical Air and Land Forces Subcommittee's  proud, bipartisan tradition and reaffirms our shared responsibility for  managing this risk.\n\nI am, however, disappointed that some in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…distinguished himself through the successful completion of       this rigorous and demanding course of instruction,       demonstrating outstanding physical endurance, tactical       proficiency, and unwavering dedication to the values of the       Marine Corps; and\n\nWhereas, he now prepares to continue his training at the       esteemed Infantry…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…30 minutes. And we also, as the  Presiding Officer knows, have hundreds of nuclear bombs in this country  and others.\n\nNow Vladimir Putin is recklessly threatening to use tactical nuclear  weapons against Ukraine. That is the equivalent of a Hiroshima bomb.  That is what we would call it today. China is expanding its arsenal of  more than 600 nuclear…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…lost revenue or had to modify their operations because  employees and customers are afraid to come to work or to patronize  their business.\n\nWhen masked ICE agents in full tactical gear inflict violence against  American citizens and then show up at businesses without identifying  themselves, small businesses pay the price.\n\nMost businessowners support…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…The skill, professionalism, and courage are beyond question  of these men and women.\n\nBut military capability is not the same as strategic wisdom. The  ability to achieve tactical objectives does not guarantee beneficial  long-term outcomes, and executing a successful raid does not constitute  a plan for governing a nation of 28 million people.\n\nCongress…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…years of working on  this piece legislation to make sure we get it done on behalf of  America. We have a that long, proud tradition of bipartisan work by our  Subcommittee on Tactical Air and Land Forces, with special thanks to my  chairman, Chairman Wittman, and his staff. We all work together and  have a commitment to make sure we get this done.\n\nMr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…anti-aircraft systems,  carried out cyber operations to shut down power in Caracas, and  executed a helicopter assault  on the Presidential compound to seize Maduro and his wife. The tactical  success of this mission is a testament to their capabilities and also  to the incredible courage and quality of the men and women of our Armed  Forces.\n\nHowever, military…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…control autonomous  vessels.\n\nThe Coast Guard Authorization Act of 2025 also expands the Coast  Guard's and Customs and Border Protection's use of cutting-edge tools,  like tactical maritime surveillance systems, which are blimp-based  radar systems to find and interdict drug runners, poachers, and human  traffickers at the Texas-Mexico border in the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Bridges; six (6)       M577A3 Command Vehicles; twenty-six (26) M1152A1 High       Mobility Multipurpose Wheeled Vehicles (HMMWV); twenty-six       (26) M1279A1 Joint Light Tactical Vehicles (JLTV); one       hundred sixteen (116) M2.50 caliber machine guns; two hundred       thirty-two (232) M240 7.62mm machine guns; six (6) AGT 1500       gas turbine…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Mark served as the  Director of Strategy for Raytheon Missile Systems in Tucson, Arizona.  In 2010, he and his family moved to Texas, where he became the Program  Director of Tactical Intelligence Systems for Raytheon. In this role,  Mark oversaw hundreds of millions of dollars in annual sales and  government contracting. He currently works as a Senior…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…people's  representatives in Congress debating the issue. We owe it to all  Americans who have worn the uniform to honor that humbling  responsibility.\n\nMoreover, despite the tactical success of our strikes, they may end  up proving to be a strategic failure. It is unclear if this  intervention will fully curtail Iran's nuclear aspirations or, in fact,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "James Risch", "party": "Republican", "sentence": "…AN/ARN-149(V)3 Automatic Direction Finders (ADF);       sixteen (16) remanufactured AN/ARN-149 (V)3 ADFs; nine (9)       AN/APN-209 Radar Altimeters; twenty-seven (27) AN/ARN-153       Tactical Airborne Navigation (TACAN) systems; sixteen (16)       Manned-Unmanned Teaming International (MUM-Ti)(UPR) Air-to-      Air-to Ground Data Link Systems; twenty-four (24)…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Operational Objectives and Support for Transition Program to  efficiently align high-potential technologies with unmet operational  needs.\n\nAs chairman of the Subcommittee on Tactical Air and Land Forces, we  have ensured this bill delivers on maintaining a capable and lethal  fighting force by authorizing over $38 billion for the development,  procurement,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…team at the  jail, developing a supervisory training manual for the division, and  working in patrol. He has overseen teams of deputies and supervised  numerous high-risk and tactical incidents.\n\nIn 2024, Lieutenant Jason Doolittle was promoted once again, this  time to field operations lieutenant. He currently serves as the  commander of the south Placer…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the aircraft modernization were eight (8) LN-260 Global       Positioning System (GPS) and nineteen (19) Multifunctional       Information Distribution System Joint Tactical Radio Systems       (MIDS JTRS). Also included were AN/APX-126 Advanced       Identification Friend or Foe (IFF); ARC-210 Radios; KIV-78       Cryptographic Appliques; other…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689947/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…single strike was in full  compliance with the constitutional statutes. Both open-source reporting  and the classified briefing we received demonstrated this was a  brilliant tactical move, which was brilliantly planned and executed  after in-depth conversations with the intelligence community and the  talented array of Presidential advisers that President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "James Risch", "party": "Republican", "sentence": "…or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nUp to four hundred fifty (450) AIM-260 Joint Advanced       Tactical Missiles (JATM).\n\nUp to five (5) AIM-260 JATM Integration Test Vehicles       (ITV).\n\nUp to thirty (30) AIM-260 JATM Guided Test Vehicles (GTV).\n\nNon-Major Defense Equipment:…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(AW) pods with IMPS.\n\nThirty-two (32) M403 Extended Range (ER) GMLRS AW pods with       IMPS.\n\nThirty-two (32) M404 ER GMLRS Unitary pods with IMPS.\n\nSixty-four (64) M57 Army Tactical Missile System (ATACMS)       pods.\n\nNon-Major Defense Equipment: The following non-MDE items       will also be included: Low Cost Reduced Range Practice Rocket       pods;…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…navigator training and an initial assignment  flying the F-4 Phantom II at Seymour Johnson Air Force Base, North  Carolina, he was deployed to Southeast Asia, joining the 555th Tactical  Fighter Squadron at Udorn Royal Thai Air Force Base, Thailand.\n\nFollowing his combat tour, Colonel DeBellevue attended undergraduate  pilot training and became a full-fledged…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…C-130H/J, including 279  combat hours in support of operations in Hungary, Iraq, and  Afghanistan.\n\nMajor General Coburn has been a close partner in improving our  Nation's tactical air mobility operations capability through  recapitalization of the Air Force Reserve's C-130 inventory. She has  heavily invested in servicemember quality of life improvements…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Shield. Within a year, they would pivot to  Operation Desert Storm, followed by Operation Southern Watch and later  the Global War on Terror, providing real-time information for tactical  forces, theater commanders, and national decision makers in what is  believed to be the longest continuous deployment for a unit in U.S.  military history.\n\nToday, the 55th…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…New  York Police Department. His leadership, his commitment, and his  generosity have been nothing short of extraordinary. He has led complex  criminal investigations and tactical operations with unparalleled  precision and excellence. His expertise spans critical areas such as  counter-terrorism, crisis management, and investigations, ensuring the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}]