[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Latinos, Asians, and others  notwithstanding the progress made in my lifetime.\n\nAs a child of the generation that shone a light on and helped pass  laws to end such racist tactics, for most of my life, we have made  strides to ensure that we moved past that America. But now we are  returning to an America that I do not recognize, nor is this an America…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…have seen  the Department of Justice sue 24 States that happen to be led by  Democrats. They are targeting their voter rolls in addition to the  intimidation and strong-arm tactics.\n\nWe also know that Donald Trump says he regrets not issuing an  Executive order in his first term that directs the military to  illegally seize voting machines. He is not…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…create chaos in every State in  America, and it is going to make it harder for Americans to participate  in their democracy.\n\nIt appears to be the latest in a long series of tactics, like polling  place closures and gerrymandering, designed to silence voters that  Republican politicians don't think they can win.\n\nThat is not how democracy works. You don't…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…of the       components of medical debt which are completely out of       control of the patient. In most cases these practices are       unlawful, but hospitals use these tactics frequently to press       patients to pay, including:\n\nDouble billing: Companies cannot attempt to collect on       medical bills that have already been paid by the consumer,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…nurse, Alex Pretti, who was fatally shot by an ICE agent  during the same enforcement surge in Minneapolis, sparking widespread  protests and intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…in military  gear firing tear gas and other projectiles into a crowd of peaceful  civilians and reporters. Even a child was injured by shrapnel.\n\nUpon seeing these violent tactics, I demanded to speak to the person  in charge, but I was denied.\n\nAs the elected Representative of the Central Coast, I have a duty to  respond to my constituents and demand…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…patriotism, flexible hours, and financial  independence.\n\nI applaud my colleague, Representative Delia Ramirez, for offering an  amendment to require specific trainings on these tactics to provide  veterans and their families with clear, actionable guidance to protect  their hard-earned benefits. It is unfortunate that this commonsense  amendment was voted…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…We must have accountability, and if this  administration plans to use our military installations as detention  facilities, then DOD must play a role in curbing DHS' inhumane tactics.\n\nI ask all my colleagues to support these amendments.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I reserve the balance of my  time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695107/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…controllers are  paid. They are heroes for having worked for so long without pay.\n\nWe need to stop the madness of this trend line. It is a through line  in the administration's tactics here. It is a through line of cruelty  and stupidity that has magnified the costs for the American people not  just in blue States but all across the country.\n\nWe should seek…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…are conditional.\n\nWhen agents run into a daycare center and drag out a teacher in front  of the children and parents, they are not following the law. They are  using gestapo tactics.\n\nNone of this is about public safety. More than 4,000 people have been  arrested by Federal agents in Chicago, but only about 3 percent have  any type of criminal records.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…States for himself, and he has  sought to do it in a number of important ways that ought to concern  this body, especially because we represent our States.\n\nForemost among his tactics, he wants to supplant States in  determining the means, methods, and mechanisms for placing our votes.  Those mechanisms vary. For example, some States use more mail-in voting…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…This conservative  Federal judge concluded that the lines were racially drawn--racially  drawn. With the lines being racially drawn, this means that they were  using racist tactics.\n\nWe want to condemn what the judge found to be the case in Texas from  the three-judge panel, that this is racist. This is what a three-judge  panel concluded: This is racist.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…we applaud bipartisan efforts to       decrease the risk of lethality in law enforcement encounters       and commend Congress' commitment to encourage de-escalation       tactics, we oppose H.R. 2189/S. 1283 and H.R. 4242 as written       and urge members of Congress to oppose these bills in their       current form.                       Unnecessary…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…energy and technology--our greatness has always  come from empowering science, not mocking it.\n\nTrump and Republicans are working to gut these critical advancements.  Their tactics echo the worst chapters of history, and they mirror the  tactics of authoritarian regimes today. If we fail to call this out, we  risk normalizing it.\n\nI believe the American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…hairdresser. He  is a man who fled his home country to come to the United States because  he feared for his life because he is gay.\n\nWe are being lied to. These kinds of cruel tactics are not necessary  to keep us safe. This is about taking away due process and intimidating  us into silence and submission. If this administration will do this to  Andry,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…such       borders.\n\n2. The information collected by operators of UAS at or near       the borders, and a description of how such data is used by       malign actors.\n\n3. The tactics, techniques, and procedures used by malign       actors operating UAS at or near the borders, including how       such actors acquire, modify, and utilize UAS to conduct…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…the International Monetary Fund, or IMF.  Unfortunately, China has consistently blocked Taiwan's participation in  international forums, including IMF. China pursues these tactics  because they know that financial security is just as important as  military security.\n\nDefense experts have identified that China could exploit Taiwan's  financial system…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…to do us harm with this emerging  technology. The Generative AI Terrorism Risk Assessment Act ensures  that our homeland security and capabilities remain ahead of adversary  tactics.\n\nOur response cannot be reactive. We must anticipate the future of  terrorist methods and be prepared before these threats materialize.\n\nMr. Speaker, I urge all of my colleagues…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…the responsibility of funding the Federal Government is one that I take  very seriously, especially in light of our Nation's debt surpassing $38  trillion.\n\nThe performative tactics that we have watched over the last 7 weeks  have truly been a disservice to Americans. My friends across the aisle  should never have put leverage or politics over those people…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…in the fight to secure our homeland.\n\nDespite this success, we remain vigilant in the face of continuing  threats against our country. That means continuing to analyze our  tactics, refine our strategies, and ensure that critical information is  efficiently shared between agencies.\n\nInformation silos are not unique to the intelligence community, but…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…the production,  for at least 50 more critical minerals.\n\nThe Chinese wield this authority through export controls to disrupt  supply chains as well as market manipulation tactics to ensure no  investments flow into these job-creating industries.\n\nAlmost 50 years later, the answer to this problem lies in our ability  to reshore essential energy production…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…pro-American sentiment.\n\nUnfortunately, our bilateral relationship with Georgia has been  eroded by the ruling Georgian Dream party's moves that mimic Russia's  authoritarian tactics, as well as their rapprochement with China and  Iran.\n\nThe opportunities provided by a pro-Western, democratic Georgia are  manifest. Georgia's strategic location on the Black…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…success, and our environmental strategies enhance, not hinder,  operational readiness and support peace through strength.\n\nI urge the Democrats to drop their misplaced stall tactics and allow  for his immediate confirmation.\n\n109, Dale  Marks, to be an Assistant Secretary of Defense; that the Senate vote on  the nomination without intervening action or…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…plays no part  in the forced slave labor of the Uyghur people. America must continue  to lead with strength and morality on the world stage and refuse to  fund these brutal tactics and cruelty.\n\nPassing this critical legislation is the first step. I urge my  colleagues to vote ``yes.''", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…step in seeing this number increase over the coming years.\n\nThis isn't just something that we should consider doing. It is  necessary. In the face of increasingly unscrupulous tactics from the  Chinese Communist Party such as rampant intellectual property theft,  corporate espionage, the use of slave labor, and environmentally  reckless energy practices,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…strategies to  strengthen domestic production, and invest in innovative technologies  that expand American mineral independence. It equips our Nation to  counter anticompetitive tactics and human rights abuses in global  markets while ensuring our own energy systems are resilient, secure,  and self-reliant.\n\nThis is about unleashing American energy. This…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…somebody to propose to develop a project. It doesn't change any of the  permitting laws. They still have to go through every permitting law.\n\nThere seems to be a lot of scare tactics on what this mine, which  hasn't even been permitted or approved yet, is going to do, but we know  one thing. It will have to stand up to all the rigorous permitting  requirements…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…American farmers  and ranchers.\n\nBy acting now and providing assistance to our producers during these  negotiations, we will send a very strong signal to China that their  tactics will not work.\n\nThat is how we secure better market access for our producers for the  long term. That is exactly what President Trump did in his first term  in the negotiations…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…philosophy that if 1 regulation is good, then 10 more must be better.  You can never do enough.\n\nOf course, my colleagues on the other side of the aisle have started  with the scare tactics claiming the sky is falling, the air quality is  plummeting, and people are dying and they are not going to have  healthcare. There is no evidence for that, of course.\n\nThe…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…insulting women.\n\nI am sick and tired and I know women across this country are sick and  tired of being talked down to and being insulted repeatedly with the  fear-mongering tactics of the left. It is disingenuous for them to  stand there and to continue to say that women will not be eligible to  vote.\n\nThis is about protecting one of our most sacred…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}]