[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Liberty cannot be taken away solely based on       accusation, without more."}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "We have taken away women's rights to go to Planned Parenthood to have  the healthcare that they need, important healthcare about their bodies."}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Medicare, healthcare, SNAP payments, and nutrition payments should  not be taken away from fellow passengers on this Earth."}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "When I go home and I talk to a working mother, a person who wakes up  at 7 in the morning and works two jobs every day and has to send her  kid to school and relies on the food programs just to keep her family  healthy, just to have something in the stomach of that 7-year-old who  is going to first grade, and to know that their food assistance  programs could get taken away, we are doing the exact opposite of what  Republicans promised that they would do for this country."}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Speaker, 13.7 million Americans will lose their healthcare, and  millions of families will see their food assistance taken away."}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Actually, this bill says that  nothing shall be construed to restrict TANF funding for these centers,  meaning that funding could not be taken away from them even if the  center engages in deceptive practices or even causes a woman's death."}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Programs like Medicaid and Medicare, Consumer Financial Protection  Bureau, FAA, and funding for HBCUs, historically Black colleges and  universities, Federal jobs being taken away  from individuals with little or no notice and promise of payment that  has only fallen short or to be told that they would get it and found  out only to be lies."}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "He has taken away  people's healthcare, launched costly trade wars on our allies abroad  while making everything more expensive at home, and has spent his days  flattering himself, putting his name on buildings and constructing  monuments in his own honor."}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Relying on Medicaid, SNAP in the past, and  SSI, I worry about what would happen to me and my friends if these  programs were taken away."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "So $8 billion was taken out of foreign aid, and $1  billion was taken away from public broadcasting."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "People who are just struggling to get by are having precious  resources taken away from them."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "They are also concerned that there is nowhere  to turn, even if the coverage is taken away."}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "On March 20, the administration announced that they are going to  start a process of restoring firearms rights to individuals who have  had them taken away because they had serious criminal records."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "The possibility of TPS being taken away has had a       devastating emotional impact on our Haitian clients."}, {"senator": "Mark Alford", "party": "Republican", "sentence": "We have to be able to defend our rights for ourselves and  others when there is risk of being taken away."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "They come here knowing they can invest their capital, build a  business, and not have it taken away by the State."}, {"senator": "John Joyce", "party": "Republican", "sentence": "As a nation, we can no longer sit by while future  generations of American workers, parents, and community leaders are  taken away from us."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": ".''\n\nIf water is taken away from agriculture in the Central Valley, it is  unsustainable."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "The servant nature is  not bestowed and cannot be taken away; it is who one is deep inside."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "It was taken away from her  because people were purposely put on the street who are dangerous."}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "We are worried  about the standard of living that they have taken away from them."}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Funding for these mothers and  fathers, many of whom are underserved, should never be politically  taken away."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "The  government has taken away his natural purpose in life."}]