[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…skyrocket at the end of December,  Republicans' solution is an unserious proposal that kicks millions of  Americans off their coverage, puts healthcare out of reach, and takes  away women's freedom to make their own healthcare decisions.\n\nUnder Republicans' concept of a healthcare plan, working Americans  will be forced to make tough decisions, such…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698314/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…new name about working families. No matter what label they  slap on it, the facts don't change. Trump and Republicans' big, ugly  law makes the cost of healthcare go up and takes away healthcare from  working families.\n\nRepublicans hand out an average of $80,000 in tax breaks to every  millionaire. Where do they get this money from? Each millionaire tax…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…are so out of touch with the reality of American families  right now, and it is shocking to call these cuts not meaningful when  their bill will hurt working families.\n\nIt takes away food and healthcare from millions and millions of  people, their own voters, but yet they are not meaningful cuts.\n\nThese cuts are certainly meaningful for all the kids and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…assistance will mean that more people, many  of them children, will go hungry. This bill guts the Supplemental  Nutrition Assistance Program, otherwise known as SNAP, and takes away  critical food assistance from vulnerable groups, including veterans,  people who are homeless, stay-at-home parents, and youth aging out of  foster care. Now is not the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…excited about it. China, Russia, North Korea, Iran, they are excited  about this package. They would love to do this themselves if they  could, because they know that this takes away our strength and our  relationships, and then they will try to jump in. They are laughing.  They are happy because they see us surrendering, because that is what  this is.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…the American Dream. What are my  Republican colleagues doing about that?\n\nThe majority voted for a big, ugly bill that makes it even harder to  raise a child in America. It takes away healthcare from 16 million  Americans. It takes food benefits from working parents. My colleagues  on the other side of the aisle are cutting half a trillion dollars from…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692545/rescissions-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…just another way to       undermine the Medicaid expansion.\n\nAttacks on the Medicaid expansion are often based on false       claims that covering adults with low incomes takes away care       from groups traditionally eligible for Medicaid. In reality,       Medicaid expansion supports better outcomes for all groups,       including children, older…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…certainly justified because  the more and more that Americans look at this bill, the more and more  they despise it. It steals their Medicaid. It jacks up their premiums.  It takes away their jobs. And it gives trillions away to billionaires  and special interests. This is a nonsense and destructive piece of  legislation, and it makes no sense for Republicans…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…tax credits will hurt  Louisianians and Americans across this country. It allows premiums to  skyrocket for tens of millions of Americans by an average of 114  percent and takes away coverage from around 4 million people.\n\nThat is unacceptable by every front. Any way you slice it, it is  unacceptable. We are the richest country in the world. This Nation…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…which is the eastern border of Washington, D.C., so I have seen  the results of some of these high-speed chases.\n\nThe bill that is drafted, that he has proposed, actually takes away a  reasonable balance that was drawn by the people here of the District of  Columbia, as is their right for a democracy.\n\nAlso, one of the things we need to keep in mind,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…restore trust in a government that  should be working for the people.\n\nMr. Speaker, I urge my colleagues in the Senate to reject this  corrupt bargain and pass our bill that takes away this unethical and  corrupt payout and to stand with the families who sent us here. These  are families who deserve a government as honest, hardworking, and  committed as…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…President has done to make things more  expensive in our country.\n\nMr. Speaker, I rise in opposition to all of the Republican  resolutions on the floor today, one of which takes away the right of  California or any State to protect residents from dangerous pollution.\n\nThe illegal attack on the vital clean air protection set by  California would choke…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690390/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise today to discuss the fiscally  irresponsible one big, beautiful bill that simply gives tax breaks for  the richest Americans and takes away services for working- and middle- class families.\n\nHere are the facts: We currently have about a $36 trillion debt, and  we are spending right now $2 trillion more every…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…America's second largest Holocaust museum. Those who visit  see thousands of artifacts from victims and survivors and their  families. There is one lesson that every visitor takes away: All who  walk through its doors learn the importance of tolerance, the need to  choose love over hate. I have been reflecting on this lesson in the  wake of the two awful…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…any discussion of Chappie James?  I have never been able to understand what it is about folks who feel  that to give one person credit for having done what they did takes  something away from another person's contributions.\n\nWe all believe in this great country. There isn't a need for it to be  made great. It is already great. We have all got to learn…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…having full reservoirs in California while  many farmers are only receiving half of the water they are supposed to  be getting is unacceptable, and it is unsustainable. It takes away the  myth that this is all due to drought conditions. It is not drought  conditions in California right now, yet farmers are still only getting  half the amount of water…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…local tax deduction, even though Wisconsin is a mildly  high tax State.\n\nMadam Speaker, I think encouraging any more taxes anywhere in the  country hurts us all as it slowly takes away the freedoms of people in  America and makes America more of a country that you would not want to  move to start new manufacturing. That is one of the things that is  going…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…support this legislation, and I urge all of my  colleagues to do so, as well.\n\nIf my Republican colleagues really don't like a CBDC, then vote for  the GENIUS Act, which takes away all the arguments for it.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…to a small business, ``thou shalt do this,''  the compliance cost of doing it is borne by that business, and it comes  out of their bottom line or out of their pockets. It takes away from  their ability to invest in expanding, growing, and hiring more people.  It has the same effect as taking another dollar of tax out of their  pocket to pay not for their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}]