[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…he was going to do. He gave us  the blueprint in Project 2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within weeks of taking office, the  Department of Education quietly rescinded guidance encouraging schools  to teach honest, inclusive Black history. Instead, they are attempting  to whitewash history…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Furthermore, as we speak of the ideals of the Declaration of  Independence, we would be horribly remiss not to recognize the violence  taking place in this country.\n\nSince taking office, the Trump administration has established a  legacy of violence and cruelty. Trump's administration has empowered  and unleashed brutal attacks against Latino, Black, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…cyber  capabilities are a unique threat. Despite knowing this to be true,  Trump has taken steps to tear down our cyber capabilities in a  comprehensive manner. Why?\n\nSince taking office, Elon Musk and DOGE have decimated cybersecurity,  CISA, our premier cybersecurity agency, with personnel cuts and stop  work orders.\n\nWhy would anyone do that?\n\nIn March,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…forward to prevent a shutdown and Congress's authority being  attacked by unchecked Office of Management and Budget Director Russ  Vought and a lawless Administration.\n\nSince taking office, the Trump Administration has stolen resources,  appropriated by this committee, for programs and services across the  federal government that help to grow the middle class,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Constitution of  the United States of America, leaving the judicial branches of  government as our strongest tool, leaving the courts as our only hope.\n\nWithin hours of taking office, President Trump issued an executive  order that would have unlawfully denied birthright citizenship, which  is guaranteed to everyone born in America by the 14th Amendment.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…officials accountable.\n\nThey are able to do this because they are independent of the  officials they oversee, and until recently, were only removed for  cause.\n\nHowever, since taking office, President Trump has fired over 20 IGs  across the government. The majority of these IG firings took place in  the first week President Trump took office and violated lawful…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…troubling and uncertain economic times.\n\nUnfortunately, bad actors took advantage of the program early in the  pandemic when SBA removed or weakened internal controls. Upon taking  office, the Biden administration reinstituted longstanding antifraud  controls and put new safeguards into place to curb the flow of pandemic  dollars to fraudsters.\n\nBefore issuing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…from countless New Jersey residents whose lives are upended by the  constant, incessant noise of helicopters traveling at low altitudes  over our neighborhoods.\n\nSince taking office, we have consistently worked to address these  challenges, from the noise and nuisance they cause to the safety risks  that have been well documented.\n\nIn the 118th Congress,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump's untenable tariffs which act as a tax on Americans and  their businesses.\n\nAt the same time, as families struggle, Trump has increased his  wealth by billions since taking office, which is a slap in the face to  American families struggling to put food on the table.\n\nJust last week, alarming new information came to light regarding  foreign governments…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…producers, Delaware farmers feed families  here at home and around the globe and contribute to an industry that  supports thousands of jobs in Delaware.\n\nUnfortunately, since taking office, the Trump administration has  broken their promises to our families and breached the trust with our  farmers.\n\nIn week one, this administration illegally froze funding…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…than 44,000 of them work in energy efficiency.  More than 300 local contractors alone work on projects directly  supported by the Weatherization Assistance Program.\n\nSince taking office, Trump has been jeopardizing clean-energy jobs in  Minnesota by terminating clean-energy incentives in his so-called ``One  Big Beautiful Bill,'' canceling grants and illegally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Speaker, last year, as I think everyone knows,  President Donald Trump repeatedly promised that energy bills across the  country would be cut in half within 12 months of his taking office.  This shows a State-by-State analysis of how much electricity bills have  gone up instead of being cut.\n\nJust to mention to my two colleagues, here in Kentucky, it says…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…New Englanders.\n\nAlan was a philanthropist, businessman, and reformer, but, most  important, he was a dear friend, husband, stepfather, uncle, and  granddad.\n\nBefore taking this office, and once sworn in, Alan provided me wise  counsel sharing pragmatic, solutions-oriented advice on how to be of  service and make change.\n\nAlan exemplified community…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…directive for these students to       file complaints with the Department of Education, which       the Trump Administration has been systematically       decimating since taking office, even promising to       dismantle the agency. A series of Executive Orders issued       early in 2025 substantially impacted the Department's       enforcement of civil…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…stablecoins while the  President, his family, and members of his administration are personally  invested in this market and directly profiting from it.\n\nMr. Speaker, 3 days before taking office, President Trump launched  his own memecoin. When the coin's value collapsed, his insiders cashed  out. Everyday investors were left holding the bag. It is estimated that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693830/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…During  his tenure, his colleagues elected him to serve as the Commission Chair  from 2017 to 2018.\n\nIn 2021, Mayor Bovo was elected as Mayor of the City of Hialeah.  Since taking office, he has been an advocate for transparency, public  safety, and accountability. Under his leadership, Mayor Bovo Hialeah  has served his constituents with pride and with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690226/recognizing-hialeah-florida-mayor-esteban-bovo"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…I come to the floor today not because I want to but because I am  compelled to. I love my country and the principles upon which it is  founded. The oath I took upon taking this office is to the Constitution  of the United States and not to any person or faction.\n\nI want to preserve the divisions of power that protect us and our  children from the rule…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…With  his team in place, President Trump has been able to execute effectively  and efficiently.\n\nThe Senate has also acted decisively to secure the border. Within  days of taking office, Senate Republicans passed the Laken Riley Act.  The Laken Riley Act is named after a young nursing student in Georgia.  She was murdered by an illegal immigrant. She was…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Last November, the American people overwhelmingly elected President  Trump with a clear mandate to secure the border and restore public  safety in our communities. Since taking office, President Trump has  delivered on this promise.\n\nDespite the incredible efforts by this administration to secure our  border and remove criminal aliens from our country,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…These actors threaten the  safety of the Haitian people and the interests of the United States.\n\nTo its credit, the Trump administration responded swiftly. Within  days of taking office, it approved nearly $41 million to support the  Haitian National Police and the Kenyan-led Multinational Security  Support Mission. It also issued a humanitarian waiver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}]