[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Men's  health cannot be confined to 30 days in June.\n\nMen's health is every day. Paying attention to the warning signs is  every day. We must recognize the importance of taking care of  ourselves, having regular checkups, eating right, and dieting.\n\nWe must realize the importance of exercising and taking care of our  mental health, particularly in the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…they no longer had a job, that  they were no longer wanted. These aren't just nameless, faceless  bureaucrats; these are Americans who signed up to serve our country by  taking care of veterans. They deserve to be treated with respect. These  are the people on the frontlines of veterans' care and services, and  they were fired without even a thought.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…people who we are losing, many of them  have had years of experience. They choose to work for the Forest  Service, for the Federal Government, because of their passion for  taking care of our public lands. They are talented. They are critical.  They are experienced. They  choose to do this, frankly, for lower salaries simply because they want  to serve.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…talking about overreach and  possible overuse, contrary to the spirit of our Federal system of a  National Guard force that should be fighting our adversaries abroad or  taking care of natural disasters or catastrophes, not employed as local  police, which they are not equipped or trained to do as readily as  civilian police.\n\nWith that, I will turn…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…before Medicaid. When I was a young kid, it was not unusual to go visit  someone, and in the front room there would be the hospital bed, the  grandmother, and the mother was taking care of the person and that was  healthcare back then. But after Medicaid, we were able to create a much  more effective healthcare system.\n\nAnd this will touch not just the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…said no. By  refusing to act, they are, once again, protecting a pedophile, allowing  him to lie in a place of honor instead of standing amongst survivors  and justice.\n\nTaking care of veterans. I proposed suspending commissary debit card  fees that unfairly tax veterans and their caregivers. I also proposed  eliminating medical copays for Native Hawaiian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…they were promised and the benefits  they earned; and they need them and deserve them today.\n\nI am asking my colleagues to advance this legislation now. The  principle of taking care of our veterans has never been Democrat or  Republican. The Veterans' Affair Committee is supremely bipartisan. My  hope is that tradition will continue, including today.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…just take a pen and with the stroke of a pen they are  off. There is no concern about children in school, there is no concern  about loved ones who may be ill, whom they are taking care of, being  the chief breadwinner for the family. There is no concern.\n\nYou have got billions, Mr. Musk.\n\nWhy should you care about the concerns of people who have much less…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…are on Medicaid and Medicare, but I want to also remind  us that if there is a doctor, if there is a clinic, if there is a  hospital that is receiving a reimbursement for taking care of a  recipient on Medicaid, that doctor, that hospital, that community  clinic is open to serve you, too, because that reimbursement allows  that clinic, that doctor, that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…from Virginia, for his remarks and for coming here this  evening to talk with us.\n\nMr. Speaker, home health aides are some of the most essential workers  in our economy, taking care of our parents and grandparents as they age  and ensuring that sick and disabled people can live with dignity.\n\nIt is downright despicable that this administration has proposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…much for this piece of legislation. I thank her for all the really good  hard work that she has done in rallying the troops to do the right  thing. I thank her very much for taking care of our victims and making  sure they have these provisions. I, too, have been a victim, so I thank  her personally.\n\nMr. Speaker, I rise in support of H.R. 909, the Crime…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…out against the Republicans' disastrous budget  proposal and to fight for our women, children, and families.\n\nFor more than 20 years, I have had the honor and privilege of taking  care of OB/GYN. One of the great joys of my job is caring for my  patients during their pregnancies and helping them grow their families.  I carry my patients and their stories…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691420/gop-tax-scam-hurts-everyone"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…we ever discuss what happened  in Hiroshima. It wasn't until I was well into my adulthood on my first  trip to Japan visiting Hiroshima and visiting Kikue, who was there  taking care of her mother, that I learned that she was a ``survivor'';  ``Hibakusha,'' that is the Japanese word for survivor, of the atom  bomb.\n\nShe lived in the outskirts of Hiroshima.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the arts, outdoor recreation opportunities, and small  community feel, along with the work of the more than 70 nonprofit  organizations that embody the town's attitude of ``taking care of  ourselves and our neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate Evergreen, Colorado, on its 150-year-…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…with your vote.\n\nDo you stand with them, Mr. Speaker, trying to fix the affordability  crisis, or do you stand with Donald Trump and my Republican colleagues  who are just taking care of those for whom the economy is booming, the  billionaires of our country?\n\nThe American people are watching. This is very simple. Why did we  take a year to get this vote?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…modernization of outdated  facilities and equipment, strengthening the safety and reliability of  our national airspace system.\n\nWe provide more than $64 billion for highways, taking care to send  the overwhelming majority of these dollars back to the States because  it is at the State level where the best decisions are made, not here in  Washington.\n\nWe…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…served in the Army, and my father long said he first really  understood what it means to be an American when he was responsible for  others and others' lives when deployed.\n\nTaking care of them is our sacred obligation. So while we keep  fighting for better healthcare, more affordable healthcare for all  Americans, my bill will pay our Armed Forces now.…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…that when they were in the majority and it was the Biden  administration they didn't push for this legislation shows that it is  more about the politics than it is about taking care of our veterans.\n\nMr. Speaker, I encourage all of our Members to support this bill, and  I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…particularly western North Carolina. I represent hardworking Americans  playing by the rules, doing everything they can right--paying their  taxes, raising their kids, and taking care of their neighbors whose  lives were impacted substantially by Hurricane Helene that hit last  year. It tore through our region. It destroyed roads. It destroyed  homes.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…food on their tables. The  difference is, Mr. Speaker, we want these programs to actually serve  the most vulnerable communities for generations to come: the single mom  taking care of kids too young to be in school, the disabled, and the  elderly, not the person who wants the government to foot their bill  while they sit at home.\n\nWhy would we willingly…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…on  healthcare. One of the great scams we are trying to fix right now is  what happens when the washing machine is actually where you are padding  State budgets instead of taking care of healthcare, but that will get  protests.\n\nEighteen States have higher credit ratings than we do. It is just an  interesting thought experiment. How about if I told you…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…prevent waste, fraud, and abuse in  the program.\n\nOften, veterans may need to attend school or training online or  hybrid, not due to performance but due to the necessity of taking care  of their families or loved ones. This bill would respond to those  realities, and I look forward to working with my colleagues in the  Senate to get the bill signed into…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…cause of death in the United  States, affecting millions of Americans each year.\n\nThe good news is that many heart conditions are preventable through  small everyday choices. Taking care of our hearts doesn't require  drastic changes. It is about simple, constant, consistent habits:  staying active, eating a balanced diet, managing stress, and keeping up…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of seeking help.  It is not a sign of weakness.\n\nLike law enforcement officers, our pilots and air traffic controllers  cannot fear that their livelihoods are at stake for taking care of  themselves. These efforts are what keep skies safe in the first place.\n\nIn December 2023, the FAA recognized the need to reform its current  policies and established…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}]