[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "Taking care of your  children  is a parent's duty.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Kids in your State and my  State think they are taking Adderall, not realizing that this has those  toxic things that can kill.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological", "date": "2025-02-25"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "This is what we  expect of very poor, impoverished countries with dictators running the  place, taking a cut of everything, but instead it is the President of  the United States doing it.", "title": "Motion to Discharge--S.J. Res. 54", "date": "2025-06-11"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Farmers are taking losses on days they go to market only to turn  around and see conditions improve a few hours later because of a tweet  from the President.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Since taking office, the Trump Administration has stolen resources,  appropriated by this committee, for programs and services across the  federal government that help to grow the middle class, protect the  working class, support small businesses, and make sure billionaires and  corporations play by the rules and pay their fair share.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "These aren't just nameless, faceless  bureaucrats; these are Americans who signed up to serve our country by  taking care of veterans.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "I  don't understand how as a country we keep increasing military and  defense funding and keep taking away from our children, whether it is  education, food, or basic services that families need.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "But the truth also is, President  Trump and the harmful actions his administration is taking are actually  restricting supply, killing good-paying jobs, and increasing energy  prices, which have risen at more than twice the rate of inflation this  year under President Trump.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "I mean, he has been there every day of the year helping people, every  day of the most recent years helping people because we know that people  have been in Chicago trying to take away people's lives, taking them  out of the country, people who are fine, wonderful people in the city  of Chicago.", "title": "Raising A Question of the Privileges of the House", "date": "2025-11-17"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "That is the oath that he was supposedly taking on January  20.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Trump is taking our troops away from their missions just to do his  personal bidding, forcing them to confront peacefully protesting  Americans, instead of using their time to train to protect our Nation  in case of future conflicts with America's adversaries around the  world.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "Since taking office, Trump has declared war on our communities.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "They give more to those with the most, while taking away from those  with the least.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Let's honor the victims by taking decisive action to protect our  Nation from future atrocities and future acts of cowardice.", "title": "Securing the Cities Improvement Act", "date": "2025-03-10"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "They are the ones who were rewarded with  the taking of this money.", "title": "-9999", "date": "2025-07-30"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "In other words, they were not taking DNA from  the people whom they were supposed to be keeping track of.", "title": "-9999", "date": "2025-03-06"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "He loved spending time with his children and taking his grandchildren  on tractor rides around the farm.", "title": "Paying Respects to Senator Bruce Anderson", "date": "2025-07-22"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "I thank the rest of my colleagues for being here tonight and taking  time to speak on the horrific assault against our ally and the Jewish  community.", "title": "Promoting Stability and Prosperity", "date": "2025-02-26"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "President, I thank my colleague from Florida for  bringing this resolution forward and for taking the time to honor a  true American patriot Charlie Kirk.", "title": "Expressing Support for the Designation of October As the ``National Day of Remembrance for Charlie Kirk''", "date": null}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "These groups use social media or other popular platforms such as  Roblox or Discord to elicit private information or sexual images from  minors, and they use that information and that material to blackmail  victims into mutilating themselves or taking other violent action  against friends, family members, or pets.", "title": "Coercion and Sexual Abuse Free Environment Act", "date": "2026-01-12"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Right now if we are sitting  in the almost 18 percent of the economy we are taking in in taxes, but  we are spending 24--and understand, over the next few years it goes  from 24, to 25, to 26--that gap is the annual deficit that gets piled  on to the debt.", "title": "Stop Bathing in Folklore and Start Bathing in Math", "date": "2025-06-26"}, {"senator": "John Thune", "party": "Republican", "sentence": "But Democrats are taking up this bill  because their anti-Trump hysteria knows no bounds.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "We are also taking steps to raise the  level of Shasta Dam to provide additional water storage there, as well.", "title": "Ten Radical Failed Policies of Governor Newsom", "date": "2025-06-06"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The President is taking charge, and he is leading to  ensure that our Nation's Capital is safe for the American people to  come visit.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "When a rule is  submitted to Congress and published in the Federal Register, a 60-day  period is opened for any Member to introduce a resolution of  disapproval that, if passed by both Chambers and signed by the  President, prevents the rule from taking effect.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Just because  you are taking business in, they don't like it.", "title": "-9999", "date": "2025-03-05"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "But, a year ago in November, the American people delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Today, we are taking concrete action to prevent more families from  having the same experience as Amber and to honor her mother's legacy.", "title": "Shandra Eisenga Human Cell and Tissue Product Safety Act", "date": "2025-06-23"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "President, well, I am coming to the floor today  as we find ourselves in the middle of the Schumer shutdown, and this is  a time where, indeed, instead of being in the Schumer shutdown and  having these shenanigans taking place, we should be in the middle of  working hard for the American people.", "title": "En Bloc Nominations", "date": "2025-10-01"}]