[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…with another championship.\n\nThese student-athletes have made their school and families proud and  proven to themselves and the Commonwealth that the town of Randolph has  the talent, commitment, and the tenacity to succeed on and off the  field.\n\nI thank Superintendent Stovell Herndon, Principal Licorish, Head  Coach Jon Marshall, the players, and the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to one of our State institutions. It might have been a land- grant college in North Carolina or a land-grant college in Vermont. And  there is probably an enormous amount of talent in that person who was  able to achieve a Ph.D in scientific research. And there is probably a  good deal of public investment in the career of that person with the  return…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…in their  communities.\n\nWith over 60 percent of K-12 educators in the United States teaching  within 20 miles of the high school they attended, creating pathways for  local talent to enter the teaching profession plays a critical role in  addressing our Nation's shortage of teachers.\n\nAs part of their Grow Your Own initiative, Educators Rising helps…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…is the only university in California's Central  Valley to attain the Carnegie Classification R1: Very High Research  Activity, cementing its role as a driver of discovery, talent and  economic mobility. As the first American research university founding  in the 21st century, UC Merced continues to be a top-100 research  university and the fastest-growing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…conflicting groups. They couldn't decide who the  leader should be, but they knew it was a critical time, and they knew  that this young man, whose father had been a preacher, had talent. They  put him in the middle of that position.\n\nThis is a young man--I think he was around 26--who moves to a new  town, doesn't know anybody there, with his wife and child.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…their own. It  requires attention. You can live a very long, comfortable, healthy,  happy life, but it requires action on your part.\n\nThat is why our caucus is engaging in talent, on both sides of the  aisle. Recognizing that this is not a Republican or a Democratic issue.  This is an American issue. This is a human issue. This is an issue that  together…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…are going to retire in the next year or two anyway, so why not get 8  months free vacation.\n\nThen they have the hiring freeze. Imagine if the Dodgers stopped  signing new talent, where would they be in the 2030s?\n\nYou can also stop all research, and I will get to an example of that,  and then you argue, well, hey--in 2026, they can say: Hey, we saved…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…beginning  her career as a microbiologist and researcher at the U.S. Army Medical  Research Institute of Infectious Diseases. Discovering a passion for  technology transfer and a talent for the intersection of science and  the law, she lent her expertise to the U.S. Army Medical Research and  Materiel Command and the Naval Research Laboratory.\n\nA Marylander…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…compete with our adversaries.\n\nThe National Assessment on Education Progress, which is colloquially  known as the Nation's report card, has shown us that this knowledge and  talent shortage is a nationwide challenge. In 2022, the assessment  registered the largest decline in mathematics scores since we first  started assessing in 1990. The scores of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…support the  science and technology development and align with NASA's objectives. I  strongly agree.\n\nI look forward to working with Administrator Isaacman on the future  STEM talent with both NASA and more broadly with the aerospace and  innovation sector. Fair questions have been raised about Mr. Isaacman's  Project Athena strategic plan, which was drafted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…began working on the program as a  freshman at WSU and now returns each year despite his national-level  career. Host Beth Ward, an award-winning journalist, has brought her  talent and warmth to the program since 2009. Production Manager Alex  Simisky, a former student crew member himself, now oversees the  University's TV studios and ensures the smooth…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…number of first robotics teams in  the Nation. Also, that we are a hotbed and a place that people and  businesses come to to expand, to grow, and to tap into our engineering  talent.\n\nMr. Speaker, you can't have a shop floor without research and  development. You can't have incredible manufacturing and incredible  innovation without scientific research…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Crystal Lake community  extends beyond the classroom. They actively support aspiring performers  through college scholarships, fundraisers, and by providing a platform  for young talent in the perfomning arts.\n\nMr. Speaker, I am proud to represent the Crystal Lake Strikers, whose  contributions to the arts and education have had a profound and lasting  impact…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…commitment to the  next generation is reflected in this initiative, which ensures the  continued success and sustainability of our region's transit systems by  investing in talent right here in the Valley. What truly sets Stacey  apart is her deep belief in partnership and public service. Her  collaborative approach has not only built rail lines--  it…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…the field.\n\nMr. Speaker, I ask my colleagues to join me in celebrating the  remarkable life and accomplishments of M. Casey D. Younger, Sr. He is a  shining example of the talent, discipline, and integrity that  Mississippi produces and a role model for future generations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Representatives Simon, Alford, and Pappas, for their  support of this important legislation.\n\nAs a father to a young man with Down syndrome, I have seen firsthand  just how much untapped talent exists within the disability community.  Unfortunately, outdated systems and perceptions still keep far too many  of these individuals on the sidelines in our economy.\n\nThat…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Federal  Government have a role to play as well, one where we can help  facilitate these changes as opposed to more bureaucracy or rules that  stand in the way of American talent and ingenuity. By embracing these  reforms, we can help grow the housing supply, expand opportunity, and  unlock the American Dream for millions of Americans.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…by faith, family, and devoted service to our Nation.\n\nDr. Mitchell graduated valedictorian of Hamilton County High School  before entering the Navy in 1943. Recognizing his talent, the Navy  placed him in the B-12 program at Emory University, where he again  graduated valedictorian from dental school. He went on to serve with  the 1st Marine Division…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…turnover, reduced absenteeism, and  higher employer/employee engagement. In a competitive labor market, the  ability to offer these benefits is vital to attracting and retaining  talent and ensuring American businesses remain competitive at home and  abroad.\n\nFor our economy, the stakes could not be higher. Labor force  participation, particularly among women,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…sitting chairman, I  understand the importance of mathematical and statistical analyses. I  have had a front row seat to the extraordinary accomplishments of our  domestic STEM talent across many industries and professions. One thing  they all share is a solid foundation and understanding of mathematics  and modeling.\n\nThese skills are crucial to a wide…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…uniform are our priority, the NDAA authorizes  a 3.8 percent servicemember raise, and that is much-needed. It also  extends special pay authorities to attract and retain the best talent  in some of the most critical career fields.\n\nAdditionally, we are enhancing the subcommittee's oversight of the  Military Health System and remain committed to addressing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Command is charged with ensuring America's superiority in the  most demanding, contested domain of the future. To protect the United  States, we need a headquarters located where talent, research, and  mission readiness intersect. With the support of President Trump, it  has been decided that Huntsville is that place.\n\nRedstone Arsenal is a hub for missile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the loss of  Richard ``Dick'' Wallace.\n\nDick was a man who led a captivating life growing up in Alexandria,  Virginia. From a young age, he exhibited an exceptional musical talent,  often playing intricate pieces by ear on multiple instruments.\n\nDick was an Eagle Scout, God and Country, and Order of the Arrow in  Boy Scouts.\n\nHe was passionate about…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "French Hill", "party": "Republican", "sentence": "…bill is a step in the right direction, offering more  Americans a chance to participate in the American Dream, build capital,  help start a business, and use their God-given talent, skills, ability,  and professional expertise to help that company be successful.\n\nMr. Speaker, I urge a ``yes'' vote from all the Members on both sides  of the aisle.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…I honor is Havre native Flint  Rasmussen.\n\nFor decades, Flint brought laughter, heart, and unforgettable energy  to rodeo arenas across Montana and the country. His natural talent,  quick wit, and unmistakable flair captivated audiences wherever he  performed.\n\nMaking his PBR World Finals debut in 1997, Flint became the  dedicated, exclusive in-arena…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…serving the NTA are hired by her and accountable to her. This  will also allow the Advocate's office to promote attorneys from within  that organization, helping to retain their talent, experience, and  expertise.\n\nMr. Speaker, the Ways and Means Committee approved this legislation  with unanimous consent, and I encourage my colleagues on both sides of  the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…benefited  the House in many ways, his dedication to teaching staff the art of  legislative drafting has left an indelible and lasting mark on this  institution. Teaching is a talent that Noah exemplifies as thousands of  current and former House staffers will attest.\n\nWhile Noah has been recognized by friends and colleagues for his  steadfast commitment…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…has created many high- paying jobs in engineering, aerospace technology, and infrastructure.\n\nThese positions offer competitive salaries and career stability,  attracting top talent and fostering a skilled workforce in Alaska.  Moreover, the increased investment in space operations has generated  economic ripple effects, benefiting local businesses, housing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…work of its  faculty, staff, and students.                            Cheers to Nic Wallace\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Nic  Wallace, whose talent and creativity have earned him national  recognition as the 2025 World Class U.S. Bartender of the Year.\n\nMr. Wallace, the bars and spirits manager at the Sea Island Resort,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary talent utilizing a relieving dose of sarcasm       and deprecating self-loathing. We do know that biting dark       humor was used by the camps' condemned inmates as a survival…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}]