[{"senator": "George Latimer", "party": "Democrat", "sentence": "…president of the Mount Vernon PTA  Council, leads the school as executive director with exceptional  experience and vigor.\n\nJennifer Ciavirella is school principal, leading a talented team of  professionals. We salute Amani Charter Public School on its 15th  anniversary. May there be many more years to come.                   Saluting the Life of Mayo Peter…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Branden holds a Bachelor of Science in Computer Science from Mount  Saint Mary's University and a Master of Science in Computer Science  from Towson University. Branden is a talented research scientist at a  research and engineering company. Together, Emily and Branden have  built a strong, loving partnership that reflects their shared values  and passions.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690468/recognizing-the-marriage-of-emily-mclaughlin-wisniewski-and-branden-anton-ehrenreich"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…advantage of susceptible investors.\n\nThis bill threads that needle and will continue to amplify our  Nation's great tradition of being the best place for entrepreneurs and  talented go-getters to start and grow their businesses.\n\nMr. Speaker, I ask my colleagues to vote ``yes'' on the bill, and I  yield back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, just over a year ago, I was part of a  talented and diverse group of 33 freshmen Members of Congress. We were  veterans, doctors, engineers, lawyers, teachers, small business owners,  and State legislators who were sent…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…successful legal careers both  locally and across the country. She was instrumental in the creation of  the Summer Law Intern Program (known as SLIP), which encourages diverse  and talented high school students to work as interns in private law  practices, corporate law offices and government agencies, often  spurring an early interest in pursuing the profession.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, a few days ago the U.S. House of  Representatives--and the House Armed Services Committee--bid farewell  to one of its most invaluable, talented, professional staff experts:  Mr. John Phillips MacNaughton, Jr.\n\nAt the end of January, Phil, as he is known, completed 30 years of  public service to our Nation. That service…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the sport. She  inspires young girls, and she uses her platform to advance equity and  empowerment across women's basketball.\n\nWe all want to be like A'ja: beautiful, smart, talented, and kind. I  congratulate A'ja. We are so, so proud of her in Las Vegas District  One.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698087/aja-wilson-named-times-2025-athlete-of-the-year"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…works on critical payment       systems said nearly a quarter of his team is already gone or       will soon be out the door as a result of resignations and       retirements. Talented software developers and analysts were       quick to secure high-paying jobs in the private sector, he       said--and the reduction in highly skilled staff is already…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…program who have gone on to be  at the WNBA who were all there yesterday in Tampa, Florida, rooting  them on. The same for the bench. He is an amazing leader and a really  talented coach.\n\nJohn Wooden, the legendary coach, never got 12 national titles during  his time. I congratulate Coach Auriemma and the team.\n\nWe have here the college basketball capital…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…directly with  elected officials.\n\nThe leadership team, President Jill Spielberg, Vice President Karen  Brew, along with Elaine Weir, Madelaine Eppenstein, and a large cadre  of talented neighbors in key roles, provide a strong base of abilities  all committed to the benefit of Scarsdale.\n\nFrom the floor of the House of Representatives, we salute the men and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…merit-based selection process, works to       provide the citizens of the District of Columbia with the       best possible court system by (a) soliciting a diverse and       talented pool of applicants for each judicial vacancy; (b)       screening applicants to ensure they have the requisite       experience, skill, temperament, and qualifications for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…firm.\n\nThe Friedland Young Leadership Awards will be given to Samuel Adler  of Rand Commercial and Lee Lefkowitz, partner for Zarin & Steinmetz.\n\nMr. Speaker, I salute these talented and committed professionals.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…passage  today of the American Music Tourism Act. Americans are fortunate to  have a rich musical heritage. Throughout the United States, you can  find countless venues where talented musicians perform. These venues  attract millions of people from around the country and the world who  want to see their favorite artists or visit the place where famous…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…bleeding employees across the board. And the loss of  key people includes clinical staff: doctors, nurses. There are already  40,000 vacancies. How can the VA possibly recruit talented, skilled,  dedicated employees when they know they will be fired at any moment?\n\nWe know that a lot of the people leaving or declining jobs at the VA  because of this chaos…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Addelynn on being the winner of Ohio's 13th  Congressional District Art Competition and this week's Champion of the  Week. I look forward to seeing what Addelynn and the other talented  students in our district create next.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Corps International World Championships. He also  served as Director of the United States Army All-American Marching Band  from 2016 to 2017, leading some of the nation's most talented young  musicians in performances of the highest caliber.\n\nHis contributions to music education have been recognized nationally  through his election to Phi Beta Mu, the International…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…recently selected as an Emerging Young Artist awardee, 1 of  just 15 nationwide whose work will be displayed prominently here in  Washington, D.C. This program highlights talented artists with  disabilities and supports their growth in the creative economy.\n\nKate's work reflects creativity, confidence, and resilience, and her  selection is a testament…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wages.\n\nI want to grow the economy, grow productivity, and make this society  wealthier. We are the only country in the entire industrialized world  that hasn't moved to a talented-based immigration system so that we can  grow and compete.\n\nI am slightly off the rhythm I wanted to use.\n\nIn the 1970s and 1980s, the world competed for hydrocarbons. In…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…and are the second  oldest Western performance band in the world. Mr. Speaker, I can  personally attest to the Flying W Wranglers' skill and musical ability.  They truly are talented and entertaining cowboys. I am proud to have  such a historic and family-friendly Western show in my district.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…hard work, perseverance, and  grit. I am in awe of their determination and spirit. They have shown us  what true resilience looks like.\n\nWe are incredibly proud to have such talented and dedicated  individuals representing Utah's Third District. Their success is not  just their own. It reflects the strength and character of our  community.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688401/congratulating-duchesne-high-school-girls-wrestling-team"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…freedom, we must defend it       everywhere, for everyone.\n\nBecause without freedom, we lose what makes us who we are.\n\nI am extremely proud of these young people. They are talented, smart,  and patriotic Americans who want our country to be better. Let us all  strive in this body no matter what side of the aisle we are on to make  that happen.\n\nMr. Speaker,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…prestigious opportunity to  perform with the Pittsburgh Symphony Orchestra.\n\nThe Student Side-By-Side program is highly competitive, selecting  only the most dedicated and talented student musicians from across the  region. Sorren's invitation back for a second year is a testament to  his exceptional talent on the violin and unwavering commitment to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689957/recognizing-sorren-morelli"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…strategic litigation unit in the Office of Tennessee  Attorney General Jonathan Skrmetti.\n\nIn that role, she has not only been an aggressive attorney, she has  led a team of talented attorneys in the AG's office, fighting to  protect the constitutional rights of Tennesseans. There is no doubt  that she will serve our Nation admirably on the Sixth Circuit.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Never trailing in the game, they won 31-20 at Ford Field in  Detroit, and, I might add, they had a perfect 14-0 season.\n\nMr. Speaker, I congratulate Coach Schelke and his talented young  group of men on their incredible accomplishment at Ford Field. They  have made Michigan's Ninth District proud. I really hope they cherish  this memory and all of the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697371/recognizing-harbor-beach-football-team"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…62 other terrific Hoosier teams  to claim top honors. Coach Jason led The Exothermics, Greenfield  Central's team, comprised of juniors Simon, Hayley, and Brayden.\n\nThese talented young Hoosiers will again showcase their talents at  VEX World competition in Dallas later this year. These students  exemplify the best of the next generation of innovators,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690023/congratulating-greenfield-central-high-school-for-winning-the-indiana-state-robotics-championship"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…against 3,700 teams from around  the world just to clinch a spot in the world championship. Only 600 of  those teams made the cut, and this robotics team won it all.\n\nThese talented students from McCutcheon High School dedicated 17 to  20 hours a week designing, building, and marketing their robot. Each of  the students on the Mavericks Robotics team…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…economy and  benefiting American workers.\n\nInternational companies are beginning to recognize what most of us  have known for decades. The American worker is among the most talented  in the world. Whether it is energy, technology, or chemicals, Americans  produce some of the highest quality products in the cleanest, most  efficient, and socially responsible…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Indiana  University has won the Big Ten football championship outright, beating  formerly number one Ohio State 13-10.\n\nThe pundits said Ohio State brought the third-most talented roster in  the country. Indiana was ranked 72 at the start of the season, but our  Hoosiers refused to be defined by those numbers. They responded with  discipline, toughness,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698048/on-to-the-rose-bowl"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…at livestock auctions across Missouri and Arkansas. She  cherished family gatherings, hosted Sunday dinners, and traveled with  relatives to nearly every state. She was a talented craftswoman whose  creativity touched every part of her life. She enjoyed bowling for both  fun and friendship, and her love of reading kept her mind curious and  engaged.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…better prepare the American people for these  high-paying jobs in the trades.\n\nThis Presidential action will support more than 1 million  apprenticeships per year, meaning that talented students in vocational  programs throughout our country will be able to further their careers  with hands-on training while being paid.\n\nIn my district, I have had the privilege…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]