[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…reform,'' which is such a huge part of this  bill and such a major undertaking. It took a long time. We held a lot  of meetings with a lot of different defense contractors, think tanks,  and former people at the Pentagon to really get an understanding of  exactly what is going on so that we could fix it.\n\nMr. Speaker, ``fix it'' means moving faster and getting…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to consider. It will be a moment of truth and an hour of  decision.\n\nI believe we have to do this. I believe we have to do it because if  we are going to wait until there are tanks rolling into major cities,  at the capitals of cities, it will be too late.\n\nIf we are going to wait until you read and hear about it in some  major newspaper that the President…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…pump and shake money out of  their pockets.\n\nThe Republicans say ``all of the above.'' No. No. It is ``oil above  all.'' We put 70 percent of the oil we consume into gasoline tanks. And  with cleaner, smarter, more efficient technologies, we can reduce and  reduce and reduce the amount of oil that we put into the vehicles which  we drive. This terrifies…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…courage  and determination in the face of Russia coming within just a few miles  of his bunker.\n\nI visited him and I then went to Bucha where I saw the remnants of  the Russian tanks that came within a 10-minute drive of killing him and  taking Kyiv. I also saw the mass graves where women and children were  buried after the Russians shot hundreds of them…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…me in. Count me in. I wish my Republican friends would  express some concern about the fact that their President is spending  maybe up to $40 million for a parade of military tanks on his birthday.\n\nReally?\n\nWe are cutting money to save lives in this rescission package, but  $40 million-plus is no big deal, as long as Donald Trump is happy.\n\nWe should…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Department of Energy, and  that is to clean up this site.\n\nRight now, there are 56 million gallons of radioactive and chemical  waste being stored underground in World War II era tanks. These 177  waste storage tanks are over 80 years old, so definitely beyond their  life design. Some of these tanks are leaking over 1,000 gallons of  waste in a year into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…multibillion-dollar Japanese company  in Georgia. It is estimated that it would cost them about $10 million  to retrofit their plant so that they could produce more efficient  tanks, and they don't want to do it. They don't want to make that  investment, which would create more jobs.\n\nMadam Speaker, I understand where my friend, the gentleman from  Georgia…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…work in manufacturing. They work in steel.  They work in strategic materials. We prefer not to import steel here.  We make it. We build cars. We prefer not to import. We build tanks. We  can't import our defense industry base. We must build it. That is what  we do. Our region operates among the top 10 finest National Guard F-16  Fighter Wings in this whole…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the judges of what impeachment is, and the standard that they use  they need not reveal to anyone.\n\nWaiting for a constitutional crisis to impeach can be the forerunner  to tanks on American streets. Acting now, with my single vote to  impeach, can function as a wake-up call to impeach as well as deter an  authoritarian President and avert a constitutional…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…accountability for the  countless mistakes that he, Elon, and the crew have made over the past  100 days. When the stock market is up, that is because of him. When the  stock market tanks, that is Joe Biden's fault. If it doesn't get  better, that is Joe Biden's fault, too.\n\nMr. Speaker, no parent would accept this behavior from their child,  so why do we accept…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…birthday, which happens to coincide with  Flag Day and the birth of the United States Army, neither of which have  ever merited a parade in the past--$90 million with airplanes, tanks,  and troops to appease a man's ego, to let him think for a while that he  is Genghis Khan or Napoleon.\n\nHe is not Genghis Khan. He is not Napoleon. He is not the Pope. He…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690660/comments-on-presidents-statements"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the bad  guys--the villains who are screwing over your people are your enemy--it  means you are doing something right.\n\nI am sick and tired of folks in Washington or the think tanks or  wherever else looking for a win-win when there is a villain hurting our  people. If a railroad sends a toxic fireball into the sky over your  community, you don't look…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…that stood with us shoulder  to shoulder. The French spilled blood on our battlefields.\n\nWe weren't even asked to do that. We were asked to provide some  material support, 31 tanks, a couple hundred of our armored vehicles,  and some money. Granted, we have to watch how we spend our money. We  have an obligation to the American people. We also have to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…for the licensing decisions made by the  State Department for direct sales of defense items by private firms to  foreign buyers.\n\nWhile large systems, such as aircraft, ships, tanks, and missiles,  are principally provided via the foreign military sales, or FMS,  process, a number of important items, such as small arms, vehicles,  radars, and other equipment,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Rich, who visited my office earlier this month. Amir was born at just 2  pounds and spent 452 days in the hospital.\n\nToday, although he still depends on feeding tubes and oxygen tanks,  he is thriving. He is walking and able to speak. He lit up my office  with energy. That is thanks to the care he received under Medicaid.\n\nChristina was forced to leave her…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693218/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…atmosphere based on 2023 EPA       reporting. Operators are also implementing vapor recovery       units to capture methane emissions from higher-emitting       equipment like tanks and compressors. In addition to       traditional ground-based monitoring approaches using optical       gas imaging (OGI) technologies, companies are also       implementing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…media organization to report on the PRC's vast, mass       arbitrary-detention program in the XUAR in 2017.\n\n(13) Credible evidence from human rights organizations,       think tanks, and journalists confirms that more than       1,000,000 Uyghurs and members of other ethnic minority groups       have been imprisoned in extrajudicial ``political       reeducation''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…ground. Democrats are  asking us to vote on a resolution about a situation that literally does  not exist.\n\nWe do not have anybody there in Venezuela fighting. There are no  tanks on the ground in Caracas. There are no snipers in the tree line.  It doesn't exist. Again, we are not at war.\n\nMaybe they are conferring about that right now. Let me confer…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…in places like Fairbanks,  for healthcare facilities and staffing in Native communities, and to  begin to address the impending crisis of leaking above-ground fuel  storage tanks. This is a matter for so many of our communities that  rely for their power generation from just fuel that is brought upriver  by barge. You have to have a place to store it.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Arms Export       Control Act of up to 48 MK 48 Mod 6 Advanced Technology All-      Up-Round (AUR) Warshot Torpedoes, containers, fleet exercise       sections, exercise fuel tanks, surface recovery cage and       tools, exercise hardware, maintenance facility upgrades,       support and test equipment, spare and repair parts, personnel       training…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687983/arms-sales-notifications"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Republican.\n\nIn any event, I think people should look at this. We are spending  $13.5 billion every year on this credit and, like I said, you can get  it on all sorts of think tanks. The primary beneficiary is the  developer. Probably the number two beneficiary is the biggest banks in  the country. It is something that ought to be reviewed.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691140/low-income-housing-tax-credit"}, {"senator": "French Hill", "party": "Republican", "sentence": "…never been interested  in jaw-jaw. He is a creature of his KGB upbringing. There was no jaw- jaw with the Chechens in 1999, and there was no jaw-jaw with the  Georgians, only tanks, in 2008. There was no jaw-jaw, only propaganda,  corruption, and death in Putin's approach to Ukraine during President  Obama's administration.\n\nUnder President Obama, Putin…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…application of such section, the Secretary shall allow       vessels to which section 3702 of title 46, United States       Code, applies to transfer fuel from the fuel supply tanks of       such vessel to offshore facilities in support of exploration,       development, or production of offshore energy resources.\n\n(c) Outer Continental Shelf Activities.--…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…including vehicles,       aircraft, and watercraft. The system weighs 49.5 pounds and       has a maximum range in excess of 2,500 meters. The system is       highly lethal against tanks and other systems with       conventional and reactive armors. The system possesses a       secondary capability against bunkers.\n\n2. Javelin's key technical feature is the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…a team of Virginians, in conjunction with the Goochland  County Tea Party, to collect donations and take them to folks in need.  They collected and delivered tents, propane tanks, sleeping bags,  winter clothes, heaters, food and water, and much more.\n\nAs recently as last week, Rick received a call on Monday and  delivered supplies on Tuesday. Rick…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690844/recognizing-rick-grizzell"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…met his wife, Mary. His next assignment was back to Germany with the  1st Battalion 64th Armor Regiment for three years. During this time, he  transitioned to the M1 series tanks.\n\nLater he was assigned to the 3rd Cavalry Regiment at Fort Bliss,  Texas. He was there for a year and transferred to Fort Hood, Texas,  because they already had M1 tanks.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…representing industrial sectors       that can benefit from blockchain technology or other       distributed ledger technology;\n\n(v) small, medium, and large businesses;\n\n(vi) think tanks and academia;\n\n(vii) nonprofit organizations and consumer groups;\n\n(viii) cybersecurity experts;\n\n(ix) rural stakeholders;\n\n(x) covered nongovernmental representatives;\n\n(xi)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…certification transmittal number       22-71 of the possible sale under Section 36(b)(1) of the Arms       Export Control Act, of one hundred sixteen (116) M1A1 Abrams       Main Battle Tanks; twelve (12) M88A2 HERCULES Combat Recovery       Vehicles; eight (8) M1110 Joint Assault Bridges; six (6)       M577A3 Command Vehicles; twenty-six (26) M1152A1 High…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}]