[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…end, he  fought for a higher minimum wage and for specific projects that would  create union, family-supporting jobs. He also led the charge to  eliminate lead pipes, making our tap water safer to drink for Rhode  Islanders.\n\nAmong his many accomplishments was his work to address the State's  opioid crisis. He created a fund to support statewide opioid…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…incorrect statements. What I want to point out is, since September 2,  the administration has carried out 25 known strikes, killing 95 people.  Among these was a so-called double-tap strike where U.S. Forces killed  two survivors clinging to the wreckage of a destroyed vessel in open  sea.\n\nThe administration now refuses to release the video of this strike,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…It is in our economic and national security interests for the United  States to remain a leader in R&D and technological advancement. In  order to maximize our impact, we must tap into talent wherever we can  find it. Too often, small businesses are overlooked when it comes to  research and development opportunities.\n\nSmall businesses are not only the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…failed to pass a War Powers Resolution and assert its  constitutional authority in response to the escalating attacks in the  Caribbean. In reaction to the controversial double-tap strike against  survivors in the Caribbean, the Defense Department has refused to  release videos so the American people can see for themselves what  played out. And if it is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…to his extraordinary  achievements as a director, filmmaker and actor--whether When Harry Met  Sally . . . , The Princess Bride, A Few Good Men, Stand By Me, This is  Spinal Tap or `Meathead' in All in the Family, and so many others-- Rob's work gave us stories that made us laugh, cry and think, and  reflected our shared humanity in profound ways. Who…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…a place that has the most number of first robotics teams in  the Nation. Also, that we are a hotbed and a place that people and  businesses come to to expand, to grow, and to tap into our engineering  talent.\n\nMr. Speaker, you can't have a shop floor without research and  development. You can't have incredible manufacturing and incredible  innovation…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…sales during land grading,  cutting delays when competition is not feasible while protecting  Federal interests and upholding transparency.\n\nThis is exactly how Congress should tap into the potential of  utilizing Federal lands and resources to support local communities.  There has been a transparent process with multiple hearings and  significant stakeholder…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…while undermining other modernization priorities.\n\nMeanwhile, Congress hasn't held a public hearing since July and most  of us haven't even seen the videotape of the double-tap strike in  Venezuela. And when we have demanded oversight, the Republican majority  and Trump's Pentagon have delayed and obstructed it. This bill's  solution, requiring DoD…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…vessels could not have  been stopped, inspected, and the individuals on board arrested and  prosecuted. Most disturbing of all, the Administration carried out a  so-called ``double-tap'' strike, deliberately targeting wounded  survivors after an initial attack. That conduct is indefensible and  inconsistent with the rule of law and the values the United States…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this evening to speak of a grave act  that took place last week in the capital of Ukraine, Kyiv. The Putin  dictatorship continues its illegal war with a double crime--a double- tap strike attack.\n\nA double tap is a merciless attack when a target is struck, but then  struck again within minutes in an attempt to kill survivors and first  responders. I repeat:…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…threats that will require the most creative  and innovative defenses. Americans are already building the technology  to meet those threats, and these reforms will help the Pentagon tap  into that energetic innovation ecosystem.\n\nSecretary Hegseth and his staff have been strong partners in these  efforts as we seek to implement our shared peace through strength…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…3872 would address this issue by providing a much-needed  technical fix to the Mineral Leasing Act for Acquired Lands, giving the  Secretary of the Interior the authority to tap into our vast mineral  wealth across all types of acquired lands.\n\nAs we seek to reshore our mineral supply chains, we must ensure that  no stone gets left unturned. By allowing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698229/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…just those who already  have an accounting department that is big enough to actually navigate  through the Federal bureaucracy.\n\nThe INVEST Act makes it easier for companies to tap into American  capital markets so we can continue strengthening our financial system  here at home rather than abroad.\n\nMr. Chair, small businesses and innovators are the backbone…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697830/increasing-investor-opportunities-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…decide to stand with Ukraine, prevent Russian victory, and  start reversing a dangerous downward trend in our defense budgets.\n\nI hope he will recognize Russia's attempt to ``tap him along'' for  what it is. Putin is getting mixed messages from us. He thinks he has  time. He believes the West is weak and divided.\n\nBut the President, at very little cost,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Public  Utility District has achieved a wide diversity of accomplishments,  including building the world's first advanced wastewater treatment  plant, bringing high-quality Tahoe tap to the community, earning  national recognition as the Environmental Protection Agency's  Wastewater Treatment Plant of the Year, and becoming a 100 percent  recycled wastewater…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…June.\n\nA newcomer to the pageant world, Allison was encouraged to get  involved last year by a friend from her dance studio. She has been a  competitive dancer for 15 years, with tap being her favorite, which she  performed during the competition.\n\nAllison's service initiative focuses on one-to-one mentoring  relationships, a meaningful way to empower and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Biden administration's needless  overreach and return the regulatory regime to a targeted, evidence- based approach.\n\nNotably, this repeal preserves America's ability to tap its offshore  resources efficiently. It will not weaken genuine historic preservation  but will stop a pointless cash grab that inflates administrative  burdens. In fact, this…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…electricity generation.\n\nThe shale revolution has ushered in a new era of American energy  independence and revitalized communities in Ohio and across the  Appalachian region as they tap into the vast natural gas reserves  beneath our feet.\n\nIn order to move this energy from the well pad to the customer, we  need modern and reliable infrastructure. Far and away,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…eye on each and every one of your  financial transactions, crediting or discrediting, or punishing you  based on your personal behavior, and restricting that behavior with the  tap of a button. Nothing could be more inimical to the liberty and  privacy on which American greatness depends.\n\nMr. Speaker, I am proud to be a sponsor of this critical legislation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Whether it is satellite  development, propulsion systems, or mission planning, Utah is becoming  a vital piece of the puzzle.\n\nNorthrop Grumman has sought to form partnerships and tap into  expertise in Utah's colleges and universities, and the company has  worked with students and faculty at the University of Utah, Weber State  University, Utah State University,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…with disabilities  can turn their ambitions into reality, whether that means starting a  company or securing meaningful work. At the same time, we are helping  small businesses tap into a skilled and motivated workforce by offering  them the guidance to do so confidently.\n\nIndividuals with disabilities should not be overlooked. They should  be empowered.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…West, water means survival. It means whether  communities grow or disappear, whether agriculture survives, and  whether moms can trust the water they give their kids out of the tap.  Westerners understand something instinctively: When the government  makes a water promise, it should keep it.\n\nIn 1962, Congress authorized the Arkansas Valley Conduit to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…where they  are.\n\nMadam Speaker, I also thank Representative Van Orden for his  continued efforts to make necessary improvements to the Transition  Assistance Program, or the TAP program.\n\nUnder my leadership, my committee will continue to honor its  commitment to all veterans, ensuring the VA is working for our  veterans.\n\nMadam Speaker, I also give…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}]