[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…working people  all to just partially pay for tax cuts for the wealthy. This  administration and Republicans promised Americans three things last  year: lower costs, cutting red tape, and bringing down the deficit.\n\nLet's review what their budget will actually do: It raises costs for  working families across the country through new out-of-pocket expenses,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…trees and branches in existing utility corridors. However,  the dead vegetation cannot be removed from Federal land without a  timber sale. This has created unnecessary red tape and led to the  buildup of dry fuels around utility lines.\n\nWe cannot continue with the status quo. Inaction can be deadly. I  know because we have seen it. The 2017 Thomas…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…of family caregiving.\n\nJust a few weeks ago, I joined a bipartisan, bicameral group of  colleagues to introduce the Alleviating Barriers for Caregivers Act to  eliminate red tape for caregivers. Caregiving back home in my district  and across the country deserves support and deserves respect, and I am  calling on my colleagues to join me in helping those…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…communications with lawyers and the Department of  Energy as everyone tries to figure out how to move forward.\n\nMy colleagues on the other side are suggesting they are cutting red  tape, but it seems to me they are creating more red tape with this  resolution. Absolutely no one opposed the Department of Energy's final  rule on this topic, no one.\n\nIn fact,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…students of color. These schools too often have  fewer counselors, overcrowded classrooms, and outdated materials. When  you cut the Department of Education, you don't just cut red tape--you  cut protections. You cut resources. You cut off opportunities.\n\nAnd while this assault affects communities across the country, it  hits especially hard in my district--Ohio's…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…passports,  this bill would cost them more than $1.25 billion statewide.\n\nIf you have to pay to vote, that is called a poll tax, plain and  simple. It is also unnecessary red tape for people just trying to cast  a ballot.\n\nThis is a bill in search of a problem. We have enough trouble getting  American citizens to vote.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise in opposition to this bill.  Codifying the so-called Red Tape Hotline, an anonymous inbox, the  contents of which, as the ranking member articulated, we know virtually  nothing about, will do nothing to help small businesses.\n\nWhile the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…insist moms and kids won't lose food assistance, but this bill  will cut SNAP benefits for over 7 million Americans, stripping food  from families' tables.\n\nThey say new red tape will improve efficiency. Come on, we know  better. New GOP paperwork hurdles will cause millions of eligible  Americans to lose Medicaid and SNAP, not because they don't qualify,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691438/gop-tax-scam-hurts-women-and-families"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Coloradans the ability to own a home.\n\nThough Representative Bird and I held different positions during my  time in the State Legislature, we collaborated to cut through the red  tape surrounding professional licensing and keep Colorado one of the  best places to work. She is my colleague, my friend, a mother, and a  steadfast advocate for her community.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…job site actually have enough  light to allow you to see what you are doing.\n\nWe hear all day about the regulations supposedly weighing down our  economy and all about the red tape. Without a doubt--I sit on the  Committee on Small Business--I am happy to talk about red tape, but  these are basic safety standards.\n\nWhat do I know, right? I am here to represent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…behavioral  health services, covering 40 percent of all Americans with opioid use  disorder.\n\nAmericans with substance use and mental health issues will face new  barriers and red tape in signing up for and staying enrolled in their  health insurance. House Republicans are setting up new barriers and  roadblocks to care that will, unfortunately, result in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, today we will vote on the Destroying  Unnecessary, Misaligned, and Prohibitive (DUMP) Red Tape Act, which  would require the SBA's Office of Advocacy to codify a Red Tape Hotline  to receive submissions on burdensome regulations and to report on those  submissions. I…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697466/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…willingness to answer the call. We look forward to seeing the  incredible impact they will have as future leaders of our Armed Forces.                         Medicaid Paperwork Red Tape\n\nMr. SUBRAMANYAM. Mr. Speaker, we keep hearing the same thing about  the big, ugly bill the President signed last week. We hear we are  keeping Medicaid for the people who need…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Administration because those cuts  mean that they can't get anyone on the phone. They can't find people to  try to prove their drugs and devices, and this has created additional  red tape and hurdles that made it very difficult.\n\nThere is a lot of uncertainty right now. These are companies that,  again, are creating thousands and thousands of jobs, providing…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the Interior received a  memo, and basically what the memo said was that Secretary Burgum has to  personally approve every single wind and solar project.\n\nThis will add red tape to renewable energy developments while  stifling new technology innovation. It is just ridiculous. We want to  be a leader in clean energy, but instead we are having the Secretary…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693909/utility-bills-are-going-up"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…bill, and I reserve the balance of my  time.\n\nMrs. BIGGS of South Carolina. Mr. Speaker, President Trump made it  clear: Put American jobs first, and cut the Washington red tape. I am  proud to say that my bill delivers by turning the President's executive  order into law and investing in American workers.\n\nThe Made-in-America Defense Act strengthens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recharge water without  requiring additional authorization from the Federal Government.\n\nUnfortunately, the implementation of this law has been bogged down by  bureaucratic red tape. Despite the plain wording of the law, the Bureau  of Land Management has asserted that the law does not apply to third  parties, only to the right-of-way holders of record.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691131/conveyance-for-aquifer-recharge-purposes"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, pursuant to House Resolution 916,  I call up the bill (H.R. 4305) to direct the Chief Counsel for Advocacy  of the Small Business Administration to establish a Red Tape Hotline to  receive notifications of burdensome agency rules, and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…expensive requirements naturally remove the incentive for many  companies to provide this important coverage for their employees. It is  high time we eradicate this unwarranted red tape and let businesses  invest in the needs of their employees without punishing the company  for doing just that.\n\nThat is why I introduced the Empowering Employer Child and Elder…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Act, led by the gentlewoman from Iowa (Mrs. Miller- Meeks).\n\nThis bill lowers premiums for Americans, creates more insurance  options, brings greater transparency, and cuts red tape.\n\nUnlike our Democrat friends' plan, our Republican plan actually  lowers premiums by double digits, roughly 11 percent, according to the  data.\n\nAll the Democrats want to do…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…place to find information to train their staff in charge of helping to  make sure students and veterans understand.\n\nIn a time when government is filled with bureaucratic red tape, I am  happy that we, as a Republican majority, are making it easier for  veterans to get an education.\n\nMr. Speaker, I urge my colleagues to support H.R. 981, and I reserve…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…previous administration prioritized their  energy policies over Americans' prosperity and freedom. This  unnecessary and costly mandate would burden small businesses, increase  red tape, and jeopardize food safety.\n\nThe Department of Energy estimates implementing this rule would cost  Americans $8 billion. This massive financial burden will fall on small  businesses…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…housing across America to help every American realize the American  Dream.\n\nRemoving that regulation is part of what the Housing for the 21st  Century Act does. It cuts red tape, and it makes a difference for  average Americans.\n\nI am very proud to have supported this piece of legislation. I do  hope that the Senate will take this up and get it over…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…four-letter word, often weaponized to  bury infrastructure, housing, energy, and other critical projects under  a mound of paperwork and litigation.\n\nNEPA is more synonymous with red tape than a green light. One recent  study found that energy projects spend a median of 3 years from final  agency approval to a final court decision, with some projects facing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Electric, and Lischkge Motors are strengthening  our communities one investment, one hire, and one customer at a time.\n\nThat is why I am committed to cutting government red tape, lowering  taxes, and fighting for progrowth policies that empower our  entrepreneurs to thrive, not just survive.\n\nMadam Speaker, I thank every small business owner out there…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…out competition, provide  unnecessary delay, and keep things in limbo for unknown periods of  time.\n\nIn the true spirit of competition, this resolution cuts burdensome  red tape and allows banks to get back to what they do best: serving  customers and serving communities. This is a step in the right  direction.\n\nMr. Speaker, comments were made earlier…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…fruition. While these projects       should not be blindly authorized, we hope that Congress       recognizes that the longer these projects languish in       bureaucratic red tape, the longer our members go without       receiving a paycheck for their work in making our nation       safer and more independent.\n\n``H.J. Res. 140 recognizes our need to support…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Disaster victims should be focused on rebuilding, recovering, and  caring for their loved ones. What they should not have to be focused on  is complying with bureaucratic red tape at the IRS.\n\nFor these reasons, Mr. Speaker, I urge all of my colleagues to  support the Filing Relief for Natural Disasters Act, a bipartisan, pro- taxpayer piece of legislation…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…northeastern United States, and new tax revenue for  rural communities like mine in the southern tier.\n\nHowever, instead of moving forward, that project was tied up with  endless red tape and obstructed by regulators. Western New York and the  southern tier lost jobs and investment in energy security that would  have come from it. A project that should have supported…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…resources they need for any adapted vehicle.\n\nIn a time when bureaucracy is getting in the way of doing what is  best for our veterans, Congress must intervene to eliminate the red  tape and provide the necessary assistance our veterans deserve.\n\nThis bill would do just that and would save hundreds of dollars for  disabled veterans across the country. It would…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}]