[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…statement that applies to millions of Americans all across  this great country who are at risk of losing their healthcare because  this one big, ugly Republican bill has put a target on their back.\n\n``Without Medicaid, my health would deteriorate.''\n\nI am taking the time to share these stories because this is a  question for so many Americans of life and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…administration has not talked about making Medicaid  better. What they are talking about is cutting Medicaid. What they are  talking about is announcing executive orders that target immigrants and  the social service providers that work in strong immigrant communities.  Immigrants that, by the way, pay into Medicaid that they never get.\n\nWhat they are…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Americans in this country.\n\nIn fact, last week, the Consumer Price Index was released. It showed  that prices jumped again at 2.8 percent, well above the Federal  Reserve's target of 2 percent, which is why interest rates are going to  continue to stay unnecessarily high.\n\nOn Wednesday, a couple days from now, so-called Liberation Day, he is  now going…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…authorize the use of post-9/11 GI Bill benefits for independent study  programs taught at non-degree-granting, for-profit institutions, might  be used by predatory operators to target veterans with subpar programs  and rob them of the benefits they have so rightfully earned.\n\nWhile I believe that student veterans should have the freedom to  pursue higher…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…declare it; to authorize force  or to refuse to authorize it.\n\nWe have been precise and deliberate in crafting it. This resolution  does not affect the United States' ability to target terrorist groups  covered by Congress's existing authorizations to use military force,  including al-Qaida, ISIS or its affiliates and offshoots, or to address  real threats…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the streets and detained simply for  the way they look or the language they speak.\n\nThe Trump administration has repeatedly justified these militarized  raids as necessary to target the ``worst of the worst.'' But the facts  tell a different story, one that I have laid out repeatedly on this  floor.\n\nIn one instance, on a list of 614 detainees submitted…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that will have catastrophic consequences.\n\nVeterans will be hurt, people who have served this country admirably.  They stood up for us. We should always stand up for them, not target  them, as will be the case in this reckless Republican budget.\n\nDemocrats are here to make it clear: Hands off Medicaid. Hands off  the healthcare of the United States of America.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…worse. We didn't  know that our colleague, the man who formerly had the Presiding  Officer's seat in the Senate, Mitt Romney, was literally running for  his life. He was a target because he had the courage--he had the  courage--to speak the truth about the results of an election.\n\nWe didn't know that, at that very moment, Capitol Police officers  were…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Recreation Area, where  just 6 percent of the roads had safeguards put in place to restrict the  damage that off-road vehicles had caused. This was a narrowly focused  rule to target protections in sensitive areas for the cultural sites,  native wildlife, and other natural resources that the Park contains.\n\nH.J. Res 87, H.J. Res. 88, and H.J. Res. 89 all…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…money originally borrowed. These are hallmarks of predatory  lending and poor underwriting.\n\nAccording to a coalition of community organizations, payday lenders  are known to target the most vulnerable, including seniors, veterans,  and low-income borrowers. Many in these communities are already  struggling to make ends meet as they navigate the President's…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…in June, and the majority of  Americans rightfully blame the White House for driving up the prices of  food and groceries.\n\nTrump said his mass deportation agenda would only target violent  criminals, but over 90 percent of detainees being held in New Jersey  have no criminal conviction.\n\nTrump said he would improve the Affordable Care Act, yet he just…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Mr. Trump let his 25 percent tariffs on Canada  and Mexico take effect.''\n\nThe Wall Street Journal said: ``Brace for higher prices on berries,  bell peppers, and . . . beer. Target CEO Brian Cornell told CNBC . . .  that tariffs on Mexico may force the company to raise prices on fruits  and vegetables.''\n\nThe Wall Street Journal said all of these things,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…triggered  under IEEPA by Democratic and Republican Presidents? The existence and  activities of transnational criminal organizations, malicious cyber- enabled activities that target the United States, human rights  violations that affect the United States, corruption that affects the  United States, pervasive strategies by foreign nations to evade  sanctions…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…is especially dangerous for those experiencing domestic  violence since this bill provides easy, legal access to weapons that  are designed to control and incapacitate their target and can be  deadly. Groups that combat domestic violence and gun violence and who  support public safety all oppose this legislation.\n\nMr. Speaker, I include in the Record…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Management and Policy Act of 1976. Using the CRA to attack       these protections also creates a reckless precedent that       would allow Congress to retroactively target virtually any       public land action as a `rule.'\n\nBeyond setting a dangerous precedent, removing Boundary       Waters protections by passing this CRA would blatantly ignore…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…smaller jurisdictions only operate with a handful of IT staff  and, in some cases, with none at all. Yet, they are expected to defend  against the same nation-state actors that target major corporations and  Federal agencies. That is not a fair fight, and it is not a sustainable  model for national security.\n\nThe State and Local Cybersecurity Grant Program…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have  adequate air and missile defense capabilities.\n\nOur troop presence in the region is therefore a significant  liability, allowing Iran and its proxies an opportunity to target  Americans, which they otherwise would not have. Yet the Washington  foreign policy establishment seems content to allow our servicemembers  to serve as sitting ducks. Should…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…effectiveness.\n\nThe critical role that R&D projects and new technologies play in  helping protect our homeland cannot be understated. It is no secret  that Federal R&D projects are a target for foreign theft, espionage,  and influence.\n\nIt is our responsibility to safeguard them from malicious actors and  prevent the unauthorized access to, or disclosure of, sensitive…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…across the Nation, the students  qualified as national finalists after designing, building, flight  testing, and launching their rocket under highly specified requirements  to target an impressive 790 feet and land while keeping the rocket's  payload intact.\n\nOn May 16, I was delighted to welcome members of the club, which  calls itself the STEAM Punks,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692513/recognizing-the-accomplishments-of-4-h-students-from-fillmore-county-nebraska"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Area Council. He volunteers for  scouts at least 40 weekends a year. During those weekends, he could be  leading his troop camping, helping with a training event, running a  target range, cooking in the kitchen or helping with camp maintenance.  He oversees all of the outdoor program committees such as camping,  target sports and climbing. Jay is responsible…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…environments where GPS  denial can be a critical disablizer to our U.S. forces, this allows us  to not only fight forward but to make sure that we can have precision  both on target as well as defending ourselves.\n\nThis system, I will note, is proudly manufactured in the heart of the  heartland, in my home State of Iowa. It is creating American jobs while…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Navy from North Dakota and served in  World War II, Korea, and Vietnam.\n\nOn January 11, 1968, he piloted a mission that took off from Thailand  and, while descending into the target area, the aircraft crashed,  killing Commander Olson.\n\nCommander Olson's remains were not recovered until 2001, and he has  been memorialized on the Courts of the Missing at…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "James Risch", "party": "Republican", "sentence": "…can be delivered from modest standoff ranges at high       or low altitudes against a variety of land and surface       targets during the day or night. The JDAM can receive target       coordinates via preplanned mission data from the delivery       aircraft, by onboard aircraft sensors (e.g., forward-looking       infrared, radar, etc.) during captive…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that       state sanctioned forced organ harvesting in China amounts to       Crimes Against Humanity.\n\nThere is also mounting evidence that the Uyghurs are now       also a target for the CCP's forced organ harvesting campaign.       For years, China has been engaged in a systematic campaign of       persecution and oppression against Uyghurs, Kazakhs,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…country--no  surprise--they are tied to the violent gang Tren de Aragua, which has  plagued cities across this country with organized crime.\n\nAll too often these traffickers target not only vulnerable women,  they also target children. According to our TBI data, there were 514  reports of children being sex-trafficked in Tennessee in 2024. That is  1…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…dozens of F-35s already in the Caribbean, the USS Gerald Ford  strike group surging toward the region, the stage for folly is set. We  are told that only drug dealers are the target of U.S. operations, but  the consolidation of the largest U.S. force in the Caribbean in 35  years suggests that regime change may very well be the intended goal.\n\nThe use…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Risch", "party": "Republican", "sentence": "…immediately relocate or take cover. Additional special       features are the top attack and direct fire modes, an       advanced tandem warhead and imaging infrared seeker, target       lock-on before launch, and soft launch from enclosures or       covered fighting positions. The Javelin missile also has a       minimum smoke motor thus decreasing the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…when you look at  the problems that are being inflicted upon this country across every  metric, the criminal law is failing to protect Americans.\n\nThis bill, again, aims to target the committed criminals who are here  illegally. There is no distinction under the current law for people who  commit crimes when they are here illegally versus those who commit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Chinese Communist  Party.\n\nThe CCP is engaged in a persistent strategic campaign to influence  every corner of American life, and one of their most dangerous efforts  is to target our education system.\n\nOften disguised as cultural exchange programs, the CCP efforts to  infiltrate America's universities are intended to manipulate  curriculum, suppress…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "Mr. OGLES. Mr. Chair, America's enemies will stop at nothing to  destroy us, and they don't care how they do it. These enemies would  stoop so low as to target our young people. For years, countries like  the People's Republic of China have used our own universities to  advance agendas that hurt American security.\n\nAside from the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]