[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…I wanted to be able to get unanimous  consent tonight, but I also want it to be bipartisan. And it turns out  that sometimes the gears here move more slowly, even on simple tasks,  than one would like. But instead of asking for unanimous consent on  this resolution tonight, instead, I am going to work with a colleague  across the aisle, a colleague,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…heard from one Minnesotan who, at  4 years old, was diagnosed with Duchenne muscular dystrophy, which  causes rapid muscle weakness, making it harder to complete most  physical tasks. But this Minnesotan, who is now 26, has been able to  thrive because he has Medicaid coverage. He got an education. He got a  job. He graduated with a master's degree in public…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…discrimination against women and to stop employers from penalizing  women with less experience.\n\nWhen it was time for retirement, Alice saw it as an opportunity to do  her evening tasks full-time. At age 69, she traveled to the Mosquito  Coast of Honduras on a human rights observation mission. She took her  mission on headfirst and investigated bullet holes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Chris Brantley, from visitor services in the Capitol Visitor Center,  recruited, tracked, trained, and managed employment of more than 350  volunteer ``JCCIC Ambassadors'' in tasks ranging from ticket counting  to wayfinding to escorting participants and guests. Though not all  served on Inauguration Day, their contributions were essential to our  overall…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…pension  later, and private insurance was never affordable.\n\nHe still depends on Medicaid to stay in his modest home, receiving  regular in-home nursing visits and help with daily tasks, like bathing,  cooking, and managing his medications. Medicaid's coverage for home- based care is, by the way, far more affordable than nursing home-based  care. He gets that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…all       required payroll deductions.\n\nMy work is centered on caring for American citizens who       need support with daily living activities. I help individuals       with tasks such as bathing, personal hygiene, dressing, meal       preparation, and mobility. I perform this work with       compassion and dignity, ensuring that those I care for feel…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…2025 and 2026).\n\nSystems changes. Reprogramming the tax processing system       will be required. This includes development of business and       system requirements, and tasks associated with Modernized       Electronic Filing. As noted previously, OTR would be required       to manage two filing seasons concurrently.\n\nChanges to software of tax…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…father was a proud Jewish American and serviceman who       fought in Okinawa. During the last years of his life, he was       bound to a wheelchair and unable to perform daily tasks       independently. The man who bathed him, dressed him, prepared       his food, pushed his wheelchair and drove him to appointments       was a skilled and compassionate…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…his constituents in North  Providence and Providence and to the entire State of Rhode Island, he  was strongly committed to fulfilling his responsibilities, obligations,  and tasks with a sense of accountability, decency, and honor. He led  his life with purpose and served the people of Rhode Island extremely  well.\n\nDonny leaves behind a devoted family,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…amendments that could even be made in order.\n\nMy friends across the aisle, particularly my friend from  Massachusetts (Mr. McGovern), know all too well the often Herculean  tasks required of the Rules Committee and the difficult discussions  when deliberating amendment decisions. The Rules majority believes in  meaningful lawmaking, not partisan messaging…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…empathy. Now retired from a successful career in sales and as a  former actress and model, Joan remains driven to stay active and give  back.\n\nShe began by helping with clerical tasks in Gulfside's Philanthropy  department and soon joined the Women for Gulfside group in May 2022.  Since then, she has played a key role in fundraising efforts supporting  programs…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Mingus took  up the call to service, in 1981, in the same way that so many of us  did. He enlisted in the Iowa Army National Guard. It was there that he  learned the mundane tasks of a young soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills in a blustery cold Iowa. But he also learned the…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…hearing, and townhall  meeting has been communicated with my constituents with  professionalism, clarity, and, if I may say, refinement. Ms. Hall is  meticulously organized, with tasks completed weeks ahead of schedule.  Nothing is left to the last minute.\n\nShe is the heart and soul of our team. No birthday is forgotten  without a card, cake, and celebration.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…performance for Federal agencies responsible for       environmental reviews and authorizations;\n\n(6) case and project management systems--\n\n(A) are essential tools for managing the tasks and       activities associated with environmental reviews and       authorizations; and\n\n(B) provide Federal agencies more data and insight into       such environmental reviews…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…intelligence tools;\n\n``(8) how to retain human involvement in important       decisions informed by recommendations made by artificial       intelligence;\n\n``(9) how to identify tasks and functions that artificial       intelligence can reliably and effectively perform, including       whether artificial intelligence can improve operations,       productivity,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…provide for their families. Oftentimes, these jobs  are obtainable to folks with a high school degree after a quick and  affordable career technical education course.\n\nMy bill tasks the Secretary of Commerce with conducting an  interagency review to help create a more favorable environment for  foreign direct investment, ultimately boosting our economy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…suffering a stroke at age 3, Brycen was left with paralysis on  his right side, a condition called hemiplegia. Despite having to  relearn how to walk, talk, and perform daily tasks, he never gave up.\n\nBrycen found his competitive spirit on the track. Representing Mt.  Spokane, he has won multiple State titles and competed on the national  stage, all while…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…from  pollution and ensuring the ecosystems remain vibrant and resilient.\n\nAs their roles have grown, Congress has not always had insight into  the exact responsibility and tasks the river basin commissions are  undertaking.\n\nMy legislation directs the Government Accountability Office to  conduct a study and compile recommendations for the Mid-Atlantic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…lines. Its disastrous 80/20 rule required that no more than 20  percent of the work performed by tipped employees could be categorized  as untipped work, and those untipped tasks could only be performed for  30 minutes at a time.\n\nBasically, this required minute-by-minute manager supervision to  ensure workers were complying with the rule. Anyone in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…dental, life and other insurance; dependent care;  and other benefits they might not typically receive as employees of a  small company.\n\nPEOs also take over the back-office tasks that consume time, energy  and resources, enabling small businesses working with a PEO to grow two  times faster, have employee turnover that is 12 percent lower and a  higher…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…foodservice operations, and are trained and qualified to administer  menus, food purchasing and preparation, and to apply nutrition  principles, among many other essential tasks.\n\nI would also like to recognize the Association of Nutrition &  Foodservice Professionals (ANFP) for its efforts to designate November  28 as National CDM, CFPP Day. Over…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697863/recognizing-the-national-certified-dietary-manager-cdm-and-certified-food-protection-professionals-cfpp-day"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…needed to best navigate AI adoption.\n\nThe scope of this educational material will include resources for  small businesses on how AI models work, how businesses can identify  tasks that AI can effectively perform, and the best practices for  coordinating with third-party providers and protecting data privacy.\n\nMadam Speaker, I thank my colleague, Representative…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…too difficult for rural Americans and  will lead to voter suppression. I grew up in rural America.\n\nThe reality is that Americans use photo IDs every day to carry out  basic tasks like opening a bank account, boarding a flight, checking  into a hotel, renting a car, or applying for a business license.\n\nAmericans use photo IDs to buy alcohol, tobacco,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…also considers a standard known as the 80/20 rule, which stipulates  that tipped workers can spend no more than 20 percent of their time, or  30 minutes at a stretch, doing tasks that don't directly earn tips. If  that sounds arbitrary, that is because it is.\n\nRestaurants and similar businesses already run on thin margins.  Keeping track of that kind…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}]