[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Cynthia Lee, Dallas Windham, Darcy Skarada, David Holmes,       David Wendt, Delia T. Cooke.\n\nDenise Lindgren, Dennis and Susan R. Kepner, Donald R.       Schwartz, Donna Tate, Dorothy Marion, Dr. Elizabeth Allen,       Eileene       Gillson, Elaine M. Carlson, Eleanor Crowe, Elinor Hart,       Elizabeth Paukstis, Emily Han, Erin Smith, F. Robert…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Ball/Football, Annandale Boys & Girls Club; Parent: Maria       Colbert, Soccer, Premier Athletics Club.                            Mount Vernon District\n\nMale Athlete: Tate Allen, Basketball, Lee-Mt. Vernon Sports       Club; Female Athlete: Zoe Tickner Soccer, Lee-Mt. Vernon       Sports Club/West Potomac High School, Coach Garrett Kell…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate my friend, Chief  Jeff Tate, on his retirement after 28 years with the Shakopee Police  Department. Chief Tate is a dedicated public servant and model for  community first policing.\n\nUnder his leadership,…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…to speak on this issue tonight, the fifth  anniversary of that tragic day of the attack on this Capitol.\n\nI want to focus on two men who were here that day. One was Nathan  Tate. He was a police officer who had grown up in Prince George's  County. He had mixed feelings about what the police do because he had  had some bad experiences in his childhood…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…their images from being shared with friends or  family.\n\nThrough this horrendous conduct, we have lost beautiful young lives,  including Gavin Guffey from South Carolina, Bryce Tate from West  Virginia, and many other children. I have also met with parents,  including a mother from my home State of Florida, who shared the  heartbreaking story of her son…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…POLITICO.COM;       Tao, Minghui: NEW TANG DYNASTY TV; Tapper, Jacob: CNN;       Tapscott, STANLEY: THE EPOCH TIMES; Taralseth, Jonathon: FOX       NEWS; Tartaglia, Louie: NBC NEWS; Tate, Simon: AL JAZEERA       ENGLISH; Taud, Houssaine: AL-ARABIYA TV.\n\nTausche, Kayla: CNN; Tavares, Jr., Marco: WJLA-TV/      NEWSCHANNEL 8; Tawfik, Nada: BBC; Taylor, Christina:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…favor of relief  for the tens of millions of working American families, farmers, and  many small businesses that are the heartbeat of this Nation.\n\nI know that Mark's wife, Tate, and his two wonderful children, Johnny  and Ann Tate, have made a lot of sacrifices along the way to allow him  to serve for so long, and I will say I am blessed to call them…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Fourth Congressional District speech competition for the great  State of Missouri. This is our second year to do this. It is a great  competition.\n\nOur next winner is Lucas Tate, who is a junior at Odessa High School.  Lucas wrote: ``Freedom is a word that rings loud in the hearts of many  Americans. We all know what freedom is. We all know what the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}]