[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…to my constituents tonight. We celebrate  Thomas Edison as the most prolific inventor of American history. Why?  Because we said he invited the lightbulb and that is true. I taught  that when I was teaching history that Edison invented the lightbulb. I  am proud of that.\n\nHowever, what was not in those textbooks that I was teaching from,  and I had to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…do not, they may resort to carrying around birth  certificates or whatever other legal papers they have.\n\nThis is not the America that I learned about as a child or that I  taught about as a social studies teacher. This is what we learn about  when we study the behavior of dictatorships and how they rule with fear  and oppression. I ask my colleagues…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…became known as the Boston Massacre.  His murder stirred the revolutionary fervor and America's fight for its  liberation from the British.\n\nSo, why is it that all of us were taught about the Boston Tea Party  but nothing about the Boston Massacre?\n\nThe life of Crispus Attucks is far less documented than his death.  Crispus Attucks escaped from slavery…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…real history  and talk about this in terms of the destruction that will occur if we  do not continue the New START treaty.\n\nI am a former political science professor. I have taught and written  about the history of nuclear weaponry. I am now a Member of Congress,  representing southern Nevada. A lot of testing is right in our own  backyard. Over the years,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…comfortably and continues to offer support to any family  that asks for help.\n\nAbove all her impactful work, Terri is a proud wife, mom, grandma,  and friend to all. She has also taught kindergarten in Carlsbad Public  Schools for the past twenty-five years. She is a beloved teacher, and  her students are forever known as ``Judah's Jaguars''. She truly does…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…commitment.\n\nGabriella served the Blackfeet Nation in Montana, honed her field  hockey and Greek dance skills, and helped her family explore our  national parks.\n\nMeanwhile, Emily taught American Sign Language, distributed food, and  became a stronger swimmer and martial artist, all while deepening her  understanding of deaf culture and global history.\n\nTheir…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…directly.  ``I could write endless words about how many will be devastated by  these funding cuts, but this is not that kind of letter. Despite my  generous nature, cancer has taught me to be selfish.\n\n``Every single day, I think about my mortality. How long do I have  left? Is that shoulder pain or something else? Will I be alive to see  my son graduate…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692074/condemning-anti-semitism"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…call this what it is: Opportunities for me, but not for thee.  He climbed the ladder of redemption, and now he is yanking it right up  from under D.C. youth. Most of us were taught to lift as you climb, but  clearly some have forgotten to lift as they climb. Now they are  committed to telling the next generations to pull themselves up by  their bootstraps.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…schools the support they need.\n\nMadam President, let me finish with this. I still have in my office a  quilt that my kids in my preschool made for me on the very last day I  taught preschool. It is hung prominently on the wall of my biggest  meeting room. It is a beautiful patchwork of squiggles and smiles drawn  in bright, messy crayon. When I look at…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…of racism and repression and was wrongfully convicted and  sentenced to 50 years in prison during his twenties. Yet Frank has  always been an organizer and educator.\n\nFrank taught himself law and launched a movement to desegregate the  prison, where Black prisoners had faced brutal and inhumane treatment.  The bars in prison didn't break him or limit…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…is no excuse for an industry polluting for  free. There just isn't. It is morally wrong, economically wrong,  environmentally wrong. It is wrong by the rules which your mom taught  you--to clean up after your damn self.\n\nBut when it is $700 billion every year of harm that you are getting  away with for free, that gives you a big reason as an industry…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…nonsense?\n\nThis is ridiculous. I would use some other language, but I would  probably get tossed off the floor right now.\n\nGrowing up on a small farm and cleaning a barn, my dad taught me how  to take a shovel to all the stuff that came out of the animals. You  know what that is called. I know what it is called. And some of the  animals that did that were…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…leads me to someone who lived much of her life until she died in  my hometown, Lieutenant Colonel Charity Adams Earley, whom I finally  called Aunt Charity. She mentored me and taught me much of what I know  today. She always reminded me of barriers and challenges, but always  said to move forward and go forward and do those things that will make  a difference.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…returning to a past--where only the privileged are protected. The work  of the Department of Education was never about charity. It has always  been about justice.\n\nAs bell hooks taught us in ``Teaching to Transgress,'' teaching is  about liberation. Education is about more than information. It is a  practice of freedom.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…myself and an engineer by education and  profession, I know personally that there is a very serious need to  improve mathematics education for our K-12 students. Indeed, when I  taught chemistry, I saw firsthand how my students struggled because  they lacked the basic foundations in math that are necessary for the  sciences. Today, I hear from both our generals…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…foreign influence with real consequences for American society.\n\nLet's be clear. Every dollar from an adversarial nation comes with  strings attached, expectations about what gets taught, which research  gets funded, and who gets hired or silenced.\n\nWe are already seeing the consequences. The committee report  accompanying the DETERRENT Act highlighted research…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Statistical       Modeling Education Act''.       SEC. 2. MATHEMATICAL AND STATISTICAL MODELING EDUCATION.\n\n(a) Findings.--Congress finds the following:\n\n(1) The mathematics taught in schools, including       statistical problem solving and data science, is not keeping       pace with the rapidly evolving needs of the public and       private sector,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…pain, chaos, and economic hardship, the  American people expect Congress to do something, to ask hard questions  of the administration, to be the check and balance that we were taught  about in school, conduct oversight, lower prices, and protect our  healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize Carl and Nancy  Schneider.\n\nCarl and Nancy taught music in southern Ohio for 43 years before  retiring at the end of the 2025 school year, leaving an indelible mark  on the arts in Ohio's Second Congressional District.\n\nCarl…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…professional experience to everything she does. NAMI is grounded in the  power of lived experience, and Joanne embodies that mission  wholeheartedly. For eight years, Joanne has taught Family-to-Family  classes and led Family Support Groups, offering encouragement and  understanding to others walking a similar path. She is also a certified  instructor for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…was tough in every sense of the word, but he also cared deeply  for his friends, family, and country. He would give you the shirt off  his back, if you really needed it. He taught his family the value of  being tough and rolling with what life gives you. He was fond of the  saying ``rub some dirt on it, you'll be fine'', which carries weight  with everyone…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…settled in  Mexia, Texas, where he launched a second career in education. He earned  teaching and principal certifications from Tarleton State University.  Beginning in 1994, he taught 7th grade science in Mexia ISD and went on  to become principal at Mexia Intermediate and later R.Q. Sims  Intermediate School. He earned a reputation as an innovative and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…earned her  teaching credential from UC Berkeley, and earned her master's degree in  English from UC Irvine. In 1994, she began teaching English, and in the  last 15 years has taught both English and Drama at Lee Vining High  School. Due to the high standards of her performance, she has received  a number of awards recognizing her exceptional teaching abilities,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…changing these  disastrous Biden policies and get this economy turning. We must become  American energy independent and critical mineral dominant. We need to  be. COVID has taught us so much. We cannot rely on foreign adversarial  nations for our much-needed strategic national security supply. Our  supply chains need to be coming from American development,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Eagle Scout Award, Carter had to obtain 21 merit badges  showcasing the skills he learned as a Scout and his commitment to the  community. Thanks to the invaluable lessons taught to Scouts, Carter  has become an expert in first aid, camping, fitness, communication, and  citizenship.\n\nThroughout our Nation's history, the Boy Scouts have played an  invaluable…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…was ``not much.'' But nothing could be  further from the truth, I assured him. For nearly 70 years, Norman  informed, educated, persuaded, and succeeded with his words. He taught  multiple generations not just to love our country but also why we  should love it and how to defend it. His words reached to the U.S.  Congress, the Oval Office, and into…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…help set up the next generation for financial well-being--not  even just well-being, but literacy on what this can actually do.\n\nIt is not just these individual accounts. If taught right and if we  were able to educate properly on this and people can see it in their  own lives, this will give them a chance to learn the value of this and  that it affects…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Classroom 2025 Outstanding Teacher of the Year Award.\n\nThis award is given to K-12 educators who can creatively incorporate  agriculture concepts into their teaching.\n\nNathan has taught fifth and sixth grade students at Glacial Hills  Elementary School since 2001. His students have been able to grow their  appreciation for agriculture through hands-on learning…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…career as a part-time officer.\n\nOver her 30 years, Officer VanLeeuwe has had a huge impact throughout  her community and especially loved the work she did in the schools. She  taught antidrug classes to hundreds of students and served for 19 years  as the Marshall School resource officer.\n\nMr. Speaker, I thank Sara for her courage, compassion, and service.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…an educator who shaped minds with  the same care and wisdom he brought to the law. His influence extends  far beyond written rulings. It lives on in the countless people he  taught, mentored, and served.\n\nThough retiring from full-time service, Judge Fender will continue  contributing as a senior magistrate judge on an as-needed basis and as  a court…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}]