[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…dollars and will trigger  more than $500 billion in Medicare cuts.\n\nHow does that happen? Well, the debt is so high from that bill  because of the trillion dollars in tax cuts to the wealthiest Americans  and the trillion dollars in tax cuts and giveaways for corporations  that it actually automatically triggered $500 billion in Medicare cuts  on hospitals.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…underscore what you have laid out very well. We are  talking about nearly $900 billion worth of cuts to Medicaid in order to  pay for about a trillion dollars' worth of tax cuts for the wealthiest  1 percent of Americans.\n\nThere will be table scraps in the Republican bill for middle-class  consumers and families, but the bulk of the tax cuts are going to the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…encourage the American people to watch what House Republicans  do, not what they say.\n\nRemarkably, instead of lowering costs, this reckless budget  resolution bestows tax cuts for the wealthiest 1 percent of Americans  while jeopardizing essential healthcare and nutrition programs. For  this reason, I strongly oppose the budget resolution authored by House…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…would be particularly dangerous for people with chronic conditions and  families caring for a child with a rare disease--all to pay for more  than $2 trillion in tax cuts for the wealthiest people in our country.\n\nSlashing Medicare and Medicaid would devastate families across our  country. These are programs that millions of people rely on, like our…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Chair, Republicans pretend to care  about the Nation's debt and annual deficits, but they have instructed  Ways and Means to add $4.5 trillion to the debt to provide tax cuts to  the wealthiest.\n\nWhat we have heard from our Republican opponents here today is that  if we don't pass this resolution, everybody's taxes are going to be  raised.\n\nI will tell…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688030/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…land, and the proceeds are going into the coffers  because, remember, we have to cover the $4.5 trillion gap that House  Republicans made because they want to give tax cuts to the wealthiest  of the wealthy.\n\nWhat else does that mean? It means that Republicans plan to cut $900  billion to Medicaid, kicking 8.7 million people off of Medicaid over  the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Instead, they are attacking the very programs that working people and  middle-class people across this country rely on. They have proposed a  budget that gives massive tax cuts to the wealthiest and the  corporations.\n\nHow will they pay for it? They will pay for it by making cuts to  Medicaid to the tune of $880 billion and deep cuts to SNAP benefits,  food…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689916/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…them--speaking to you, Mr. Speaker--that tax  cuts are expenditures. They are the biggest spending in this bill, to  the tune of $5 trillion added to the national debt to give tax cuts to  the wealthiest people in the country at the expense of feeding our  children, healthcare for our people, and the education of our children.\n\nNothing brings more money to the Treasury…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693157/one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…governments, barriers designed  to trip people up and push them out. It adds $3.7 trillion to the  deficit, not to expand care or invest in working people, but to fund  tax cuts for the wealthiest Americans.\n\nI didn't come to Congress to rubberstamp cruelty. I came to fight for  the people I represent: the aging parents in Sussex County, the  caregivers in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…2026. That would be devastating.\n\nOn top of the premium increases that people have seen because the  Affordable Care Act extended tax credits were not extended when tax  cuts for the wealthiest were extended, this additional burden on this  1.8 million-person population is unacceptable, and the vote we will  cast today gives us all an opportunity to sort…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…going to eat? pay the bills? or keep him  alive?'' She said, ``It is a life-or-death situation.''\n\nSo when Republicans are talking about cutting Medicaid to hand tax  cuts to the wealthiest Americans, the choice they are making is to  leave people like Nicole and Jordan, like Jamie and David behind.\n\nAt some point, our children grow up and leave, but…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Republicans did not examine these policies closely because they  knew it would take food away from hungry families and they didn't care.  They have chosen to provide tax cuts for the wealthiest individuals.  They know these changes will devastate State budgets.\n\nIn my home State of Connecticut, we could have to pay up to an  additional $221 million per…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…passed by the Republicans in June phased out premium support  for low- and middle-income people buying health insurance on the  exchanges. The Republican bill extended tax cuts for the wealthiest but  phased out premium support for low- and middle-income people buying  health insurance. So that causes premiums to go up.\n\nThe second thing that causes premiums…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…tell you why this is a failure of a bill, but that is literally in  their projections. Without those projections, they don't have enough  revenue for the biggest tax cuts for the wealthiest people in the  history of the planet.\n\nNo. 2, hundreds of rural hospitals and nursing homes will close  without enough funding to continue operating. More people…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…in the world. Now we are going to provoke this crisis. We are going to  make it even worse. We are going to destabilize these families. For  what--so we can give tax cuts to the wealthiest people in America? Why  don't you just not do that part of the bill? Why don't you just not do  that part of the bill?\n\nThis economy has shoveled benefits for 50…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}]