[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…the country--I, from Washington State; you, from Oregon. People from  Illinois and Alabama and Florida all come here to be a voice for their  constituents on where their tax dollars are going to go.\n\nWithin this country, the power of the purse means we have the ability  to decide where the money is going to go because we represent our  constituents.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is baseload energy in this country.\n\nThe reason green energy was ever affordable or cheaper is because  everybody in America is subsidizing it right now with their tax  dollars. That is the only reason that it ever became competitive. It is  because we are subsidizing a broken system.\n\nGreen energy is consistent in its inability to produce baseload…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today to tell the American people  exactly what their tax dollars are being used for: imprisoning  children, even infants.\n\nLast month, DHS agents detained a sick 7-year-old and her parents in  an urgent care parking lot while they were…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…more difficult for your child to get the attention  and high-quality education that they deserve at school.\n\nThey are choosing to miss deadlines and hold your tax dollars  hostage, tax dollars meant specifically for our children.\n\nThis funding is typically released every year before July 1 to ensure  that schools are ready to go for the school year…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…administration is unapologetic in its efforts to target  immigrants, the Constitution, and the law be damned.\n\nNow, in addition to being unconstitutional, this wastes a great deal  of tax dollars because they are detaining masses of people in these  large sweeps, only to have to release them when proof of their legal  status is shown. It also horrifies the citizens…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to be executed? How many more of  our neighbors have to be killed?\n\nI refuse to send another dollar to the Department of Homeland  Security. My residents don't want their tax dollars going to execute  people in the streets, abduct 5-year-olds, tear gas children, and  separate our families.\n\nThis is what the Trump administration is doing right now with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…action will  be able to rely upon for generations to come.\n\nMr. DOGGETT. Madam Speaker, I yield myself such time as I may  consume.\n\nAs stewards of Americans' hard-earned tax dollars, we have a  responsibility to ensure efficient and appropriate government spending.  The dollars that have been spent on Social Security have been spent  well and effectively…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…battling cancer. It detained a U.S. marshal over the weekend.  Nobody is asking for this. Our troops deserve much better.\n\nThe cost of this is $134 million of your hard-earned tax dollars,  $134 million.\n\nMr. President, take the troops out of Los Angeles and get back to a  sane immigration policy that only deports the most violent in our  community and addresses…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692336/troops-in-los-angeles"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…than the combination of Big  Oil and Big Pharma.\n\nIt allows for the purchase of bitcoin and Trump coin, and Trump has  announced that he is going to do just that with our tax dollars going  into his crypto.\n\nMr. SHERMAN. Finally, this creates the perfect financial tool for  drug dealers and for tax evaders because every time a billionaire  cheats on…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have done nothing other  than enter the country illegally for much longer periods of time, for 5  years or 10 years.\n\nAgain, we see this as very wasteful in terms of public tax dollars.  If we set aside the murderers, the rapists, and the armed robbers, who  we are going to get under existing laws that make all of that criminal,  and you look at what is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…record over and over and  over again.\n\nYes, I am a Democrat, and I admit that our healthcare system needs so  much help and so much reform. One out of every three of our tax dollars  is being spent on healthcare. That is ridiculous. And what are we  getting from it? A society that is getting more and more sick.\n\nAnd what are our solutions as a body?…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…to the wealthiest, raises  the cost of living, or undermines safety and security, but that is what  we are voting on today.\n\nThe Republicans are stealing the hard-earned tax dollars of  Oregonians and Americans to line the pockets of people like Elon Musk.\n\nThis ruthless Republican budget will rip away healthcare from low- income and working families…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…would  claim that they have no reason to be, that this is just something that  we should allow the Israelis and the Palestinians to resolve, here is  my retort. Your tax dollars, your tax dollars are fueling the genocide  that is taking place. If you wanted to do something about it, you  wouldn't fund it. Those planes are our planes. The munitions are our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, tonight, as I stand here, people across this  country are being terrorized by ICE with our tax dollars. Americans do  not support this, and I will be their voice tonight on the floor.\n\nThey don't want to live in a country in which you can be randomly  stopped by a masked…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699478/ice"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…The       resulting chaos has left us weaker and more vulnerable. Like       all of my colleagues, I have always supported reforming       government and making sure our tax dollars are spent wisely.       But this administration has ignored U.S. laws enacted by       Congress--cutting foreign assistance programs and USAID staff       that are essential…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…and historic  tax cuts will reignite their economy and put money back into their  pockets.\n\nIn Terry County, they were grateful for our stewardship of their  hard-earned tax dollars as we cut $1.5 trillion in woke and wasteful  spending.\n\nIn Lynn County, we talked about strengthening rural healthcare  through the $50 billion rural healthcare fund; cracking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…we take the first step in restoring fiscal  discipline and getting our Nation back on track. H.R. 4, the  Rescissions Act of 2025, cuts unnecessary spending and ensures tax  dollars are not wasted on reckless foreign aid. There will be no more  tax dollars to fund DEI programs in Serbia. There will be no more taxes  to fund DEI musicals in Ireland and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692531/rescissions-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…grounds and headed for an airport.  Democrats are on that bus who just voted to defund the paycheck of the  TSA agent making $40,000 a year, to hop on a plane, funded by your tax  dollars, to go to Munich, to go to Europe, and badmouth American  foreign policy. They will be sipping wine with the global elites,  telling them: Don't listen to President Trump.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…for that leadership from the President and from my  Republican colleagues. I can't imagine that most Democrats throughout  this country actually support us protecting their tax dollars, too.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699637/supporting-safety-net-services"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…discipline.\n\nFrom my seats on the House Budget and Appropriations       Committees, I will continue to push for policies that will       reverse our national debt, make sure tax dollars work for the       American people, and root out waste, fraud, and abuse.                           Restoring law and order\n\nIn an extreme example of spinning reality, some…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…access and increased  competition by negotiating better drug prices for workers.\n\nMr. Speaker, I will take greater access to affordable healthcare any  day over shoveling more tax dollars into Democrats' healthcare fraud  schemes. I oppose this legislation, and I reserve the balance of my  time.\n\nMr. SMITH of New Jersey. Mr. Speaker, I thank my good friend…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Trump delivered historic results. He is  securing our border, restoring common sense, lowering costs, and  reestablishing America's strength in the world. He is stopping our tax  dollars from funding woke, perverted projects that the other side of  the aisle seeks to push.\n\nToday, 60 percent of American taxpayers are facing rising taxes and  uncertainty.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…the  entire majority team, as well as the minority staff.\n\nWe have no greater duty to the American people than to protect the  security of our country while safeguarding tax dollars.\n\nMr. DIAZ-BALART. This bill does that. It protects our national  security. It protects the hard-earned tax dollars of every American who  pays taxes. This bill plays an…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…your own, you  are still paying those higher and higher rates. If I were that person  individually insured who was not getting the subsidy when everyone else  was but my tax dollars were going to subsidize other people, I would  feel totally taken advantage of. You are paying for others to get  cheaper insurance, but you are paying more because nobody…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…LGBTQI in the Caribbean, the Balkans,  and Uganda, and all the dollars that we put into trying to support  those programs that are waste, fraud, and abuse. Our American tax  dollars should not be spent in that way.\n\nI am sorry that they are lying to you in this way, but we are going  to work through all this and work to save you all money.\n\nI am sorry…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692528/rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…toward improving access to care for  legal California residents.\n\nThe partial repeal is not a solution. For one thing, it will continue  to cost us enormous sums in State tax dollars. For another, it could  lead to the loss of billions and billions of dollars every year in  Federal funding.\n\nAs I called on the Governor before to repeal this policy, as…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…are ineligibly on the program,  and the answer from the Democrats is to perpetuate this fraud bag,  which is a completely egregious and reckless thing to do as stewards of  tax dollars. This is not to mention that it is propping up the  underlying program that, year after year, has raised premiums and  deductibles two times--it has doubled premiums and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…country back on a strong footing.\n\nWhat else it does is it produces incredibly needed savings, Mr.  Speaker, savings that the American taxpayers want, as well. They want  their tax dollars being spent better. They want to see this Congress  find a way to get back to balanced Federal budgets.\n\nWhy don't we all work together to do that? We are here working…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…believe we owe Mr. Musk a debt of gratitude for helping to identify  these problems--again, just the tip of the iceberg--and/or eliminating  these wasteful uses of hard-earned tax dollars.\n\nIn order to consolidate the gains that DOGE has made, I support  Congress and the administration working together to codify these cost- cutting measures through rescissions.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…chairman of the House  Appropriations Committee,   Tom Cole.\n\nThis bill would simply fix a mistake in the House CR that prevents  the District of Columbia from spending its own tax dollars as part of  its budget, which Congress routinely approves. Congress approves the  authorization of the expenditure of DC local funds, which are paid for  by DC tax revenues.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}]