[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…America--those with profits north of $1 billion in a single year-- ought to pay a minimum tax--a minimum tax--of 15 percent. Now, keep in  mind that 15 percent is roughly the tax rate you pay if you are a  middle-income household--a nurse, a firefighter, or a couple of  schoolteachers.\n\nDemocrats say those hugely profitable firms ought to pay a 15-percent…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…services or, in the  long run, save money for the American people? It is being done because  there is a goal to have a tax cut. That is a fair-and-square debate.  What should our tax rate be; should we have a tax cut; if we have a tax  cut, how do you allocate; how much goes to corporations; how much goes  to billionaires; how much goes to everyday people?…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Department of Education overreach or that the Department is just too  big. Now, if we are saying this because of the budget cuts Republicans  are starving for to underwrite the tax rate for the wealthy, let me  remind us all that the Department of Education is the smallest Agency  in the Cabinet by a lot.\n\nThe Department is responsible, though, for promoting…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…the  situation where we have the largest concentration of wealth in the  history of this country, making it more obscenely unfair.\n\nThose same tax cuts lowered the corporate tax rate from 35 percent to  21 percent, which the Bipartisan Policy Center projected will increase  the Federal deficit by almost $1 trillion dollars by fiscal year 2027.\n\nUnsurprisingly,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to help out billionaires, that they are the ones  who are hurting, not average working families but billionaires?\n\nWe have billionaires in this country who pay an effective tax rate  that is lower than the effective tax rate for teachers, police  officers, and firefighters.\n\nWhat the hell is wrong with this place? I mean, the priorities here  are all…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…friend Gabe Amo, Seth Magaziner had an amendment to  provide a tax cut for the middle-class, paid for by increasing taxes on  the wealthiest here in this country, taxes and a tax rate that had  previously been at 39 percent, lowered by the original GOP tax scam in  2017.\n\nYou had this amendment to provide a tax cut for middle-class  Americans. Instead,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and halt domestic innovation, all because of a policy that was  supposed to help American manufacturing.\n\nJulie wrote to me earlier this year, and she said: ``Our effective  tax rate has skyrocketed, with no explanation or benefit to us. . . .  Where is the relief for businesses? Does the government truly not  understand the impact of their actions, or…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…next wealthiest quintile up,  it is a 5.5-percent increase on the sales tax. For the next, it is 5.0,  all the way up to the richest 1 percent will see their effective sales  tax rate go up by 1.7 percent. This is a sales tax on everyone in the  country, but it is a sales tax that, as all sales taxes do, fall  hardest on those who can least afford it.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…abominations in this bill.\n\nOne, the GOP tax scam is a massive giveaway to the wealthiest in our  country. We are talking about investment and hedge fund managers paying  a lower tax rate than regular income earners like schoolteachers or  firefighters. It would cut taxes for the top 5 percent of taxpayers  while reducing critical resources for the poorest…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…superwealthy and the  billionaires should not have a continuation of that tax cut.\n\nWe will also take a look at the cut to corporate taxes that was in  that legislation. A tax rate of 28 percent was on the docket for many  years until 2017. Even today, if we were to go back to that, it is much  lower than it was prior to that time.\n\nWe will not raise…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…triggered if it is 50-1. That is the trigger, 50-1, that  a company will pay more in corporate tax if that is the case. The  greater the ratio, the larger the increase in the tax rate.\n\nThis will not only incentivize more reasonable CEO pay packages, but  it would also compel companies to increase their workers' pay and take  care of their workforce.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…that Vietnam has actually  agreed to what the President announced.\n\nSecond, I want to remind all of us that these deals all force  Americans and American businesses to pay a tax rate that is far higher  than what we saw before the President engaged in this trade war.\n\nI talked earlier about how, for both Europe and Japan, Americans will  face a tax that…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…percent to 3.5 percent by 2031, with a phased-in reduction       beginning in 2028.\n\nEven though the new limit won't take effect for several       years, federal waivers for the tax rate will pose an issue as       soon as next year, when the current provider tax agreement       between the state and hospitals expires. In advance of a new       agreement,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…That happens, and they end up paying tax  revenue to foreign countries.\n\nLet's just say what you saw prior to 2017 when Republicans did the  Tax Cuts and Jobs Act, you had a tax rate of foreign drive and tangible  income at approximately 16 percent effective rate, but let's say in  Ireland, it was 13 percent. A company could easily set up their entire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to figure out what they were going to do.\n\nThis wasn't a client of ours, but in the aftermath of that bill, this  is what I understand took place. When they had a corporate tax rate  decrease, they have shown me their books, and the areas that they  prioritized were to increase wages for their frontline workers. They  said every single person at the firm…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…for all Americans. In fact,  the lowest earning individuals gained the most benefit. The bottom 20  percent of earners, those with incomes up to $26,000, saw their Federal  tax rate fall to the lowest point in 40 years.\n\nEarnings under $100,000 received an average cut of 16 percent, while  the share of taxes paid by the top 1 percent increased. This is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…see a 2.2 percent tax cut if the  Trump tax cuts were extended. According to the Tax Foundation, the  bottom 50 percent of earners in the country saw their average Federal  tax rate fall by 15 percent when the Tax Cuts and Jobs Act took effect.  On the other hand, the top 1 percent of earners only saw a decrease of  about 5 percent during that same period.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Speaker, I  had the honor of serving in the chair where you are. For a long time, I  heard a Member from the other side talk about tax cuts for the rich.  Guess what? The tax rate for the rich is staying the same. It is 37  percent now. It is going to be 37 percent when we pass this bill.\n\nThat is not a tax cut. Get it straight. They are on the same…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…did in this bill.\n\nThe other overwhelming rhetoric I kept hearing over and over is, this  is somehow a big tax cut for the rich. Again, for those people who  don't know, the tax rate for the wealthiest Americans did not change. I  want to make sure that it echoes through the next few years, that they  recognize the folks who are working and happen to be…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…median cost of a home--actually, number one in the continental United  States. Hawaii is a little more expensive there.\n\nTaxes: California is number one, has the highest income tax rate of  any State in the country, as well as the highest gas tax rate of any  State in the country.\n\nGovernment spending and debt are so much higher in California, and  that relates…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, every day I hear this big story about  how we are making big tax cuts for the rich.\n\nLet's be abundantly clear once again, today, that the current tax  rate on the wealthiest Americans is 37 percent. Under the new law we  will be passing soon enough, it will stay at 37 percent.\n\nThe people who will get the true tax cuts in this…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691557/republican-tax-cuts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Last week, I was walking through a series of different numbers, and  one of them was a proposal, or a discussion coming out of the White  House. It was about taking the top tax rate and just letting it expire.\n\nI think I said it was $32.7 billion. That is for a single year. Just  multiply it by 10. That is what the actual math would be.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…endowment itself.  Harvard has $53 billion. We are not taxing that. We are just going to  tax the net earnings on their investments at 21 percent, which is equal  to the corporate tax rate.\n\nWhat did the Senate do? They reduced it to 8 percent, just under 8  percent.\n\nIt is about time that we get these universities to pay the same that  corporate America pays.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693219/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…thing, one of my Democratic neighbors who makes a lot of  money, he has a beautiful home: David, is it true that the President is  even talking about going back to the 2017 tax rate for high-income  earners?\n\nWell, apparently the President said something like that on Friday.\n\nWell, David, do you think that is fair?\n\nThis is a guy I know is a Democrat…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have a big  mortgage. We should look out for the average guy at a time when they  are most desperate.\n\nSome people would say my second pick would be to reduce the marginal  tax rate on the most technical manufactured goods because we want those  goods to be made here in America, and it would be great to have those  manufactured in America.\n\nSome people,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691493/new-tax-cuts"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…there, over and over I hear on this  floor every day, is that somehow this is a big tax cut for the rich.\n\nMr. Speaker, let me inform the public very clearly: The current tax  rate for the rich is 37 percent. Under this bill, the tax rate will be  37 percent.\n\nWhen you look at the actual tax cut package to those folks who are  hardest hit with high…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…tips or overtime, as  well as those who earn Social Security get a big tax cut.\n\nMr. Speaker, let's be clear, so the American public hears it loud and  clear: The current tax rate on the wealthiest Americans is 37 percent.  Under this bill, it remains at 37 percent.\n\nAt the same time, we are protecting the most vulnerable. Please read  the bill. Seniors…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693227/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we were here, I had my 2\\1/2\\-year-old that we have  adopted with me.\n\nHere are some basic pieces of math. For my 2\\1/2\\-year-old, when he  is 24, 25 years old, every U.S. tax rate has to have been doubled, all  of them, just to maintain baseline services.\n\nThe whole presentation of walking through what happens when you get a  moment to actually disrupt…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}]