[{"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…with this  bill, not undocumented people, not the disgusting term ``illegal,'' but  17 million Americans will have their healthcare cut from this bill.\n\nOn this point of tax on tips, as one of the only people in this body  who has lived off of tips, I want to tell you a little bit about the  scam of that text, a little bit of the fine print there.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693223/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…budget resolution, and all my Republican  colleagues are on Twitter, X, whatever they want to call it, saying  that that resolution contains statutory language to say no tax on tips,  no tax on overtime, no tax on Social Security.\n\nWell, what did Elon Musk have to say about that or what did his  organization have to say?\n\nThey organized the readers…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…By the way, the tax breaks for those millionaires and billionaires  are permanent over 10 years. The tax breaks the Democrats support for  working-class families, like no tax on tips, they only want them for 4  years. Democrats have been fighting to get the no tax on tips for 10  years. Republicans say: No, for working families, we only want 4 years.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…wealthiest amongst us. That amendment was  dismissed out of hand.\n\nRepresentative   Steven Horsford, who also came in during the class  of 2012, had an amendment to make no tax on tips, which we support--but  we support no tax on tips becoming a permanent part of the law, and  that is not what this one big, ugly bill does.\n\nTax breaks for billionaires,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…customer, but that is exactly what this bill would do.\n\nThis bill flies directly in the face of President Trump's campaign  promise to help tipped workers. What good is no tax on tips if you have  to give those tips directly to your boss so that they can take it out  of your base pay?\n\nWhen someone pays taxes, they at least get something in return. Like…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…higher.\n\nNevadans, our families, we are being squeezed, and they need real  relief. They need us to work together to lower costs for them. That is  why I introduced the No Tax on Tips Act alongside Senator Ted Cruz from  Texas, which would eliminate Federal income taxes on tipped wages.\n\nFor so many service and hospitality workers, tips aren't extra;…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…This is just one  of the ways Republicans are helping tipped workers earn more.\n\nAs part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets.\n\nRepublicans are working hard to deliver solutions that help Americans  thrive. H.R.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…this  is what we have to do to be able to pass the Trump agenda with respect  to renewing the Trump tax cuts, with respect to creating and passing  legislation to prohibit tax on tips and tax on overtime, and all the  new blue-collar, working-class tax cuts that President Trump campaigned  on and received a mandate to do.\n\nAfter the mandate, draining…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…deliver on that agenda.\n\nH.R. 1 stops the largest tax increase in U.S. history, while  providing the largest tax cut for working-and middle-class families  ever, with no tax on tips, no tax on overtime, and tax breaks for  seniors.\n\nH.R. 1 protects the 87,000 Missouri farms and countless family-owned  small businesses from double taxation by expanding…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…some of her  challenges, and how the One Big Beautiful Bill Act will help address  some of those challenges.\n\nAmong the many things we discussed were specifically the no tax on  tips and no tax on overtime provisions in the One Big Beautiful Bill  Act. Being that  Statesboro is a large college town, Mary Beth informed me that 95  percent of her staff…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694787/promises-made-promises-kept"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…You want waiters and  barbers and bartenders to be able to keep up to $1,300 more in money  that they wouldn't have in their pockets now but by what we passed,  which is no tax on tips.\n\nIn my home State and in yours, nurses and firefighters and police  officers and coal miners are going to see about a $1,400 increase in  their take-home pay in their paychecks…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…all 11 counties in  my district, hitting over 40 stops, meeting with Hoosiers where they  live and work.\n\nI heard from Chuck at Allie's Cafe, who shared about how limiting tax  on tips puts more money directly into workers' pockets.\n\nI spoke with Camping World and other companies about how the Made in  America provision and immediate expensing strengthened…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for yielding time  today.\n\nMr. Speaker, I was proud to vote in favor of the Working Families Tax  Cut Act to deliver tax relief to millions of Americans that included no  tax on tips, no tax on overtime, and support for small businesses, so  what does the D.C. Council do?\n\nThey voted to deny their own residents these benefits. This means a  waitress…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699677/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…through a double standard deduction and lower tax rates, making the  2017 tax cuts permanent, an increase in the standard deduction by up to  $1,500 per family in 2025, no tax on tips, no tax on overtime, no tax  on Social Security, a boost to the child tax credit of $2,200 while  indexing its value to inflation, expanding access to childcare and paid…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion in deficits.\n\nHere is extending the tax cuts in 2017, and then they made a margin  there for additional spending, either it be some of the other  priorities, no tax on tips, no tax on overtime, those things, and then  we have another $520 billion in additional spending.\n\nCan you see this line here, Mr. Speaker?\n\nYou can't really see it. It…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats wanted to raise taxes by $4 trillion. How is that going to  help our country? It is not.\n\nAnd then I heard Senator Schumer talk about bartenders. Well, we say  no tax on tips. Bartenders get tips as part of their pay, so do  waiters, waitresses. Lots of people work with tips. No tax on tips-- every Democrat voted against that. That was taking…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there just a couple days ago, and within his  speech, when you talk about some of the policy to help our brothers and  sisters in this country, there was the discussion of no tax on tips, no  tax on overtime, these things, and the pushing to get us in Congress,  the Senate included, to move the extension of the 2017 tax cuts. I am  going to show you why…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…policies.\n\nI talked to a waitress in Cassopolis who called this legislation  life-changing because she will be able to pocket more of her hard- earned money thanks to no tax on tips and overtime.\n\nAs I travel across my district, it is clear that we are delivering  for hardworking Michiganders and ushering in a new era of prosperity,  and that is great.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…with the working families tax cut. Mr.  Speaker, do I need to remind you, it is only the largest tax cut in  U.S. history. Workers can keep more of what they earn with no tax on  tips and no tax on overtime. To our seniors, I have good news for you,  too. With the new deduction, you are not going to pay any tax on Social  Security benefits.\n\nBut wait,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…couldn't be prouder of this Conference and the Trump administration  for working together in the interests of American citizens across our  Nation. Together, we delivered no tax on tips, no tax on overtime, a  doubled child tax credit, relief for our seniors, and so much more.\n\nIn Georgia, families will keep an additional $3,000 of their own  money in 2026…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…single one  of them voted against all the tax benefits that would have helped the  middle class and will continue to help the middle class.\n\nThe minority voted against no tax on tips, against no tax on  overtime,  against doubling the child tax credit, and against doubling the  standard deduction, all things that put serious money back into the  pockets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]