[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…healthcare and food programs.\n\nThe pending expiration of health insurance subsidies at the close of  this year, in particular, threatens to impose a severe and unwarranted  tax hike on the middle class.\n\nAllowing these subsidies to lapse will cause out-of-pocket premiums  for enrolled Americans to soar by an astounding 93 percent.\n\nThis drastic reduction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, as the American people can clearly see,  President Trump's new tariffs have become a massive tax hike on  consumers--a tax on the food we eat, a tax on the clothes we wear, the  cars we drive, every cup of coffee we have in the morning.\n\nThese rising costs are not just hurting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…per year for  coverage. A family of four in Tulare County earning $64,000 a year will  pay $2,500 more.\n\nThis is not fiscal responsibility. This is a Republican healthcare  tax hike on working families, imposed in the richest country in the  world. I think it is unacceptable. These are not just numbers on a  page. These are real people.\n\nIt is a mother…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…whether our  personal wealth is growing or shrinking.\n\nSo let's be clear. A tariff is a tax on the American people--plain  and simple. Trump's tariffs equate to the biggest tax hike on Americans  in decades, because the way tariffs work is this: American companies  will have to pay more to import goods, and in turn, the American people  will have to pay…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…food programs by the President, have only driven up costs.\n\nThe recent expiration of ACA tax credits makes things even worse. In  Maryland, it is the equivalent of a $4,700 tax hike. I have heard from  many constituents who are now forgoing insurance altogether, exposing  them to risks and spiking premiums across the board.\n\nI am also deeply concerned…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698590/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…House, and please talk to the  Republicans in the Senate and tell them not to move forward on this  folly.\n\nRepublicans call their bill a tax break, but, in reality, it is a tax  hike and a job killer, except for China, where it is a job creator.  China wins; America loses.\n\nIn the coming days, Americans will take a look at the Republicans'  Big Beautiful…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…a big deal. That is long-term price stability.\n\nWhat would our bill do? I am very proud of a lot of the things that  it would accomplish.\n\nNumber one: It would rescind the tax hike on low-cost, clean energy,  and it would restore tax credits for clean energy such as those in the  Inflation Reduction Act.\n\nNumber two: It would reverse roadblocks to clean…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…that the administration's myth that tariffs will  reshape the economy by bullying our closest allies is nothing more than  a fantasy.\n\nThe Trump tariffs represent the largest tax hike in American history.  They have caused chaos in the markets and stripped millions from  Americans' retirement plans. Consumer confidence is plummeting,  reaching its lowest…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689895/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…breaks.\n\nIn less than 3 months, Donald Trump has unleashed more chaos upon the  American people than any previous President. His tariffs have hit  families with the largest tax hike in half a century.\n\nElon Musk and DOGE are sabotaging Social Security and Medicaid and  Medicare from within with massive layoffs, funding cuts, and crashing  websites. The…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689616/taxes"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Speaker, this funding deal is why Americans have  lost faith in Congress. It does absolutely nothing to address the  crushing cost of healthcare, in what amounts to a massive tax hike on  working families.\n\nIt does absolutely nothing to stop President Trump from canceling the  very funding we would provide, something he has already done again and  again.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696697/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…class of this country, that was a kick to the gut. We  got rid of that. That would come back 100 percent, and all of those  people in the middle class would see a massive tax hike.\n\nThink about small businesses. People love to come here and talk about  small businesses. We should do everything we can to help the creation  of more small businesses and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…security and protecting the safety of our  fellow Americans. It means extending  the 2017 Tax Cuts and Jobs Act and preventing American families from  seeing a 22 percent tax hike next year.\n\nAs the President stated last night and in his inauguration address,  the golden age of America is just beginning. I have never been more  thankful to have a President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…We can continue down our current fiscally  unsustainable path where we have waiting lists for Medicaid,  insufficient border security resources, and are facing the largest tax  hike in American history, or we can change course.\n\nThe One Big Beautiful Bill Act ushers in the golden age of America,  as our great President says, where taxpayers, not illegal…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is Donald Trump promises made promises kept.\n\nThis budget resolution provides a framework for Congress to secure  the border, unleash American energy, prevent the largest tax hike in  history, create jobs, and bring common sense back to the government.  Unnecessary and wasteful government spending will be eliminated,  putting the American people first.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…first starting as a small business, or a mom and pop.\n\nIf we don't act now, those tax cuts will expire, and Iowa's small  businesses will be hit with a crushing 20 percent tax hike. We cannot  let that happen.\n\nLet's extend the Tax Cuts and Jobs Act, protect small business owners  and farmers, and keep the American Dream alive in Iowa and across the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the standard  deduction. But without action from Congress, a substantial part of the  Tax Cuts and Jobs Act would have expired this year, and that would have  meant a huge tax hike for hard-working Americans--some $2,500 for  people in my State of South Dakota.\n\nWe were determined not to let that happen--not next year, not ever-- and I am proud that…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…pro-small business.\n\nSeparate from the small business provisions, if the individual tax  cuts are allowed to expire, the average Pennsylvania family, Mr.  Speaker, will face a tax hike of over $2,500. If my Democratic  colleagues oppose this bill, they are voting in favor of the largest  tax increase on working families in American history, plain and simple.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "John Thune", "party": "Republican", "sentence": "…families tax cuts.\n\nIf Congress failed to act this year, a typical family in South Dakota  would have had less money in their budget. They would have been looking  at a $2,500 tax hike next year. A typical farm would have seen a $5,000  tax hike. Tens of thousands of small businesses would have seen their  taxes go up as well.\n\nRepublicans were determined…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Trump's One Big Beautiful Bill  Act, moving President Trump's agenda one step closer to being signed  into law.\n\nThis is critical legislation that will prevent the largest tax hike  in history by extending President Trump's Tax Cuts and Jobs Act of  2017, which ushered in historic economic growth for our country.\n\nThe legislation also provides rural…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…the 2017 Trump tax cuts would be the  ultimate betrayal of the middle class. The average taxpayer in my  district, in the Ninth District of Indiana, would see a 26 percent tax  hike if the tax cuts the Democrats oppose expire.\n\nA family of four making $67,000, the median income in my district,  would be a $1,289 tax increase. More than 6 million people…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…families a  tax cut of 15 percent, the highest of any income group.\n\nOn the other hand, failing to extend these tax cuts means the average  taxpayer will see a 22 percent tax hike.\n\nThe average family of four making $80,000 a year will see their taxes  go up almost $1,700. That is 2 months' worth of groceries.\n\nAmericans need certainty that relief is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…doubled to maintain baseline spending.\n\nI have done presentation after presentation where I have come here  with the actual charts using Democrat economists showing that every tax  hike the Democrats have proposed on the wealthy--capital gains,  income--the entire plethora produces about 1.5 percent of GDP. All the  austerity, the cuts on our side, accounts…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…a budget that delivers on  President Trump's priorities.\n\nThose priorities are securing our border, strengthening national  security, energy independence, and preventing a tax hike of $4 trillion  set to hit at the end of the year if we don't act.\n\nThink of the reconciliation process as a baseball scrimmage. The  House and Senate can't take the field…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689887/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…represent the Phoenix and  Scottsdale area. For my folks, our math is $3,300, almost $3,400 a year  for my average family in tax hikes. For the country, it is $2,850.\n\nThat is the tax hike that is already in the law. That is already what  is coming at us. That is what the Democrats have been arguing, saying  we shouldn't extend these tax cuts, and then they…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…businessowners, and  the employees who make them go. I discussed our passage of the working  families tax cuts. This bill, now law, allows Hoosiers to avoid perhaps  the largest tax hike in our history. It offers tax predictability that  encourages investment in Indiana's economy and a pathway to quickened  economic growth.\n\nMy tour fostered conversations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}]