[{"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I got this note this morning from  a constituent of mine who said: ``Dear Congressman Davis, I wish you  were voting to extend the tax credits for healthcare today. I am a  single mother with a daughter in college. Without these Federal tax  credits, we will be in an extremely vulnerable position. Accessing  healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698393/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Groceries are skyrocketing in price. Americans are finding it more  difficult to put food on the table. Farmers are being crushed by these  tariffs as well.\n\nHealthcare. The tax credits that make healthcare insurance affordable  to millions of Americans will end at the conclusion of this year  because he has failed to provide leadership in extending them,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise in strong support of a 3-year  extension of the Affordable Care Act's enhanced premium tax credits.\n\nMillions of Americans who benefited from these credits are now facing  the real prospect of losing their health insurance because they can no  longer afford their premiums.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698587/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…people behind each  of them, with very real stories.\n\nTake Amanda. Amanda is a broker's assistant in a real estate office  in Wisconsin who relies on the enhanced premium tax credits on the  Affordable Care Act. Amanda, who has lupus, needs weekly shots to  manage the autoimmune disease.\n\nOr take Madison chef and restaurant owner Evan Dannells who has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…damaging impacts across the board.\n\nThey failed to address this particular issue. In fact, I will come  back to that in a moment. Not only did they not address extending the  tax credits for the Affordable Care Act, but they made the problem even  worse. The big, ugly bill that they passed included a $1 trillion cut  to Medicaid.\n\nThe healthcare safety net…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Republican Senators.  If anyone else in government gave themselves millions in taxpayer  money, they would go to prison. For Americans trying to afford  healthcare? Not $1 in tax credits.\n\nHouse Democrats are united against this corrupt bill and will keep  fighting to protect America's healthcare.\n\nMr. Speaker, I urge my colleagues to reject this bill.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…It just costs too much to live.\n\nPeople are working just as hard as they always have, but they are  falling behind. That is why I have been fighting to extend the ACA's  tax credits to lower healthcare costs, especially for our most  vulnerable citizens. It is why I voted against the big, ugly bill that  is now putting healthcare coverage at risk for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…needs of most Americans.\n\nHealthcare providers and patients are frustrated and frightened by  the imminent skyrocketing of healthcare costs caused by the loss of the  ACA tax credits and cuts to Medicaid, Medicare, and lifesaving  biomedical research.\n\nMy constituent, Ms. Angela Hoomes, is unable to walk without  debilitating pain. She is worried that,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…begging us to ``hold the line''  when it comes to fighting for healthcare because, in her words, ``I  definitely cannot afford my ACA insurance without the Advanced Premium  Tax Credits. If costs go up and healthcare gets more expensive, I will  have to go without insurance and not go to the doctor.''\n\nThese are just a fraction of the thousands of calls…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…for veterans. This is about killing young people, seniors, and  those who are disabled. This is about cutting important critical  services for the American people to give tax credits to billionaires.  There are a lot of B's in this statement. None of them are very good.\n\nLet me be very clear: Republicans have barely made any attempts to  support working…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…from our colleagues, they do  propose on Medicaid to really make cuts that will hurt us. This isn't  about waste, fraud, and abuse. Their plan is to allow enhanced premium  tax credits to expire. That has really nothing to do with lowering  costs on average Americans. And this whole idea, in my mind, is a  veiled attempt to repeal the expanded coverage…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…is working two jobs is  counting on us. The recent college grad in Tamarac who makes enough  money only to pay rent is counting on us.\n\nWe must deliver and extend the ACA tax credits because America is  counting on us to survive, to thrive, and to have another chance.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, for months, Democrats have  urged Republicans to come to the table to work together on a clean  extension of the Affordable Care Act tax credits. Now, we are just days  away from the deadline, and Republicans are scrambling to push through  an unserious proposal at the eleventh hour. People aren't stupid. They  can…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698377/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "Ms. UNDERWOOD. Mr. Speaker, I rise today in support of my bill to  extend the Affordable Care Act tax credits and to put an end to the  Republican healthcare crisis.\n\nThis Republican majority wasted all of 2025 by refusing to extend the  tax credits in time to prevent the premium…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698810/breaking-the-gridlock-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to write such a report in doubt. If Republicans are concerned about  energy supply chains, they should start by repealing the One Big  Beautiful Bill Act, which attacked tax credits and programs designed to  strengthen our supply chains.\n\nH.R. 3616 would grant the Federal Energy Regulatory Commission (FERC)  unprecedented power to veto or demand changes…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…closely, but the  insurance companies that the Democrats want to give an additional $85  billion to with their 3-year clean extension of the temporary COVID  enhanced premium tax credits have not been knocking on the doors, Mr.  Speaker, of the United States bankruptcy courts seeking protection or  aid. In fact, they have been making record profits--record…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…mandates.\n\nNot only did Democrats refuse to fix any of this, but they want to  make it permanent at a cost of $400 billion. No thanks, Mr. Speaker.\n\nMr. Speaker, reverting these tax credits back to the original  structure that the Democrats designed means that 93 percent of  enrollees will still retain very generous subsidies next year. Mr.  Speaker, 60 percent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Security income. Senator  Marsha Blackburn fought hard to make sure that deduction stayed in the  bill.\n\nThanks to Senator Katie Britt of Alabama, Republicans modernized tax  credits for childcare. That helps parents pay for childcare.\n\nThanks to Senator Ted Cruz of Texas, new parents now get a $1,000  Trump account for every newborn child. Parents can…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…bring back housing affordability. In 2025, as a part of the Working  Families Tax Cuts Act, we passed what has been called the largest  expansion ever of affordable housing tax credits. Our reforms to the  low-income housing tax credit are predicted to create 1.2 million  additional affordable housing units over the next decade, helping  millions more…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…country's fiscal  health back on track.\n\nAt home in Indiana's Eighth Congressional District, more than 80,000  Hoosier families have been protected from losing half of the child tax  credits. Thanks to the death tax exemption, Hoosier farmers can pass  their family-owned farms down to their children without losing most of  it to the IRS.\n\nMr. Speaker, I look…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695724/supporting-working-families-tax-cuts"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…premiums have increased by roughly 80  percent. Guess what. Ninety percent of that increase has been paid for  by the taxpayers.\n\nIt is important to note that these premium tax credits are sent  directly to insurance companies, not the taxpayers, and it is no secret  why. The ACA was written by insurance companies to benefit insurance  companies, and it…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…today. I  know the President is very interested in this issue, but not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which was a bill under the reconciliation  process. It was solely the Democratic Party who…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I will try to go fast enough to touch on it.\n\nI did this board the other day. I just need to show you this is what  they call an economic scoring of the enhanced premium tax credits,  which is basically the subsidies on top of the subsidies.\n\nFunctionally, only 38 percent of that $40 billion is actually going  to cover actual insurance where people…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…shut down. It is shut down  because we can't come to an agreement here in the Senate, with the  President, and with the House to deal with the expiring Affordable Care  Act tax credits that make it affordable.\n\nLetters are about to go out in my home State of Delaware that will  tell folks who get their health insurance through the Affordable Care  Act…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…A report from the Government Accountability Office confirms what  Republicans have said for years. There is significant fraud associated  with COVID-era enhanced premium tax credits established by the trifecta  of President Joe Biden and majorities in the House and Senate led by  Democrats.\n\nAgain, in 2021, Democrats put in place what is called the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of coverage. First, in the American  Rescue Plan of 2021 and then again in the Inflation Reduction Act of  2023, Democrats sent temporary taxpayer-funded enhanced premium tax  credits directly to the coffers of big insurance plans.\n\nThey did this without a single Republican vote of support. On both  occasions, Democrats chose to make these COVID credits…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…healthcare is now cheaper today than it was when they passed  this disastrous bill. You won't. You won't find one.\n\nIn fact, the sky is falling because of their enhanced premium tax  credits that they made temporary because they decided to make permanent  tax benefits for wealthy environmentalists who support them. That is  why we are where we are today.\n\nMr.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for All Americans Act.'' Is that going to be  any consolation?\n\nNow, I have been extremely critical of the House Speaker for refusing  to put any measure to extend these tax credits on the floor, and I  think that criticism right now is more well deserved than ever.\n\nWe have in the past seen measures come to the floor that divided the  Republican Conference…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…expanding the Pell Grant program. It  is a program that was one of these things that has a marriage penalty  associated with it.\n\nWe are expanding the low-income housing tax credits. While some of  those credits do not come with a marriage penalty, particularly when  coupled up with State programs that do have a marriage penalty, it is  another program…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…too much money.\n\nFrequently, these programs are, in certain ways, more generous than  the middle class normally receives. A perfect example would be section  42, low-income tax credits. I have known people who have looked for  housing, and the housing they get is not as lavish as the housing  available in low-income housing.\n\nThe programs are set up in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}]