[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…bottom line of cars. I think that is a lot  of risk for tariffs that President Trump can't justify for any other  reason, other than because he wants to get funding to support a tax cut  for the wealthiest Americans.\n\nYet the President is talking about wanting to cut deals with Russia  for economic development. I don't see the logic in going half way  around…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…already stretched  thin healthcare system.\n\nThe State of Arizona has estimated the impact of Medicaid cuts alone  to be $34 billion over the next 10 years.\n\nFor every $1 billion tax cut there is an estimated loss of 36,000  jobs across multiple industries. While the economic impacts will be  devastating throughout the State, the most immediate impact will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…away healthcare from  working families.\n\nRepublicans hand out an average of $80,000 in tax breaks to every  millionaire. Where do they get this money from? Each millionaire tax  cut is paid for by taking away insurance from four people. Republicans  are stealing from the American people to fund these tax cuts.\n\nWhat does it mean when four people lose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…and what I think is a very cynical  bill.\n\nWhy are my Republican colleagues making the cuts?\n\nThat is what we all want to know.\n\nIt is to give the very wealthy another big tax cut and deliver tax  breaks to billionaires and corporations, people who absolutely don't  need any more assistance.\n\nIt is taking that money from people who desperately need…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…years  here--voting for the balanced budget amendment, taking up all of these  pursuits in terms of fiscal rectitude, they are borrowing an additional  $5 trillion to pay for a tax cut for the wealthiest amongst us.\n\nMr. Speaker, $5 trillion is being added to the debt. I call attention  to that because they are taking away health insurance for poor people.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans, all to cover the cost for their  massive tax cut for billionaires.\n\nAnd, now today, Republicans are trying to bypass once again  bipartisan laws--laws that many of them voted for themselves--so they  can rubberstamp another…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…optimistic projections--and  they have had to reduce them--the amount of money that DOGE will cut is  far less than the amount of the deficit created by the huge Republican  tax cut. So all this talk that they need to do this for deficit  reduction is belied by their clinging to a whopping deficit creation by  the tax cut.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Speaker, we want to make sure that there is an across-the-board  increase. Under the leadership of Hakeem Jeffries, that is what you  will see, an across-the-board increase, a tax cut proposal for people  who have to work out of necessity who would end up having to pay taxes  on their Social Security. We pay for it to make sure that it doesn't  impact the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…this crisis, but instead, they are  going to make things worse.\n\nRepublicans are about to hand billionaires like Elon Musk $5.3  trillion in tax cuts, the biggest billionaire tax cut in American  history. To pay for it, Republicans are cutting health insurance for  families; ripping away food from kids, seniors, and veterans; and  cutting public education,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689901/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…policies that benefits and protects the wealthiest, that  serves the largest corporations, that is designed to line the pockets  further and further of the wealthy. It is a tax cut for corporations  that we have seen in policies, while Americans and their most important  issues--whether it is their healthcare, whether it is their ability to  make a living--are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…The top 1 percent in income--in  the State of Connecticut from where I am from, that is people whose  income is about $1.2 million a year--they are going to get a $70,000  tax cut. For somebody who is in the lowest quintile, which is income up  to $14,000 a year, you can see on this chart they are going to get  about $130. For a middle-income person…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…questions about what is  happening here, about why it is necessary to cut a program like  Medicaid--that insures 24 percent of Americans--to the bone in order to  finance a tax cut for the very, very wealthy.\n\nOne of the things I just wanted to set up for you here is, you know,  just to note that Americans may be surprised to know that 24 percent of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Speaker, there are a lot of difficult things about  this, but one thing I want to say is that the Republicans are actually  trying to change the rules of the game to say that this tax cut doesn't  cost any money. The Senate is ignoring the rules we have observed for  decades, ruling out the Parliamentarian, just declaring that extending  these tax cuts doesn't…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689899/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…are more focused on what they  didn't eat than learning.\n\nMr. Chair, there is more we can do, and that is another reason why I  am so glad I didn't vote for the President's tax cut.\n\nI just reiterate, again, that this mil-to-mil training builds  resilience, support, and respect between the militaries. It keeps their  militaries healthy, and I continue…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…economy against them. That is what  Republicans are doing.\n\nThere are 801 U.S. billionaires who have $6 trillion of wealth, and  Republicans now want to give a $4.5 trillion tax cut to the wealthiest  billionaires.\n\nThat is what Donald Trump said: ``You're rich as hell.'' ``We're  going to give you tax cuts.'' This is on the backs of working Americans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689888/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…delivering on that mandate, and Congress is helping him to  advance this agenda.\n\nJust a few days ago here in this Chamber, House Republicans voted to  deliver the largest tax cut in American history. We made long-overdue  investments in our Nation's border security by funding the completion  of the border wall, investing in modern technologies to assist…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…IRS by cutting enforcement and redirecting resources to  customer service. This is especially important as we approach tax- filing season and implement the working families tax cut, allowing  families to keep more of what they earn.\n\nJust as this package strengthens economic security and  accountability, it also reinforces America's security and leadership…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…leadership has taken  this country over the last year.\n\nTogether, we have accomplished real results. It starts with tax  relief for American families with the working families tax cut. Mr.  Speaker, do I need to remind you, it is only the largest tax cut in  U.S. history. Workers can keep more of what they earn with no tax on  tips and no tax on overtime.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…forgotten  worker. We are going to fix healthcare. We are going to fix  affordability. Gas prices are already coming down. Grocery prices are  coming down. Wait until that tax cut hits in 2026.\n\nMr. Speaker, I urge support of H.R. 4593 and so should you.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…benefit provisions of the One Big  Beautiful Bill Act.\n\nSimply put, the District of Columbia Council doesn't want its  citizens to benefit from the largest working families tax cut in  American history.\n\nSpecifically, the District of Columbia Council wants to deny its  citizens the ability to enjoy the increased standard deduction. The  District of Columbia…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senate Accomplishments\n\nMr. President, 2025 was a year of hard legislative work in the U.S.  Senate. We passed once-in-a-generation legislation, the Working  Families Tax Cut bill, which is currently putting more money in hard- working Americans' pockets. But we didn't just make the headlines  legislatively. In addition to a packed legislative…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of all Federal income taxes.\n\nIt is math. It is not comfortable. It doesn't fit almost any of the  speeches you hear from the left behind the microphone.\n\nThat is a tax cut for billionaires and rich people. That is not what  the math says. Because when it comes to math, we are able to lie about  it all the time because it is big and it is hard.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every  single year.\n\nI want to get right to the chase here because, for the last 2 months,  some of us have been willing to walk out and say that we will not vote  for the tax cut extensions if we don't get spending restrained. I am  getting lots of Republicans around town who like to stir the pot and go  and say, ``You are going to vote for a tax increase,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and 77  million--77 million Americans supported that promise. They voted for  change. The One Big Beautiful Bill Act delivers for the American  people.\n\nThis is the largest tax cut for working families, farmers, and small  businesses in U.S. history. Households making under $100,000 will see a  12 percent tax cut compared to what they pay today. The…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, in honor of the Nation's 249th birthday, House  Republicans delivered the largest tax cut in our Nation's history for  middle- and working-class families, strengthened the farm safety net,  and voted to get our country back on track.\n\nThe One Big Beautiful Bill…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…and also  provide some information relative to my colleague's previous comments.\n\nRepublicans just passed working families tax cuts, which gave  American families the largest tax cut in American history. Under the  bill, the typical family will get up to $10,900 in additional take-home  pay. Households earning less than $100,000 will get a 12 percent tax…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…America First. That means a Federal Government that gets  out of the way and allows hardworking people to succeed.\n\nRepublicans put America first when we passed the largest tax cut in  American history. We delivered no tax on tips, no tax on overtime, and  tax relief for seniors by lowering taxes on Social Security benefits,  because the key to affordability…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…which is the America First agenda. This bill is our  opportunity to deliver on that agenda.\n\nH.R. 1 stops the largest tax increase in U.S. history, while  providing the largest tax cut for working-and middle-class families  ever, with no tax on tips, no tax on overtime, and tax breaks for  seniors.\n\nH.R. 1 protects the 87,000 Missouri farms and countless…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…continued my work to support law enforcement in Iowa but also  nationwide. In that role, I worked with Senate Republicans and the  White House as part of the Working Families Tax Cut law signed by the  President on July 4, securing historic support for the Byrne JAG and  COPS Programs for local police as well as efforts to combat drug  trafficking.\n\nAdditionally,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…grows anything, for that matter.\n\nSo while we tackle the 40-year high inflation rate--and it is coming  down, thankfully--these steps we have taken in the Working Families Tax  Cut Act I think will help us nudge the economy where it matters most-- which is at the kitchen table--in the right direction and make life  more affordable and the standard of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}]