[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the courts when we  absolutely oppose him.\n\nThis resolution is only moving because Republicans needed to waste  time while they hammer out how best to give $5 trillion in tax breaks  to billionaires. They needed more time to figure out if tens of  millions of Americans would lose Medicaid, whether millions of children  would lose access to food stamps,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…parents. My colleagues  on the other side of the aisle are cutting half a trillion dollars from  Medicare and hiking the costs of everyday items with their tariffs, all  to fund tax breaks for the billionaire class.\n\nThat alone is a betrayal of working families, but the GOP is not  stopping there. My Republican colleagues are not stopping at  dismantling people's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692545/rescissions-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…to Gilford, tell me they  wouldn't be able to afford groceries without some help.\n\nIt is a betrayal of working families for Republicans to take away  food so they can give tax breaks to billionaires.\n\nMy colleagues must continue speaking out against these cuts and do  everything they can to stop a reckless, cruel budget from moving  forward.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692014/food-assistance-for-working-families-at-risk"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…hundreds and hundreds of  millions of dollars in election spending and lobbying. And what did  Trump do? He delivered for them. He gave them $18 billion in new and  expanded tax breaks. A pretty good deal, huh? With hundreds of millions  of dollars invested, you get $18 billion in tax breaks.\n\nHe penalized their competition. The renewable energy that is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…lifelong educator, has been told that her premiums will jump  from $383 to nearly $1,000.\n\nMeanwhile, Trump and Republicans can find money for a fancy ballroom.  They can give tax breaks to billionaires. They even included millions  of dollars in cash payments in this bill for eight Republican Senators.  If anyone else in government gave themselves millions…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…have finally brought their healthcare bill to the floor, yet it fails  working families. Despite its name, it does nothing to lower costs.\n\nRepublicans found time to lock in tax breaks for big corporations and  billionaires but not the urgency or respect to help Americans afford  their healthcare.\n\nHouse Democrats are 100 percent united, and now four Republicans,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698367/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…largest cut to  Medicaid in American history. It also rips food out of the mouths of  hungry children, seniors, and veterans. All of this is being done to  provide massive tax breaks to billionaires.\n\nThen, Mr. Speaker, in this one big, ugly bill that has now been  signed into law, the debt and the deficit will explode by trillions of  dollars.\n\nHow dare…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…double next  year, and not small business owners and consumers alike hit hard by  tariffs.\n\nAmericans are hurting because my colleagues across the aisle would  rather give tax breaks to billionaires than lower costs for working  families. Americans and their families deserve better.\n\nWhether someone calls it stuffing or dressing, cranberry relish or…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697059/increasing-costs-of-thanksgiving"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fentanyl, but less than 1 percent of the fentanyl that comes into the  country comes from Canada.\n\nIt is one of the ways they can close that budget hole when they take  huge tax breaks for billionaires. This is another place--another  place--where Donald Trump and the Republicans are raising your costs so  they can cut taxes for billionaires. It is unbelievable.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Parkinson's research.\n\nWe used to have a bipartisan consensus in this country that we did  not cut Medicaid, that we did not cut medical research, and that we did  not give more tax breaks in my district in Silicon Valley, to the  billionaires in my district, at the expense of medical research and the  working class.\n\nMr. Speaker, I hope people in this body…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…underfunds  efforts to clean up sites contaminated by our Nation's early atomic  energy program.\n\nAll of this after Republicans passed the Big Ugly Bill, a law that  gives massive tax breaks to billionaires and the biggest corporations  while driving up home energy bills for families by as much as 30  percent.\n\nI cannot support this bill, and I urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…lose their health coverage.\n\nI will continue to do everything I can to stop a budget that places  the burden of cuts on New Hampshire families like hers to finance  massive tax breaks to the superrich. I urge my colleagues to stand up  against this betrayal of working families and instead focus on how we  can work together to make life safer, healthier,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Res. 31 is irresponsible, especially as we wait to see whether  Republicans will bring forward their budget bill to strip healthcare  from millions of Americans to give tax breaks to billionaires.\n\nHowever, this resolution would allow 1,800 facilities that emit the  worst of the worst cancer-causing toxic air pollutants to avoid Clean  Air Act requirements…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…didn't cut enough from critical programs like Medicaid and SNAP. This  budget is a direct attack on the working and middle classes, all while  handing more than $7 trillion in tax breaks to billionaires.\n\nOver 196,000 residents in my district are at risk of losing Medicaid  coverage, including 73,000 children and 27,000 seniors in one district.\n\nApproximately…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690060/republicans-budget-plan-passage"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…have passed the big, ugly bill  to rip away savings and rebates for cleaner, cheaper energy a few  months ago and energy efficiency that keeps bills lower, all to pay for  tax breaks for the wealthy and the well-connected.\n\nNow they want to ramp up gas exports that will make life even more  expensive. It wasn't even 1 year ago that the Department of Energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…double and sometimes even triple what they were 1 year ago. In their  big, beautiful bill, Republicans took a sledgehammer to our fragile  healthcare system to give permanent tax breaks to their political  donors, the billionaires, and the biggest corporations.\n\nOur President bombed boats and then the capital of a foreign country  for oil, and now he says…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…talking about different things. I do feel  the need to address that in that tax bill that he is talking about, in  the reconciliation bill that he trashes and says that it is tax breaks  for billionaires.\n\nI will just use my district as an example.\n\nIn my district, in the Seventh District of Minnesota, the  reconciliation bill that he opposes would prevent…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…effective and  overall impact.\n\nThis is going to provide real relief to American families, workers,  and businesses. The bill expands the child tax credit, provides  critical tax breaks for small businesses and the working class, and  makes America more competitive on the global stage. It also makes the  Tax Cuts and Jobs Act permanent, like I mentioned,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…stops the largest tax increase in U.S. history, while  providing the largest tax cut for working-and middle-class families  ever, with no tax on tips, no tax on overtime, and tax breaks for  seniors.\n\nH.R. 1 protects the 87,000 Missouri farms and countless family-owned  small businesses from double taxation by expanding the death tax  exemption.\n\nThe One…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…hard-earned taxpayer  dollars to bail Democrats out of their own decision--their own  decision--to make this COVID-era spending temporary so that they could  give Green New Deal tax breaks to the wealthy for electric vehicles and  solar panels.\n\nThey had the option. They had the option to make it permanent twice,  whether it was in the American Rescue Plan…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the D.C. Council has completely  opted out of in the D.C. Income and Franchise Tax Conformity and  Revision Temporary Amendment Act of 2025. Seven of them are targeted at  tax breaks for individuals. This includes service workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…news. I believe it was Bernie Sanders who was criticized by The  Washington Post--again, The Washington Post--by giving three or four  Pinocchios when they say that these tax breaks that Republicans do just  go to benefit the wealthy. That is The Washington Post saying to call  it as it is. These are Pinocchios. These are complete lies that the tax…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…rise $1,500, so  it won't feel relief from this provision. We don't feel what doesn't  happen.\n\nDemocrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips. They don't get paid overtime. They  don't rely on Social Security. Working families…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…4.The amendment referred to in section 3 is as       follows:\n\nAdd at the end of title V the following:       SEC.___.POINT OF ORDER AGAINST MEDICAID CUTS TO FUND TAX                     BREAKS FOR THE WEALTHY.\n\nIt shall not be in order in the House of Representatives to       consider any bill or joint resolution, or amendment thereto       or conference…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…dependence on the  government. Of course, they also had bailouts for student loans and  expansion of the IRS by $80 billion, mandating electric vehicles for  every American, tax breaks for green energy corporations, and the list  goes on and on.\n\nThey will also dust off an old playbook where they say that the Tax  Cuts and Jobs Act was simply a tax cut…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in expanding people's access to care by empowering them  with the same tax treatment, equal tax treatment, the corporations get.  Individuals should get the same tax deductions and tax breaks to be  able to have healthcare.\n\nMr. Speaker, we believe in expanded health savings accounts that you  can use for direct primary care to go to a doctor, have that…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…faster than  the top half. For the lower 10 percent, wages increased two times over  the 1 percent. People at the bottom and people in the middle benefited  more from the tax breaks.\n\nMr. ARRINGTON. Mr. Speaker, budgets are value statements. We value  letting working families keep more of their hard-earned dollars. We  value stewarding tax dollars, protecting…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}]