[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "We can start by permanently extending the enhanced  premium tax credits under the Affordable Care Act to prevent millions  more from seeing their premiums skyrocket.", "title": "National Rural Health Month", "date": "2025-11-20"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "No parent should have to face that choice, but Republicans in  Congress right now, aided by Donald Trump and Elon Musk, are willing to  rip away this essential healthcare from families like Abby's just to  hand out more tax cuts to the ultrawealthy.", "title": "Women's History Month", "date": "2025-03-26"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "President, the Constitution of the United States puts  two powers clearly--clearly--within the hands of Congress: the power to  tax and the power to conduct trade policy, including the imposition of  tariffs.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "If you take a look at the big, ugly bill and you get into  the details, well, there are the enhanced tax credits for the  Affordable Care Act, and we will talk about that in a few moments; but  also in the big, ugly bill is the big problem coming up at the end of  this 2026 year.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "I am ready to debate one-on-one,  prepared to yield to the Speaker for colloquy at any time so we can  discuss the Democratic vision for building an affordable economy that  lowers costs and makes life better for the American people and the  Republican budget proposal that would enact the largest Medicaid cut in  American history in order to pass massive tax breaks for Republicans'  billionaire donors like Elon Musk.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "This situation has led to  confusion, lost tax dollars, and a diminished sense of unity among  residents and businesses.", "title": "Single, Unique Zip Codes for Certain Communities", "date": "2025-07-21"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "The law ripped healthcare coverage away from millions  of Americans to give tax breaks and tax giveaways to billionaires and  megacorporations.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "I will continue to do everything I can to stop a budget that places  the burden of cuts on New Hampshire families like hers to finance  massive tax breaks to the superrich.", "title": "Cuts to Medicaid", "date": "2025-03-27"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "This bill will make devastating cuts to our communities in exchange  for massive tax breaks for President Trump, Elon Musk, and their  billionaire buddies.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "At the start of this  year, 22 million Americans saw their premiums go up in 2026 because  Republicans refused to extend tax breaks to help families afford their  healthcare.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "This happened in large part due to Congress providing long-term  certainty for tax incentives to both produce and deploy American-made  energy technologies.", "title": "American Energy Jobs At Risk", "date": "2025-06-11"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Meanwhile, if you look at what the Trump administration and our GOP  colleagues are doing, they are actually adding deficits of trillions of  dollars to give tax breaks to billionaires.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "But while hospital beds are  closing, Republicans are prioritizing a repeal on tanning bed taxes.", "title": "Budget Reconciliation", "date": "2025-05-22"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "To perpetuate the tax  breaks of the Trump administration for the wealthiest people in  America.", "title": "Medicaid", "date": "2025-05-12"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Tax Court          None.............", "title": "Developing and Empowering Our Aspiring Leaders Act of 2025", "date": "2025-12-01"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The gentleman's chart that The Wall Street Journal did, where you  have the provider taxes, you have this high rate that they are able to  collect, and they are juicing it using the provider taxes.", "title": "Economic Anxiety", "date": "2025-05-01"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Americans pay several  hundred billion dollars in taxes each year to fund the salaries and  benefits of more than 2 million Federal civilian employees.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "I worked on legislation to permanently increase the child tax credit  from $1,000 to $2,000; indexing the CTC--child tax credit--to  inflation; and provide an additional $500 for families through 2028.", "title": "Highlighting Republican Successes in 2025", "date": "2026-01-21"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "You know, other solutions out there are expanding healthcare savings  accounts where you can use pretax dollars for different opportunities  as well.", "title": "-9999", "date": "2025-10-02"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "We wanted less government  spending, more secure borders, and we wanted to see the 2017 tax cuts  made permanent to prevent tax hikes on every American.", "title": "One Big, Beautiful Bill", "date": "2025-05-21"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Taxpayers should all be asking: Why is Washington spending money on  anyone or anything that is nonessential?", "title": "-9999", "date": "2025-10-16"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "One of those debates involves the State and local tax deduction.", "title": "The Big, Beautiful Bill", "date": "2025-05-15"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Also while I was at home, I ran into somebody who is in a low-income  housing unit that receives the low-income housing tax credits.", "title": "Events in Milwaukee", "date": "2025-07-14"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Speaker, 77 million Americans trusted President Trump to restore  common sense to our Nation's Capital by bringing down everyday costs,  reining in our Federal spending, lowering taxes, rolling back  burdensome regulations, strengthening our Nation's border security, and  getting our fiscal house back in order.", "title": "Condemning Anti-Semitism", "date": "2025-06-05"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "House Republicans have a mandate to restore America's faith in  government and we will protect hardworking taxpayers, preventing the  largest tax increase in American history.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Speaker, 85 percent of all Affordable Care Act revenue insurers  received comes from the Federal taxpayers.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "With our community  leaders, we had conversations that focused on the need to extend the  progrowth policies of the Tax Cuts and Jobs Act.", "title": "All Policy is Local", "date": "2025-03-27"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "From  the tobacco buyout program to tax relief for the sale of farmland, I  have made sure our farmers have the tools they need to be successful in  volatile markets.", "title": "-9999", "date": "2025-08-01"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Speaker, if FOX News or talk radio or any  other conservative media outlet came to me and asked us if we should  provide them with taxpayer-funded handouts, I would say no, and I  believe that most of my colleagues would as well.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}]