[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food stuck in warehouses, factory workers laid off, with  children suffering from severe malnutrition and famine.\n\nThis is food that has already been paid for by the American taxpayers  that could be used to feed starving children who are victims of war and  famine, but instead, it sits in a warehouse benefiting no one.\n\nWe need the funding that this Congress…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Oregon coast. Certainly,  the people of the Oregon coast would differ mightily with the notion  that there is no environmental impact. They are still cleaning up the  mess, and taxpayers ultimately had to do it.\n\nWe also have the example from the Olympic Coast National Marine  Sanctuary that I referred to earlier. This, of course, is a tough place  to work…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…colleague,  Representative Malliotakis, in cosponsoring and speaking in favor of  the Recovery of Stolen Checks Act.\n\nThis bill requires the Treasury to make procedures that allow  taxpayers to opt in to receiving a replacement refund by direct deposit  after their paper checks have been lost or stolen in the mail.\n\nRight now, the Treasury Department is only…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…impossible to explain or defend what is going on today. Gaza is  starving and dying because of the policies of Benyamin Netanyahu.\n\nIt is time for us as a nation to say that our taxpayers are not going  to support this effort. I will be joining the Senator this evening in  supporting this effort.\n\nMr. DURBIN.  Slotkin) are necessarily absent.\n\nThe result was…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that I think all of us absolutely need.\n\nIt is to fund a tax cut. Literally, it is to fund a tax cut. So then  the question becomes: tax cut for whom? We have millions of taxpayers  in this country with all different incomes, and that includes everyone  from folks who are making 7 or 8 bucks an hour to $15 an hour, to  middle-class families maybe with…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…remarks for a second  because I saw this as a mayor. When you scrimp on regular treatment for  people with chronic care, when you scrimp on preventing disease, it  costs more to taxpayers. I saw that because folks would end up in my  emergency rooms in Newark. And the care there is so much more  expensive. For a taxpayer, you get a much better deal in helping…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…prevent  such tunnels from happening. That is why I support H.R. 495.\n\nTunnels are used by transnational criminal organizations looking to  make a profit at the expense of our taxpayers. Over the last 30 years,  cartels have created illegal and sophisticated tunnels under our border  walls to smuggle drugs into our country, as well as money and weapons…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688706/subterranean-border-defense-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…traffickers to use stablecoins to finance illegal activity; have  refused to adopt changes that ensure that stablecoins do not  destabilize our financial system and require taxpayers to bail out  crypto companies when they crash; have refused to adopt changes that  would prevent Big Tech billionaires from using this bill to issue their  own private currencies;…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…cancer research.\n\nOver the last 50 years, the 5-year cancer survival rate for people  like myself has risen from 49 percent to 68 percent. This is largely  because of American taxpayers' investment in the brilliant researchers  at the National Cancer Institute.\n\nThe administration's cuts to the National Cancer Institute's spending  by $842 million in its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…months accusing Maduro of leading a cartel  that even our own DEA doesn't recognize.\n\nJust like the Bush administration insisted earlier on that oil  revenue, not American taxpayers, would cover the cost of reconstruction  in Iraq, Trump is hoping people will buy the fantasy his incursion into  Venezuela will be cost-free. The parallels to Iraq are alarmingly…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…administrative nightmare for D.C. and tax software  companies. D.C. would have to suspend the current tax filing season for  several months to update tax forms and guidance, and taxpayers who have  already filed returns would have to file amended returns.\n\nThe D.C. law is not unique. Like D.C., approximately half of the  States, both red and blue, automatically…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…programs have been endlessly scrutinized since their founding,  but economic analysis has shown an overwhelmingly successful program  with an outsized return on investment for taxpayers.\n\nUnfortunately, the SBIR and STTR programs are set to expire on  September 30. If these programs are allowed to expire, agencies would  lose the ability to issue new awards,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…low-level offenses. They are not there because they have been found  guilty but because they can't afford bail or are stuck waiting for  their day in court. While they wait, taxpayers pay the price.\n\nThat is why I have introduced the Justice Forward Agenda, a target,  results-driven plan to reduce crime and use taxpayer dollars more  wisely. The Community…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690046/moving-justice-forward"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…which is the complete corruption of their government from the  inside out.\n\nThe Trump administration's pay-to-play schemes are literally ripping  off hardworking American taxpayers as we speak. We see the evidence  everywhere: A $10 billion payout that Donald Trump, the President of  the United States of America, now demands from his own Treasury  Department…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…who is  sending in the National Guard and militarizing soldiers against  citizens in those cities and States. They are right here at Union  Station in Washington, D.C. The taxpayers are footing a million dollars  a day for these National Guard members to pick up trash. They are doing  the job that sanitation workers would be doing in the District of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the largest tax  hike in American history, or we can change course.\n\nThe One Big Beautiful Bill Act ushers in the golden age of America,  as our great President says, where taxpayers, not illegal immigrants,  are put first. It eliminates taxes on tips and overtime and brings tax  relief to seniors. It saves and sustains Medicaid so it is there for  those…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Gothenburg is--and  some, probably, where Omaha or Lincoln are.\n\nJust as important in bringing Federal tax dollars back home, it is  providing that tax relief to Nebraska taxpayers. Many of these projects  would otherwise fall on our local property taxes, which are considered  very high in the State of Nebraska. It will shift the burden onto  families,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…across the  country looking to grow and reshore their businesses.\n\nIt is often the case that when Congress passes a bill to support an  industry, it will come at a cost to taxpayers. This is not the case  with H.R. 3174 because the SBA's 7(a) and 504 loan programs operate  under zero subsidy, meaning zero cost to the taxpayer. The  Congressional Budget…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…who have come to our country to steal from the  American people--to steal from the U.S. taxpayer; to steal from the  Federal Government--and pad their pockets.\n\nHard-working taxpayers deserve to know their money goes to those who  truly need it. It should not be going to criminals who are choosing to  game the system. I know the Fraud Accountability Act…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…treatments.\n\nTemple University Hospital in Pennsylvania provides transgender care  for adults.\n\nAny of the communities that want this should put their money up to  pay for it. The taxpayers cannot afford it.\n\nMr. NORMAN. Mr. Chair, I yield an additional 15 seconds to the  gentleman from Georgia.\n\nMr. NORMAN. Mr. Chair, may I inquire how as to much time is  remaining.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…without the  Mayor's support, legislation that denies tax relief to D.C. residents  and businesses that was afforded to them by the Working Families Tax  Cut Act.\n\nWhile D.C. taxpayers still enjoy the benefits of such tax relief with  their Federal tax filings, they are being stripped of corresponding  relief that should also be afforded to them at the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the safety of their workforce.\n\nProject labor agreement mandates prevent many small businesses from  competing for Federal projects and may even lead to increased costs for  taxpayers.\n\nI told you I was going to talk about legislation that would do the  same thing I asked President Biden to do. I am the cosponsor of a bill  called the Fair and Open Competition…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…has heard  from the people and is hell-bent on rightsizing this bureaucracy,  reining in this waste, and restoring fiscal sanity here in Washington,  D.C., not only for the taxpayers of today but for the future, for  prosperity, for freedom, and for our children.\n\nThis is why my colleagues are going to wander in the wilderness for  years to come. While…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…level the playing field  for veterans seeking education and employment so that every veteran has  access to the opportunities that they want, all the while protecting  the taxpayers' investment and these programs.\n\nMadam Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Madam Speaker, I appreciate the concerns of the minority,  and I would…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Nation, the only State in the Nation, to provide free  Medi-Cal to every single person in our State illegally.\n\nIt was recently revealed that this is costing California taxpayers  $9.5 billion this year alone. Right now, we are talking about costs  over a 10-year time horizon, so let's consider what that cost will be  here.\n\nThe cost is surely going…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…grassroots  organizing for Gavin Newsom's redistricting sham. The same group that  has benefited so generously from his largesse that has received funding  from California taxpayers in order to help organize and instigate the  actions of rioters is now leading the grassroots organizing for this  attempt to overturn the will of California voters.\n\nIt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…supports a well-deserved pay raise for our  servicemembers, creates a more lethal and agile force to counter our  adversaries, and secures our Nation's borders, all while saving  taxpayers over $20 billion through cutting inefficient programs and  government bureaucracy. This is a compromise bill that meets the moment  and the need to support our warfighters…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…watchdog group has said is loaded with fraud and waste--as the chairman  said, Social Security numbers from tens of thousands of dead people--it  is siphoning money out of the taxpayers' pockets, away from the  vulnerable, and enriching insurance companies.\n\nThere are millions of ineligible people, billions of dollars of  fraud, and people are watching what…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Europe.\n\nUnder Barack Obama and Joe Biden, our Federal Government imported  millions of foreigners who hate America, enabling them to live on  welfare and forcing American taxpayers to pay the bills.\n\nNew York City's recent mayoral election reveals how easily a Muslim  communist can come to power in our Nation's most iconic city. You know,  foreign-born,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…mistake, this is a generational win for rural America.\n\nI thank Agriculture Committee members for their continued work in  developing and advancing this policy. We are protecting taxpayers,  helping low-income Americans return to work, and securing the future of  American agriculture in our rural communities.\n\nThe One Big Beautiful Bill Act delivers on President…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693176/one-big-beautiful-bill-act"}]