[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…School in 1964, later earning her  bachelor's degree in Elementary Education from the Women's College of  Georgia, now Georgia College and State University.\n\nJudy began her teaching career at Bibb Elementary School in Columbus,  where she was a fifth and sixth grade teacher. Due to her unwavering  commitment to education and the future of young people,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…proud graduate of Riverside High School in Loudoun  County where she cultivated a love for the arts. Madison will spend the  year traveling to over 70 elementary schools, teaching students  curriculum on making health choices relating to drugs and alcohol.\n\nShe will begin her work on the Arts for All initiative, as well,  seeking to expand access to…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…United States' national security interests.\n\nOn a personal note, I credit the people of Haiti,       especially as we are coming off of celebrating independence,       for teaching me my earliest lessons in the work of       resistance. So today, on the one year anniversary--feels much       longer--on the one year anniversary of this cruel and hostile…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Tribal nation lies in the preservation and vitality of culture and  language for future generations. He led the effort to create the  Kwiyagat Community Academy, dedicated to teaching Ute history,  language, and culture. Visiting the school with him was a profound  reminder of his vision and dedication to his people and their cultural  heritage.\n\nChairman…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…awards this  year. Many of these grants were terminated for no reason by the  administration. One particularly egregious example was an award on  improving the effectiveness of teaching students how to do computer  science. Really?\n\nAt a time when we need to increase our domestic AI and STEM focused  workforce, we need students to be familiar with the artificial…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…I thank Head Coaches Tim Byers and Fernando Serratos. I also thank  Assistant Coaches Liborio Salazar, Alex Becerra, Monica Serratos, Jose  Leon, and Stephanie Zamora for teaching our young Saints leadership  qualities, and what hard work and dedication can mean at the end of the  day.\n\nThese young ladies are wrestling champs all while maintaining a…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700265/congratulating-the-santa-ana-high-school-girls-wrestling-team"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…is an 11th and 12th grade international baccalaureate  language and literature teacher at South Hills High School in the  Covina Valley Unified School District. He has been teaching for 21  years and has developed an outstanding reputation for his creativity,  compassion, and dedication to his students.\n\nHis inclusive and supportive classroom has exemplified…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…scholar, having earned both a Bachelor of  Science and Master of Science in education at Indiana University in  Bloomington. After graduating, Edith pursued a career in the teaching  profession where she went on to enrich the lives of thousands of young  minds. For over 27 years, Edith taught students at Frederick Douglass  Elementary School. She also…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Langworthy, matters so deeply. Respite care isn't a luxury. It is the  difference between a caregiver burning out and a family staying  together.\n\nThis bill also reauthorizes the Teaching Health Center GME program,  the National Health Services Corps, extends telehealth, and increases  funding for critical rural health programs. Taken together, these  investments…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…low-income students. These harmful  policies will also impede access to graduate education and, by  extension, exacerbate workforce shortages in professional fields such  as teaching, behavioral health, and social work. Instead of investing  in public education, this bill enacts a federal voucher scheme that  redirects tax dollars to unaccountable K-12…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today because I have heard from  a lot of my colleagues about a nationwide shortage in professional  fields like teaching, nursing, and social work. Our communities have  done a lot of work to address these shortages so we can keep our  hospitals and clinics and schools open. However, between…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Champion of the Week.\n\nJoseph was recently awarded a $50,000 prize for his school's skilled  trades program as a winner of the 2025 Harbor Freight Tools for Schools  Prize for Teaching Excellence. He is 1 of just 25 teachers around the  country to be honored with this award--a true testament to his  determination to better the lives of his students.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…with his draconian Executive orders--his obsession to stamp out  diversity, equity, and inclusion in our public schools; Executive  orders that direct our schools to stop teaching entire chapters of our  Nation's history like the Civil War, African-American history, and the  history of immigrants in our country.\n\nThat is just a part of the obsession…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…included provisions to lower prescription drug prices, crack  down on junk fees, lower gas prices, ensure our water is safe to drink,  and fund community health centers and teaching health centers. Instead,  Speaker Johnson chose to cave to Elon Musk.\n\nThough it may be delayed, I am pleased to be supporting the passage  today of the American Music Tourism…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…employed. We also stand to lose $21  million in special education support, and $19 million for school  meals--because no child should be too hungry to learn. More than 1,300  teaching jobs are on the line.\n\nAll of this--to make billionaires richer? Mr. Speaker, we are not  going backward. Not to Jim Crow classrooms. Not to separate and  unequal.\n\nThe Congressional…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…areas, and has performed internationally in Great Britain  and the British Virgin islands.\n\nIn retirement, Mr. Parker looks forward to guest conducting, running  clinics and teaching lessons online, as well as continuing to play his  saxophone. He is the proud father of one daughter.\n\nMr. Speaker, I thank Mr. Parker for his 27 years of service to the…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Amendments.--\n\n(1) Section 2102(a) of title 14, United States Code, is       amended, in the second sentence by striking ``and officers of       the permanent commissioned teaching staff of the Coast Guard       Academy'' and inserting ``officers of the permanent       commissioned teaching staff of the Coast Guard Academy, and       officers designated…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…nursing faculty       member, for whom such award amounts described in paragraph       (3) shall be prorated relative to the amount of time       participating in part-time teaching.\n\n``(B) Inflation.--The term `inflation' means the Consumer       Price Index for all urban consumers (all items; U.S. city       average).\n\n``(8) Authorization of appropriations.--To…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…These blatant  attempts to inject foreign ideologies into our schools undermines the  fundamental purpose of American education. It goes without saying that  we should be teaching American values in American schools.\n\nThis is what happens when institutions of learning accept the Trojan  horse of foreign funding. It shouldn't take an act of Congress…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…construction sites and  ReStores. Mr. Quinn's impact is profoundly felt by the partner families  working toward homeownership. On construction sites, he shares his  expertise by teaching them essential home building and maintenance  skills. His mentorship empowers these families with practical knowledge  and fosters a sense of ownership of their future homes.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…is Alex's son, Anthony.\n\nAlex's dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and my office on track, smiling,  and teaching us Armenian history along the way.\n\nWhile he was working around the clock in my office during the past 4  years, he has also been a part-time law school student and devoted…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of America and the first  Supreme Council in the world was established.\n\nThe Scottish Rite of Freemasonry seeks to better its members and  strengthen their communities by teaching and promoting brotherly love,  tolerance, and truth. The Rite embraces strong social, moral, and  spiritual values that include compassion and dedication to God, family,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…990 KBLS-AM. As a  testament to his sales development, leadership, and organizational  skills, Terry also led the sales and marketing department at the number  one Christian Teaching and Talk station in the nation.\n\nThroughout his successful career, Terry and his broadcast stations  have earned numerous accolades, including the Marconi Radio Religious…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…meets the needs of kids  where they are.\n\nHer student-first approach provides real options for parents of  special needs children. By customizing lesson plans and blending  teaching, she makes sure that every student, regardless of ability, has  the path to succeed.\n\nDuring a recent visit, I met Sofia, a student who once was nonverbal  and withdrawn.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691347/recognizing-lacey-anderson"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…million to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer global movements; $3 million for Iraqi ``Sesame  Street''; $2.5 million for teaching young children how to make  environmentally friendly reproductive health decisions; and $833,000  for services for transgender people, sex workers and their clients, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…years,  starting as my digital director before moving up to deputy  communications director.\n\nFrom taking incredible videos and photos and designing eye-catching  graphics to teaching other Hill staffers how they can best produce  great content for Members of Congress, Michael's inspiring creativity  and work ethic have been a major contribution not only…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691928/good-bye-michael-comer"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…events  that honor fellow service members. In addition to supporting community  celebrations and veteran fundraisers, Mr. Sarrault volunteers his time  at Bishop Baraga School, teaching students about patriotism and proper  flag etiquette. His community commitment is further reflected in his  charitable efforts, including distributing toys at Christmas and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…expenditures nearly tripled, and the  endowment more than doubled.\n\nDr. Adams oversaw more than $1 billion in campus construction and  renovation, creating vital facilities for teaching, research, and  student life. His success as a university administrator was recognized  by more than 50 higher education awards. He deeply believed in the  transformative…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sponsoring the High-Quality Charter  Schools Act that would make more opportunities like that available  throughout the country.\n\nWe have also held hearings in my subcommittee on teaching literacy  appropriately, which California is finally moving in that direction,  teaching math appropriately, getting back to basics, utilizing  education technology in the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the country, being  selected for this distinction is a remarkable and well-deserved honor.  It reflects not only Master Sergeant Worthen's professionalism and  excellence in teaching, but also his profound commitment to shaping the  character and leadership potential of America's youth.\n\nThrough his example, Master Sergeant Worthen continues to inspire…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696209/recognizing-bensalem-high-school-jrotc-instructor-of-the-year-master-sergeant-shawn-worthen-retired"}]