[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I thank Representative Hayes for leading  this important conversation and bringing her expertise as National  Teacher of the Year to the Congress and to the Education Committee.\n\nMr. Speaker, I have been an education advocate for decades, and I  speak with students, parents, and educators in Congress…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Columbus,  where she was a fifth and sixth grade teacher. Due to her unwavering  commitment to education and the future of young people, she was honored  as Columbus Teacher of the Year in 1973. During that same time, she  served as President of the Muscogee Association of Educators. On May 9,  2021, Judy was awarded the Jim Buntin Leadership Award…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…Speaker, I thank the gentlewoman from Connecticut  (Mrs. Hayes) for yielding time. I thank her for her unwavering support  of children and for having been the National Teacher of the Year. I  thank her so much.\n\nMr. Speaker, I rise because dismantling the Department of Education  is not just bad policy. It is dangerous for North Carolina's children.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…originally from Springfield, Massachusetts, who recently  was honored by the Organization of American Historians (OAH) as the  winner of the prestigious 2025 Mary K. Bonstell Teacher of the Year  Award. He currently is a U.S. History and Government teacher at Gonzaga  High School in Washington, D.C.\n\nThe award was given at the OAH annual meeting last April in…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…receives  a vote here on the House floor.\n\nMr. NEGUSE.  Mrs.  Hayes is the author and the sponsor of this legislation, a former  public schoolteacher, and a National Teacher of the Year. She is  someone who has spent her life serving the students, the young folks,  and the working families of the people of Connecticut.\n\nMr. Speaker, some of this can…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…taught our kids in Irvine for the past 20 years and had the honor  recently of being 1 of 6 educators out of 20,000 across Orange County  to be selected as Orange County Teacher of the Year.\n\nTracy is known for her outstanding ability to build a positive  classroom culture and to find creative ways to engage her students.  Tracy goes above and beyond outside…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690842/teacher-appreciation-week"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…during Teacher Appreciation  Week, I rise to honor Jessica Suarez Nieto, a middle school teacher at  Telpochcalli School, a dual language school, recently named Bilingual  Teacher of the Year by the Illinois State Board of Education.\n\nAs a young immigrant child who didn't speak English when I arrived in  the U.S., I knew firsthand the impact that teachers…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…organizing  this Special Order hour but also for her leadership. We are so  fortunate to have Representative Hayes on the Committee on Education  and Workforce, National Teacher of the Year, and I will say what an  honor it is to serve with the gentlewoman.\n\nMr. Speaker, I ran for Congress because I care so much about public  education. Although I haven't…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…his creativity,  compassion, and dedication to his students.\n\nHis inclusive and supportive classroom has exemplified good teaching,  and he has well-earned the title of Teacher of the Year.\n\nDr. Heather Povinelli is a second grade teacher at Bradoaks  Elementary Science Academy in the Monrovia Unified School District.\n\nFor 25 years, she has dedicated her…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…certified teacher, one must go through a lot of steps. But this  certification indicates what an exceptional teacher she is.\n\nShe has been recognized as her complex area's Teacher of the Year, as  Hawaii State teacher fellow, and as a Pulitzer Center teacher fellow.  Just last month, she was recognized by the Hawaii State Teachers  Association for her work…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today to recognize Sarah Dully,  Rhode Island's 2026 Teacher of the Year.\n\nMs. Dully began her work as an educator in 2012. She joined  Narragansett High School as an English language arts teacher in 2020,  where she is admired and respected…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise to congratulate Edie Brooks on being  named Teacher of the Year by the Virginia Business Educators  Association.\n\nEdie is a business and IT career education teacher at Post Oak Middle  School. She was honored for her innovative teaching…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, it is always an honor and a pleasure to work  with the gentlewoman from Connecticut, a distinguished National Teacher  of the Year and an amazing educator who, like myself, went from the  classroom to the Halls of Congress to advocate for our students  nationally.\n\nThe promise of a free and quality…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Christ and has taught Sunday School for many years.  As a result of her efforts to advance student learning and achievement,  she  has been recognized as Bible School Teacher of the Year and Rookie of  the Year at Lindale Elementary School. A devoted follower of Jesus, Kay  is most proud of supporting Sheriff Lane's career as a public servant  and being…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…highest standards of educational  excellence and leadership, which led her to be recognized recently by  the Folsom Cordova Unified School District as the 2024-2025 Teacher of  the Year.\n\nI am proud to represent outstanding educators like Dr. Sandfort in  Congress, and I commend her for her more than two decades of dedication  to education and to promoting…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to honor Rachel  Kinsaul who was recognized by the Georgia Department of Education as  the Georgia Teacher of the Year for 2026.\n\nShe led an exceptional career in the Morgan County school system as a  teacher of agricultural science, extending her involvement beyond the  academic setting.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692403/recognizing-rachel-kinsaul"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Madam Speaker, I rise today in honor of Tiffani  Jaseph, who was honorably named the 2026 Arizona Teacher of the Year.  Tiffani serves as a special education teacher at Copper View Elementary  School in the Sahuarita Unified School District.\n\nTiffani received her bachelor of arts and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I rise to recognize Ms. Kimberly Day- Scanlon as the Okaloosa County Teacher of the Year. For several years,  Ms. Day-Scanlon has served Kenwood Elementary School with talent,  passion, and an unwavering commitment to a quality education. In  Northwest Florida,…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I am proud to recognize Utah's State Teacher  of the Year, Sayre Posey, an outstanding educator who embodies the  mission of the Merit Caucus: excellence, innovation, and high  expectations.\n\nShe comes from a long line of teachers.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…community, serving as director of the Coastal Ecology Camp and  caretaker to various campus educational gardens.\n\nBeyond Country Day, Mr. Eswine has been recognized as Teacher of the  Year and honored by organizations such as Garden Club of America, the  Georgia Independent School Association, and the Georgia Department of  Natural Resources. His commitment…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize Valencia Abbott, of  Rockingham Early College High School, who was recently named the 2025  National History Teacher of the Year.\n\nThis is a monumental accomplishment and one that speaks volumes to  Ms. Abbott's passion for education and her dedication to the students  she serves.\n\nNot only is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…classroom.\n\nThis year, Pennsylvania has special reason to celebrate. Ashlie  Crosson, an English teacher of Mifflin County High School, has been  named the 2025 National Teacher of the Year. A first-generation college  student, Ms. Crosson earned degrees from Susquehanna University and  Penn State and previously taught in Bellefonte, near my hometown.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Nation  because of them.                       Recognition of Shanequa Matthias\n\nMr. CISCOMANI. Mr. Speaker, I rise today full of pride to  congratulate Cochise County Teacher of the Year and Carmichael  Elementary School's fifth grade teacher Shanequa Matthias.\n\nMr. Speaker, I thank her for her tireless efforts on behalf of our  students.\n\nI firmly believe…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate Nathan Lund of  Starbuck, Minnesota, on receiving Minnesota's Agriculture in the  Classroom 2025 Outstanding Teacher of the Year Award.\n\nThis award is given to K-12 educators who can creatively incorporate  agriculture concepts into their teaching.\n\nNathan has taught fifth and sixth grade students…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…I meet some very special people. Last month, in Sheldon, IA, at the  high school, I had the honor of meeting Stephanie Pritts, who was  recently named Iowa's 2026 ``Teacher of the Year.''\n\nNow, it goes way back to 1958 that Iowa started the ``Teacher of the  Year'' award, honoring an exceptional Iowa teacher each year. There is  very tough competition…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Recognizing Michael Clark\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to recognize  Michael Clark for being selected as the Outstanding Agriculture  Education Teacher of the Year. This is one of the highest honors for  his profession.\n\nMichael is an agriculture teacher at the Greenwood High School in  Perry County, Pennsylvania.\n\nThe national…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}]