[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…University of  Akron Zips Women's Lacrosse team and their coach, Elaine Jones, as  Ohio's 13th Congressional District Champions of the Week.\n\nFor the first time ever, this lacrosse team won the Mid-American  Conference Lacrosse Championship when they took down Robert Morris  University in an overtime thriller to secure their first ever  championship.\n\nWith just…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691189/champion-of-the-week-university-of-akron-womens-lacrosse-teams"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…performed plays, and gone above and beyond academically.\n\nThey have excelled across a wide range of fields. Riverside Moon  Productions won a competition, and the varsity softball team won a 5A  State title.\n\nRiverside was also named as a platinum member of the 2024 AP School  Honor Roll. This would not have been possible without the 80 percent of  seniors who…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…apparent in his days as a college basketball player. He attended  Virginia State University on a four-year athletic scholarship and  played small forward. In his senior year, his team won the Central  Intercollegiate Athletic Association championship. While his goal was  to join the NBA, Shabazz ended up meeting several folks who worked for  the Richmond Sheriff's…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…young players take  the field with determination and energy. Just this summer, the minor  league division, the 10-year-olds, made it to the State tournament,  while the senior team won the fourth consecutive Central Region  Tournament, something no other team has done before, and went on to  represent our State in the Little League Senior League Baseball…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694916/congratulating-burbank-american-little-league"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…rise today to congratulate the Idlewild  Elementary School Chess Team champions, and their coach Mark Beatty, on  their impressive run of successes this year. The 15-member team won the  2025 Henry D. Sabine State Scholastic Team Chess Tournament in both the  kindergarten through third grade and kindergarten through fifth grade  categories. The wins qualified…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691697/congratulating-the-idlewild-elementary-school-chess-team-champions"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…named the  Assistant Coach of the Year by the PSCA.\n\nThe Cocalico Eagles soared under Hogan and Parmer's leadership.  During their stellar 20-2-3 season, the girls' soccer team won the  Lancaster-Lebanon League section title and advanced to the District  Three 3A championship. Beaten in the finals in the previous two years,  the Eagles defeated their…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize the 2025 Class 1A  Minnesota State Girls Hockey Champions: the Dodge County Wildcats.\n\nOn February 22nd, the team won their first-ever state title at the  Xcel Energy Center in a suspenseful overtime game against Warroad. The  Wildcats claimed the win with a 4-3 final score.\n\nThe deciding…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Pere Phantoms traveled to Camp Randall  Stadium in Madison to compete in the 2025 WIAA Division 2 State  Football Championship.\n\nIn a hard-fought matchup, the West De Pere team won its third State  title in program history. The Phantoms' defense held their opponent to  zero points in the second half, and the offense broke records on the  way to a 28-14…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Placid Games and drew 34,200,000 average viewers. The match       is remembered as a ``miracle'' as collegiate hockey players       defied expectations in defeating a Soviet team that won 4       consecutive gold medals dating back to 1964.\n\n(5) Team USA defeated Finland 4-1 in its final game to win       the gold medal, its first gold medal since 1960 in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Continuing their dominance of NCAA wrestling, the Nittany Lions  brought  their 13th national title to Happy Valley.\n\nUnder the leadership of Coach Cael Sanderson, his team has won 12 of  the last 15 NCAA championships.\n\nPenn State's two individual champions are a testament to the strength  of their program as well as their personal strength, talent,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689222/congratulating-penn-state-wrestling"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to honor the  Frederica Academy baseball team who won the program's first-ever State  championship this season.\n\nSince 1969, Frederica Academy has earned 76 State titles across all  its athletic programs, except for one. Their…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Placid and drew 34,200,000 average viewers. The match is       remembered as a ``miracle'' as collegiate ice hockey players       defied expectations in defeating a Soviet team that won 4       consecutive gold medals dating back to 1964.\n\n(5) Team USA defeated Finland 4-2 in its final game to win       the gold medal, its first gold medal since 1960 in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise today to honor McCutcheon High  School's Mavericks Robotics team, which won the 2025 FIRST Robotics  Competition World Championship.\n\nThe Mavericks Robotics team competed against 3,700 teams from around  the world just to clinch a spot in the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Pacific Southwest Regional, advancing to the Babe Ruth  World Series. They are only the third Utah team to do so in the 75-year  history of the tournament.\n\nThe Price Battle team won third place at the championship, making  history for our community while competing on the national stage. Price  Battle also took home the most awards for the tournament,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694927/congratulating-price-utah-battle-youth-baseball-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…record previously held by St. Cloud  State.\n\nThe Nittany Lions' current winning streak began in February 2020 when  they defeated the University of Maryland. Since 2020, the team has won  five consecutive Big Ten regular season titles, three Big Ten  championships, and four NCAA championships.\n\nThis past weekend marked the team's first Big Ten conference…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699135/recognizing-pennsylvania-state-wrestling"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Indianapolis, Indiana. During the Poultry Evaluation event, Manor FFA  students evaluated live poultry, graded carcasses and eggs, and  completed a written exam. The Manor FFA team won a gold ranking, and  the students--Anna Frey, Jozie Gilger, Leanna Kneisley, and Misty  Railing--each earned silver.\n\nThe Dairy Cattle Evaluation and Management event saw…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}]