[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today with great pride to  congratulate South Side High School's girls' volleyball team on winning  the New York State Class A girls' volleyball championship.\n\nOn behalf of Nassau County and New York's Fourth Congressional  District, I want to take this opportunity…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698103/congratulating-south-side-high-school-girls-volleyball-team"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…In their time at Rappahannock County High School, they have achieved  a lot of great things, including bringing home a Class 1 State title  for the women's basketball team and winning a Scholastic Bowl regional  championship. Whether on the field, in the classroom, in the drama  club, or as part of one of Rappahannock County High School's bands, I…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "Mr. VARGAS. Mr. Speaker, I rise today to congratulate the Lincoln  High School football team on winning their second State title in 3  years. This was a huge achievement, but it is even more amazing when  you consider what this team had to overcome to get there.\n\nThe Hornets…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688608/congratulating-lincoln-high-school-football-team"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today with great pride to  congratulate the Baldwin High School girls' basketball team on winning  the New York State AA State Championship.\n\nOn behalf of New York's Fourth Congressional District, I take this  opportunity to commend and celebrate these young athletes…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689286/congratulating-baldwin-high-school-girls-basketball-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Congratulating the Skyline High School Wrestling Team\n\nMr. CLINE. Mr. Speaker, I rise today to recognize and congratulate  the Skyline High School wrestling team on winning the 2025 Class 3  State wrestling championship, the first State title in the school's  history.\n\nUnder the leadership of Head Coach Kyle Symons and Assistant Coaches…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  Moody High School football team for winning the Alabama High School  Athletic Association (AHSAA) 5A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 4, 2025,  the Moody football team,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697944/recognizing-moody-high-school-for-winning-the-ahsaa-class-5a-state-championship-in-football"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  Coosa Christian School football team for winning the Alabama High  School Athletic Association (AHSAA) 2A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 5, 2025,  the Coosa Christian School…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697936/recognizing-coosa-christian-school-for-winning-the-ahsaa-class-2a-state-championship-in-football"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Congratulating Roanoke Valley Christian Schools Eagles\n\nMr. CLINE. Mr. Speaker, I rise today to congratulate the Roanoke  Valley Christian Schools Eagles varsity boys' basketball team for  winning the 2025 VACA State championship, securing back-to-back titles  and etching their names into school history.\n\nAfter graduating eight seniors last year, expectations were…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate the Catalina  Foothills High School boys' swim team for winning the D2 State  championship.\n\nThe Falcons finished with a total score of 386, with senior Connor  Daggett winning gold.\n\nThe team finished first in three races: the 200-meter…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699071/catalina-foothills-high-school-boys-swim-team-wins-d2-state-championship"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate Empire High  School's softball team for winning the 3A State Title.\n\nThe Ravens scored a run in the bottom of the eighth inning to defeat  Yuma Catholic 1-0, earning their second straight State title and the  fourth…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate the Manheim  Central High School boys' volleyball team on winning the PIAA Class 2A  State championship on Saturday, June 14, 2025.\n\nThe Manheim Central Barons cruised through the regular season, the  District Three championship, and…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Basketball Team on Ohio                           Division V State Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to congratulate the Portsmouth  High School girls' basketball team on winning their school's first-ever  Ohio Division V basketball State championship.\n\nHaving dreamt of securing this title since they were in the fifth  grade, the nine athletes…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I rise today to congratulate Izzy Soto and her  teammates on the United States National Development Team for winning a  gold medal at the 2025 Pan American Inline Hockey Championships in  Oaxtepec, Morelos, Mexico.\n\nRepresenting our Nation with pride and determination, the team  demonstrated…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  Moody High School girls' flag football team for winning the Alabama  High School Athletic Association (AHSAA) 1-5A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 3, 2025,  the Moody flag football…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698051/recognizing-moody-high-school-for-winning-the-ahsaa-class-1-5a-state-championship-in-girls-flag-football"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "Mr. RULLI. Mr. Speaker, I rise today to congratulate the Youngstown  State women's bowling team on winning the 2025 NCAA bowling  championship over Jacksonville State on April 12, 2025.\n\nIn the ``Entertainment Capital of the World'', Las Vegas, the  Youngstown State women's…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690138/congratulating-the-youngstown-state-womens-bowling-team-on-winning-the-2025-ncaa-bowling-championship"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN. Mr. Speaker, I am excited to congratulate the  University of Tennessee at Chattanooga men's basketball team on winning  the National Invitation Tournament in an exciting overtime victory to  bring the championship trophy home to Chattanooga and East Tennessee.\n\nThis nail-biting head-to-head…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690281/congratulating-the-nit-national-champions-the-utc-mocs"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize the Harbor Beach  High School football team for winning the Michigan Division 8 State  championship last week.\n\nThe Harbor Beach Pirates took home their second State championship in  football. Never trailing in the game, they…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697371/recognizing-harbor-beach-football-team"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, today I rise to recognize and congratulate the  West De Pere Phantoms football team for winning the WIAA Division 2  High School State Championship.\n\nFollowing an impressive regular season and dominant performance in  the playoffs, the West De Pere Phantoms traveled…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I rise today to honor and recognize the  Menominee High School football team on winning the Division 7 Michigan  State Championship. This remarkable and well-deserved accomplishment  reflects these young men's commitment to excellence, their dedication  to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}]