[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…the brave souls aboard the PAT 25 helicopter. Each of them was  more than a passenger and more than a soldier. They were loved ones-- friends, parents, classmates, children, teammates, and colleagues-- whose very presence made the world better.\n\nWhile the flight manifest has not been shared, from the names that  have been shared publicly, I want to specifically…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…April, and a talented tattoo artist.\n\nAfter such a tragic event, the team rallied together and made the  decision all on their own to play on for Manny and for their injured  teammates. Amazingly, in the face of hardship that came far too early  for those so young, the Santa Clarita Flyers ended up taking home the  championship after a nail-biting final…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700079/santa-clarita-lady-flyers-tragedy"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…chaplain for today.\n\nI first met Father Shaughnessy at the College of the Holy Cross in  Mr. McGovern's district, in Worcester, Massachusetts. We were  classmates, friends, teammates, and we spent an occasional evening in  Worcester at an Irish bar having a pint, maybe two--we were young-- talking about life.\n\nFather Shaughnessy joined the Jesuits and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692466/recognizing-father-paul-shaughnessy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…servicemembers convicted of war crimes. During the first  Trump administration, he lobbied for the pardoning of several military  personnel who were turned in by their own teammates for war crimes as  well as military contractors convicted of killing 14 Iraqi civilians.  He has also called for reinstating waterboarding and other forms of  torture.\n\nIn…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the audience with his skill, determination, and unshakable  leadership. A playmaker in every sense of the word, Makhi not only put  up impressive numbers but also lifted his teammates, making everyone  around him better.\n\nElise Bender has proven that hard work and passion are unstoppable  forces. A true competitor, Elise has set the standard for what it…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689799/congratulating-all-blade-basketball-players-of-the-year"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…a first team All-American three  times.\n\nWinning the NCAA championship with UConn is a testament to her  talent, resilience, and leadership on and off the court. Paige's  teammates and coaches have praised her for her mentality of putting her  team first and for her dedication to their sport.\n\nPaige serves as an inspiration and role model for athletes…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689924/recognizing-paige-bueckers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the 287  graduates in Kettle Run High School class of 2025.\n\nThe graduates, as Cougars, have balanced life as students, teammates,  and coworkers, and through it all they have learned the value of  perseverance. They have excelled across a wide range of fields: In  band, in chorus, and in orchestra,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I rise today to congratulate Izzy Soto and her  teammates on the United States National Development Team for winning a  gold medal at the 2025 Pan American Inline Hockey Championships in  Oaxtepec, Morelos, Mexico.\n\nRepresenting…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Despite this, he never let this  stop him from excelling as a standout player in high school, college,  and now the international level.\n\nPatrick Danen and the rest of his teammates showed incredible skill,  determination, and fortitude, and their victory was well deserved.\n\nI also recognize the USA Women's Deaf Basketball team, who earned the  silver…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698133/congratulating-usa-mens-deaf-basketball-team"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the front line every single day.\n\nFrom narcotics detection to crowd control, search and rescue to  border patrol, these animals are more than sidekicks. They are trusted  teammates, and just like their human handlers, they face real threats,  danger, and consequences.\n\nThat is why, today, I am introducing the Leo K9 Protection Act, a  straightforward…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…in the next farm bill.  Those who know Riley know that that just scratches the surface of who  he is.\n\nRiley is an incredible friend, a loyal advocate and mentor for his  teammates and colleagues, a proud son, a champion for agriculture, a  caring father to his kids, Blakely and Ford, a loving husband to his  wife, Lauren, and most importantly a man…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Award, and it is clear  why. The team is extremely dedicated, having offered hours of their  time in the summer to work with elementary and middle school robotics  teams.\n\nTeammates Bridger Klavetter and Gunner Sellnow said they appreciate  the worldwide community that the sport has allowed them to be part of  and said that their team works to be professional…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689758/congratulating-alexandria-high-school-robotics-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Valley, guided the 1980 team to its historic gold medal.       Known as a motivator, Brooks molded a team built around hard       work, belief in oneself, and belief in teammates. He reminded       his team when they played the Soviets, ``you were born to be       hockey players, everyone one of you . . . and you were meant       to be here''.\n\n(7)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Hinckley  Lovelace, who finished 12th. Their combined strength, discipline, and  endurance propelled Parry McCluer to another well-earned championship.  They were joined by their teammates, Sebastian George and Sam  Carpenter, who helped make the team a success throughout the season.\n\nThis exceptional program thrives under the leadership of coaches  Chris Poluikis…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Knights embodied excellence in every  sense. Senior outside hitter, Christian Sheaffer, named the  tournament's most outstanding player, led the charge with 13 kills,  while his teammates, including Kristo Bianchin, Kyler Evans, Justin  Madsen, and sophomore setter Gehrig Tolman, delivered in every critical  moment.\n\nFrom a heartbreaking quarterfinal loss…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Valley, guided the 1980       team to its historic gold medal. Known as a motivator, Brooks       molded a team built around hard work, belief in oneself and       belief in teammates. He reminded his team when they played       the Soviets, ``you were born to be hockey players, everyone       one of you . . . and you were meant to be here''.\n\n(7) The…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…that. I have been coaching most of these boys since they  were in second grade, and it has been amazing seeing them grow up,  compete together, and support each other like teammates always should.\n\nMy players--Kenny Ciscomani, Augie Axen, Mateo Brandt, Cooper  Brayant, Braeydn Darby, Isaiah Davis, Bas Guthrie, Preston Harshberger,  Warrick Mendoza, Dominic…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Basketball Coaches Association and was selected as a top player in the  Mid-Hudson Athletic League's American Conference by all the league's  coaches.\n\nZoe is known by her teammates, coaches, teachers, and family as an  exceptionally hard worker and team player. These are assets that will  be of great service to her and our country as she now serves…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…a member of the Indiana University Hoosiers, starting on the  defensive line as his team captured the national title.\n\nBack home in Emmaus, where I reside, friends, former teammates,  coaches, and neighbors came together to cheer him on, a testament to  the character and leadership that Mario has shown, both on and off the  field.\n\nMario's success reflects…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…conference record of 10-2, and a proud 13-0 record  at home.\n\nIt takes a lot of blood, sweat, and tears to make it to the top.  Having a heart for the game and for your fellow teammates goes a very  long way. I am very excited about the victory of this team and how they  brought it home to northwest Florida.\n\nCongratulations to Coach Bart Walker and his…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…concrete manufacturing for runways and taxiways at major airports.\n\nUnderstanding the power of influence, Pat served as a role model and  leader. He advocated for many of his teammates during pivotal moments  in their lives and has been involved in many community advancement  initiatives. Alongside his wife Beth, Pat founded Team Terrell to help  promote…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}]