[{"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…health insurers who are rolling up the entire industry, from  providers to hospital beds and to the prescription drugs that people  rely on for their lives. I hear about big tech companies that are using  your valuable data for their own gain. The list goes on.\n\nAs we look across our consolidated economy, we see that corporate  power has reached its…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…us all keep track here on the 100th day of the Trump  Presidency, here are the 100 damages from Trump's 100 days:\n\nIn his first 100 days, Donald Trump, No. 1, propped up Big Tech  billionaires at his inauguration, right here in this building.\n\nNo. 2, withdrew the United States from the World Health Organization.\n\nNo. 3, pulled the United States out of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…talking about: Oh, my God, foreign interests, maybe even China, will  buy American land. Keep in mind that we need investment in the United  States.\n\nWhen the Chinese buy a high-tech company, they can take that  technology that is acquired back to China. When they buy farmland, they  can't take the land back to China, and they can't take the food back to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…damage is done. The TAKE IT  DOWN Act gives victims a clear, fast pathway to have these images  removed from online platforms, hold perpetrators accountable, and  ensure that tech companies do their part. They have responsibility.\n\nThis is just one piece of a broader fight. It is one I have been in  for years, and I will not stop fighting. We will end…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…defunding the police by stripping funding from the  Consumer Financial Protection Bureau, and the CFPB is the only Federal  cop on the block to hold Wall Street banks and Big Tech payment apps  accountable when they cheat Americans.\n\nIt is shameful that while families suffer from high prices, Musk is  firing thousands of Federal workers and stealing sensitive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Court, as I said, unanimously upheld this law that  Congress passed. I am concerned that each extension, though, of not  getting a deal, puts America and some of our leading tech companies at  great financial risk.\n\nUnder the law, app stores that distribute and support TikTok are  subject to severe penalties: up to $5,000 per user and that could  amount…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…running again, and that funding for food aid is back, none of this  should have ever happened.\n\nMake no mistake, children died needlessly because President Trump and  an unelected tech billionaire cut off their supply of food before  eventually reversing course. This is a lesson in the devastating  consequences of the chaotic slash-and-burn style of government…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Indo-Asia Pacific, and this is about people in Iran having  access to the internet through VPNs that we helped them to get.\n\nAnd so some of these programs--if you are just a tech guy and you  have been assigned to find things to cut and you read a line item and  you say: 75 million for what? VPNs in the mid--what is that? That is  what this is. All of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…which is the global  U.S. reserve currency and provides a huge competitive advantage for our  country.\n\nThis bill allows a complete takeover of our financial system by Big  Tech companies by allowing these massive companies to issue their own  cryptocurrencies.\n\nFor example, Google has 3.5 billion daily users, and META has over 2  billion active daily…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…companies  accountable and demand they put safeguards in place to protect our  children. One of my amendments would have repealed the liability shield  that Congress granted Big Tech nearly 30 years ago, known as section  230.\n\nAt that markup, Chairman Grassley agreed to work with me to finally-- finally--allow these companies to be sued by their victims'…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…whale watching guides, and the other businesses  that operate in marine sanctuaries have to navigate regulations. They  have to play by the rules and pay fees but not the Big Tech oligarchs.  These conglomerates, worth hundreds of billions of dollars, get special  treatment and exemptions.\n\nOur national marine sanctuaries encompass over half a million…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…instead, ties  stablecoins into our financial system but without the safeguards that  are required by banks and investment companies.\n\nAs the ranking member noted, this allows Big Tech companies to issue  stablecoins and amass consumer data at the same time we are gutting the  Consumer Financial Protection Bureau, which protects consumers.\n\nIt allows issuers…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is their big donors.''\n\nLook at who Republicans have helped. They have been in charge for a  year. They have helped Big Oil. They have helped Big Banks. They have  helped Big Tech.\n\nLook who was in the front row at Trump's inauguration: billionaires.  That is all he cares about. Look at their promises to go after ``the  worst of the worst'' when it comes…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  ticketing and lodging markets; it unveiled rules to make it as easy to  stop a subscription as it was to start it; and it has worked to rein in  the monopoly power of Big Tech companies to ensure small businesses and  innovators can thrive online.\n\nThe President's attempt to remove independent Commissioners violates  Congress's long-held power to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cool.\n\nSo electric prices are going up, and they are going up big time, and  they are going up for deliberate reasons.\n\nThe one deliberate reason has to do with the AI, crypto, tech bros  data centers problem.\n\nAs you know, the data center crypto people gave a lot of money to  Donald Trump. They are big political donors. They are getting pretty  much everything…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…a lifelong commitment to professional  growth and excellence. He is a graduate of the University of Oklahoma  Economic Development Institute, completed coursework at Georgia Tech,  and attended the Intensive Economic Development Course at Auburn  University. He is also a graduate of Wallace State Community College  and Athens State University.\n\nRetirement…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…providers, and families had the tools and       support they needed, providing prevention, guidance and       establishing a local response network laboratory at Texas       Tech to expedite measles testing in West Texas.\n\nAnd he engaged the broader public as well. The CDC       accelerated its public reporting of measles cases and       outbreaks so…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…which we will be marking  up in committee on Thursday, even though it is not on the floor today,  I will put in a shameless plug for our bipartisan legislation that is  not only tech neutral, but it is agnostic to the project, the project  type.\n\nIt would definitely help us produce more energy in America, and it  will also help us to build things in America…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, I rise today to recognize a group of  remarkable young women from the plains of West Texas who are making  history on the national stage, our Texas Tech Lady Raiders' softball  team.\n\nThese athletes have battled all season long, with an impressive  drive, determination, and an unmistakable West Texas will to win that  has taken…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692008/recognizing-texas-tech-girls-softball-team"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…investment in  American industry looks like. It will retain 390 good-paying jobs  locally and create 258 new ones for families across my district.\n\nThese are high-quality, high-tech jobs that provide economic  stability and opportunity for the hardworking people of the southern  tier.\n\nProduction will soon begin on 200 multilevel commuter railcars for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…and manufacturing everything from satellites to heat shields.\n\nSpace is not only a source of innovation but also a pillar of the  American economy, fueling growth in both high-tech and blue-collar  industries, as I mentioned.\n\nSmall businesses are also benefiting from this emergence. Just a few  weeks ago, I had the honor of visiting a small company called…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to highlight a  remarkable act of kindness happening right here in the State of  Georgia.\n\nGeorgia Tech faculty and staff opened their homes to students who  could not travel home for Thanksgiving. Through a program called Home  for the Holidays, students were welcomed like family.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697596/georgia-tech-thanksgiving"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…tennis courts, swimming pools, ski resorts, and golf  courses. Utahns value sports, and we are good at them.\n\nUtah is an international center for technology, including space tech.  Just south of Salt Lake City is a business park called Silicon Slopes.  About 100 miles north of Salt Lake City is the Space Dynamics  Laboratory. Utahns value technology…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…generation of leaders and innovators emerging from my own hometown.  This inspiring group of young people is known as the Rebel Robotics FTC  team.\n\nRebel Robotics is a FIRST Tech Challenge team hailing proudly from  Norfolk, Nebraska. Founded in 2019, the team gives students the  opportunity to engage directly with cutting-edge technologies and  robotics…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…new threats coming from the People's Republic of China.  The President's America-first investment policy builds on this by  directing CFIUS to restrict PRC investments in U.S. tech, agriculture,  energy, raw materials, and more.\n\nBut as Chinese companies get richer and richer from American  investment, it is clear that restricting inbound investment is…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Last week, I joined Talon Metals to celebrate the new Beulah Minerals  Processing Facility, which will process high-grade nickel and copper,  just like this, from Talon's high-tech, environmentally friendly mine  in Minnesota.\n\nThey will turn it into materials for our defense, aerospace, and  energy industries, all while reducing our reliance on adversaries…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691909/north-dakotas-greatest-resource"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Valerie Prehoda  for being inducted into the Michigan Tech Presidential Council of  Alumnae. This well-deserved honor reflects her steadfast dedication to  her fellow Servicemembers, the communities throughout the Upper  Peninsula,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…Instagram, whether it is Facebook  itself--every child who is on that platform for any length of time will  be exposed to child sex abuse material, every single child.\n\nThe tech companies themselves tell us, but I also know our kids  aren't safe online because I am a father of three children. My oldest  is 13 now. I have got a 10-year-old and a 5-year-old.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, Section 230 of the Communications Decency  Act insulates ``Big Tech'' from most liability for the digital fentanyl  promoted on their sites. Time and time again, drugs are sold, sexually  suggestive and/or explicit content is posted without…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…exactly what is  happening to our children, and this is why we must act.\n\nMr. Speaker, the bill called the TAKE IT DOWN Act finally sends a  very loud and clear message to Big Tech. If you, Big Tech, do not  remove these fake images within 48 hours, you are as guilty and as  responsible as the predators who created them.\n\nI am talking to Snapchat, to Instagram,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}]