[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…still don't know the extent of chaos that is  going to result from these actions that have already been taken, but we  do know this: Under the CRA rules and ``rules'' is a technical term of  art here, normally cannot go into effect unless they are submitted for  congressional review.\n\nHere is the problem, BLM and the Forest Service have never considered…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…eliminating the  teacher shortage in America by recruiting, preparing, and inspiring the  next generation of educators.\n\nEducators Rising is a community-based, Career and Technical Student  Organization that supports middle and high school students in rural,  urban, and suburban communities with a passion for teaching in their  communities.\n\nWith over…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…sexually explicit material, regardless of whether  that child appears to be actively participating, this change  strengthens the law so that predators can no longer hide behind  technical loopholes while continuing to exploit our children, making  sure that anyone who dares to prey on the most vulnerable will face  consequences for their crimes. This legislation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…enable partnerships between industry, innovators, and  the U.S. Government that will enhance existing production methods,  unlock new and innovative techniques, and offer technical assistance to  entities seeking to promote the application of low-emission cement,  concrete, and asphalt.\n\nTogether, the IMPACT Act--alongside IMPACT Act 2.0, introduced…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the case for far too many Californians, still to this  day. But it is the reason why decades ago Congress recognized both  California's unique air quality challenges and its technical ingenuity  and granted California special authority to do something about it.\n\nAnd thanks to the bipartisan Clean Air Act of over 50 years ago,  California has had that legal…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…appropriate network solution for them. Under this bill, the  Assistant Secretary of Commerce for Communications and Information will  be required to engage in outreach and provide technical assistance to  small communications providers concerning the uses, benefits, and  challenges of Open RAN and other open network architectures.\n\nThis bill would also require…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…it time and again. It is rinse, lather,  repeat.\n\nWhat do we have on the floor this week? We have all guessed it. It is  another corporate handout, this time to the biggest technical oligarchs  in the world. These folks have shown that if a person has enough money  and if they are willing to bend the knee, they can pretty much get  anything they want…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Foreign governments have figured out a lot of ways to line Donald  Trump's pockets. The Trump Organization--he is still the owner. It may  be in trust. He maybe figured out some technical legal way to seem to  insulate or isolate himself from it. But that organization is doing  business deals with Saudi Arabia, with Qatar, and with Oman and Serbia.\n\nLIV Golf,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…you  know, sometimes the Sun is shining and sometimes it is not and it is  intermittent and the batteries aren't there. All of that is in the  rearview mirror. All of the technical issues--not all of them. Ninety  percent of the technical issues related to solar energy have been  resolved.\n\nThat is the scariest thing for the fossil energy people. Do…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reconciliation  but in the section of the law as it deals with just the regular budget  process that was created in 1974 that gives the budget chair some  flexibility to solve technical problems, and I think I can use that to  simply decree a new baseline so that things that actually cost a ton of  money, we can tell the American people and ourselves they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…have  demonstrated a commitment to operational excellence, nuclear safety,  emergency preparedness, and professional standards, exemplifying the  spirit of public service and technical leadership. Additionally,  Waterford 3 has maintained a strong and ongoing partnership with the  St. Charles Parish community, providing local jobs, supporting  charitable…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…colleague, Mr. Kennedy for his were  very affirming and wonderful remarks on the importance of this  legislation.\n\nI think from what everyone can hear today, we have bipartisan  technical improvement legislation that will only strengthen our Nation  and our research enterprise.\n\nMr. Speaker, I urge everyone to vote ``yes'' on H.R. 1318, and I  yield back the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…sophisticated understanding of this threat and how it has  evolved over time. He or she needs to be able to see this threat in its  geopolitical context and to fully grasp both the technical capabilities  and the policy options that might help counter the threat. General  Rudd, despite his service, does not have the background that would  allow him to immediately…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…every task  with a sense of dedication, professionalism, and passion for public  service.\n\nAs the daughter of central Illinois farmers, Aleksi brings to her  role not only technical expertise but also lived experience. She  understands first-hand the challenges faced by family farmers and rural  communities across Illinois. She has carried that perspective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…electronic devices will require significantly  greater functional density, in other words, packing chips together even  more tightly than current technology allows. This requires technical  leadership in semiconductor advanced packaging  processes, including fanout wafer level packaging.\n\nI believe Congress should continue to provide the resources necessary…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693817/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…return support;       weapons system support and software; classified and       unclassified software delivery and support; classified and       unclassified publications and technical documentation;       personnel training and training equipment; U.S. Government       and contractor engineering, technical, and logistics support       services; and other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…concerns (as such term is defined in section 3 of the Small       Business Act (15 U.S.C. 632)) relating to artificial       intelligence. Such resources may include technical standards,       best practices, benchmarks, methodologies, procedures, or       processes for the understanding, adoption, or integration of       artificial intelligence.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…actively  participating in legislative, regulatory, and public affairs  initiatives. At PCCA, he has been a visionary, contributing extensively  to the organization's scientific, technical, and strategic pursuits.\n\nIn addition to his outstanding work with PCCA, Mr. Bassani has  previously served on the United States Pharmacopeia Compounding Expert  Committee.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…and the company has  worked with students and faculty at the University of Utah, Weber State  University, Utah State University, Brigham Young University, and  Bridgerland Technical College in Logan.\n\nTop-tier research institutions Brigham Young University, the  University of Utah, and Utah State University are preparing the next  generation of engineers,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…fruit fly facility in Metapa, Mexico. Once complete, this  facility is expected to produce an additional 60 to 100 million sterile  flies per week. With continued support from technical experts at USDA,  Mexico expects production to begin as early as the summer of 2026.\n\nLast November, the USDA opened a sterile fly dispersal facility in  Tampico, Mexico.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…systems; helmets; simulators;       generators; transportation and organization equipment; spare       and repair parts; support equipment; tools and test       equipment; technical data and publications; personnel       training and training equipment; U.S. Government and       contractor technical assistance; technical and logistics       support services;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical expertise but also their heart and  respect for the people they serve. Their dedication has energized ten  homesteads and countless lives, creating a legacy of service that…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…a Delta 19, which meant  riding motorcycles. He served in the Scout Platoon, 4th Battalion, 64th  Armor during Operation Desert Storm displaying outstanding tactical and  technical skills. His proficiency enabled the Scout Platoon to quickly  in advance friendly forces so the enemy could be destroyed while  displaying high morale and a cool demeanor.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Congresswoman and fellow commissioner on the Semiquincentennial  Commission, Bonnie Watson Coleman, and also by Senator Thom Tillis of  North Carolina.\n\nThis bill, of course, makes technical changes to Representative  Watson Coleman's bipartisan House-passed bill, H.R. 469, to create a  congressional time capsule in commemoration of the semiquincentennial.  I…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699841/semiquincentennial-congressional-time-capsule-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…starting to downgrade our growth. For every  dollar we take in tax collections, we are going to spend, functionally,  $1.36.\n\nDo you understand how screwed--actually, that is a technical,  economic term--we are when we don't tell the truth about the math? It  is not fixable, but it is possible to stabilize. We can stabilize this.  We just have to think and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical expertise but also their heart and  respect for the people they serve. Their dedication has energized ten  homesteads and countless lives, creating a legacy of service that…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692593/recognizing-patrick-sullivan"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…this bill passed the House unanimously in  the 118th Congress. The only difference between this year's bill and  last year's bill is that we have incorporated some helpful technical  assistance provided by the new administration to ensure the legislation  better executes the letter of the law and congressional intent.\n\nI thank Chairman Mast and Ranking…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Chief Operating Officer of  Corning Incorporated, on the occasion of his well-earned retirement.  For nearly four decades, Mr. Musser has exemplified steadfast  leadership, technical excellence, and an unwavering commitment to  innovation and service.\n\nSince joining Corning Incorporated in 1986 as a shift supervisor at  the company's optical fiber plant…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693658/recognizing-eric-musser-on-his-retirement-from-corning-incorporated"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical expertise but also their heart and  respect for the people they serve. Their dedication has energized ten  homesteads and countless lives, creating a legacy of service that…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692592/recognizing-gary-steele"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…providers to combatant commands.  We also provide tools to sustain the growth and development of United  States Space Force guardians to ensure we have the highly skilled and  technical proficient acquisition cadre capable of bringing online the  next generation of systems to fight and win in space.\n\nThis bill revitalizes the defense industrial base and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]