[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the       strength of our military or our ties abroad. It is also       about the strength of our intellect here at home.\n\nI find myself thinking about an exchange from the television series  on Chernobyl. A scientist tells a Soviet bureaucrat:\n\nEvery lie we tell incurs a debt to the truth. Sooner or       later, that debt is paid.\n\nThis administration…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…transparency and accountability our  democracy needs to thrive.\n\nThat is why, on its 39th birthday, Senator Grassley and I wanted to  highlight how important it is for all television providers, including  major streaming services like YouTube TV, owned by Google, and Hulu +  Live TV, owned by Disney, to provide the American public with C-SPAN  and the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…So just  one-fifth of those funds would enable the full November SNAP funds to  be distributed.\n\nLast week, I saw a speech by   Mike Johnson, the Speaker of the  House, on television, and he was saying that Republicans are not going  to provide SNAP funds because it would reduce pressure on Democrats to  reopen the government. In other words, the Speaker…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…fixing this issue as a priority.  Bipartisan feeling--change it, reduce the price of drugs.\n\nWhy is the United States such an outlier? One of the major reasons-- if you watch television, you see it every single day. The United States  is one of only two industrialized countries in the world that allows  people to advertise drugs on television.\n\nThis is a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Columbine as if it were yesterday. I was in the Houston Airport coming  home from a work trip when I saw our Colorado high school flashing on  the screens of every single television set in the terminal. It filled  me, as it did all Americans, with horror. How could something like this  happen in America?\n\nMy wife Susan was 6 months pregnant with our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Appropriations to modify the proposed rescission of funds       from the Corporation for Public Broadcasting to exclude       amounts designated to support public radio or television       stations that are licensed to or primarily serve rural areas       or Tribal communities.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693638/hr-4"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, the rescissions package before us reduces  access to educational programming for children and locally produced  public radio and television programming. It diminishes America's global  leadership while eliminating lifesaving aid from the world's most  vulnerable populations.\n\nI want to spend a minute on the impact…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…legislation. His answer was no. Further, he said he talked about it on  Fox News before anyone else.\n\nHere is a news flash for Secretary Duffy and House Republicans.  Talking on television does not make trains safer. Talking on television  does not make our communities safer. Talking on television does not do  what East Palestinian residents have asked us to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…words.\n\nRob was truly one of a kind--a gifted storyteller whose humor,  humanity and brilliance enriched our culture and brought people  together. From his memorable roles on television to his extraordinary  achievements as a director, filmmaker and actor--whether When Harry Met  Sally . . . , The Princess Bride, A Few Good Men, Stand By Me, This is  Spinal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…said,  and the White House denied it. They said it didn't happen. I said it  did. They said I am lying--to the point where two of my Republican  Senate colleagues went on television several days later and said that I  lied when I said the President made those statements.\n\nWell, yesterday at his rally in Pennsylvania, President Trump  admitted that he…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…State University. To the best of our  knowledge, As Schools Match Wits, known affectionately throughout the  region as ASMW, is the longest-running, continually broadcast  television program in Massachusetts, and quite possibly in all of New  England.\n\nFounded in 1961 by Leonard J. Collamore and first aired on WWLP-TV,  ASMW quickly became a treasured…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have a trial. Impeach, convict--conviction takes place in  the Senate--and remove. The Senate has the power to do this. This is  the solution.\n\nI understand that the network television programs, for the most  part--there are some exceptions, but for the most part, they stand with  Donald Trump. Donald Trump does not want to be impeached. He as much as…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…daughter. We had one child at the time. I rushed toward  her, what is wrong? Is something wrong with Mignon? She said no. There  is nothing wrong with Mignon. I just saw you on television and there is  something wrong with you. Sit down and let me ``splain'' something to  you.\n\nNow, it is one thing to get an explanation, but when the Gullah  Geechee woman…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…cut staffing in half at the  Social Security Administration, guaranteeing that services for seniors  will suffer, or that the Trump Secretary of Agriculture just went on  television and told Americans who are struggling with food prices to  get a chicken.\n\nThat is why House Republicans want to talk about something else. That  is why we are here to debate…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Speaker, I rise today to congratulate  Bernie Prazenica on his retirement as President and General Manager of  WPVI-TV, Philadelphia's most-watched local news and entertainment  television station.\n\nA graduate of Temple University, Prazenica's illustrious 43-year  career in television saw stops in Pittsburgh, Richmond, and Raleigh  before he returned to Philadelphia…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Press, and recognition from the Michigan  Association of Broadcasting. Sheri is also a proud member of the Silver  Circle of the Michigan chapter of the National Academy of Television  Arts and Sciences--an honor reserved for those who have devoted a  quarter-century or more to broadcast excellence.\n\nBut Sheri's impact goes far beyond the newsroom. She's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…pass this year's Police Week bills. These are  bipartisan bills. These are common sense. Most importantly,  particularly in light of recent events--and you can turn on the  television right now and see what I am talking about--they would give  this Chamber the chance to demonstrate its commitment to the men and  women who wear the badge and to the laws…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, let's make sure that we are dealing with the facts as  they actually occurred. The assertion the LAPD had the situation under  control; we all saw otherwise on our television sets. The LAPD chief  himself said that every person in Los Angeles should be disgusted by  what occurred.\n\nThe Governor has, himself, in the past, recognized the virtue…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Refuge. These NGOs didn't just  shelter illegal aliens. They pampered them.\n\nThose contracts paid for luxury hotel rooms, room service, 24-hour  snacks, laundry, bilingual television, recreation, cultural events, and  individual tutoring for mathematics and social studies. Most  shockingly, it paid for  pet therapy, music therapy, and horticultural therapy…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…said  the notion that marriage serves as the foundation of the family is at  best outdated and at worst misogynistic.\n\nThis is a woman who didn't, obviously, put that on her television  commercials. It is interesting that a very liberal judge in the State  of Wisconsin clearly had contempt for traditional marriage. Apparently,  she maybe took some women's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…JAZEERA ENGLISH; Aldag, Jason:       BBC; Alexander, Clinton: CBS NEWS; Alexander, James: WTOP       RADIO; Alexander, Peter: NBC NEWS; Alexander, Robert: WTTG-      FOX TELEVISION; Al Falahi, Mohanad: AL TAGHIER TV; Al Falahi,       Sam: AL TAGHIER TV; Alfarone, Debra: GRAY TELEVISION;       Alhazeem, Ahmed: AL JAZEERA INTERNATIONAL ali, majeed: SKY…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…have voted time and time again to  keep the government closed. If Democrats hadn't voted 13 times to shut  down the government, there wouldn't be the lines we are seeing on  television down and around the block at food banks and all around the  country.\n\nThe Senator from Oregon talked about children, using people as pawns,  as political pawns. That is exactly…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker,  it would require math, and then the harder part is it would require us  to tell truth.\n\nSo many people, like this very moment, there will be someone on cable  television on the left and the right doing their talking, getting  people's dopamine to hit, but it is not honest math. The math is really  hard. It is really complex. There is a way…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…voters and tell them the truth about the math.\n\nIt made me feel better because I have mocked us for years on how much  of public policy we now make on feelings. It is great television. It  gets you followers on social media. You get a hit on cable television  tonight if you are willing to make crap up, but do it with passion and  feelings, but if you actually…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, Congress is leaving and won't be back  until next week. If it is like every other weekend, a lot of what you  see on television is going to be incidents going on in Minnesota  affected by the immigration situation.\n\nI remind my colleagues and the American people that we are a Nation  of immigrants,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699736/america-cannot-have-unlimited-immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare and interest, that is the primary driver. No one wants  to hear that. That doesn't set off the dopamine receptors. It doesn't  make people mad. It doesn't get you on television.\n\nIf you tell the truth about the drivers of U.S. sovereign debt, you  will never end up on MSNBC or FOX News or any of those because no one  wants to hear the actual math.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Senate, because I know what he either doesn't  know or he should know, and if he did know, I can't imagine why he  would make the comments that he did the other night in a television  interview.\n\nLet me give you some facts about Denmark, for example. Denmark, which  has responsibility for Greenland--although, Greenland is an autonomous  territory under…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…window into  Washington for people across the country.\n\nJamie has been honored with the Career Achievement Award for  Distinguished Reporting on Congress from the Radio and Television  Correspondents' Association and has been referred to as the most  connected man in Washington, a reflection of his professionalism and  integrity.\n\nToday, we congratulate…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…we have attempted to do this. One  time, I think we were successful, but it is still not law.\n\nI would like to put this in the simplest form I can by saying that  watching television all the time, prices are showing up all the time  for this product or that product. I don't know how many times I see  that something costs $9.99 or $19.99 or that the price…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…his infectious smile and genuine love for every person he meets.\n\nWhether Brother Gary is emceeing the Gorgeous Grandma Pageant,  championing the Marine Toys for Tots on television commercials, firing  up the crowd at Riverside Stadium for the Victoria Generals, or leading  the Christmas parade, Brother Gary shows up with enthusiasm that lifts  the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}]