[{"senator": "Andy Kim", "party": "Democrat", "sentence": "Mr. KIM. Madam President, I rise today to tell the stories of the  nearly 2 million New Jerseyans who rely on Medicaid for their critical  care. I do this because their care is at risk. I do this because the  care of more than…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I am just returning from hearing the  survivors tell their stories, and I was so deeply moved. This is not a  political issue. This is an issue of 14-year-olds and 15-year-olds who  told the stories of how they were solicited by Jeffrey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…education. In Connecticut, 30  percent of DACA recipients are married, 17 percent have children, and  there are 6,000 U.S. citizens living with DACA recipients.\n\nLet me tell you the stories of two DACA recipients in Connecticut.\n\nAgnes was brought to Connecticut when she was 9 years old. She worked  hard in school and qualified for a Rotary Club scholarship…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…have died in ICE  custody, and 2 have been shot and killed by ICE agents. These are not  just numbers. They are lives, people with families. We must say their  names, tell their stories, and stop state-sanctioned violence.\n\nLast week in Minneapolis, a 37-year-old American mother, Renee Good,  was killed by an ICE agent. It was caught on video for the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Congress does not  act to extend the enhanced premium tax credits beyond December 31.\n\nClarke),  our chairwoman and the Representative from New York's Ninth District,  to tell some stories.\n\nMs. CLARKE of New York. Mr. Speaker, I thank the gentlewoman from  Virginia for her steadfast leadership and for hosting our Special Order  hour this evening.\n\nMr.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…voices, and  contributions to this Nation.\n\nMake no mistake, we will fight tooth and nail for our communities and  stand up to these attacks. We will not let anyone tell us that our  stories don't matter.\n\nOur stories are American history, and without us, our Nation would  not be where it is today.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…suffered along the way.\n\nYou have heard the stories of our parents. You have heard the stories  of our grandparents. We just don't come tonight for a Special Order to  tell you our stories, but we want America to know that we are  suffering. We want America to know that we stand with them in this time  when we are in trouble.\n\nJust last night, I was on…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…many  birthday parties for 100-, 102-, and 103-year-olds because we are  blessed to have a number of the original Rosies living in my area. They  have inspired me. They tell me their stories. On a cold Veterans Day  this year, when the wind chill was zero degrees, I stood outside with  those strong, resilient women with every ounce of their intellect  there,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…It wasn't a floor speech. It  wasn't a formal committee meeting or a hearing. It wasn't a press  conference. It was five everyday Americans coming to the Capitol to  tell their stories about the brutality and violence they suffered at  the hands of their own government--everyday Americans just like all of  us coming here to tell us how they were stopped,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…opportunity to learn for generations in the future.\n\nThese cornerstones of our civic life belong to the public. Arts and  culture should not be partisan. They are how we tell our stories. They  are how we learn. They are how we connect across communities, across  cultures, and across language. They are worth defending.\n\nCongress must protect these institutions.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…can't walk my neighborhood.  I just did a travel around the country to do what a lot of us elected  officials do, and I got stopped in the airport by people who want to  tell me stories about a parent with dementia or a disabled child or a  child with a rare disease who has seizures. It is story after story  after story.\n\nThere are people who have been…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…they do that? It is to meet their needs, to solve their  problems. It is an idea that sparked my imagination as a child. It is  an idea that as I listened to my parents tell stories of what their  life was like growing up during the Depression, growing up during Jim  Crow, where they didn't always have their needs met, not because of any  fault of their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…act. We must extend the  healthcare tax credits, and we must do so now.\n\nI thank my colleagues of the Congressional Black Caucus for this  Special Order hour where we can tell the stories of our constituents.\n\nThis gentleman in Wilcox County, Alabama, who pays $188 today will  have to pay $1,500 next year. It is simply unacceptable, and we must do  something…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…let's tell them what Social  Security does.\n\nA few weeks ago, I posted a video explaining what Trump and Musk were  doing to Social Security, and I asked people: Just tell your stories.  And the stories came flooding in, and here are just a few:\n\nI'm on Social Security disability--it's about 95 percent of       my total income. Every month since Trump…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographics. Deal with the  facts. Deal with the math. Tell the truth.\n\nThis place has been so busy spinning stories, though. We were  listening to the Democrats a few minutes ago tell stories: There is an  enemy out there. No, these things, we can fix them. We can stabilize  it. However, so many care so much more about winning the next election.\n\nThe point I…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…American sons like Travis? Where were CNN and  MSNBC? Where were the New York Times and the Washington Post? Where  were the armies of journalists and camera crews to tell their stories,  to interview their grieving parents, to regale us all with stories  about their kindness and their decency and their innocence?\n\nWhere were Chuck Schumer and Hakeem…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just easier to run around and scream stories that they  are going to cut things.\n\nLet's pay people, so I have hospitals and other groups paying people  to fly out here, tell stories, and they have no idea what they are  talking about because we make crap up, once again, because everything  is about the money.\n\nThe last board and the one that always…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spread over a decade. If  we can't find 4 percent of modernization in these programs, we are  actually in much more trouble than even just the brain trust here as we  tell our stories.\n\nMr. SCHWEIKERT. Madam Chair, I yield myself such time as I may  consume.\n\nI love public policy by storytelling, but this being the Joint  Economic Committee, let's actually…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Speaker, it is in Nature publication right now. Go pull up the  academic article. That is what goes on behind these microphones day  after day after day, is we have people who tell stories. We tell about  our feelings, but we don't seem to actually bother doing something  called math. The family slogan is: The math will always eventually win.\n\nI am going to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]