[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "…the European Parliament and the U.S. Congress, and was  awarded the Congressional Gold Medal in 1997. In September 2025, he  will return to the United States to receive the Templeton Prize--the  world's most distinguished award at the intersection of faith and  science.\n\nThis visit is especially meaningful to the many Greek Orthodox  Americans in Massachusetts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…spiritual leader of more than 300 million  Orthodox Christians worldwide, to Washington, D.C.\n\nThis week, His All-Holiness is visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…tolerance, His All-Holiness was awarded the Gold Medal of  Congress during his visit in 1997. During this current visit to the  United States, His All-Holiness will receive the Templeton Prize, the  prestigious award honoring contribution in religion and science.\n\nI welcome His All-Holiness to Washington, D.C. and I congratulate him  on his great achievement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…causes of peace, interreligious  understanding and environmental stewardship.\n\nPatriarch Bartholomew is stopping in Washington, D.C. on his way to  New York City to accept the Templeton Prize for his groundbreaking  harmonization of faith and science in service of environmental  protection. The Templeton Prize, given to singular champions of human  dignity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…All-Holiness Bartholomew,  to Washington, DC. The spiritual leader of the Orthodox Christian  Church, Ecumenical Patriarch Bartholomew comes to the United States to  accept the Templeton Prize, which recognizes an individual who has  ``made an exceptional contribution to affirming life's spiritual  dimension, whether through insight, discovery, or practical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…him one of the most  recognizable and respected religious figures of our time.\n\nWhile in the United States, Ecumenical Patriarch Bartholomew will be  awarded the prestigious Templeton Prize for his outstanding  contributions to the advancement of science and spirituality. He will  join the company of other spiritual leaders like Mother Teresa and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…(First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people.\n\nLater this month, His All-Holiness will visit the United States to  receive the Templeton Prize, the world's most prestigious international  award at the intersection of religion and science. This honor is  awarded annually to those who advance Sir John Templeton's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise today to recognize The Ecumenical  Patriarch of Constantinople, His All Holiness Bartholomew, who was  recently selected for the revered Templeton Prize by the John Templeton  Foundation. The Foundation recognizes pioneers of scientific and  spiritual insight for their contributions to human well-being and  spiritual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…promoting peace, advancing  religious freedom, and speaking out on environmental stewardship. He  has been honored with the Congressional Gold Medal and will receive the  Templeton Prize during this visit.\n\nIn Arizona, the Greek Orthodox community is an important part of our  State's civic and cultural life. Parishes across the State serve as  places…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Patriarch Bartholomew to the United States.\n\nHis first visit since 2021, he joins us on his eighth Apostolic trip  to our country during which he will receive the prestigious Templeton  Prize for his environmental advocacy.\n\nThe ``Green Patriarch's'' landmark 1997 speech in Santa Barbara--in  which he first posited the notion of ecological sin--is striking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…is my honor to  congratulate The Ecumenical Patriarch of Constantinople, His All- Holiness Bartholomew, who is traveling to the U.S. this month to  receive the prestigious Templeton Prize, on his achievements in  interfaith dialogue. As this year's Templeton Prize Laureate,  Ecumenical Patriarch Bartholomew will join the esteemed ranks of past  recipients,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…His All-Holiness is in the United States this month to meet with the  President and Members of the House and Senate leadership. He is also  set to receive the distinguished Templeton Prize for his years of  dedicated service as Ecumenical Patriarch. Throughout this time, His  All-Holiness has sought to bring together people of all faiths to  combat religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695682/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Fetterman", "party": "Democrat", "sentence": "…Environmental stewardship has been a consistent theme of His All  Holiness's ministry. In honor of this commitment, Ecumenical Patriarch  Bartholomew was awarded the prestigious Templeton Prize.\n\nI am proud to join faith leaders from across Pennsylvania in  welcoming His All Holiness to the United States and extend my heartfelt  congratulations on this momentous…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697378/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…international symposia  blending faith, science, and environmental stewardship. His efforts  have earned him global recognition, including the U.S. Congressional  Gold Medal and the Templeton Prize.\n\nPatriarch Bartholomew's tireless work ethic and dedication has  bridged religious traditions, championed interfaith dialogue, advanced  environmental justice, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694986/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…longest-serving Archbishop of Constantinople in the history of  Christianity, the Ecumenical Patriarch will arrive in the United States  this month to receive the distinguished Templeton Prize. This  prestigious award will be presented in recognition of his ``pioneering  efforts to bridge scientific and spiritual understandings of humanity's  relationship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…pares''; ``first among equals'' of Greek  Orthodox Christianity worldwide, a church of over 300 million people.\n\nHis All-Holiness is visiting the United States to receive the  Templeton Prize, the world's most prestigious award in religion and  science.\n\nI congratulate His All-Holiness on this amazing achievement. I know  people in Iowa are extending that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…to bring people together for the  purpose of advancing greater cooperation and mutual understanding. He  has been honored with the Congressional Gold Medal and, soon, the  Templeton Prize. Florida is home to many Orthodox churches, Orthodox  Christians, and communities who share deep gratitude for the leadership  of His All-Holiness Bartholomew and his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…of  the oldest sees in Christendom. This month, Patriarch Bartholomew will  visit Washington, D.C., where he will be recognized as this year's  recipient of the prestigious Templeton Prize, an award that has been  garnered in the past by great historical figures such as Mother Teresa,  the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…All-Holiness is visiting Washington, DC, from September 15  through September 17 and will meet with President Trump at the White  House. This visit coincides with his receipt of the Templeton Prize, a  prestigious award previously bestowed upon renowned figures such as  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nFor decades, His All-Holiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…serving  Archbishop of Constantinople in two millennia of Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York, an honor once bestowed  on Mother Teresa, the Dalai Lama, Archbishop Desmond Tutu, and Nelson  Mandela--leaders whose lives have testified to the power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "Mr. GOODEN. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to the United States and congratulate  him on receiving the distinguished Templeton Prize.\n\nAs the head of the Orthodox Christian Church, Ecumenical Patriarch  Bartholomew is the spiritual leader of 300 million Orthodox Christians  worldwide, having faithfully…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695394/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Constantinople and spiritual leader of Orthodox Christianity.  Recognized as ``First Among Equals'' among Orthodox bishops, he is  visiting our Nation's Capital to receive the Templeton Prize--the  world's most prestigious award honoring contributions to religion and  science.\n\nAs Ecumenical Patriarch of Constantinople, His All-Holiness leads the  world's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…All-Holiness Ecumenical Patriarch  Bartholomew. His All-Holiness is not only a recipient of the  Congressional Gold Medal, but he is also soon to be the recipient of  the Templeton Award, the world's foremost award in Religion and  Science.\n\nHis All-Holiness is the spiritual leader and Primus inter Pares of  Orthodox Christianity, providing leadership…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696715/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…towards the cause of peace should be commended, and on  behalf of Wisconsin's 5th Congressional District, I congratulate  Ecumenical Patriarch Bartholomew ahead of receiving the Templeton  Prize.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695466/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Bartholomew, to the United States. He is visiting the United  States next week to meet with the president and members of the House  and Senate Leadership and to receive the revered Templeton Prize.\n\nKnown as the ``Green Patriarch,'' he is well known for his efforts to  promote ecology and the protection of the environment. He has been at  the forefront of religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…Holiness Ecumenical Patriarch Bartholomew's visit to Washington, DC.  His All-Holiness is visiting our Nation's Capital in conjunction with  his acceptance of the prestigious Templeton Prize, an award which has  been received by faith leaders including Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. The Greek Orthodox community in Ohio and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695552/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "Mr. RYAN. Mr. Speaker, I rise today to welcome Ecumenical Patriarch  Bartholomew of Constantinople to Washington, D.C. as he receives the  Templeton Prize for his lifetime of work curating harmony between  science and faith.\n\nEcumenical Patriarch Bartholomew not only serves as the spiritual  leader to the upwards of 300…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…week, His All-Holiness Ecumenical Patriarch Bartholomew will  return to Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…leader and ``First Among Equals'' of more than 300  million Orthodox Christians worldwide. During this historic visit to  the United States, His All-Holiness will receive the Templeton Prize-- the world's most prestigious award in Religion and Science.\n\nPatriarch Bartholomew's efforts to promote religious freedom and  human rights and his initiatives to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is a respected spiritual leader whose  presence is deeply meaningful to many people across our great Nation.  His visit coincides with his acceptance of the distinguished Templeton  Prize, a testament to his lifelong dedication to advancing spirituality  and humanity.\n\nDuring his visit, he is scheduled to meet with administration  officials, Members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}]