[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…must ask ourselves: Why wasn't any grace extended to those fleeing  the Democratic Republic of the Congo, home to the deadliest conflict in  the world? There is no temporary protected status for them.\n\nWhy wasn't any grace extended to Afghans, who helped our soldiers at  war and risked their lives for the American people? This administration  ended their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Venezuela--the moment he was sworn in. On his first  day in office, he designated multiple drug cartels as terrorist  organizations. Shortly thereafter, he ended temporary protected status  for some 350,000 Venezuelan migrants and authorized holding some at the  naval station at Guantanamo before deportation.\n\nOn March 15, the President invoked the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…her son are struggling  after her husband, Jose, was arrested at work and detained for 2 days  at an ICE facility in Burlington. Jose was living here legally with  temporary protected status but was told by the ICE agents who detained  him that only people born here have rights.\n\nThese are real people--real people--children and adults alike  traumatized,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…alien lawfully admitted for permanent       residence on a conditional basis, an alien who is       inadmissible or deportable from the United States, is in       temporary protected status under section 244 of the       Immigration and Nationality Act (8 U.S.C. 1254a), or is the       son or daughter of an alien admitted as a nonimmigrant       described…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…I include  in the Record their testimonies:\n\nDear Honorable Senator Markey and Honorable Congresswoman       Pressley: In response to the slated termination of Temporary       Protected Status (``TPS'') for Haitian nationals on February       3, 2026, Rian Immigrant Center respectfully submits the       following remarks.\n\nRian Immigrant Center (``Rian'')…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…listening       to the people closest to the pain.\n\nToday's hearing is an opportunity to examine the necessity       of extending TPS for Haiti. For those unaware, Temporary       Protected Status, or TPS, is an immigration designation in       recognition of a country facing conflict, disaster or       extraordinary conditions, TPS has received bipartisan…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Senator Markey,       and other participating members of the Massachusetts       Congressional Delegation,\n\nThank you for receiving this testimony in support of       Temporary Protected Status (TPS) for Haitians. I am a primary       care physician at the MGB Chelsea Community Health Center in       Chelsea, Massachusetts, where I care for adults and children.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to oppose the Department  of Homeland Security's termination of temporary protected status for  Afghans. TPS has provided a lifeline to Afghans who supported U.S.  national security efforts and risked their lives to support our  missions.\n\nWe offered them…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…devastating earthquake       struck. The place where I lived collapsed, and the building       where I worked was completely destroyed. I could not return       home. When Temporary Protected Status (TPS) was designated       for Haiti, it brought me immense relief during an incredibly       painful and uncertain time.\n\nWhile mourning the loss of so many family…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the end of the conflict, some of those Afghans who risked their  lives to help American soldiers came to the United States, and they  were given what is known as temporary protected status, meaning they  could stay in this country until the dangers in their home country had  abated.\n\nTPS is a temporary designation allowing certain foreign nationals…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…recently, where a raid that swept up 44 people ended  with six Venezuelan men--who were legally here seeking asylum--self- deporting after the administration revoked temporary protected status  for their country. To anyone who thinks this could never happen to me,  consider this: Two-thirds of the Japanese imprisoned in camps were  American citizens. Their…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…their testimonies:  Testimony of Attorney Mirian Albert of Lawyers for Civil Rights to the\n\nCongressional Field Hearing on the Termination of Haitian Temporary                              Protected Status\n\nLawyers for Civil Rights (``LCR'') advocates for       communities of color and immigrants through legal action,       education, and economic empowerment.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President of the United States referred to  people from Somalia as ``garbage.''\n\nJust yesterday, the administration announced the termination of  Somalis' designation for temporary protected status. TPS allows  immigrants from a country that is unsafe to temporarily remain in the  United States.\n\nDoes the President really think Somalia is a safe or stable place…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]