[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…White  Station Middle School and White Station High School where his teams  have won 45 state team titles. Idlewood, my elementary school alma  mater and the only school in Tennessee to receive the Top Magnet School  of Excellence designation, also sent teams to the national chess  tournaments in 2024 and 2023. This proud tradition puts Idlewild on a…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691697/congratulating-the-idlewild-elementary-school-chess-team-champions"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…is watching, the United States  cares, and that we want to ensure their future in Europe and NATO.\n\nMr. OLSZEWSKI. Madam Speaker, I yield 2 minutes to the gentleman from  Tennessee (Mr. Cohen).\n\nMr. OLSZEWSKI. Madam Speaker, I have no further requests for time,  and I yield myself the balance of my time for the purposes of closing.\n\nMadam Speaker, H.R.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1373, as amended, bipartisan  legislation to promote additional transparency of board meetings of the  Tennessee Valley Authority.\n\nI thank Representatives Cohen and Burchett of Tennessee for their  leadership on this bill and their tireless work to improve the TVA.\n\nTVA is the Nation's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692214/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…or self-harm to the world.\n\nTake, for example, a horrific case that happened just last summer on  the online platform Roblox. Several people associated with 764 located  in Tennessee allegedly used the platform to entice a 13-year-old,  located hundreds of miles away in New Jersey, to carve the initials of  each person into her leg and send the group…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…been  present, I would have voted no.\n\nI was necessarily absent for rollcall vote No. 300, the motion to  invoke cloture on Executive Calendar No. 112, Stephen Vaden, of  Tennessee, to be Deputy Secretary of Agriculture. Had I been present, I  would have voted no.\n\nI was necessarily absent for rollcall vote No. 301, the confirmation  of Executive Calendar…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692470/vote-explanation"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…pictures and videos of themselves engaged  in sexual conduct. The victims ranged in age from 5 to 17 years old and  lived all over the U.S. and even around the world, from Tennessee and  Massachusetts to Australia and the United Kingdom.\n\nWhen the man asked for access to the social media account of an 11- year-old, he wrote: ``Add me back or I'll post…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…May of  1992, one of two women in her recruiting class of 84, after receiving a  bachelor of business administration in 1988 from Freed-Hardeman  University in Henderson, Tennessee, where she played collegiate  basketball. After joining the department, she continued her education  by receiving a bachelor's of professional studies in fire  administration…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…bystanders. That should alarm every single one  of us.\n\nAcross the country, Republican-led States have recognized the dangers  of high-speed cases. States like Texas, Florida, and Tennessee have all  implemented tighter standards to limit pursuits of violent criminals or  imminent threats. They know the risks are too high for people who are  innocent or could…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…because this nigger got them  all right.'' He got all of them right, and he registered to vote. Yet,  my father and my grandfather had to pay poll taxes to be able to vote  in Tennessee.\n\nAll of this was done to make sure that local election officials could  deny people they didn't want to vote the ability to vote. I took my  oath of office on the Bible…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…States that supported Donald Trump in the last election. That is  because the EV component plants that are being built for this  burgeoning sector are happening in Texas and in Tennessee and in  Missouri and in South Carolina. The battery factories are being  launched in Indiana, Alabama, Georgia, Ohio, and Michigan.\n\nEvery signal we send to American industry…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Baptist Church, where Dr. King held a pastorate.\n\nI encourage my colleagues to join me in honoring the life of Reverend  Middlebrook by naming a post office in Knoxville, Tennessee, after him.\n\nMr. Speaker, I urge strong support from all of our colleagues for  H.R. 1372.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697618/reverend-harold-middlebrook-post-office-building"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "Mr. JACKSON of Illinois.  I rise in support of H.R. 260, and I thank my dear friend  and honorable colleague, the Honorable Tim Burchett from the great  State of Tennessee, for his remarks.\n\nMr. Speaker, oversight of U.S. policy toward Afghanistan does not  have to be a partisan issue. We can all agree that we do not want  American dollars…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…look at this as the  total picture.\n\nMost of these tanks are manufactured in the United States by American  companies, and they are in a lot of the red States. They are in  Tennessee, for example. They are saying: This is fine. We want the more  efficient standards. We want to save Americans money. We are the good  actors, not the bad actors.\n\nMadam Speaker,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…better service to themselves,  their employers, and the community in which they lived.\n\nIn the 1930s, my father and his sisters attended that school because  the State  of Tennessee did not provide a good education to Black children. Like  his father and his grandfather, my dad became an educator himself,  ultimately teaching the next generation of educators…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of West Virginia, to       be United States Attorney for the Southern District of West       Virginia for the term of 4 years.\n\n9. Calendar Number 375: David Dunavant, of Tennessee, to be       United States Attorney for the Western District of Tennessee       for the term of 4 years.\n\n10. Calendar Number 376: Matthew Harvey, of West Virginia,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Inc. and President of Gray  Kentucky Television, Inc., operating WKYT-TV in Lexington, WYMT-TV in  Hazard, WBKO-TV in Bowling Green and President of WVLT-TV in Knoxville,  Tennessee.\n\nIn addition to an Emmy Award, Wayne has earned a number of accolades,  including Ohio Valley Conference (OVC) Coach of the Year in 1982, OVC  Hall of Fame Inductee in 2004,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…the cybersecurity threat posed by the People's Republic of China's  cyber actors.\n\nMr. GARBARINO. Madam Speaker, I yield such time as he may consume to  the gentleman from Tennessee (Mr. Ogles).\n\nMr. GARBARINO. Madam Speaker, I think I would be remiss if I did not  mention the ranking member of the full committee and the ranking member  of the subcommittee…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…United  States.\n\nThis organization has a long history of service and patriotism, with  strong ties to Illinois and to my hometown, Murphysboro, not  Murfreesboro. That is in Tennessee. I am speaking of Murphysboro, M-u- r-p-h-y-s-b-o-r-o. There is only one in this world, and it is  Murphysboro.\n\nMurphysboro is also the hometown of former Member of Congress,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass  the bill (H.R. 1372) to designate the facility of the United States  Postal Service located at 300 Macedonia Lane in Knoxville, Tennessee,  as the ``Reverend Harold Middlebrook Post Office Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697619/reverend-harold-middlebrook-post-office-building"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Mr. Chairman, I thank the gentleman from  Tennessee for yielding me time.\n\nMr. Chairman, I rise today to offer my support for this year's Energy  and Water Development Appropriations Act.\n\nMr. Chair, I will talk about Texas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…hidden about it. It is fully present.  Consumers opt in to it, and the competition is intense to retain those  customers.\n\nMr. Rose was the Commissioner of Agriculture in  Tennessee before coming to Congress. He is a very active member of both  the House Financial Services Committee and the Agriculture Committee.  He has rural Tennesseans and their financial…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Virginia, to be General Counsel for the Department of the  Treasury; Francis Brooke, of Virginia, to be an Assistant Secretary of  the Treasury; and Jonathan McKernan, of Tennessee, to be an Under  Secretary of the Treasury.\n\nDuring consideration of the One Big Beautiful Bill Act, I worked with  my colleagues to provide wind and solar an appropriate…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694587/department-of-the-treasury-nominations"}, {"senator": "John Rose", "party": "Republican", "sentence": "…letter supporting this bill.\n\nAdditionally, many organizations, some already mentioned, have come  out in support of this bill, including the American Bankers  Association, the Tennessee Bankers Association, America's Credit  Unions, the Broker Action Coalition, the Independent Community Bankers  of America, the Mortgage Bankers Association, and the National…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…at the signing ceremony along  with the brave young women and girls who have spoken out for fairness,  safety, equal opportunity, including one of those female athletes,  Tennessee's Riley Gaines.\n\nThe terms of the order are simple: If you allow men to compete in  women's athletics, you will lose your Federal funding.\n\nTo no one's surprise, the order…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…more than 50 years  after the conception of FedEx, he continued to lead it.\n\nToday, FedEx operates in over 220 countries, but its heart and  headquarters remain in Memphis, Tennessee. Through FedEx, Fred Smith  turned Memphis into a global logistics hub, driving economic growth  across the region while employing tens of thousands of Tennesseans.\n\nToday,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "John Rose", "party": "Republican", "sentence": "…represent in Congress. This year  marks 100 years since the Grand Ole Opry first introduced audiences  around the world to country music and to Nashville.\n\nMy home state of Tennessee is known for many things. If you had to  list some of the most prominent, you might think of the Great Smoky  Mountains of Elvis Presley, but you would most certainly include…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…completed 1  million miles of long-haul driving without an accident.\n\nMs. Partin is a professional long-haul truck driver for McKee Foods  Corporation based in Collegedale, Tennessee. She began her career at  McKee Foods Corporation in September 1987. Starting in the  Manufacturing Production Area, Karen first transferred to Shipping,  then to the Transportation…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…citizens should be the people choosing our elected leaders, not illegal  immigrants.\n\nI am not a drinker. Everybody knows that. But I know if I go to  Weigel's in Knoxville, Tennessee, down on the corner of Emory Road and  Tazewell Pike, and I go in there to buy a six-pack or a can of Skoal or  a scratch-off, then I have to produce an ID.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…not fund the government.\n\nI was always embarrassed to even look in the eye--I voted for all of  it--to go see a TSA agent at the airport in Nashville in my home State  of Tennessee where I fly out of, the FAA people going to work at the  airport. I was embarrassed coming here and seeing the people sitting in  front of us here, the people guarding the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…the Hamilton County, Indiana Sheriff's Department.\n\nPrior to his time with the Hamilton County Sheriff's Office, Deputy  Larkin served as a police officer with the Memphis, Tennessee Police  Department. In 1982, he served as lead negotiator for a hostage  situation at St. Jude Children's Hospital. After his heroic actions  during this event, Deputy Larkin…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}]