[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "\"At this time of almost unimaginable pain, it is essential that we pause to honor every life lost, and that we grieve together.\"\n\n\"Over the past few months, more than 300 Tennesseans have lost their lives to COVID-19."}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "It is a big  loss to Tennesseans."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "\"At this time of almost unimaginable pain, it is essential that we pause to honor every life lost, and that we grieve together.\"\n\n\"Over the past few months, more than 300 Tennesseans have lost their lives to COVID-19."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "This bill will help to grow our STEM workforce to give Tennesseans the training necessary to compete in the 21st century landscape.\"\n\n\"We must ensure we are preparing our next generation with the skills that reflect the future of our workforce and that are necessary to protect our nation, and that training begins in the classroom,\" said Senator Rosen."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "United States Senator Lamar Alexander (R-Tenn.) today encouraged Tennesseans to visit his website to learn more about how they can take advantage of legislation Congress passed, and President Trump signed into law, that will keep paychecks coming, relieve financial burdens, and contain COVID-19."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "She gave the following statement on its passage:\n\n\"This is a tough time for Tennesseans, and over the last few weeks, I have spoken with dozens of employees, small and large business owners, and gig economy workers."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Marsha Blackburn to stop these green-light sanctuary laws from wreaking havoc on communities across the country.\"\n\n\"Tennesseans know all too well what can happen when illegal immigrants are granted driver licenses,\" Senator Blackburn said."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "United States Senator Lamar Alexander (R-Tenn.) today said Tennesseans continue to show the \"Volunteer spirit,\" by helping each other after the catastrophic storms on March 3."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "President, I want to say just a couple of things  to Tennesseans and to Americans."}, {"senator": "John Rose", "party": "Republican", "sentence": "The American people and countless  Tennesseans I represent are suffering and experiencing real pain."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "The work plan also includes $2.163 million for dredging at Memphis Harbor McKellar Lake, which is good news for West Tennesseans."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "I am especially pleased today to honor two Tennesseans who heard the  cries for help and, in spite of the danger, asked, Where do I sign up?"}, {"senator": "John Rose", "party": "Republican", "sentence": "The Tennesseans who I represent have suffered enough because of the  many failed policies of the last administration, and they shouldn't be  forced to pay more."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "\"My fellow Tennesseans saw right through the games and the intentional mishandling of the Democratic House Managers' constitutional duty."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "\"Last year, more Tennesseans died from opioid overdoses than were killed in car crashes."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "I thought she said that well and expressed the  feeling of most Tennesseans."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "\"What fentanyl has done to Tennesseans, families and communities is just devastating, and those criminals responsible for distributing these drugs must face serious penalties."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "\"Tennesseans know all too well what can happen when illegal immigrants are granted driver licenses,\" said Senator Blackburn."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "I know that I have sounded like a broken record in my reiterating  just how important it is to keep these judicial nominations moving  through the Committee on the Judiciary and moving to the floor, but I  will tell you this: I think it is a message that needs to be repeated  day in and day out because the American people and, as I said,  Tennesseans know that this should be a priority, for this is how we  continue to protect freedoms from generation to generation."}]