[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…have thought of that before he started a trade war against the  entire world.\n\nNow, he claimed that he was already negotiating with China to lower  tariffs and calm trade tensions, but China and Secretary Bessent said  that talks have not even started.\n\nThis weekend, the Agriculture Secretary said 100 countries had  reached out to start trade talks,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…been deployed into his city, over the objections of the mayor,  over the objections of the Governor, in a historically unprecedented  way and in a way such as to escalate tensions in his town rather than  to reduce them.\n\nSo he decided to go to a peaceful public assembly. It was a press  conference. It wasn't a private meeting to which he was not allowed…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…calling out the military  over the objection of a Governor to try to intimidate and interfere  with law enforcement in California, calling out the Marines to try to  inflame tensions in our city; and, now, this latest act, when a U.S.  Senator goes to demand questions about the lawfulness or lawlessness of  these actions, to see him tackled to the ground,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, at a time when global tensions are  rising, the last thing we need is more weapons. That is why it is so  important that the New START treaty, set to expire in 21 days, is  renewed by the administration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…on no more than 700 deployed long- range missiles and bombers. Extension is common sense for our security.\n\nFirst, New START promotes stability. With the war in Ukraine,  tensions between the U.S. and Russia are high. Negotiating an extension  offers space within that relationship to lessen tensions.\n\nSecond, if not renewed, we risk the possibility…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and the right of each of our citizens to  make their decision and their vote be the one that counts.\n\nAt the same time, despite the political violence at home and rising  tensions abroad, the Trump administration has taken an ax to CISA. As  we know, that is the Agency that works to curb emerging cyber security  threats. And that threat, those threats,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…in our bilateral relationship.\n\nSadly, the Trump administration has failed to do anything to get  ahead of the expiration of New START and has done a lot to raise  nuclear tensions. The President has made threats, endorsed insanely  expensive plans to expand our arsenal, pushed for the resumption of  explosive testing, and advocated for an impractical…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…bill leaves wide open opportunities for countries like Iran and  other nefarious actors to more easily get their hands on the materials  needed to build nuclear weapons. With tensions mounting in the Middle  East and the internet containing significant bomb-making instructions  which are much more accessible to terrorist groups, this is not the  time when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…of  police, or the Governor. It was unprecedented, unnecessary, and a clear  attempt to take over the State's law enforcement authority. In fact, I  think it did aggravate tensions in the area.\n\nNow, the National Guard remains in Los Angeles to this day. They have  nothing to do. We heard a report from a former commander that less than  20 percent are…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…follow.\n\nPresident Obama understood this. He knew that insanity was doing the  same thing over and over and expecting different results, so he  loosened restrictions, relieved tensions, and advanced cooperation. We  were on the road to helping create a new future for Cuba.\n\nHowever, Trump takes us backward. He unjustifiably added Cuba to the  state sponsor…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Ms. BARRAGAN. Mr. Speaker, it is this conduct that is causing people  to go out in the streets and peacefully protest.\n\nPresident Trump's deployment of troops only escalated tensions and  caused further unrest. Democrats have been clear. Anyone who commits  violence must be held accountable. We must recognize that peaceful  protests are patriotic. Deploying…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…core beliefs.\n\nThe Federal response to deploy more than 4,000 National Guard troops  and 700 marines without a local request is a troubling overreach. It  risks escalating tensions and chilling the right to protest, which is  protected by the Constitution.\n\nWe need leaders that listen and not the ones that answer concerns  with intimidation and threats.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…workers to come into the U.S. legally, but in Minnesota, following the  tragic shootings, more than 60 Minneapolis-based business leaders  called for cooperation to de-escalate tensions and achieve durable  immigration reforms.\n\nIt is important for this body to hold Federal immigration officials  accountable and ensure that small businesses do not bear the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…on the agenda when he  meets with Xi Jinping. He expressed a willingness to do this in his  Oval Office comments.\n\nEven talking about negotiations in itself can help reduce tensions. A  deal requires a first step, and I encourage the President to take it  and to take it soon.\n\nWe, in Congress, can use our voice. Along with our colleague, the  gentlewoman…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…here''.\n\n(7) The tournament occurred at a time when the United       States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for ice hockey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…the base they need to continue the important work they  do in so many of our communities and paves the road for a smoother  procurement process going forward.\n\nWith global tensions as high as they are, it is more important than  ever for America to preserve the ability to project power across even  the furthest reaches of the globe, from the Pacific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…responsibility--earning the endearing nickname ``the Green Patriarch'',  by stating that damaging God's creation is a sin.\n\nAt a time when religious persecution, catastrophes and tensions among  religious communities seem to be dominating news headlines, Patriarch  Bartholomew presents an alternate vision: ``War in the name of religion  is war against religion,''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…here''.\n\n(7) The tournament occurred at a time when the United       States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…training missions. We use it to reload  submarines. In fact, it is one of the few military bases where we can  actually reload submarines. We use Diego Garcia to respond to tensions  throughout the Middle East, throughout Africa, and throughout Asia.  Recently, we relocated several B-2 bombers to respond to Iran's  aggression toward demonstrators.\n\nThere…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…danger of relying on hostile foreign nations such as China       for essential mineral resources which can be cut off at any       time due to geopolitical or economic tensions. Maximizing       domestic production and processing of mineral resources is       the optimal strategy for addressing this dynamic and will       also create many well-paying…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…past Saturday, President Trump directed our military to respond  to a growing threat that Iran could weaponize nuclear material and  deliver a nuclear weapon. With escalating tensions between our ally  Israel and our adversary Iran, the President made the decision to deter  and delay the capabilities Iran has to deliver a nuclear weapon. What  we know to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…industries rely on.  Economically, a conflict would disrupt global trade routes, potentially  triggering a global financial crisis. And it would escalate regional  military tensions, risk broader conflict, and cyber attacks.\n\nA strong American presence in the region lowers the odds of conflict  and reassures our allies that they will never face these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Affairs Committee due to its  significance to national security and economic prosperity.\n\nMeanwhile, the region also faces significant challenges, including  rising geopolitical tensions, maritime disputes, and growing coercion  from bad actors seeking to undermine a rules-based order.\n\nThis bill is long overdue and sends a strong message that the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Congressional District.\n\nThis expansion signifies a strong commitment to domestic  manufacturing, while also bolstering our military readiness and  capabilities. In a world of growing tensions with foreign adversaries,  investments like this are essential to our national security. They are  essential for maintaining that peace through strength that President  Trump…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the  next Speaker of the House.\n\nWhat our leadership seems to have forgotten is that the House is a  coequal, independent branch of our government. There are supposed to be  tensions between the branches. That is the design of our system.\n\nEven if the leaders of the other branches are carbon copies of  yourself, Mr. Speaker, there should, from time to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…today because of  President Trump, and we pray that the Lord would continue to give him  wisdom and discernment as he leads our Nation and continues to work on  bringing down tensions in the Middle East.\n\nGod bless President Trump, God bless our troops, and God bless our  great country.                  One Big, Beautiful Bill's Economic Relief\n\nMr. MANN.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…for war. They have actually  threatened to forcibly take Taiwan. President Xi has ordered the  People's Liberation Army to be ready to do so by 2027, of course,  escalating tensions in the Indo-Pacific and engaging in provocative  joint military exercises with Russia.\n\nNotwithstanding the chaos around the world, America was suffering  direct consequences…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…making sure that no further  damage to property and life occurred?\n\nMr. Speaker, the assertion has been made repeatedly that the  President's deployment of the Guard escalated tensions. We have seen  zero evidence for that. We all saw the images of the horrifying  violence that occurred before the Guard came in.\n\nFor my colleagues who continue to assert…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]