[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…trillion-dollar cut to the  health insurance program that is responsible for the care of one- quarter of Americans, two-thirds of nursing home beds, and the budgets  of literally tens of thousands of vital healthcare institutions in this  country.\n\nNobody is better than you at conveying the moral consequences of the  decisions we make here. Just share with us for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…electricity is scary. It can kill you and is produced  by burning coal, which is dangerous, so we are not going to research  electricity or atomic power or the automobile. Tens of thousands of  Americans die every year because of the automobile.\n\nWe don't know, and the majority says let's not learn because they  have some ideological fixation that, frankly,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first designated for Afghans under the Biden administration  in 2022 after we withdrew from Afghanistan, marking the end of  America's longest war.\n\nFor over two decades, tens of thousands of Afghan civilians worked  alongside our military and diplomats. Make no mistake, they were  risking their lives to help us and faced the possibility of retribution…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Airlines grew from humble beginnings into a global  carrier headquartered in the Twin Cities. Northwest played a central  role in shaping Minnesota's economy, creating tens of thousands of  good-paying jobs, and connecting our communities to the Nation and the  world. Its story is inextricably linked to our state's modern history.\n\nOne of the earliest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…week, Russia launched a barbaric missile strike on Kyiv  that killed and injured more than 100 Ukrainians.\n\nSince Russia began this unprovoked war more than 3 years ago, tens of  thousands of Ukrainians have paid with their lives, and we must never  forget the more than 20,000 children from Ukraine who have been  forcibly deported by Russia and remain missing.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…thank Congressman Quigley for his strong  and constant support of Ukraine. I thank the gentleman so much for  representing the State of Illinois and the thousands and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…flowing into the bank  accounts and pockets of President Trump and his family. And everyday  Americans are suffering losses because of it.\n\nThe investors in his meme coin--tens of thousands of them--are  losers. They have lost money. And many other Americans are likely to  suffer losses as well. So the tangible impact of that crypto corruption  is real and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and it begins with:\n\n``Dear Secretary Collins: On April 3, 2025, you abruptly announced  the closure of the Veterans Affairs Servicing Purchase program (VASP),  leaving tens of thousands of veterans at risk of foreclosure. These  actions were taken unilaterally, leaving veterans, veterans service  organizations, and mortgage services unsure how the closure…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…President, every year, Congress considers the  National Defense Authorization Act which has critical investments in  our national defense, including in Maryland. In my State, tens of  thousands of military personnel and civilians work at military  installations and in the defense sector, driving innovation and  research to advance our defense. The NDAA governs…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Tip Line to receive reports of suspected child  exploitation. The Cyber Tip Line has received many more reports of  sextortion of minors in recent years, amounting to tens of thousands of  potential victims. These crimes have deadly consequences.\n\nNCMEC has identified 36 teens who took their own lives after being  subjected to harsh and incessant harassment…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…because of how they express their gender. That  message is immoral, unfair, and un-American.\n\nI represent Delaware's at-large district, a district that includes  thousands, tens of thousands of Active-Duty servicemembers, veterans,  and military families. In our State, service isn't abstract. It is  personal. We see every single day what honor, discipline,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…district who are tangibly impacted by this  backlog and by what is going on at the IRS.\n\nTake a small business in my district who filed for a tax refund. They  are owed tens of thousands of dollars, money that is critical to  running and growing their business, and now they can't make new  investments because they are waiting for their refund. There is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…in Ukraine because that is what they are fighting for.  They know that if they give up, the Russians will occupy. In those  occupied areas, they have already deported tens of thousands of  children to be reeducated and taken away from their family. They put  the Ukrainian people in camps.\n\nRussia is basically like a boa constrictor, slowly digesting…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the identities of at least 124  individuals who had been involved in their cases--including  prosecutors, judges, and FBI agents.\n\nThe post, which has received at least tens of thousands of views,  includes names, photos, disparaging remarks, and demands for  accountability.\n\nIn January, another pardoned January 6 defendant who pleaded guilty  to assaulting…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…the wealthy, it neglects the ACA tax credits working  families in my district depend on to cover their insurance premiums. It  cuts Medicaid by $1.1 trillion, kicking tens of thousands of my  constituents off their healthcare, and it raises costs for everybody.\n\nOur Protecting Health Care and Lowering Costs Act reverses all of  that, and we should pass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…honor of  National Prisoner of War/Missing in Action Recognition Day to remember  the more than 500,000 POWs who endured the horrors of enemy captivity.  We also honor the tens of thousands still missing in action.\n\nThese patriots and their loved ones deserve more than a single day of  remembrance. They deserve a permanent place of honor. That is why I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…relating to the crisis of fentanyl coming across our  northern border.\n\nDemocrats don't recognize that there is a crisis and that it is  killing thousands of Americans, tens of thousands of Americans, each  and every year. They are trying to literally end that executive order  that identifies the national emergency, an emergency that is literally  agreed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…yielding and  for claiming this time to highlight the many accomplishments of the  Trump administration during the first 100 days.\n\nMr. Speaker, I rise today on behalf of tens of thousands of  Tennesseans I represent to express appreciation to President Trump and  his administration on their bold action over the last 100 days.\n\nAfter 4 years of unprecedented…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…It is a fun survey that highlights a staff member or intern,  so we all get to know each other better--something everyone on the team  enjoys receiving.\n\nFrom helping tens of thousands of Idahoans navigate complex federal  issues to personally attending meetings and events across the district  to supporting veterans, Amy has been far more than an asset--she…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…thousands--of Alaskan Natives were serving in Vietnam. When a whole  host of Americans didn't want to serve in Vietnam, Alaska Natives  answered the call. So we have tens of thousands of Vietnam vets.\n\nAnd when they came home, like a lot of Vietnam vets, they were not  treated well. That was horrible. Our country should apologize for the  horrible…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…that it would be a savings of $6 billion over 30 years. What he didn't  mention is the cost of replacement equipment with these new energy  efficiency standards could be tens of thousands of dollars, adding up  to billions and billions of dollars that are going to be borne by these  businesses.\n\nI am grateful President Trump has taken the decisive action…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…learn more about this and other problems  with the Biden administration's mass parole of Afghan nationals into  the United States.\n\nOnce again, let me just reiterate that tens of thousands, hundreds of  thousands, even millions of individuals were admitted into the United  States due to President Biden's open border policies, using this same  claimed discretionary…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing limbs, shrapnel, nerve damage, brain injuries, burns, scars.  Some live with paralysis and are confined to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…eliminate the need for ongoing special use permits  with Forest Service, and allow implementation of a comprehensive  watershed management strategy. We would also save tens of thousands of  dollars in administrative costs for both the City and the Forest  Service.\n\nMr. Speaker, this is a narrowly tailored, community-driven proposal  that directly supports…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…angst, they required pointless studies  that were endlessly time-consuming and outrageously costly along with  backbreaking, outrageous environmental fees, adding many tens of  thousands of dollars to the costs that were all passed on to helpless  homebuyers.\n\nAs these solutions drove up the price of housing, the socialists  began offering subsidies to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…preserves and makes accessible firsthand the recollections of veterans  who served during World War I through more recent conflicts and  peacekeeping missions.\n\nFrom helping tens of thousands of Idahoans navigate complex federal  issues to personally attending meetings and events across the district  to supporting veterans, Linda has been far more than an…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…different from anything we have ever experienced in the history  of the United States or the world, for that matter.\n\nIf a foreign actor released a chemical agent that killed tens of  thousands of Americans, the response would be immediate, unified, and  decisive.\n\nWe can and must act immediately to save American lives.\n\nThis is not unprecedented. Every President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Democrats all designed to expire when COVID was over, that every  watchdog group has said is loaded with fraud and waste--as the chairman  said, Social Security numbers from tens of thousands of dead people--it  is siphoning money out of the taxpayers' pockets, away from the  vulnerable, and enriching insurance companies.\n\nThere are millions of ineligible…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…New Jersey. Mr. Speaker, I thank the chairman for his  support and for yielding this time.\n\nMr. Speaker, every year under Xi Jinping and his Chinese Communist  Party, tens of thousands of young women and men, average age 28, are  murdered in cold blood to steal their internal organs for profit or to  be transplanted into Communist Party cadres, leaders…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…project would have provided a safe and reliable way  to transport energy resources between the United States and our  neighbor to the north, Canada. It would have created tens of thousands  of jobs, as my colleague earlier said, strengthening our energy  security and generating billions of revenue to boost economic growth.\n\nDon't listen to this chatter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}]