[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Children's smiles are extinguished every single day by bombs that say  ``Made in the United States of America.''\n\nExperts say, and we all know this, that the death toll is likely tens  of thousands higher with countless bodies still trapped under the  rubble.\n\nThis must end.\n\nAs we speak, the Israeli military is moving to wipe what remains of  Gaza city off…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…benefits of their tireless labor.\n\nWith fewer than 100 days in office, President Trump has already  caused tremendous harm to Social Security, jeopardizing the well-being  of tens of millions of seniors, veterans, and people with disabilities.  This assault on Social Security is an assault on our nation's most  vulnerable and least secure. Across the…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…enhanced premium tax  credits expired. For years, these credits allowed millions of Americans  to afford health insurance that they would otherwise not be able to  get. For tens of millions of others, these tax credits drastically  lowered premiums--for some families, by as much as thousands of  dollars. They gave working families essential relief amidst…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…had the tools, and has the responsibility, to intervene when  veterans faced foreclosure. VASP was working. It had already helped  over 15,000 veterans keep their homes with tens of thousands more  eligible.\n\nEnding it based on the false narrative that veterans would game the  system is an insult to their service and sacrifices. This decision  abandons…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…American people. The majority is choosing billionaires  over programs that everyday people depend on.\n\nIn my district alone, hundreds of thousands of people will lose  Medicaid. Tens of thousands will lose SNAP benefits that help put food  on the table. The Natural Resources Committee is tasked with finding at  least $1 billion of these savings, $1 billion…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…affordability is fake. Tell it to anyone who actually has  to work for a living. Affordability isn't fake; it is a very real  nightmare. I am sure that last night, probably tens of millions of  families gathered to decide which bills they could afford to pay and  which bills they couldn't for necessities they need.\n\nLike many Presidents before him,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…work of the people in this Congress. We have taken health care  away from hundreds of thousands of people. We have taken SNAP payments  and nutritional sustenance, away from tens and hundreds of thousands of  people. We have made injuries to the Earth, God's Earth we are here to  preserve, and we only use. We have taken away from women the right to…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…that electricity is scary. It can kill you and is produced  by burning coal, which is dangerous, so we are not going to research  electricity or atomic power or the automobile. Tens of thousands of  Americans die every year because of the automobile.\n\nWe don't know, and the majority says let's not learn because they  have some ideological fixation that,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…trillions of dollars on  tax breaks for billionaires and to send the Pentagon billions of  dollars more than they even ask for.\n\nMr. Speaker, the administration came up with tens of billions of  dollars to bail out Argentina, for God's sake. Somehow, helping moms  and dads, grandparents, and kids afford trips to the doctor is a step  too far for this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…``Oh, it is a government program,''  as if that is a slur, when, really, it is something that we the people,  in order to create a more perfect Union, created as a lifeline to tens  of millions of Americans that, but for programs like this, would be  succumbing to diseases, succumbing to ill health. And we as an entire  country would suffer.\n\nThink about…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…themselves to opening the voting booths to all Americans.\n\nIndeed, the Trump administration and congressional Republicans are  now advancing policies that could disqualify tens of millions of  Americans from voting in elections. If adopted, these policies will  make it harder for low-income individuals, the elderly, women, and even  U.S. servicemembers…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Africans, unless they happen to be White Afrikaners, and, more  importantly, by his abrupt and unjustified termination of the Agency  for International Development, which has cost tens of thousands of  lives in Africa and other places, and thousands of American jobs. AGOA  cannot undo all of that harm, but it can be part of responsible  engagement, if it is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…tell, they have not done much of the work needed  to avoid making the same expensive mistakes again.\n\nRepresentative Kiggans' bill in its introduced form would have  authorized tens of millions of dollars to VA for a pilot on a program  VA does not even yet have a plan for. That is millions of dollars to  the Department simply with the hope that VA was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695397/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…over my district who are tangibly impacted by this  backlog and by what is going on at the IRS.\n\nTake a small business in my district who filed for a tax refund. They  are owed tens of thousands of dollars, money that is critical to  running and growing their business, and now they can't make new  investments because they are waiting for their refund. There…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…2024 election, crypto emerged as the biggest corporate  spender, accounting for nearly half of all the corporate money spent.  Crypto outspent every other business lobby by tens of millions of  dollars.\n\nWhile the crypto industry's political spending is enormous, what  really sets it apart is the brazenness with which the industry buys  influence in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…every apparatus the department has owned and still runs the  pumper and tanker with skill.\n\nSkip played a major role in planning the current fire station, saving  the department tens of thousands of dollars through smart cost cutting.\n\nSkip has been on the front lines of major incidents, from the Kane  tornado to floods, barn fires, and even a military plane…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…in honor of  National Prisoner of War/Missing in Action Recognition Day to remember  the more than 500,000 POWs who endured the horrors of enemy captivity.  We also honor the tens of thousands still missing in action.\n\nThese patriots and their loved ones deserve more than a single day of  remembrance. They deserve a permanent place of honor. That is why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…perpetuate the inefficiencies. It doesn't make you  popular telling the truth, but we all knew this.\n\nShould we have bailed out Blockbuster Video 15 years ago because  there were tens of thousands of people who worked for Blockbuster?  Should we have put Netflix out of business? Should we have slowed down  the internet? Should we have stopped the revolution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…apologize for. We are not being xenophobic. We are  not saying we are going to let nobody in this country, but obviously we  have to have some restrictions or we would wind up with tens of  millions more people in the country.\n\nHowever, despite our generosity in letting more people here, we have  significant areas of the country governed by elected people who…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Mrs. HYDE-SMITH. Last week, tens of thousands of Americans of all  ages, from across the country, gathered in our Nation's Capital to  march for the most vulnerable among us: preborn children. I am so proud…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…up-front costs of  going public, as well as the high operating costs public companies  experience due to SEC reporting rules.\n\nBefore a company files for an IPO, they often spend tens of millions  of dollars to gather and compile information to submit to the SEC.  These mandatory information requirements exclude or dissuade many  companies from even considering…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…$500,000. It is $500,000 per account, per occurrence.\n\nWe have one Senator, one, who maintains that this provision is good  and is currently saying that he is going to sue for tens of millions of  dollars. I believe my side did the right thing in voting to open up the  government. There are a select few people that did the wrong thing in  putting language…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…routinely rated among the three worst roads in terms of their condition  anywhere in the country. We pay the highest gas taxes, yet drive over  the deepest potholes.\n\nDespite tens of billions of dollars more being spent every year on  education, educational achievement in California has flatlined, and we  continue to have some of the most glaring achievement…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…taxpayer dollars  funneled to illegal immigrants.\n\nAn outrageous pattern of perverse and intentional incentives reveal  deliberate efforts to worsen the border crisis and to allow tens of  millions of illegal aliens to invade our Nation at direct cost to the  American taxpayer.\n\nThe Biden-Harris administration cycled through repeated falsehoods:  claiming…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  suspect, one being Officer Pastore, who was trying to rescue the  victims.\n\nI know I speak for many of my colleagues when I say we couldn't be  more excited to welcome tens of thousands of law enforcement officers  from around the country to D.C. this week.\n\nLet's be clear: House Republicans and President Trump are mobilized  to restore order and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…financial freedom. First, we will vote on Senator Cruz's resolution to  stop the Biden administration's digital asset broker rule, which puts  at risk the privacy and security of tens of millions of Americans who  trade digital assets. This rule could also mean forfeiting American  leadership in financial innovation by giving the advantage to foreign  companies…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I rise to thank the courageous men and  women responding to the historic ice storm that left tens of thousands  without power across northern Michigan and the Upper Peninsula. Ten  counties are under a state of emergency, and our grid suffered near  total collapse under…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…amazing to hear the arguments about affordability when they presided  over an era of government that exploded our national debt, exploded  prices, not to the tune of $1,000 but tens of thousands of dollars on  Americans across the board, and they still tried to convince people  that their policies had nothing to do with it.\n\nThat is why this House is in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…union bosses after the November election and just before  leaving the agency to run for chair of the Democratic National  Committee.\n\nThe deal locked in telework levels for tens of thousands of Social  Security Administration employees for the entirety of the incoming  Trump administration. To be clear, this was done specifically to Trump- proof the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing limbs, shrapnel, nerve damage, brain injuries, burns, scars.  Some live with paralysis and are confined…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}]