[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…trillion-dollar cut to the  health insurance program that is responsible for the care of one- quarter of Americans, two-thirds of nursing home beds, and the budgets  of literally tens of thousands of vital healthcare institutions in this  country.\n\nNobody is better than you at conveying the moral consequences of the  decisions we make here. Just share with us for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…electricity is scary. It can kill you and is produced  by burning coal, which is dangerous, so we are not going to research  electricity or atomic power or the automobile. Tens of thousands of  Americans die every year because of the automobile.\n\nWe don't know, and the majority says let's not learn because they  have some ideological fixation that, frankly,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the identities of at least 124  individuals who had been involved in their cases--including  prosecutors, judges, and FBI agents.\n\nThe post, which has received at least tens of thousands of views,  includes names, photos, disparaging remarks, and demands for  accountability.\n\nIn January, another pardoned January 6 defendant who pleaded guilty  to assaulting…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Airlines grew from humble beginnings into a global  carrier headquartered in the Twin Cities. Northwest played a central  role in shaping Minnesota's economy, creating tens of thousands of  good-paying jobs, and connecting our communities to the Nation and the  world. Its story is inextricably linked to our state's modern history.\n\nOne of the earliest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…week, Russia launched a barbaric missile strike on Kyiv  that killed and injured more than 100 Ukrainians.\n\nSince Russia began this unprovoked war more than 3 years ago, tens of  thousands of Ukrainians have paid with their lives, and we must never  forget the more than 20,000 children from Ukraine who have been  forcibly deported by Russia and remain missing.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…thank Congressman Quigley for his strong  and constant support of Ukraine. I thank the gentleman so much for  representing the State of Illinois and the thousands and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…powerful, and they are persuasive. They depict the  scope and impact of this act, if it were passed, in lifesaving and  life-enhancing benefits, and what it will mean to the tens of thousands  of veterans across this great Nation.\n\nIn fact, these veterans and their families--think of their families-- deserve a lot better. They deserve elected officials who…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the tools, and has the responsibility, to intervene when  veterans faced foreclosure. VASP was working. It had already helped  over 15,000 veterans keep their homes with tens of thousands more  eligible.\n\nEnding it based on the false narrative that veterans would game the  system is an insult to their service and sacrifices. This decision  abandons our…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…President, every year, Congress considers the  National Defense Authorization Act which has critical investments in  our national defense, including in Maryland. In my State, tens of  thousands of military personnel and civilians work at military  installations and in the defense sector, driving innovation and  research to advance our defense. The NDAA governs…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…china shop.\n\nDoes anyone believe the Freedom Caucus and President Trump love  America's children more than their own parents do or that they can make  better decisions for tens of thousands of American children than their  own parents? I can't understand the logic of it.\n\nAt a time of skyrocketing healthcare costs--which our colleagues will  do nothing about…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…because of how they express their gender. That  message is immoral, unfair, and un-American.\n\nI represent Delaware's at-large district, a district that includes  thousands, tens of thousands of Active-Duty servicemembers, veterans,  and military families. In our State, service isn't abstract. It is  personal. We see every single day what honor, discipline,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…career in the trades.\n\nOver the last 50 years, BIG STEP has been essential to creating  Milwaukee landmarks, from our skyscrapers to our sports complexes.  After helping tens of thousands of people take their first steps into  the trades, BIG STEP has served Wisconsin's workforce by building  courage, innovation, and equity.\n\nToday, WRTP BIG STEP creates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today as the Representative for  72,000 veterans and tens of thousands of Active-Duty personnel who live  in the Seventh Congressional District of Virginia.\n\nAs a 25-year Army veteran, former Army JAG prosecutor, and National  Security Council…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689155/pete-hegseth-must-go"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first designated for Afghans under the Biden administration  in 2022 after we withdrew from Afghanistan, marking the end of  America's longest war.\n\nFor over two decades, tens of thousands of Afghan civilians worked  alongside our military and diplomats. Make no mistake, they were  risking their lives to help us and faced the possibility of retribution…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…the wealthy, it neglects the ACA tax credits working  families in my district depend on to cover their insurance premiums. It  cuts Medicaid by $1.1 trillion, kicking tens of thousands of my  constituents off their healthcare, and it raises costs for everybody.\n\nOur Protecting Health Care and Lowering Costs Act reverses all of  that, and we should pass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing limbs, shrapnel, nerve damage, brain injuries, burns, scars.  Some live with paralysis and are confined to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…that it would be a savings of $6 billion over 30 years. What he didn't  mention is the cost of replacement equipment with these new energy  efficiency standards could be tens of thousands of dollars, adding up  to billions and billions of dollars that are going to be borne by these  businesses.\n\nI am grateful President Trump has taken the decisive action…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…honor of  National Prisoner of War/Missing in Action Recognition Day to remember  the more than 500,000 POWs who endured the horrors of enemy captivity.  We also honor the tens of thousands still missing in action.\n\nThese patriots and their loved ones deserve more than a single day of  remembrance. They deserve a permanent place of honor. That is why I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…this bill passes.\n\nDo not let the Senate muck this up. There have already been efforts  to derail our discharge petition. The Oversight Committee has released  thousands, tens of thousands of documents. That is fine. Keep working.  How many names have they released? Zero.\n\nThey are still protecting, or the DOJ is protecting, pedophiles and  sex traffickers.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…New Jersey. Mr. Speaker, I thank the chairman for his  support and for yielding this time.\n\nMr. Speaker, every year under Xi Jinping and his Chinese Communist  Party, tens of thousands of young women and men, average age 28, are  murdered in cold blood to steal their internal organs for profit or to  be transplanted into Communist Party cadres, leaders…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…It is a fun survey that highlights a staff member or intern,  so we all get to know each other better--something everyone on the team  enjoys receiving.\n\nFrom helping tens of thousands of Idahoans navigate complex federal  issues to personally attending meetings and events across the district  to supporting veterans, Amy has been far more than an asset--she…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the inefficiencies. It doesn't make you  popular telling the truth, but we all knew this.\n\nShould we have bailed out Blockbuster Video 15 years ago because  there were tens of thousands of people who worked for Blockbuster?  Should we have put Netflix out of business? Should we have slowed down  the internet? Should we have stopped the revolution of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Mrs. HYDE-SMITH. Last week, tens of thousands of Americans of all  ages, from across the country, gathered in our Nation's Capital to  march for the most vulnerable among us: preborn children. I am so proud  to live…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…What makes this championship even more special is how the U.P. made  it possible. With just days to prepare for the long trip to Ford Field,  the Maroons suddenly needed tens of thousands of dollars for buses,  lodging, and meals. Our Yoopers stepped up, raising nearly $30,000 in a  matter of days with the entire community pulling together because they…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697511/recognizing-menominee-maroons"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…angst, they required pointless studies  that were endlessly time-consuming and outrageously costly along with  backbreaking, outrageous environmental fees, adding many tens of  thousands of dollars to the costs that were all passed on to helpless  homebuyers.\n\nAs these solutions drove up the price of housing, the socialists  began offering subsidies to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…district, builders and citizens who want to reach  the American Dream, tell me that the cost of energy code mandates  totals in the thousands in added costs. In some cases tens of thousands  of dollars are added to the cost for a home.\n\nIt is long overdue that States change their ways. If we want to make  housing more affordable, then we have to make it…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…dispositive moment here in terms of  determining the character of this administration or what they are doing  or not doing when they are leaning in to try to seek the truth.\n\nTens of thousands of pages have been released by Jamie Comer, and 13  subpoenas have all been put out.\n\nNow the House just voted to have greater transparency. Time will tell  what that…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…preserves and makes accessible firsthand the recollections of veterans  who served during World War I through more recent conflicts and  peacekeeping missions.\n\nFrom helping tens of thousands of Idahoans navigate complex federal  issues to personally attending meetings and events across the district  to supporting veterans, Linda has been far more than an…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…eliminate the need for ongoing special use permits  with Forest Service, and allow implementation of a comprehensive  watershed management strategy. We would also save tens of thousands of  dollars in administrative costs for both the City and the Forest  Service.\n\nMr. Speaker, this is a narrowly tailored, community-driven proposal  that directly supports…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…condition, fighting for his life.\n\nWe join all Americans in praying for them and their families.\n\nThe terrorist who attacked them was an Afghan national. He is one of  tens of thousands of Afghans who were flown into our country following  Joe Biden's disastrous withdrawal from Afghanistan. We now know for a  fact that thousands of these individuals…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}]