[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…civic leadership, both for the city of  Fredericksburg and for her students in Stafford.\n\nWhether in city hall or in the classroom, she has made community a  cornerstone of her tenure as a public servant and educator. She has  also tirelessly worked to increase reading comprehension, counter the  harmful impacts of social media on young people, and she supports…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…from Merced  Community College in 2012. Ms. Fragoso has owned the Farmers Insurance  Agency in downtown Merced, with more than 20 years of insurance  expertise.\n\nDuring her tenure at the Merced County Hispanic Chamber of Commerce,  Ms. Fragoso helped secure an ARPA grant as part of the Re-open Merced  Businesses initiative. She was instrumental in another…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…courage.\n\nA graduate of the University of St. Thomas and the FBI National  Academy, Chief Tholen exemplified Minnesotan excellence throughout his  law enforcement career. His tenure includes a decade in the patrol  division, where he served as a field training officer, a defensive  tactics instructor, and a member of the Southwest Metro SWAT Team  Consortium.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…serve as  the President and General Manager of WPVI beginning in 2007, making him  the longest-serving General Manager in the station's history.\n\nThroughout the entirety of his tenure, Prazenica played a critical  role in maintaining WPVI's status as the home of the most-watched local  news broadcast in Philadelphia, Action News, a title which the station…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…the pleasure of working  with Ambassador Rudd on some of the most pressing challenges of our  time.\n\nWith his departure, we are going to bid farewell to a statesman whose  tenure has strengthened the bonds between Australia and the United  States and upheld the values we share.\n\nFrom the day Ambassador Rudd arrived in Washington on March 2023, he  proved…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Grandview.  Leading with kindness, service, and compassion, Jim served as a  Grandview Alderman for 40 years and remained active on the Parks and  Recreation Commission during his tenure. Jim's dedication to the  constituents of Grandview is evident through the various groups he was  involved in, including serving as Board Director for the Grandview  Assistance…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the career of David  Caron as he retires after over eight years of service as Town  Administrator of Derry. Throughout his tenure, Dave has been a  tremendous public servant in his role, overseeing all the day-to-day  operations of Derry Town Departments.\n\nDave has managed numerous projects to improve…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…representing the Village of Skokie  for the entirety of my congressional career, and George Van Dusen has  been a fierce and effective advocate for his community throughout my  tenure. George was a partner who I knew I could rely upon, and my staff  and I took every possible opportunity to work with him and his team.\n\nMayor Van Dusen has dedicated 52 years…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688871/recognizing-the-career-of-skokie-mayor-george-van-dusen"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…thrive as the county's largest  employer, generating an estimated $4.6 billion annually and supporting  more than 24,000 military, civilian, and contractor jobs.\n\nThroughout his tenure, Gene represented the interests of Naval Base  Ventura County with distinction, communicating its needs and priorities  to local government leaders, educational institutions,…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…inquisitive questioner of the  parties before her. And whether she authors majority opinions or  dissents, she always demonstrates a brilliant legal mind.\n\nJust a year into her tenure on the Court, Justice Jackson's first  major opinion reaffirmed that Medicaid patients unlawfully denied care  or abused by healthcare providers can sue under section 1983.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…our region is worth celebrating and  commemorating.\n\nMr. Gilbert became Executive Director of NOVA Parks in 2005 after  serving many years on the NOVA Parks Board. During his tenure as  Executive Director, Mr. Gilbert remained steadfastly dedicated to  public service in land acquisition, conservation, and management.\n\nUnder Mr. Gilbert's visionary leadership,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Engineering from the University of New Hampshire. He began working at  NHDOT early in his career in 1986 and has risen through the ranks of  the department throughout his tenure. Before his role as NHDOT  Commissioner, he served as the Final Design Supervisor, Preliminary  Design Section Head, Chief Project Manager, Assistant Director of  Project Development,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Yu will retire at the end of this year after over 25  years of distinguished service on the bench, including more than a  decade on the Washington State Supreme Court. Her tenure is marked by  an unwavering commitment to fairness, dignity, and equity for all. She  is a trailblazer, a champion for justice and a visionary leader in  Washington's legal…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Comptroller General comes to an end this month.\n\nFor 52 years, Gene Dodaro has served the American people as part of  the Government Accountability Office. During his 17-year tenure as head  of the agency, he has embodied GAO's core values of accountability,  integrity, and reliability, leading work that has resulted in more than  $1 trillion in taxpayer…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…would require Members of  Congress and their immediate family members to divest from individual  stock holdings or place them into a qualified blind trust during their  entire tenure in Congress.\n\nIn practice, it would ban Members of Congress from trading stocks.  This is just common sense. Members of Congress should be prohibited  from using nonpublic…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691213/stock-trading-ban-for-members-of-congress"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, I rise to recognize the  dedicated public service of Betty Bucher, who recently concluded a 16- year tenure as a member of Littlestown Borough Council in Adams County.\n\nDuring the December meeting of the borough council, Betty was honored  for the steady and reliable leadership that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698629/recognizing-the-dedicated-public-service-of-betty-bucher"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…years with discipline and courage. Afterward, he made the transition to  law enforcement, serving with the Fernandina Beach Police Department  and continuing with a 25-year tenure with the Nassau County Sheriff's  Office. As a sergeant, he led with integrity, mentoring officers and  strengthening public safety to ensure that his community remained safe.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Judge Knecht.            Recognizing James Collins, President of Loras College\n\nMr. LaHOOD. Mr. Speaker, I rise today to recognize Jim Collins for  his extraordinary 20-year tenure as president of Loras College in  Dubuque, Iowa. As the longest serving president in the school's  history, Jim has left a lasting impact on Iowa's oldest institution of  higher…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to honor Gary  Paul, who has concluded three decades of public service as a Richland  Township supervisor in Cambria County, Pennsylvania.\n\nGary Paul, throughout his 30-year tenure, has worked tirelessly as a  Geistown borough road foreman while maintaining his family farm, where  he also raises beef cattle.\n\nRecently, Gary was recognized for his dedication…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Force Academy.\n\nAfter graduating from the Academy and marrying his high school  sweetheart, Nancy, he went on to serve 26 years in the United States  Air Force.\n\nDuring his tenure, Rick would become the commander of the 32nd  Tactical Fighter Squadron Wolfhounds, later the 33rd Tactical Fighter  Wing. However, his most notable accomplishment came on…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…was a friend to many of us. He was  steadfast in fighting for what he believed in, but he was always  committed to bipartisanship where he thought we could agree.\n\nOver his tenure on this committee, I am proud to say we cosponsored  eight bills together, including the Mail Traffic Deaths Reporting Act,  the FedRAMP Authorization Act, and the Federal…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…his responsiveness  to residents, and his collaborative approach to governing have made a  lasting and positive impact on the borough he loves.\n\nMayor Taylor's distinguished tenure in elected office is only one  chapter of a lifetime spent protecting and serving others. In 1972, he  answered the call to join the Langhorne Fire Department, beginning a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and was deployed to Vietnam. Upon returning from  Vietnam, Clark continued his federal service at Farmer's Home  Administration and then USDA Rural Development. During his tenure as a  Program Director, a role he served in until his retirement in September  2025, Clark was responsible for more than 3,700 obligations totaling  more than $2.4 billion…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699718/recognizing-mr-clark-d-thomas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Christopher began his near decade  long career on the Hill a year after graduating from Pepperdine  University in 2014. Christopher has served in many different roles  during his tenure and worked for Representatives Sean Duffy (WI-07),  Keith Rothfus (PA-12), Jim Sessenbrenner (WI-05), and Brad Wenstrup  (OH-02). I came to know Christopher when he began working…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of the  strategic management team. His leadership has strengthened PCCA's core  capabilities, driving innovation and excellence in pharmaceutical  compounding.\n\nPrior to his tenure, Mr. Smith leveraged his expertise in home  health, specialty medicine, respiratory pharmacy, long-term care  pharmacy, and compounding support, demonstrating his commitment…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise today to congratulate Kumara  Jayasuriya on his remarkable tenure as the president of Southwest  Minnesota State University.\n\nUnder President Jayasuriya's leadership, SMSU thrived. In a period  where most Minnesota schools saw an enrollment…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690729/congratulations-to-president-kumara-jayasuriya-on-his-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…support Rocklin's local businesses and  economy, and built a legacy that will continue to shape the Rocklin  community for many years to come.\n\nLike any 20-year period, her tenure as CEO came with its fair share  of unique challenges. One example is the important role that she played  in minimizing the impact of the extraordinary challenges that arose…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…in  America. Dale has also been a great friend, we've shared many  conversations about leadership, community, and our love of baseball. I  congratulate him on his remarkable tenure and thank him for  representing the very best of Texas.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696653/recognizing-dale-petroskey"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…service on the Mono County Board of  Education to fulfill her mission of providing what she described as a  ``good solid education'' to the students of her community.\n\nDuring her tenure as a board member, Kathy continuously advocated for  the support and services of the Mono County Office of Education and  Mono County Public Libraries.\n\nWith the education…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…crisis communication plans and  procedures, serving as the base liaison with state and federal  legislators, and overseeing a $1.3 million audiovisual contract.\n\nDuring his tenure, Mr. George Woodward led public relations efforts  on critical developments at Sheppard Air Force base, such as the base's  groundbreaking on a $27 million Child Development…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}]