[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…foster care, and less likely to experience poor  health.\n\nI am proud to serve in Congress with notable Head Start alumni, such  as my colleagues Representative Tony Gonzales, Teresa Leger Fernandez,  Andre Carson, Jahana Hayes, and of course, Georgia's very own Senator  Raphael Warnock.\n\nSadly, over the last 60 years, the transformational legacy of Project…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…achievements in  interfaith dialogue. As this year's Templeton Prize Laureate,  Ecumenical Patriarch Bartholomew will join the esteemed ranks of past  recipients, including Mother Teresa, the Dalai Lama, and Archbishop  Desmond Tutu.\n\nHis All-Holiness has been a pioneer in merging spirituality with  science as a force for change. As head of the Eastern Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and highly  impressive honor of being awarded the 2025 Templeton Prize, which  recognizes spiritual and scientific advancement. The award puts him in  the company of Mother Teresa, the Dalai Lama, King Abdullah, Jane  Goodall, and Francis Collins--men and women from all walks of life who  have made contributions to understanding the universe and humanity's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…harmonization of faith and science in service of environmental  protection. The Templeton Prize, given to singular champions of human  dignity and progress such as Mother Teresa and Archbishop Desmond Tutu,  honors people who have harnessed the power of the sciences to explore  the deepest questions of the universe and humankind's place and purpose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…prestigious Templeton Prize for his outstanding  contributions to the advancement of science and spirituality. He will  join the company of other spiritual leaders like Mother Teresa and the  Dalai Lama. I am honored to add my voice to the chorus of others who  welcome the Ecumenical Patriarch to the United States and honor him for  his lifetime of incredible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…of  the Anaheim Car Club, where he gave back to the community that meant so  much to him.\n\nAbove all, Gilbert's heart belonged to his family. Married to his  beloved wife, Teresa, he was a father, stepfather, and proud  grandfather. His kindness, strength, humor, and work ethic touched all  of us.\n\nMr. Speaker, Gilbert will be missed.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Julia Mejia,                                    Boston City Councilor At-Large.                                __________\n\nMy name is Maria Teresa Nagel, I am the Director of       Immigrant Affairs in the City of Somerville, MA, and I am       here in strong opposition to the termination of TPS for       Haitians.\n\nHaitians…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise to recognize Sister Teresa Lynch, who  will be retiring from Santa Ana's Saint Anne School.\n\nShe served as a teacher for 31 years and principal for 19 years at  Saint Genevieve and Saint Anne School.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693061/recognizing-sister-teresa-lynch"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…All-Holiness is  visiting Washington, D.C. in conjunction with his acceptance of the  distinguished Templeton Prize in New York City--an honor previously  bestowed on Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu,  among others. While here, he will visit both the White House and the  Congress.\n\nElected in October 1991 as the 270th Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…service and leadership has placed him among the illustrious company of  previous Templeton Prize honorees--The Dalai Lama, Desmond Tutu, and  the first ever recipient, Mother Teresa.\n\nAs His All-Holiness reminds us, ``We have it in our power either to  increase the hurt inflicted on our world or to contribute toward its  healing. The choice is ours.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…revolutionaries, Time Magazine named him as one of the world's most  influential people. Now, he is being rightfully honored with the  Templeton Prize, previously received by Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu, among others. Congratulations to  Ecumenical Patriarch Bartholomew on this honor and I thank him for his  life of service.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership but his  unwavering witness for peace, human dignity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…recognizing those who use the power of  science to explore the deepest questions of the universe and  humankind's place and purpose within it. Previous recipients include  St. Teresa of Kolkata and the Dalai Lama.\n\nMr. Speaker, I am proud to celebrate the work of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the statute of limitations that has shielded  horrific criminals like Jeffrey Epstein and denied survivors of the  ability to hold them accountable.\n\nI thank Representative Teresa Leger Fernandez of New Mexico for  working with me on this bill.\n\nFor years, survivors who were abused, trafficked, and exploited by  Jeffrey Epstein were ignored by the justice…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Foundation recognizes pioneers of scientific and  spiritual insight for their contributions to human well-being and  spiritual prosperity. Previous award recipients include Mother Teresa,  Archbishop Desmond Tutu, and Nelson Mandela. On behalf of New York's  20th Congressional District, I congratulate His All Holiness  Bartholomew on receiving this great honor.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York, an honor once bestowed  on Mother Teresa, the Dalai Lama, Archbishop Desmond Tutu, and Nelson  Mandela--leaders whose lives have testified to the power of faith to  transcend borders.\n\nAs a Catholic, I am deeply moved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…he will be recognized as this year's  recipient of the prestigious Templeton Prize, an award that has been  garnered in the past by great historical figures such as Mother Teresa,  the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits to the United States, His All Holiness has had  visitations with five Presidents, he has spoken to both…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to faith, peace, and science.\n\nMr. Speaker, it is fitting that we welcome His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…President Trump at the White  House. This visit coincides with his receipt of the Templeton Prize, a  prestigious award previously bestowed upon renowned figures such as  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nFor decades, His All-Holiness has been a steadfast advocate for  religious freedom and unity among Christians worldwide. He has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Caitlyn Murphy,       Hashmita Nittala, Gabriel Parsons, Adhya Penati, Hansa Samur,       Shivangi Singh, Amrit Singh, Katherine Sullivan, Saatvik       Sunilraj, Ella VanStory, Teresa Maria Vithoulkas, Manya       Yellepeddy, Sulenur Zirekoglu\n\nVT: Alexander Califano, Matthew Califano\n\nWA: Aubrey Jane Moore, Julian Roger, Shawna Sanjay, Simone       Shenoi,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Patriarch has played throughout his lifetime.  Historic international figures who received the Congressional Gold  Medal immediately before and after His All-Holiness were Mother Teresa  and Nelson Mandela.\n\nWe also acknowledge the extraordinary historic role His All-Holiness  has served as the longest tenured Ecumenical Patriarch in history. It  is significant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…mothers and children--including the unborn. Since  her announced retirement last year, she has continued to oversee the  Saint Gianna Molla Pregnancy Outreach Centers and Mother Teresa Home in  Western New York.\n\nThe Saint Gianna Molla Pregnancy Outreach Centers have a tangible  impact on our community, providing important material, emotional, and  spiritual…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689281/recognizing-cheryl-calire-for-her-steadfast-service-and-dedication-to-the-saint-gianna-molla-pregnancy-outreach-center"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Teresa Piechowicz has made to our community as a  volunteer with the Hernando County Family YMCA. The Hernando County  Family YMCA is more than just a place--it's a community, a support…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Wagon, a nonprofit health care organization that has served  the medically underserved in Central Appalachia for over four decades  (including chief executive officer, Dr. Teresa Gardner Tyson, DNP;  clinical director, Dr. Paula Meade Collins, DNP);\n\nRemote Area Medical (RAM), which organizes annual pop-up clinics  providing free medical, dental, and…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…on the Papio-Missouri River  Natural Resources District Board, and as a founding member of 100 Black  Men of Omaha leave a great mark in our city.\n\nMr. Conley and his wife, Teresa, have three children and have resided  in the same North Omaha district they have dedicated themselves to for  over 40 years.\n\nEarsul Banks IV exemplifies resilience, resilience…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…is visiting our Nation's Capital in conjunction with  his acceptance of the prestigious Templeton Prize, an award which has  been received by faith leaders including Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. The Greek Orthodox community in Ohio and  across the country take great pride in this recognition of their faith  leader's global…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695552/welcoming-ecumenical-patriarch-bartholomew"}]