[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…for authoritarian overreach.\n\nThis package guts essential investments in international development  and humanitarian programs, lifesaving tools that fight disease, prevent  terrorism, supports democracy, and open markets for American  businesses.\n\nHere is the kicker, Mr. Speaker: Congress approved this funding just  2 months ago, and Donald Trump signed…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…bill. I  just want to point out that this is a national security issue because  when starvation and famine are permitted to progress unimpeded around  the world, it yields terrorism, increased violence, and extremism that  is a risk to our own Nation's defense.\n\nWhen we step back, our adversaries, like China, step in to save the  day in the developing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695224/restore-lifesaving-food-aid-for-children"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…countries. But  I also admit that the UAE and, most especially, Qatar have been allies  of the United States. We have worked together in our efforts, for  instance, to combat terrorism in the region. Qatar specifically has, at  times, been a heroic partner of the United States. We would never have  been able to rescue thousands of Americans and American…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…somehow it  has become politicized to the point where people can't even acknowledge  what they were saying at the time. We had Republican leaders who were  describing it as terrorism and saying it was absolutely inexcusable and  indefensible. Now, all of a sudden, we have the majority which will not  even follow the law by posting a plaque in honor of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…their family to  stay where they are and risk that they will be in the path of the  bombing campaign?                                   ____\n\nThe definition of international terrorism in our law--title 18  section 2331--includes violent actions that are intended to intimidate  or coerce a civilian population. And what is coercion and intimidation  more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Never before at the United Nations has any U.S.  President ever stood with the dictators of Russia.\n\nThose countries that voted with Russia yesterday are state sponsors  of terrorism. Russia understands terror. That is what she does. For the  United States to stand beside Russia, North Korea, and Belarus at the  United Nations, it is appalling. It is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…what happened in Venezuela just a few days ago when  Mr. Maduro was removed from power and brought to the United States to  be held accountable for his actions in narcotics terrorism.\n\nThis is not a new issue to me. In 2018, I took a trip to Caracas and  met with President Maduro, his First Lady, and members of his  administration. It was clear to me…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…safe, secure, and credible nuclear deterrents that power our  unparalleled, remarkable nuclear Navy--thank God for them--and counter  the threat of nuclear proliferation and terrorism.\n\nMr. Speaker, I urge my colleagues to support this bill. America can  and must meet the new-age frontiers of energy and water. Let us invest  in our workers, protect our…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…have  weakened the ATF, making it easier for guns to fall into the wrong  hands and for gun crimes to go unsolved. They even disbanded key  initiatives that tracked domestic terrorism and hate crimes tied to gun  violence.\n\nThese decisions are not just reckless. They are deadly, making it  easier for violence to spread, for lives to be shattered, and for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…lasting peace in the region will require the  creative leadership and hard work of statesmen and stateswomen. It is  past time to break out of the brutal and circular logic of terrorism  and violence and war and instead address the underlying political  problems destabilizing the region. We must stay united around these  goals and committed to the continuation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…out. Now, they would like his memory to go  down that Orwellian black hole so nobody remembers him or so nobody  remembers the things the Republicans said. They called it terrorism at  the time, but now it is inconvenient.\n\nDonald Trump doesn't want police officers being honored for the work  they did defending our Constitution, our democracy, our Capitol,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…missed roll  call votes numbered 286 through 288.\n\nHad I been present, I would have voted:\n\nYea on Roll Call No. 286, H.R. 1608--The Department of Homeland  Security Vehicular Terrorism Prevention and Mitigation Act of 2025;\n\nYea on Roll Call No. 287, H.R. 2659--The Strengthening Cyber  Resilience Against State-Sponsored Threats Act; and\n\nYea on Roll Call…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696780/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…crime, and crime against women.\n\nWould my colleague work with me to oppose that suggestion in the  President's budget? They want to cut $646 million from FEMA for  violence and terrorism prevention. Why do they want to do that? I have  no idea.\n\nThey want to cut $545 million from the FBI, cutting its workforce by  more than 2,000 personnel. That sounds like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Qaida. By Secretary Hegseth's own logic, this current operation  requires congressional authorization.\n\nBut there is a deeper problem with the administration's analogy to  terrorism. Terrorists pursue political objectives. Cartels pursue  profit and power. They are criminals, not ideological combatants waging  war against the United States. If the White…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…you  supported with your proxy votes--and I appreciate that--to take action  against Russia's aggression in Ukraine.\n\nOne bill will designate Russia as a state sponsor of terrorism  because of what they have done to kidnap Ukrainian children. One will  stop Chinese entities from supporting Russia's brutal war machine  against Ukraine. And the final…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696340/trump-administration"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…inserting ``or harm resulting from       cyber incidents, transnational organized crime, or foreign       state threats'' after ``loss''.\n\n(c) Facility Visit by State Sponsor of Terrorism.--Section       70011(b) of title 46, United States Code, is amended--\n\n(1) in paragraph (3) by striking ``and'' at the end;\n\n(2) in paragraph (4) by striking the period…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…MANN. Mr. Speaker, thanks to the leadership of President Trump,  America and the world are safer today than we were a week ago. Iran,  the world's leading state sponsor of terrorism, is no longer on the  verge of obtaining a nuclear weapon. They have agreed to a ceasefire  with Israel. President Trump is fulfilling his campaign promise of  promises made,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…suspend the rules and pass  the bill (H.R. 1608) to require the Secretary of Homeland Security to  produce a report on emerging threats and countermeasures related to  vehicular terrorism, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1608\n\nBe it enacted…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Joint Service Commendation Medal, Army Commendation Medal (4th  award), Army Achievement Medal (6th award), Army Good Conduct Medal,  Humanitarian Service Medal, Global War on Terrorism Expeditionary  Medal, Korea Defense Service Medal, Kuwait Liberation Medal (Kuwait),  Southwest Asia Service Medal, Armed Forces Reserve Medal, Army Superior  Unit Award,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…and  protecting their employment rights.\n\nA ``yes'' vote on House Resolution 1032 enables us to consider  legislation that funds the Department of the Treasury's Office of  Terrorism and Financial Intelligence, a critical component of our  national security that disrupts and disables terrorists, criminals, and  other direct threats to American citizens,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…world. Now is the time to rededicate ourselves to the God-given right  to live in peace and safety of Jewish people both in Israel and across  the globe. We must condemn terrorism. We must condemn anti-Semitism,  and we must call it out for what it is: pure evil.\n\nOur support of Israel must never ever waver, and our response to  anti-Semitism must…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…investments that are being made because of,  I believe, significant anticipation of the vote that just occurred  tonight.\n\nIn conclusion, God bless our troops as the global war on terrorism  continues while the people of Ukraine continue to successfully stop war  criminal Putin who is trying to resurrect the failed Soviet Union,  killing so many people in Ukraine,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…National Intelligence  Tulsi Gabbard of new information. My office has been told that of the  more than 100,000 Afghan evacuees, as of August 2022, 1.6 percent had  links to terrorism or other derogatory information. It happens that  that is over 1,600 people who, at that time, posed a potential threat  to our homeland and our people.\n\nAt that time, all…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693254/afghan-evacuees"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…terrorists and hostile regimes weaponize technology for illicit  finances and cybercrime. That includes the use of anonymous digital  platforms to launder money, to fund terrorism, and to bypass the very  sanctions this Chamber has helped lead.\n\nHowever, the transparency and traceability of blockchain enhances our  law enforcement's ability to intercept…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…people, the region, and the world at large.  The United States must stand with the Iranian people in this critical  moment.\n\nFor decades, the Iranian dictatorship has exported terrorism  throughout the Middle East and beyond, while tormenting its own people.  At this moment, it has shut down communications nationwide and is  inflicting violence and death…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698899/standing-with-brave-iranians"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Achievement Medal, two Marine Corps  Good Conduct Medals, the National Defense Service Medal, the  Afghanistan Campaign Medal with one Bronze Service Star, the Global War  on Terrorism Service Medal, the Sea Service Deployment Ribbon with one  Bronze Service Star, and the Presidential Unit Citation.\n\nFollowing his honorable discharge in 2023, Mr. Moceri…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern history, a time marked by  violence, narco-terrorism, and instability. Through his bold and  visionary ``Democratic Security'' policy, President Uribe restored law  and order, dismantled the strongholds of terrorist organizations…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…massive blow to Iran's  nuclear program, bolstered American credibility, and strengthened U.S.  and Israel leverage to end Iran's pursuit of nuclear weapons and its  support for terrorism for good.\n\nThanks to Israel's historic efforts for more than a year and a half,  Iran's ability to threaten regional stability is massively degraded.  Not since before the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…flags is hard to grasp: drag shows on  ships and military installations; base security training teaching  guards that pro-life bumper stickers were indicators of possible  terrorism; and taxpayer-funded gender transition and hormone treatments  that kept soldiers nondeployable or nontrainable for years. The list  goes on, but the point remains.\n\nEven…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Course,  and the Maneuver Captain's Career Course. His service has been  recognized with the Joint Service Commendation Medal, the Army  Commendation Medal, the Global War on Terrorism Expeditionary Medal,  and several other awards and decorations. He is also a proud Silver  Spur holder and recipient of the Order of St. George.\n\nMr. Speaker, Captain Retzlaff's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}]