[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…they pay rent. When they cross  national parks, they pay fees, but somehow marine sanctuaries are  supposed to be free. That is nothing more than a corporate giveaway and  a terrible precedent that won't stop with our marine sanctuaries.\n\nThe sponsors wrapped this handout in national security rhetoric. We  have already heard some of it from the chairman.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…GARAMENDI. Mr. Speaker, I rise today to mark the 15th annual  International Day Against Nuclear Tests, observed each year on August  29th. This day serves as both a reminder of the terrible human and  environmental toll of nuclear testing and a call to action as the world  confronts new dangers of nuclear proliferation and a fraying arms  control architecture.…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Defense and  Director of National Intelligence, on the death of American-Palestinian  Journalist, Shireen Abu Akleh. I send my deep condolences to the Abu  Akleh family for this terrible killing and continue to stand with them  to demand justice and accountability.\n\nShireen Abu Akleh, an American-Palestinian Journalist, was killed on  May 11, 2022. She was…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…else in this country.\n\nThe problem is that 10 years ago, when he was 4 years old, Conner was  diagnosed with Duchenne muscular dystrophy. Duchenne muscular dystrophy  is a terrible disease. Your muscles waste away, including your heart  and your lung muscles. As a consequence, people who have this terrible  diagnosis tend to live between 20 and 30 years.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…again putting our beloved Boundary  Waters at risk of toxic pollution from a foreign-owned mine.\n\nIf that weren't enough to convince my colleagues that this resolution  is a terrible idea, I will briefly touch on the abuse of the  Congressional Review Act itself that this resolution represents.\n\nThe Congressional Review Act, or CRA, has been used to overturn…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…making sure that we had the resources and the means  that we needed, making sure that we understood that the State of  Florida was standing there to support us in spite of the terrible  tragedy that we had suffered. That money, those funds, were allocated  from the Crime Victims Fund.\n\nSo, once again, having actually lived through this experience, I know…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…out of  Ohio. Yet, for two consecutive Congresses, House Republican leadership  has refused to even give the bill a hearing. That is not gridlock. That  is a decision and a terrible one at that. It is a decision to put  profits over people.\n\nSince the derailment, President Trump, Vice President Vance, members  of the Cabinet, and Ohio Republicans have…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hostage and tragically murdered by Hamas on  the border of Gaza on October 7. After months of fighting for his  return, Itay's family learned that he was also murdered that terrible  day.\n\nThis is the depths of Hamas' cruelty. For months, they refused to  even acknowledge that Omer and Itay had been murdered. They kept these  families in anguish, in the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…prescription drugs are expensive.  It is not why housing is expensive. It is that corruption and those  villains who want you thinking that when they are the ones who made  life terrible for people.\n\nWe know the real root of the problem is corruption and corporate  power run amok. Too many have been pathetic at talking about corruption  and showing that they…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…wildlife, and despoil our ecosystems.\n\nIt is the plan of giving fossil fuel companies the power to bypass  the public comment period so the public can't weigh in about the  terrible ideas the fossil fuel companies are putting forward.\n\nThe public can't weigh in about the drilling rigs and the leaky  pipelines and the export terminals polluting their communities.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…possible its long-      harbored vision of a state-of-the-art money museum, a dream       that has proved elusive in New York.\n\n``One of our members said that this will mean a terrible       loss to New York City,'' the society's executive director,       Ute Wartenberg Kagan, said. ``But if no one uses it, what's       the loss?''\n\nWartenberg Kagan, a scholar…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…all of the  people who work here.\n\nMr. Speaker, I am happy to yield to the gentleman if he wants to  condemn the pardons that Trump gave to all those who committed these  terrible crimes on that horrific day.\n\nSilence.\n\nWe can't even get the Speaker of the House to hang a plaque honoring  the men and women in law enforcement who defended us.\n\nWhat is…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…organizing this Special Order this evening.\n\nI am Laura Friedman, and I represent the 30th Congressional District  in Los Angeles, a district that has really undergone a terrible tragedy  with fires, for which we are very much hoping for the kind of support  from the Federal Government that so many other regions have received  unconditionally after…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…restricted  the aid that is necessary to get in, has interfered with organizations  that were delivering aid, and it is resulting in an extension of the  suffering.\n\nWars are terrible, not always avoidable. But after the horrors of  World War II, we had, as part of the international community, the  Geneva Conventions. It stated that collective punishment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…There have been 45 deaths and counting under Donald  Trump's tyranny.\n\nIn what moral nation would the penalty for seeking a better life for  yourself or your neighbors be a terrible death?\n\nIn what decent society would the government deploy propaganda to  convince the masses that its victims deserved their fate?\n\nCatching an ICE agent in a bad mood should…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…costs continue to spiral out of control.\n\nHowever, it is also true that suddenly withdrawing premium support  from 22 million Americans is going to force those folks into a terrible  dilemma: either paying hundreds or thousands of dollars more, so they  face hard trade-offs for their families, losing their insurance  altogether in a way that will impact…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…rule. I don't want to live where my  representatives cannot speak for me and have a check and balance on  power.\n\nOne person can make a mistake. And guess what: Tariffs are a terrible  mistake. They don't work. They will lead to higher prices. They are a  tax, and they have historically been bad for our economy.\n\nBut even if this were something that was…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…pledging that his caucus will be  united against it, barrelling us toward a potential government shutdown  that would very much not be in the interests of anyone and would be  terrible for the country as a whole.\n\nThe minority leader in the Senate has not been abundantly clear as to  what exactly he is looking for in order to avoid this outcome. After  all,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695800/continuing-resolution-compromise"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…of the rhetoric--mostly not on this floor, let  me say that--that I have heard in the country about comparing law  enforcement officers to the gestapo or the Nazis, that is terrible.  That is not true. That is not who they are. That is not what they do.  That kind of rhetoric, when we hear it and wherever we hear it from, is  dangerous and reckless and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…especially for students in  underserved communities.\n\nThe bill is so bad and disgraceful that almost 20 Democrats just  didn't even vote at all. They abstained. They knew it was terrible, but  they didn't want to go against their party, the Governor, or special  interests. They simply abstained from the vote.\n\nThis is a measure that absolutely cannot be allowed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…hookups in new construction starting in 2026. That means  families in western New York, where winters are long, snow is great,  and it is cold and oftentimes dangerous in these terrible winter  storms, they will be denied the ability to choose the energy source  that best keeps them safe and warm in their homes. Taking affordable  and reliable options off…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…last year.\n\nIt is also worth pointing out, by the way, that 2 years ago almost to  the day, we were here. Those of us who thought that ``bipartisan  immigration plan'' was terrible--and it was, which is why it fell  apart; it made illegal immigration easier--we had to hold the floor all  weekend long--in a bipartisan affair, by the way--to get Ukraine…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…office.\n\nOther than a single letter the ranking member wrote in 2019, a single  letter, not one Democrat on the committee spoke out about Epstein or  his victims of this very terrible tragedy, other than to say he didn't  like the plea deal.\n\nMr. Speaker, let me say this: When they stand here today, insisting  how badly they want these files released, why…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…I wanted to take a  moment to share my prayerful solidarity with my brother from Georgia  because he had a family member, a young girl who was unfortunately lost  in that terrible flood, and I bring that up because we were all  affected by it. We had so many loved ones who were impacted, but the  faith of that community and the faith of the people in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…some time.\n\nNo one wants this, not Democrats in the House and not Republicans in  the House. I have people coming up to me constantly agreeing that what  is going on is a terrible thing for the country. It is going to  stratify and polarize representation like never before. You are going  to have more and more State delegations, Mr. Speaker, that are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…August at the convention.\n\nLisa McGovern dedicated herself to helping families deal with cancer  at Prevent Cancer Foundation. Lisa knows directly what it is like to  see that terrible disease impact a young and promising life and how it,  therefore, impacts the entire family.\n\nJim has one of the biggest hearts I know. He stands up on this floor  every week…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…DUI-related charge.\n\nThis issue hits home for me. In my district, a 15-year-old girl and  her grandmother were killed by an illegal alien who was driving drunk.  This was a terrible, avoidable tragedy. Sadly, true justice was not  served. The assailant received only 15 years per death and will be out  to roam free in America by the time he is 67 years…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…colleagues on the other side  of the aisle refuse to acknowledge any program that they don't think  they can just continue to shovel money out from, despite the fact it  has terrible outcomes.\n\nMedicaid is debilitating the vulnerable, not helping them. We are  shoveling money out to the able-bodied on the back of expansion of  ObamaCare. We are crippling…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…balance in 5 years. A few years later, I introduced it again; it  was a two-penny plan. Then came the pandemic. We spent so much money.  We closed the economy down. We did such terrible things to the country,  and now it is a six-penny plan. It takes a 6-percent cut.\n\nHow can we possibly survive a 6-percent cut?\n\nI will tell you how I present it to people.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…it happen, so they got it.\n\nNow, over on the House side, the Democratic whip made it very clear  during a recent interview--and I will quote her. She said:\n\nShutdowns are terrible, and of course there will be       families that are going to suffer. . . . But it is one of the       few leverage times we have.\n\nSo to the American people, realize that…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]