[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…1983--I think it was passed in 1871-- says that ``Every person who, under color of any statute, ordinance,  regulation, custom, or usage''--and it now says--``of any State or  Territory or the District of Columbia,'' and so on, becomes liable,  becomes legally responsible, and citizens can seek redress against that  individual. They have legal recourse in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the  murderer.\n\nTrump is joining a rogues' gallery of lesser dictators to deny  Putin's murderous invasion, his war crimes, and a demand that he return  occupied Ukrainian territory. Trump, ``the great appeaser,'' is joined  in this appalling wrong by House Republican accomplices.\n\nWhile Ukrainians dodge bullets and missiles and are risking death  daily,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…centers,  domestic violence shelters, child advocacy programs, and services for  survivors like me of homicide, assault, and human trafficking in every  State and in every territory. It pays for counseling, emergency  shelters, legal aid, and lost wages.\n\nIn short, the Crime Victims Fund is the bedrock of our Nation's  promise to help victims rebuild…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Listen to me when I tell you that he is not joking. When he says he  wants to take over Canada, Greenland, and Panama, he means it. He even  said that we will ``[expand] our territory'' in his inaugural speech.  When was the last time you heard a President say something like that?\n\nThe American people do not want to take over other countries. Nobody  voted…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…vote in D.C., a person must maintain their  residency in D.C. for at least 30 days before the election and cannot  claim voting residence or the right to vote in any State, territory, or  country.\n\nIn a letter to Congress, the D.C. Board of Elections made it clear  that to vote in a D.C. local election, a foreign diplomat would have to  ``effectively…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Constitution to this body is outrageous. It has never been done  before, not in Trump's first term, not by Bush, not by Reagan, not by  Clinton, not by Obama. We are in new territory here in our country  where we see a President encroaching upon our powers. I can't be  complicit in that.\n\nEverybody in this body--I would never question any of my colleagues…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…under       consideration by the Senate. The Act provides for the       issuance of a congressional joint resolution declaring the       admittance as a State of most of the territory currently       comprising the District of Columbia, while the seat of       government (defined as the ``Capital'') will fall outside of       the boundaries of the new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…under       consideration by the Senate. The Act provides for the       issuance of a congressional joint resolution declaring the       admittance as a State of most of the territory currently       comprising the District of Columbia, while the seat of       government (defined as the ``Capital'') will fall outside of       the boundaries of the new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press reports, Donald Trump is considering military  action on Venezuelan territory. But it also sounds like nobody really  knows what the plan is because, like so many other things with Donald  Trump, he keeps changing his mind. Who knows what he will do…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…seat for 22 years. But because of the quirky law in  Illinois, the Democrats got to draw the map, so I got a map against the  Republican incumbent which was 40 percent new territory. I had a  chance. And 1982 was a big year for Democrats. I remember it. I still  remember my fear: Would I raise enough money to be a viable candidate?  Nobody knew for sure.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…located on the Black Sea, is no stranger to  larger geopolitical forces. Russia invaded Georgia in 2008 during the  Beijing Olympics and proceeded to occupy 20 percent of its territory.  Despite the persistent threat from Russia, Georgians continued to forge  forward with democratic reforms and even made significant contributions  to the wars in Iraq and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…care to veterans residing in American Samoa, Guam, the  Commonwealth of the Northern Mariana Islands, the Commonwealth of  Puerto Rico, the U.S. Virgin Islands, and any other territory or  possession of the United States. It will also allow the traveling VA  physician to coordinate with nondepartment medical providers as  necessary to provide care. I thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Nigeria, Somalia, Syria, and Yemen. He bombed Venezuela and now says  that we are running the country, whatever the hell that means. He is  also threatening to take an autonomous territory from Denmark, a NATO  ally.\n\nLet's go over another failure. Donald Trump promised ICE would only  deport the worst of the worst. Guess what. That is not true. ICE agents…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…agreement, but we do know it will  take years, if not decades, to see substantial returns.\n\nA large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary Hegseth's comments about the forfeiture of Ukraine's…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…States maritime domain and the Marine Transportation System,       and deny the use and exploitation of the maritime domain as a       means for attacks on United States territory, population,       vessels, and critical infrastructure.\n\n``(B) Drug interdiction.--Engage in maritime air       surveillance or maritime interdiction to enforce or assist…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…States of California, Colorado,       Connecticut, Illinois, Indiana, Iowa, Michigan, Missouri, New       Jersey, Ohio, Pennsylvania, and Wisconsin and any other State       or territory of       the United States the Secretary determines appropriate in       addition to and in the same manner as each of the States to       which the original depredation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ordinary  Americans, contrary to the Democratic talking points.\n\nYou know, I have been here working in Washington--or what I like to  call the forward operating base in hostile territory--for some time  now, and the truth is, you get these prevailing narratives that get  repeated over and over and over again and written about by the press  that simply have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…is his dream, but it is a lie. The facts show that  Putin is nowhere close to winning. Here are the facts: During the year  2024, Russia captured 0.6 percent of Ukrainian territory. Last year, it  captured 0.8 percent. So 2 years of massive, tragic bloodshed caused by  Vladimir Putin has resulted in 1.4 percent of enemy territory taken.\n\nSo he is bad…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…River Watershed, the Boundary Waters Canoe Area Wilderness       (BWCAW), the Boundary Waters Canoe Area Wilderness Mining       Protection Area (MPA), and the 1854 Ceded Territory of the       Lake Superior Chippewa in northeastern Minnesota from the       potential adverse effects of mineral and geothermal       exploration and development.\n\nDATES:…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…in a television  interview.\n\nLet me give you some facts about Denmark, for example. Denmark, which  has responsibility for Greenland--although, Greenland is an autonomous  territory under NATO. It is a part of the Kingdom of Denmark.\n\nBut let's talk about Denmark for a minute. Denmark was one of NATO's  most disproportionately high contributors in Afghanistan,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…products).\n\n(D) Identifying consumer products required by section 17(a)       of the Consumer Product Safety Act (15 U.S.C. 2066(a)) to be       refused admission into the customs territory of the United       States.\n\n(2) Consistent with section 6 of the Consumer Product       Safety Act (15 U.S.C. 2055), consult with the following:\n\n(A) Technologists, data…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…beyond a traditional alliance. It is both  economic and military. Palauan citizens can live, work, and study in  the United States, while U.S. forces have access to Palauan territory  under the ironclad guarantee of American defense. That partnership, it  is strengthened by the fact that Palau has continued to maintain  diplomatic ties with Taiwan, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…a major milestone for fish and wildlife conservation. Statewide action  plans serve as a vital blueprint for identifying the unique  conservation needs of each State and territory and are required for  States to take part in the State and Tribal Wildlife Grant program.\n\nThese plans play a leading role in helping to prevent and recover  endangered species…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…apply to a presentation or other       communication made by or on behalf of an issuer which is made       at an event--\n\n(1) sponsored by--\n\n(A) the United States or any territory thereof, the       District of Columbia, any State, a federally recognized       Indian Tribe, a political subdivision of any State,       territory, or federally recognized…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…cartels are highly organized and militarized. They are  terrorist networks that have convinced my colleagues they are nothing  more than small street gangs.\n\nThey control territory, run armed convoys, use drones for  surveillance, and communicate through encrypted networks like the  military. They terrorize entire countries with extreme violence, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…I certainly rise in support of the  amendment. The amendment prohibits the expenditure of funds to create,  procure, or display any map that depicts Taiwan as part of the  territory of the People's Republic of China.\n\nLet's be clear: Taiwan is not a part of the People's Republic of  China. We should not appease the desires of the Communist Chinese  leadership…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…about restoring deterrence,  it would recognize how plans to reduce security cooperation with  frontline NATO allies invite more brazen Russian incursions into the  alliance's territory and airspace; it would recognize how China is  watching closely for signs of weakening American commitments to  European allies, to Ukraine, or to AUKUS partners.\n\nOf course,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…stack of wipes on all sides of the stack.\n\n(8) State.--The term ``State'' means each State of the       United States, the District of Columbia, and each       commonwealth, territory, or possession of the United States.\n\n(9) Symbol.--The term ``symbol'' means the ``Do Not Flush''       symbol, as depicted in the most recent edition of the       Guidelines…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…which such property's services are sold in       interstate commerce.\n\n(10) State.--The term ``State'' means each of the 50       States, the District of Columbia, and any territory or       possession of the United States.\n\n(11) Third-party online seller.--The term ``third-party       online seller'' means any person other than a hotel or short-…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}]