[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…through the door of a U.S. citizen and haul  them out in their underwear in the dead of winter, only to later  release them without charge, without apology, only with newfound terror  courtesy of the U.S. Federal Government.\n\nAgents with just 47 days of training are sweeping through American  cities; agents with barely over a month of training--just 47…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today to denounce the terror  campaign this administration has launched against our immigrant  neighbors.\n\nAt the direction of the Trump White House, masked Federal agents are  ripping children away from…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697132/immigrant-neighbors"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Iran Sanctions Act, or ISA, to constrict  Iran's energy sector, denying the Iranian regime needed funds to grow  its nefarious nuclear program and carry out state-sponsored terror  activities.\n\nOriginally passed into law in 1996, the ISA has been the key  statutory element undergirding our sanctions infrastructure against  Iran. The ISA provides secondary…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…retire  as a First Sergeant.\n\nFollowing the tragic attacks on our Nation on September 11, 2001,  Sergeant Major Black deployed repeatedly to the frontlines of the  Global War on Terror. With the 2nd Battalion, 1st Marines, he completed  two combat deployments to Iraq during Operation Iraqi Freedom, and  later, with the 3rd Battalion, 7th Marines, he deployed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…be intimidated, and I will not stop demanding truth  and dignity for Silverio, William, or the children in Cicero, and for  every family who deserves to live free from state terror.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…toys, were strewn about in the  hallway. That raid and so many others shook our community, not just  immigrants, but everyone.\n\nNow, Secretary Noem has brought her reign of terror to Minneapolis  after she left Charlotte and Raleigh. We have all seen what happened.  An ICE officer shot and killed Renee Nicole Good in cold blood.\n\nWithout knowing any…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Speaker, a week ago, my congressional district suffered an  unimaginable tragedy when a terrorist by the name of Mohamed Soliman  drove over an hour to carry out a horrific act of terror in Boulder,  Colorado.\n\nThis attacker targeted Jewish members of the Boulder community,  literally trying to burn them alive with Molotov cocktails and  incendiary devices.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…that arresting  noncriminals is `` . . . our job.''\n\nIn Los Angeles, ICE has been racially profiling people,  indiscriminately arresting and holding people, causing fear and terror  in people of every legal status who simply look Latino or speak Spanish  or congregate on certain corners.\n\nToday's bill is just more of the same scapegoating and lying about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American people, especially the  families of those in harm's way, deserve nothing less. Confronting the  Iranian regime's nuclear ambitions--and stopping their campaign of  terror--demands strength, resolve, and strategic clarity.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginia from 2006 to  2010. I was Lieutenant Governor of Virginia before that. Like every  State in this country, Virginia was deeply, deeply affected by the  global War on Terror.\n\nWhen I was Governor of Virginia, I had the honor and responsibility-- but it was also a burden--of being the commander in chief of the  Virginia National Guard. That meant…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Republicans gave ICE a blank check last year, ICE used it to  kill American citizens. ICE now wants 2 more weeks' worth of money, no  strings attached, to keep their campaign of terror running smoothly.\n\nMr. Speaker, 2 weeks? Renee Good and Alex Pretti were murdered just 2  weeks apart. During those 2 weeks, 5-year-old Liam Ramos was used as  bait and detained,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699497/no-more-money-for-ice"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…as a  permanent cease-fire, an end to Hamas's threat to Israel.\n\nToday, I stand in solidarity with Israel. I believe in Israel's right  to self-defense against this kind of terror. We should commit ourselves  to take advantage of this window of opportunity. I hope that the peace  plan that is on the table will provide a path, as it should, to  everyone…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the court gutted section 5 and  section 4 effectively in the Shelby County v. Holder case.\n\nWe have seen Black and Brown communities, including American  citizens, living in terror as ICE agents show up on streets, door to  door, in our courthouses, and on the way to school, grabbing people and  violating their due process rights.\n\nWe have seen trade…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…glass in his eye when an ICE  vigilante smashed in his driver's side window and arrested him,  detained him first, and asked questions later.\n\nThis is not justice. This is terror, but I have a voice. I have a  voice for the people in my district. I have a voice for those who still  believe that the United States is the land of opportunity, just as the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…seized by the Nobel laureate scientist George Wald in a       widely reprinted 1969 anti-war speech at MIT. ``Nuclear       weapons offer us nothing but a balance of terror, and a       balance of terror is still terror,'' he said. ``We have to       get rid of those atomic weapons, here and everywhere. We       cannot live with them.''\n\nDuring…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Strategy  for School Security Act. Despite rising attacks against our Nation's  schools, there is currently no comprehensive Federal strategy to  protect schools from acts of terror.\n\nThis bill closes this dangerous gap, requiring DHS to produce a  school security strategy that identifies and works to mitigate  vulnerabilities. In doing so, our schools…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…the first to conduct air strikes on terrorist  sites in Afghanistan following the tragic events of September 11, 2001.\n\nHis leadership during the onset of the global war on terror left an  indelible mark on both his squadron and the larger Navy community.  After leading the squadron through its transition to the Super Hornet,  he was selected for an…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…hiring practices, and       provided unequal access to healthcare services.\n\n(7) PRC authorities have manipulated the strategic       objectives of the international war on terror to mask their       increasing cultural and religious oppression of the Muslim       population residing in the XUAR.\n\n(8) Following unrest in the region, in 2014, Chinese…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…which was a really  bad idea. That is why Trump pulled out.\n\nHere is the reporting over the period here:\n\nHamas-Iran alliance: Captured documents expose decades-long       terror funding.\n\nWhen Israel began to liberate Gaza from Hamas and drive out Hamas  terrorists, they found a treasure trove of documents showing the  history between Hamas, Hezbollah,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…how the UAE  has fought alongside the United States in Afghanistan and Iraq, is a  participant in the Global Coalition to Defeat ISIS, and is working  against Iran and its terror proxies. The debate would mention that the  UAE was the first Arab state to join the Abraham Accords when it  normalized relations with Israel in 2020. The discussion would…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of brave Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing limbs, shrapnel, nerve damage, brain injuries, burns, scars.  Some live with paralysis and are…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…weekend were precisely tailored to achieve that  limited, yet vital mission.\n\nLet's remember who we are dealing with here. The Iranian regime is  the world's foremost sponsor of terror. They have funded monsters,  sponsored violence, and sewn chaos far beyond their borders. Their all- consuming obsession is the obliteration of America's principal ally in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…not a single taxpayer dollar would be  sent to the Lebanese Armed Forces, a military force riddled with  Hezbollah sympathizers that acts as yet another proxy of the Iranian  terror regime.\n\nTo say that Hezbollah and its allies do not have any control over the  Lebanese state is just categorically false. Hezbollah and other terror  groups that operate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…thing to actually  take these on? Hell, no.\n\nMr. Speaker, I have talked to so many people on the Committee on Ways  and Means and other committees who basically look at me in terror and  run out of the room.\n\nThe political consultants care more about the power of the politics  than the fact that in 7 years, Medicare is $2 trillion a year. In 7  years,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "James Risch", "party": "Republican", "sentence": "…We cannot afford to wait until  the end of August. Initiating the snapback process would be right and a  long-overdue move and would deny Iran the resources it uses for its  terror agenda.\n\nThe 2015 deal flooded Iran with cash while allowing it low-level  enrichment, a clock to simply wait out, no limitations on ballistic  missiles, and nothing to rein…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Middle East in  support of Operation Desert Shield. Within a year, they would pivot to  Operation Desert Storm, followed by Operation Southern Watch and later  the Global War on Terror, providing real-time information for tactical  forces, theater commanders, and national decision makers in what is  believed to be the longest continuous deployment for a unit…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Middle East just a few decades ago. Then, came the  revolution of 1979, when the progress abruptly ended with the takeover  by the theocratic despots who introduced a reign of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…generative AI. It also requires  greater information sharing and coordination across the intelligence  community to ensure that we have the clearest possible picture of AI- related terror threats.\n\nThis is an issue that requires us to be proactive and outmaneuver any  group or individual seeking to do us harm with this emerging  technology. The Generative AI…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the men of the Alamo, the men who stormed the  beaches of Normandy, the men on the fields of Lexington and Concord,  the men and women who have answered the call to defeat terror, the men  and women in blue who actually stand on that thin blue line even when  they are abandoned.\n\nAll of those who have answered the call deserve Members of this body,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…country that was war-torn and literally run by the Taliban, which  is an international terrorist organization. Consequently, many of these  aliens have likely committed acts of terror or have ties to terror  groups.\n\nIn some cases, the U.S. Government was asking the Taliban to verify  information on these individuals. Now, that strikes me as rather  bizarre.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]