[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW.  1600, the Crimea  Annexation Non-Recognition Act; H.R. 1601, the Defending Ukraine's  Territorial Integrity Act; and H.R. 670, the Lady Liberty Act, bills  originally introduced by Representative Connolly of Virginia, for the  purposes of adding cosponsors and requesting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698676/permission-for-member-to-be-considered-as-first-sponsor-of-hr-hr-and-hr-670"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…only jurisdiction in our country to allow this. At various  points throughout American history, Congress and 40 States have allowed  noncitizens to vote in local, State, and territorial elections,  including the home State of the sponsor of this bill.\n\nCongress did not prohibit noncitizens from voting in Federal  elections until 1996, and today, about 20…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…bombers, an arsenal large enough to  annihilate every person on Earth.\n\nBy 1996, Ukraine had voluntarily given up that nuclear arsenal in  exchange for written guarantees of territorial integrity, signed by  America, Russia, England, and Europe. These were guarantees that were  reconfirmed by Russia under Vladimir Putin in 2009.\n\nWhen JD Vance and Donald…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688385/a-stain-on-our-nations-honor"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…specific negotiating position should be dictated for  anyone. But only that--and I read from my resolution--we reaffirm the  support of the United States for the sovereignty and territorial  integrity of Ukraine in the face of the illegal invasion of its  territory by the Russian Federation and the bonds of friendship and  shared values between the people of…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…held the appointments clause of the  Constitution does not ``restrict the appointment of local officers that  Congress vests with primarily local duties'' pursuant to the  territorial or District clauses of the Constitution. Local D.C. judges  are local officers that Congress vests with primarily local duties  pursuant to the District clause.\n\nThe longstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…this moment.\n\nUnder international law, the raid on January 3 violates article 2(4)  of the United Nations Charter, which prohibits the threat or use of  force against the territorial integrity or political independence of  any state. The United States is bound by treaty to follow the U.N.  Charter. The Constitution makes treaties part of the ``supreme…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…25th anniversary of the State Partnership Program (SPP) between the  Hawaii National Guard and the Armed Forces of the Republic of the  Philippines.\n\nThe SPP pairs state and territorial National Guard units with partner  nations worldwide. It helps build enduring, mutually beneficial  relationships to enhance security cooperation, advance U.S. interests…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…time of the end  of the Soviet empire, Ukraine possessed the world's third-largest  nuclear weapon inventory, which they voluntarily gave up in return for  a guarantee of territorial integrity--one, unfortunately, which we are  not abiding by.\n\nMr. FOSTER. Mr. Speaker, I thank Mr. Takano for reminding us of  Hiroshima.\n\nMr. Speaker, I had the opportunity…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…action with Mexico, to include  drone strikes and the use of special operations military personnel,  ostensibly against drug cartels, in violation of the sovereignty and  territorial integrity of that country and without any congressional  authorization to use military force;\n\nThree, annexation of Greenland, an autonomous territory in the  Kingdom of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…local  government. While D.C. law allows noncitizens to vote only in local  elections, 40 States and the Federal Government allowed noncitizens to  vote in local, State, territorial, and Federal elections at various  points, including at the founding.\n\nThe Federal Government first prohibited noncitizens from voting in  Federal elections only 29 years…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…want peace, and yet this administration has begun negotiations  from the weakest possible position. Before we even get to the table,  Ukraine has been excluded from NATO. Territorial concessions were  granted to Russia, and Ukraine didn't even have a seat at the table.  This is what they get for a sacrifice of hundreds of thousands of their  people,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and Gonzalez.\n\nChina continues its provocations toward Taiwan with increasingly  hostile rhetoric and actions. This includes military incursions into  Taiwan's airspace and territorial waters. Thus, I agree with the  sponsors of this bill that Congress must stand up for Taiwan and its  people as they confront this threat.\n\nThis is especially true, given…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…medical practice in Hawaii in 1952.\n\nPeter Aduja became the first Filipino American elected to       public office in the United States when he was elected to the       Hawaii Territorial House of Representatives in 1954.\n\nLarry Ramos became to first Filipino and Asian-American to       win a Grammy Award playing the banjo for the New Christy       Minstrels…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…the Trump  administration is insisting that it yield its natural resource wealth  to the United States in exchange for previous American support without  any guarantee of territorial integrity.\n\nThis is not the behavior of a great democratic power, the leader of  the free world. It is the behavior of a Mafia state engaged in coercion  and blackmail.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…in detecting, assessing, and mitigating the risks       associated with vehicle-based threats.\n\n(6) Strengthened coordination between Federal, State,       local, Tribal, territorial, and private sector stakeholders       is essential to enhance prevention, preparedness, and       response efforts, ensuring the safety of communities across       the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…by the overwhelming majority of the       citizens of Georgia;\n\n(2) to continue supporting the capacity of the Government       of Georgia to protect its sovereignty and territorial       integrity from further Russian aggression or encroachment       within its internationally recognized borders;\n\n(3) to call on all political parties and elected Members…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…credible force that       is capable of deterring adversaries and participating in NATO       operations. The proposed sale will support its goal of       improving national and territorial defense as well as       interoperability with U.S. and NATO forces. Denmark will have       no difficulty absorbing this equipment into its armed forces.\n\nThe proposed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698533/arms-sales-notification"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…recognition that cybersecurity cannot be approached through a  partisan lens.\n\nBy passing the PILLAR Act, the House can reaffirm its commitment to  our State, local, Tribal, and territorial partners. When our  communities are more secure, our entire Nation is more secure.\n\nI thank Congressman Ogles, again, for his leadership in bringing  forward this bipartisan…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…approach to key  policies that guided and distinguished our efforts particularly around  State regime oversight, the reserve composition, the anti-money  laundering, and territorial integrity issues around stablecoins, and,  finally, the corporate structure of issuers.\n\nFurthermore, it is my firmly held belief that only by enacting  payment stablecoin…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…awarding of grants under this       section, including relating to the following:\n\n``(1) Conducting annual surveys to collect feedback from       State, local, Tribal, and territorial stakeholders on the       awarding of such grants and the effectiveness of the       Administrator's outreach efforts.\n\n``(2) Summaries of the surveys conducted pursuant…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…adding at the end the following:\n\n``(c)(1) Whoever, using the mail or any facility or means       of interstate or foreign commerce, or within the special       maritime and territorial jurisdiction of the United States,       intentionally compels a minor to--\n\n``(A) engage in self-harm, including suicide or attempted       suicide;\n\n``(B) commit animal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…partnering with State and local governments  to ensure that the United States is prepared for a potential outbreak.  This means working across Federal, State, local, Tribal, and  territorial agencies to update emergency response plans, ensuring that  responders are trained and ready.\n\nThey are also supporting hands-on training and simulations at all  levels…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Other appropriate Federal departments and agencies with       missions associated with the southwest, northern, or maritime       border.\n\n(ii) State, local, Tribal, and territorial law enforcement       agencies with jurisdictions adjacent to the southwest,       northern, or maritime border.\n\n(C) Efforts to locate, detect, interdict, and disrupt…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Territorial Response and       Access to Veterans' Essential Lifecare Act'' or the ``TRAVEL       Act of 2025''.       SEC. 2. DEPARTMENT OF VETERANS ASSIGNMENT OF TRAVELING…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695431/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Security's Office of Intelligence and  Analysis has a distinct role within the intelligence community of  gathering and sharing intelligence across State, local, Tribal, and  territorial partners.\n\nIn recent years, the Office of Intelligence and Analysis has faced  criticism for overreach in its handling of bulk data that raises  privacy concerns for the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…political stability and economic progress in the Middle       East.\n\nThe proposed sale will improve the United Arab Emirates'       ability to defend its sovereignty and territorial integrity       to meet its national defense requirements. The United Arab       Emirates will have no difficulty absorbing this equipment and       services into its armed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691103/arms-sales-notification"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…departments in--\n\n(1) working with the navies and domestic coast guard of       nations located in the Indo-Pacific region on building       capacity to protect the territorial waters of such nations       from incursions by other nations;\n\n(2) providing a presence in the Arctic and Antarctic to       protect United States sovereign national security…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…local  leaders with the resources and tools they need to prepare.\n\nMadam Speaker, I urge my colleagues to support H.R. 5078 and to stand  with the State, local, Tribal, and territorial partners who are on the  front lines of our cyber defense every day.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…sacrifice for law enforcement officers and first responders       who were killed in the line of duty.\n\n(b) Eligibility.--\n\n(1) In general.--A local, State, Tribal, territorial, or       Federal law enforcement officer or first responder who was       killed in the line of duty shall be eligible for the medal of       sacrifice established under…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}]