[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…centers,  domestic violence shelters, child advocacy programs, and services for  survivors like me of homicide, assault, and human trafficking in every  State and in every territory. It pays for counseling, emergency  shelters, legal aid, and lost wages.\n\nIn short, the Crime Victims Fund is the bedrock of our Nation's  promise to help victims rebuild…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…read from my resolution--we reaffirm the  support of the United States for the sovereignty and territorial  integrity of Ukraine in the face of the illegal invasion of its  territory by the Russian Federation and the bonds of friendship and  shared values between the people of the United States and allied  fighting forces.\n\nNow, by any measure of military…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the  murderer.\n\nTrump is joining a rogues' gallery of lesser dictators to deny  Putin's murderous invasion, his war crimes, and a demand that he return  occupied Ukrainian territory. Trump, ``the great appeaser,'' is joined  in this appalling wrong by House Republican accomplices.\n\nWhile Ukrainians dodge bullets and missiles and are risking death  daily,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…located on the Black Sea, is no stranger to  larger geopolitical forces. Russia invaded Georgia in 2008 during the  Beijing Olympics and proceeded to occupy 20 percent of its territory.  Despite the persistent threat from Russia, Georgians continued to forge  forward with democratic reforms and even made significant contributions  to the wars in Iraq and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…become the 19th  Sergeant Major of the Marine Corps, the highest-ranking enlisted  Marine.\n\nIn 2010, he earned a Bronze Star with Combat V after running through  dangerous territory to reach a fellow Marine who had been struck by an  IED.\n\nHe most recently served as the senior enlisted adviser to the  Chairman of the Joint Chiefs of Staff, the highest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…under       consideration by the Senate. The Act provides for the       issuance of a congressional joint resolution declaring the       admittance as a State of most of the territory currently       comprising the District of Columbia, while the seat of       government (defined as the ``Capital'') will fall outside of       the boundaries of the new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…fire a long-range missile into another  country because we are not in hostilities since there are no  servicemembers directly in danger as we launch the missile from our  territory? That logic does not hold up. That represents, indeed, a  fundamental rewriting of our Constitution--not through amendment or  legislation but through one man's decision.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press reports, Donald Trump is considering military  action on Venezuelan territory. But it also sounds like nobody really  knows what the plan is because, like so many other things with Donald  Trump, he keeps changing his mind. Who knows what he will do…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…planes, and rocket  launchers to wreak havoc on Ukrainian cities and citizens. They do this  to overthrow the government, to end democracy in Ukraine, and to seize  Ukrainian territory to reconstitute a new Soviet Union, or at least a  Soviet-like sphere of influence.\n\nUkrainians have bravely stood up to this unprovoked, unlawful  aggression. The Ukrainian…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…ensures our communities have access to healthy, locally sourced  seafood.\n\nThe impact is equally critical in American Samoa, where the tuna  industry forms the backbone of the territory's private sector and plays  an essential role in supporting families and sustaining the local  econony.\n\nPassing the South Pacific Tuna Treaty Act today will eliminate this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…correcting the lies that will waft out of the  House Chamber from Donald Trump's mouth tonight. On Ukraine, 4 years  ago the tanks, missiles, and infantry rolled in from Russian territory  onto Ukrainian soil. Today my colleagues and I pause to honor the  memory of the courageous dead in Ukraine. We reaffirm that the Senate  and the American people stand with…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…a national program derive from its       variations across different States.\n\nDifferent States doing things in different ways.\n\nMedicaid looks different in every State and territory       because the program is able to reflect and accommodate the       specific needs of the State's patients, providers, and       communities.\n\nThese State-based programs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…accelerating stage of the military strategy that is being executed by  the Netanyahu government to force Palestinians out of northern Gaza and  to induce them to leave the territory altogether.\n\nAnd Palestinians, compelled by hunger and thirst, are being forced to  make their way to a handful of sites, which our closest allies  uniformly condemn as a…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…care to veterans residing in American Samoa, Guam, the  Commonwealth of the Northern Mariana Islands, the Commonwealth of  Puerto Rico, the U.S. Virgin Islands, and any other territory or  possession of the United States. It will also allow the traveling VA  physician to coordinate with nondepartment medical providers as  necessary to provide care. I thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…inserting ``a leadership       official of an affected Indian Tribe, the executive official       of the District of Columbia, or the executive official of an       affected territory or possession of the United States,''       after ``State,''; and\n\n(B) in subparagraph (B), by striking ``consider'' and all       that follows through ``boundary.'' and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…friends have come together on a common negotiating  position centered on several key principles. Here are the key points:  Ukraine should not be forced to give up the sovereign territory it  deserves and it currently controls. Also, Putin should not achieve  through negotiation what he has not managed to achieve on the  battlefield, and there have been great…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ordinary  Americans, contrary to the Democratic talking points.\n\nYou know, I have been here working in Washington--or what I like to  call the forward operating base in hostile territory--for some time  now, and the truth is, you get these prevailing narratives that get  repeated over and over and over again and written about by the press  that simply have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…in a television  interview.\n\nLet me give you some facts about Denmark, for example. Denmark, which  has responsibility for Greenland--although, Greenland is an autonomous  territory under NATO. It is a part of the Kingdom of Denmark.\n\nBut let's talk about Denmark for a minute. Denmark was one of NATO's  most disproportionately high contributors in Afghanistan,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…States of California, Colorado,       Connecticut, Illinois, Indiana, Iowa, Michigan, Missouri, New       Jersey, Ohio, Pennsylvania, and Wisconsin and any other State       or territory of       the United States the Secretary determines appropriate in       addition to and in the same manner as each of the States to       which the original depredation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Stamp Conservation and Design Program Act of 1994 (16 U.S.C.       719b-1) is amended--\n\n(1) by inserting ``and'' after ``Guam,''; and\n\n(2) by striking ``, and any other territory or possession''       after ``Virgin Islands''.\n\n(b) Authorization of Appropriations.--Section 6 of the       Junior Duck Stamp Conservation and Design Program Act of 1994…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698168/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…beyond a traditional alliance. It is both  economic and military. Palauan citizens can live, work, and study in  the United States, while U.S. forces have access to Palauan territory  under the ironclad guarantee of American defense. That partnership, it  is strengthened by the fact that Palau has continued to maintain  diplomatic ties with Taiwan, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…which such property's services are sold in       interstate commerce.\n\n(10) State.--The term ``State'' means each of the 50       States, the District of Columbia, and any territory or       possession of the United States.\n\n(11) Third-party online seller.--The term ``third-party       online seller'' means any person other than a hotel or short-…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…products).\n\n(D) Identifying consumer products required by section 17(a)       of the Consumer Product Safety Act (15 U.S.C. 2066(a)) to be       refused admission into the customs territory of the United       States.\n\n(2) Consistent with section 6 of the Consumer Product       Safety Act (15 U.S.C. 2055), consult with the following:\n\n(A) Technologists, data…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…in the east  part of Ukraine, it is at an exorbitant cost. Since the invasion began  in February 2022, 4 years ago, Russian forces have seized only 12  percent of Ukrainian territory. Because of the way they fight and how  Ukrainians defend, Russian forces simply cannot achieve breakthroughs  after the breach of Ukrainian positions. Today, nearly 20 percent…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…a major milestone for fish and wildlife conservation. Statewide action  plans serve as a vital blueprint for identifying the unique  conservation needs of each State and territory and are required for  States to take part in the State and Tribal Wildlife Grant program.\n\nThese plans play a leading role in helping to prevent and recover  endangered species…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…apply to a presentation or other       communication made by or on behalf of an issuer which is made       at an event--\n\n(1) sponsored by--\n\n(A) the United States or any territory thereof, the       District of Columbia, any State, a federally recognized       Indian Tribe, a political subdivision of any State,       territory, or federally recognized…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…tell you that an operation that is over before breakfast is not a war.\n\nThe Department of War--let me say this again--is not engaged in any  hostilities within the Venezuelan territory or with the Venezuelan  military. They are not in tank battles. There are no tactical  operations centers there. There are no convoys. There are no U.S. mess  halls over…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…States maritime domain and the Marine Transportation System,       and deny the use and exploitation of the maritime domain as a       means for attacks on United States territory, population,       vessels, and critical infrastructure.\n\n``(B) Drug interdiction.--Engage in maritime air       surveillance or maritime interdiction to enforce or assist…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…by--\n\n(A) health care professional; and\n\n(B) contract.\n\n(3) The number of such examinations conducted in each       State, the District of Columbia, or a Commonwealth,       territory, or possession of the United States.\n\n(4) The numbers of each kind of health care professionals       who conducted such examinations.\n\n(5) The number of examinations that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695499/rural-veterans-improved-access-to-benefits-act-of-2025"}]