[{"senator": "Al Green", "party": "Democrat", "sentence": "…more than 500,000 signatures for  impeachment.\n\nThese are the people who are at the genesis of this movement, and I  thank all of them for what they are doing.\n\nI also thank another friend, a lawyer as well, but a great consumer  advocate, a protector of rights for people who we consider consumers,  and that, of course, is the attorney Ralph Nader. The…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, I thank my friend and colleague, Ranking  Member Pallone, for yielding.\n\nMr. Speaker, House Republicans ended 2025 by failing to extend  Affordable Care Act tax credits causing healthcare…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of the Subcommittee on  Oversight and Investigations.\n\nMs. WATERS. Mr. Speaker, I have no further speakers, and I yield  myself the balance of my time.\n\nMr. Speaker, I thank my friend and colleague, Ranking Member Green,  for his good work on this bill.\n\nH.R. 3716 will ensure that if we have another banking emergency, as  we did 2 years ago with several…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697287/systemic-risk-authority-transparency-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Mr. President, I want to thank my friend from Illinois  Senator Durbin for his leadership and commitment to saving public  broadcasting and educational programming for Americans all across our  beautiful country.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Madam Chair, I thank my friend, the gentleman from  Virginia, for yielding me time.\n\nI rise today in strong opposition to this budget resolution. As an  Appropriations Committee member, thoughtful consideration…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…its place, but effective  diplomacy and law enforcement cooperation are indispensable.\n\nLet me be clear. Use of military force is not a viable solution.\n\nMr. Speaker, I thank my friend, Representative Barr, for his advocacy  on this important issue. Congress works on behalf of the American  people best when we work together, and Mr. Barr and I worked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…rise in support of H.R. 36, a bipartisan bill  designed to make sure that the United States remains committed to  Georgia's Euro-Atlantic and democratic aspirations.\n\nI thank my friend, the gentleman from South Carolina (Mr. Wilson),  for his tireless efforts on this topic, in addition to his fervent work  to support Ukraine.\n\nFor years following the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I thank my friend from Kentucky for  yielding.\n\nMr. Speaker, I rise today in strong support of the Medal of Honor  Act.\n\nThe Medal of Honor is our Nation's highest military decoration.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I thank my friend and colleague,  Representative Stansbury, for bringing us together tonight to discuss  an important and alarming situation.\n\nEvery American should be outraged at the Trump…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…I rise in support of H.R. 249, a bill to redesignate  parts of the Paterson Great Falls National Historical Park in honor of  the late Congressman Bill Pascrell, Jr.\n\nI thank my friend and fellow New Jerseyan, Congressman Frank Pallone,  for leading this effort. I am a proud original cosponsor of this  important measure to honor the legacy of one of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…leadership, her indelible mark that she left on Walnut  Creek and the San Francisco Bay Area, the State of California, and,  indeed, the United States of America.\n\nMr. Speaker, I thank my friend, Gwen, for her service and incredible  personality.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Sam, who has now made four flights  across the country to change hearts and minds and also highlight the  need for reform here in Congress.\n\nMs. PETTERSEN. Mr. Speaker, I thank my friend and colleague for  yielding.\n\nMr. Speaker, I understand that my colleague, Representative Luna, has  done everything she can to try to find a path forward, and this is…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank my friend and colleague from  Massachusetts for the time and for offering this bill, which is simple.  It would block any budget reconciliation language in the House or  Senate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691942/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I thank my friend for yielding. He and I have  known each other for some 60 years. We have served in this body for a  very long time.\n\nI can remember two events. One was on September 11,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Chairman, I thank my friend from Connecticut for  yielding.\n\nDonald Trump is breaking promises left and right to American workers.  His latest target is Revolution Wind. His stop work order is abusing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, I thank my friend from Texas for his  leadership.\n\nMr. Speaker, in order for us to deliver one big, beautiful  reconciliation bill, one that extends the provisions of the Tax Cuts  and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689890/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Mr. BARR. Mr. Speaker, I thank my friend from Washington State and  Chairman Mast for supporting the legislation. I thank my friend, the  ranking member, the gentleman from New York (Mr. Meeks), for his  bipartisan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Mr. JOHNSON of Louisiana. Mr. Speaker, I thank my friend, Chairman  Cole, who has done an extraordinary job in this process.\n\nMr. Speaker, we all know why we are here. House Democrats voted to  shut down the government. It was…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, I thank my friend and colleague, Mr.  Foster, on the other side for working on this.\n\nMr. Speaker, I rise today in strong support of Mr. Foster's  legislation, the Financial Stability Oversight…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise today in strong support of my bill, the IRS MATH  Act. I thank my friend from Illinois (Mr. Schneider) for working with  me on this commonsense legislation.\n\nMr. Speaker, if the IRS finds a mistake on a tax return, such as when  a taxpayer…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank my friend from Arizona, and I would  really just commend the people who watch C-SPAN, all 14 of them, the  greatness of my friend from Arizona and how much he focuses on the  spending…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I thank my friend, Chairman Griffith, for  yielding time.\n\nMr. Speaker, this rule is an example of unsubstantiated bureaucratic  overreach that does not have any added impact to public…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688524/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Director       of Budget Analysis.                                                 Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nI thank my friend from New Jersey for this excellent bill. I know  that Congress has consensus on it, and I hope that in this Congress it  becomes law. I have spent a good part of my career…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…this  country.\n\nI thank Representative  John James of Michigan and Representative  Ronny Jackson of Texas for introducing important provisions to this  language, and I thank my friend, Representative Ciscomani, for  introducing this bill and continuing to be a champion of improving  education opportunities for veterans and their dependents.\n\nMy committee…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…service, and to honor the commitment of the men and  women who show up for the American people every single day.\n\nMr. Speaker, I urge my colleagues to support this bill. I thank my  friend and colleague from Maine, Jared Golden, for his partnership,  and, more importantly, for his courage in advancing this initiative.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…America more competitive by  having the most liquid, competitive capital markets in the world. These  bills certainly take a step in that direction to support that goal. I  thank my friend from California (Mr. Sherman) for his comments in  support of the bill.\n\nThe gentleman is right, Mr. Speaker. I think we have all learned in  our lives that intelligence…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…back the balance of my time.\n\nMr. GUTHRIE. Mr. Chairman, I claim the time in opposition to the  amendment, even though I am not opposed to it.\n\nMr. GUTHRIE. Mr. Chair, I thank my friend from California for  offering this amendment.\n\nThis amendment would incorporate advanced transmission technologies  into the supply chain considerations that the Department…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I thank my friend, our conference chair  (Mrs. McClain) for managing this time on this important bill.\n\nMr. Speaker, a lot of people come up here, and they talk about trying  to get America's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Gold Medal Act for those amazing patriots.\n\nI actually watched that movie with my kids over the weekend and saw  the patriotism start to brew, really an amazing feat. I thank my friend  for that.\n\nMr. Speaker, I rise today in support of my bill, the University of  Utah Research Park Act, which passed unanimously out of the Natural  Resources Committee…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Mr. FONG. Mr. Speaker, I thank my friend and colleague from Florida  (Mr. Haridopolos) for leading this Special Order today about the  importance of America leading in aerospace and aviation.\n\nMy district in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}]