[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I thank my colleague for yielding and for  his actions today.\n\nMr. Speaker, I rise today to speak on one of my eight amendments to  the SAVE Act, which will be offered as the previous question…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…passage.\n\nMadam Speaker, I yield 3 minutes to the gentlewoman from New Jersey  (Mrs. Watson Coleman), who is the author of the bill.\n\nMrs. WATSON COLEMAN. Madam Speaker, I thank my colleague for  yielding.\n\nMadam Speaker, the signing of the Declaration of Independence on July  4th, 1776, marked a turning point not just in our Nation's history but  in the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I rise to thank my colleague from Minnesota  Senator Klobuchar for her hard work on this effort and her work over  many years in leading the U.S.-Canada interparliamentary dialogue. That  is a dialogue…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Senate and  sending us this bill so quickly as well as Representatives Salazar,  Pettersen, and Luna for their unwavering advocacy for traveling  mothers.\n\nI also thank my former colleague, Katie Porter of Orange County, who  introduced this bill in prior Congresses. It is a commonsense bill, and  it is rightfully a bipartisan effort.\n\nCompounding the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Speaker, I thank my colleague and good friend, the  Ranking Member of the Rules Committee Jim McGovern. He is a tireless  fighter for working families and I am proud to be in that fight with  him.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…The gentleman from New Jersey seeks recognition. He is       recognized for five minutes to speak on the amendment.\n\nMr. Menendez. Thank you, Chairman, and I want to thank my       colleague Mr. Carter, for offering this amendment. You know,       often when we talk about environmental justice our friends       across the aisle roll their eyes. They scoff…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Ms. HIRONO. Mr. President, I want to thank my colleague from Maryland  for his passionate advocacy for IDEA. IDEA is a critical program of the  U.S. Department of Education.\n\nLet me tell you what is happening to the U.S. Department…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…cause, as it has long been, and we should be talking more about fully  funding IDEA and strengthening it. Instead, we are left defending it  from political attacks.\n\nI thank my colleague, Representative Hayes, for organizing this  discussion. I also thank my fellow members of the Education and  Workforce Committee for their commitment to maintaining IDEA.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, I just want to first thank my colleague  from California for stating so plainly about the character of the  individual we are talking about.\n\nWe have justifiable disagreements in this body. We have strong-held…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Mrs. GRIJALVA. Mr. Speaker, I thank my colleague and friend,  Congressman Stanton, for that kind introduction and to the entire  Democratic delegation from Arizona and the delegation that stood here  with me that has…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I am happy to yield if he can just clarify that.\n\nMr. RASKIN. I yield to the gentleman from North Carolina.\n\nMr. RASKIN. Madam Speaker, reclaiming my time. I thank my colleague  for that clarification.\n\nMadam Speaker, I am satisfied to believe, again, that there are  people who could end up with the most severe penalties under the  legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Corps.\n\nSemper Fidelis.\n\nI am happy now to yield to my colleague and friend from Alaska and  fellow marine, U.S. Senator Dan Sullivan.\n\nMr. BLUMENTHAL. Mr. President, I thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps birthday always has enormous  personal meaning for…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, let me first say thank you to my colleague  from Virginia, Congresswoman Jennifer McClellan, for yielding to me and  for leading this Special Order hour. I also thank our chairwoman,  Congresswoman Yvette…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…support this bill  once again.\n\nMs. STEVENS. Mr. Speaker, I have no further requests for time to  speak on this bill, and I am prepared to close.\n\nMr. Speaker, I thank, again, my colleague, Mr. Kennedy for his were  very affirming and wonderful remarks on the importance of this  legislation.\n\nI think from what everyone can hear today, we have bipartisan…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…support of H.R. 1503. I also thank  Representatives Smith and Keating for introducing this bill, which, as  the chairman mentioned, passed in the 118th Congress. I also thank my  colleague and chairman for bringing this and many other important  bipartisan bills to the floor today.\n\nAccording to the State Department's Office to Monitor and Combat  Trafficking…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…short, this bill enables two of our chief scientific agencies to  do better work by tackling some of our most challenging scientific  problems together.\n\nMr. Speaker, I thank my colleague, Representative Begich, for  introducing this legislation. I also thank Representative Whitesides  for cosponsoring it. This bipartisan bill earned unanimous support…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…for his  leadership in helping to return us to regular order and producing a  series of bills that will fully fund the government by the January 30  deadline.\n\nI also thank my colleague from Connecticut, the ranking member, Rosa  DeLauro, who was part of this combination. We have seen them work  before in years past, both as the chairman of the full…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, I thank my colleague Mr. Davidson for his  broad work in the capital market space and for leading us here on the  floor today.\n\nI rise to urge my colleagues to support the Expanding WKSI…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise in support of H.R. 1469, the Senior Security Act.  I thank my colleague, Representative Gottheimer, for his work on this  vital piece of bipartisan legislation that will strengthen protections  for senior investors. I am proud to be the co-lead…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…lower  appliance prices, and it will do nothing to lengthen product lifetimes  or to bring real energy savings to the American homeowner.\n\nAccordingly, Mr. Speaker, I thank my colleague from Georgia (Mr.  Clyde) for his leadership on bringing this to our attention. I urge all  Members to join me in voting in favor of H.J. Res. 42, and I yield back  the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…their impact on national security, this  language is necessary to protect our investments and breakthroughs from  hostile powers such as the Chinese Communist Party.\n\nI thank my colleague, Mr. Whitesides of California, for working with  me on this important legislation and continuing the bipartisan  tradition of the Science, Space, and Technology Committee.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…hold  bad actors accountable.\n\nI thank my friend, the chairman of the Transportation and  Infrastructure Committee, for his support in moving this bill forward.  I also thank my colleague from Illinois (Mr. Krishnamoorthi), my co- lead on this legislation, for his partnership and commitment to  advancing this important legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Powder  River Basin alive. Through the CRA, we will stop future anti-American  energy administrations from taking similar steps to shut down the  Powder River Basin.\n\nI thank my colleague from Wyoming for introducing this important CRA  resolution on behalf of the hardworking men and women that make up  Wyoming's coal industry. I urge my colleagues to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Mineral Leasing Act for Acquired Lands, clarifying that all lands  acquired by the Federal Government are eligible to be considered for  hardrock mineral leasing.\n\nI thank my colleague Representative Fallon for his work on the  bipartisan piece of legislation.\n\nAcquired lands comprise 10 percent of the Nation's Federal lands, or  64 million acres. The…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698229/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…preserve.\n\nMr. Speaker, I thank Chairman Westerman and the staff of the House  Committee on Natural Resources for working with my office to get this  bill introduced. I thank my colleague from across the aisle,  Representative Elfreth, for co-leading this legislation with me. I also  thank all of the organizations who are supporting this effort.\n\nMr. Speaker,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…including in my home district of  central and eastern Montana, deserve an SBA that efficiently supports  local job creators and isn't undercut by fraud.\n\nMr. Speaker, I thank my colleague, Representative Herb Conaway, for  co-leading this legislation.\n\nThe fraudulent spending of Federal taxpayer dollars undermines our  trust in the government. It is essential…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…violent riots in Los Angeles this month, and I thank our brave law  enforcement officers for keeping us safe.\n\nI appreciate the heated debate and the conversation. I thank my  colleague (Mr. Kiley) for leading on the groundwork and for explaining  what led to the events that occurred last month in Los Angeles, which  explains that Federal agents were…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "Mrs. HARSHBARGER. Mr. Speaker, I thank my colleague, Chairman Gus  Bilirakis, who I affectionately call Gus, and Ranking Member Pallone  for supporting this act.\n\nWe have the opportunity today to vote on legislation centered…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…our national security, our communities, and the men  and women in uniform who stand the line every single day, I urge a  ``no'' vote on this resolution.\n\nMr. Speaker, I thank my colleague from Florida (Mr. Mast) for  yielding me the time to speak on this important matter.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I rise today in proud support of H. Res.  364, recognizing the Gold Shield families resolution. I thank my  colleague, Congressman Meuser, for his leadership in reintroducing this  important measure.\n\nMr. Speaker, this resolution honors the families of fallen first  responders, those…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}]