[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…beloved daughters, Susan, Stefany, and Anne, who paid a price  for Dad's absences.\n\nTo my grandchildren and great-grandchildren, for giving me great joy.\n\nTo my mother, who thankfully lived to see her son become the  president of the Maryland State Senate.\n\nTo my staff, for serving me and their Nation with great loyalty and  ability.\n\nTo my colleagues,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…is no stranger to wildfires-- we are in the midst of a growing megafire crisis, and in 2024 alone we  saw 9 wildfire incidents that burned nearly 15,000 acres in total.  Thankfully, these fires were contained due to the quick action and  selfless heroism of our firefighters, law enforcement, and first  responders. Just earlier this year, during the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…stronger,  develop their brains, and have a stronger immune system. If kids don't  get the nutrition they need during this time, it literally has  generational consequences.\n\nThankfully, as Congressman Magaziner has highlighted, we have a  proven treatment to save the lives of malnourished children: ready-to- use therapeutic food, or RUTF. RUTF is the go-to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…recent weeks, life has only become harder for this workforce, as  probationary employees have been fired and TSOs' collective bargaining  rights have also come under attack.\n\nThankfully, we have the opportunity today, Mr. Speaker, to make life  a bit easier for the hardworking civil servants of TSA.\n\nThe TSA Commuting Fairness Act, offered by my colleagues…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congress.\n\nInstead of assuming that I knew what mattered the most to people in  my district, we sent out a survey to ask people in Ohio's 13th what  mattered most to them. Thankfully, more than 2,000 people took the time  to respond.\n\nWhat they told us was pretty straightforward. They wanted me to  protect Social Security, Medicaid, and Medicare. They…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…often to blame.\n\nA federal safety standard enforced by the CPSC would level       the playing field and help ensure that manufacturers and       sellers put safety first. Thankfully, the Setting Consumer       Standards for Lithium-Ion Batteries Act (H.R. 973) would       address this emerging, but addressable, hazard. On April 9,       2025, the Energy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…forever. Honor your oaths.  Remember your legacy.'' That is what he said.\n\nIt is pride in assaulting the officers, pride in assaulting  democracy, pride in driving the Congress, thankfully for just hours,  out of this Capitol so they could not proceed in doing their  constitutional duty.\n\nThat pardon list included 600 who were charged with assaulting or  obstructing…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…cut billions of dollars of aid that goes to PEPFAR to treat  people around the world with HIV. They cut aid for malaria. They cut  aid for clean water around the world.\n\nThankfully, this bill did not cut funding for emergency food aid like  Plumpy'Nut. The problem is that even though this funding has not been  cut and it is still available, the Trump…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692483/funding-for-edesias-plumpynut"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Marine  Sanctuary because that is something that went through the special use  permit process. It was for one of these undersea cable landings. Things  got very complicated.\n\nThankfully, the National Park Service was able to charge market rent  for the rights to go through this area, and it turns out that that was  a good thing because there were all sorts…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Ms. HOULAHAN. Mr. Speaker, importantly, how will those who may decide  to pursue STEM fields succeed where these same skills are useful among  the trades or manufacturing?\n\nThankfully, schools across the country are developing new tools and  curricula with students to help them learn these challenging topics.\n\nI will repeat again that this is without any…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Only through Medicaid, Jessica was able to access  prenatal care.\n\nThen, late in her pregnancy, her doctor discovered a knotted  umbilical cord. She was rushed into surgery. Thankfully, Jessica gave  birth to a healthy baby.\n\nWithout Medicaid, Jessica might not be a mom today. She and her  daughter might not have survived. These massive cuts will force…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691495/gop-tax-scam-hurts-women-and-families"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…American people and  their pocketbooks central rather than you are threatening Greenland. He  has to have Greenland. He is going to insult Canada and put tariffs on  Canada.\n\nThankfully, later this afternoon, we are going to debate and try to  remove some of these arbitrary added taxes on the American people and  lower the cost of living. That is why your…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…United  States to approve the Treaty. These actions show that D.C. residents  were early, prescient leaders on this important issue. It seems that  the rest of the world is, thankfully, starting to catch up to D.C.\n\nAs the only Nation that has used nuclear weapons in war, and that  still possesses one of the largest nuclear weapons arsenals, this bill…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688575/introduction-the-nuclear-weapons-abolition-and-conversion-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from  Medicaid and $500 billion from Medicare. Over 203,000 people will lose  coverage in my district. Let's be really clear: Many of them will get  needlessly sick or die.\n\nThankfully, Democrats refused to accept this Republican healthcare  crisis and forced this vote to extend the ACA tax credits.\n\nMr. Speaker, Republicans have made life too expensive.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Commonwealth of Massachusetts.  Emily tells us: ``I had moved to Massachusetts in 2020 and was working  a retail job for minimum wage. I was unable to afford much, but the  State, thankfully, approved me for SNAP assistance and Medicaid.  Without that jump start, I am not sure where I would be today. There  shouldn't be shame or stigma surrounding these programs.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…convert to Islam will be prosecuted and  persecuted. It will be acceptable for young girls and women to be  raped, and Islamic terrorism and violence will become the norm.\n\nThankfully, President Trump and his administration are working day  and night to save this country through mass deportation, revoking  immigrant visas, and implementing travel bans…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…respond to a tragedy, to console a grieving  victim's family after a horrendous crime has happened to them involving  tragic accidents. I have seen things most Americans will thankfully  never have to experience.\n\nWhen others run away from danger, law enforcement and first  responders run toward it. They fight crime, protect the innocent, and  too often,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…to freeze and cut spending wherever possible. When we deal with  these financial issues, lawmakers in this body would be wise to protect  important government services.\n\nThankfully, the fiscal year 2026 Financial Services and General  Government bill, which is on the floor today, cuts spending by $140  million and sends a clear message that Washington…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…They will weaponize their content against congressional Republicans.  They will hire lobbyists. They will buy ads. In fact, they have. They  can continue to do that, but thankfully, it won't be subsidized by the  taxpayer any longer.\n\nMs. FOXX. Mr. Speaker, I think my colleague from Texas (Mr. Roy)  explained very well why we are not voting to increase…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…convictions, and even nonviolent ones, can hold  someone back from applying for a job or getting housing. These victims  deserve to be able to heal and move on with their lives.\n\nThankfully, we have made significant progress to help survivors.  Today, the vast majority of States--in fact, 46 or 47--have some sort  of relief to victims for nonviolent offenses…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Throughout his  career, it is estimated that he dedicated more than 5,000 hours of  community service.\n\nWhile all of us in northeast Wisconsin will miss Bill's news  coverage, thankfully, we will still get to hear the voice of Lambeau  Field during Green Bay Packer home games.\n\nMr. Speaker, I thank Bill for his many years of service to northeast  Wisconsin…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688600/recognizing-bill-jartz-the-voice-of-lambeau-field"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Board, before issuing this final rule.\n\nCreating different merger rules for banks with different charters  would add significant ambiguity for both banks and their customers.\n\nThankfully, the current OCC under President Trump has recently  indicated they will abandon this flawed rule. However, without this  Congressional Review Act resolution, there is nothing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…base. We are filling  our stockpiles. We are making our soldiers the most lethal fighting  force the world has ever seen.\n\nWe will never apologize for keeping America safe. Thankfully, Mr.  Speaker, the people of America are now seeing through Biden's 4 years  of smoke and mirrors here in D.C.\n\nIt is a fact that the Clinton-Steele dossier was proven a…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…however, many cases go  undecided and are simply left to expire. This effectively results in  automatic denials even though no substantive decisions have been  rendered.\n\nThankfully, H.R. 677 offers a needed off-ramp for appellants that the  IBLA has left in limbo. Starting 1 year after filing the appeal, an  appellant may submit a request that requires…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…State of Georgia knows all too well, we must do more to  deliver secure elections. The survival of our constitutional Republic  relies on free, fair, and secure elections.\n\nThankfully, this legislation bolsters election integrity by requiring  a government photo ID to vote, requiring proof of U.S. citizenship to  register to vote, and directing States…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…on the other side. I do hope  those on the other side who disagree with this will start stepping up  and pushing back with what is happening there.\n\nI will say this, too. Thankfully, under President Trump's leadership,  we are cleaning house. The Department of Government Efficiency has  exposed FEMA's failures in the past administration. Secretary Noem…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…obviously, did not do that.  We have learned that they lost track of more than 320,000 migrant  children who face the threat of abuse, trafficking, and sexual  exploitation.\n\nThankfully, after 4 years of failure under the Biden administration,  President Trump is working to secure our border, to protect our  communities, and to bring human trafficking to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…bodies of American hostages to deprive their  families of closure.\n\nIsrael is the United States' greatest democratic ally in the Middle  East. We cannot abandon our ally. Thankfully, we have a President who  is an ally of Israel and who is working to fight anti-Semitism in the  United States.\n\nPresident Trump is pushing back on colleges and universities…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…environment of any State. It has the most onerous  regulations on gas, electricity and energy. It has failed to build  adequate water storage in many decades, although we are, thankfully,  changing that. It places tremendous restrictions and frivolous  litigation on building housing and imposes fees that make it cost tens  of thousands of dollars before you…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…along the southern border.  Tens of thousands of flies from traps in all locations have been  submitted to our National Veterinary Services Laboratories for  identification, thankfully with zero New World screwworm detections so  far.\n\nIn Texas, the USDA examines all wildlife for signs of an infection.  To date, more than 6,600 wild animals across 28 species…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}]