[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Would the Senator yield for a question?\n\nMr. SCHIFF. I thank the Senator for yielding.\n\nI just watched footage of our colleague--my California colleague-- Senator Alex Padilla, being forcibly removed from a briefing by the  Secretary of Homeland…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…a lot of people are seeing their news this way. So we  need to expand it and make sure we are on all of those platforms, as  well as the ones we already are on.\n\nThank you again to Senator Grassley for working with me to highlight  C-SPAN's critical role, and thanks to everyone who has had a hand in C- SPAN's success. Happy birthday.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…feast, to dine, and to dance with billionaires and power brokers of the  world, while letting--in fact, forcing--America's children and  vulnerable families to go hungry.\n\nI thank Senator Schumer and the other 44 additional cosponsors who  have joined this resolution. I invited all 100 Senators to join it. The  five points are certainly ones I have heard…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Well, Senate  Democrats are not waiting, and that is why I am so grateful for Senator  Lujan.\n\nIn a few minutes, we will force a vote to avert this avoidable  crisis. I thank Senator Lujan. I thank him for championing the Keep  SNAP and WIC Funded Act, which will make sure that 42 million Americans  don't lose their benefits. It will make sure 7 million…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…America a better country than most. I am proud to be part of this  country, but we are a nation of immigrants and should never forget it.\n\nMr. DURBIN. Mr. President, I want to thank Senator Mark Kelly for  bringing us together on the floor to talk about Citizens United.\n\nSenator Kelly has the honor of representing the State of Arizona.  When I was a Member…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Insurrection Act are important and necessary to protect  the American people and the military itself against the kinds of misuse  of powers that could occur.\n\nMr. BLUMENTHAL. I thank the Senator from Oregon.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…this process was; how many Senators were  able to give serious critical thinking to the bill to make it better to  bring bipartisan support behind this effort.\n\nI can't thank Senator Hagerty enough for his leadership, his  patience, and his willingness to create a bipartisan regulatory  framework for an industry that desperately needs it.\n\nI have been…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, I want to thank the Senator from Colorado  for your energetic leadership in this area. I am very grateful for your  voice on this and for the work you do for the people of the country  and, also,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, I want to thank the Senator from New  Mexico for coming out here and making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their costs skyrocket…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Isn't that a huge  difference between the way McCain looked at waste, whether it was in  the military or anything else, and what we are hearing here today?\n\nMr. SCHUMER. I thank the Senator. There is a hope--it may be  forlorn--that maybe one of John McCain's words will influence a few  folks over there before we proceed disastrously.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, let me first thank Senator Kelly for  coordinating this unfortunate commemoration of a truly disgraceful  decision by the Republican appointees of the Supreme Court 16 years  ago.\n\nThis decision…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I want to thank Senator Warner for his  tremendous leadership on this important issue that is just really  tormenting so many Americans right now--as well as Senator Wyden.\n\nThis involves tens…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…GARAMENDI. Mr. Speaker, today I am honored to introduce the  ``Transportation Emergency Relief Extension Act'' to safeguard federal  funding for disaster-recovery projects. I thank U.S. Senator Alex  Padilla (D-CA) and U.S. Senator John Cornyn (R-TX) for sponsoring the  companion legislation and my colleague, Congressman Doug LaMalfa (R-CA)  for cosponsoring…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…REED. Mr. President, I rise today alongside my colleagues to  speak out against the attack on a fundamental right of every American  citizen: the right to vote.\n\nI want to thank Senator Padilla for leading this important effort.  The progress, the prosperity, and success of our Nation, both as an  economic power and as an inspiration for freedom-loving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Mr. SCHATZ. Mr. President, I thank the Senator from Rhode Island for  his leadership and his clarity, and I want to underscore one of the  most basic points that has to be made. And this is how times have  changed.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…are  doing today. Instead of the world absolutely leading us, we are doing  what the world wants us to do. We are stepping up. We are leading the  world.\n\nAgain, I want to thank Senator Tuberville in every way. And to my  Democratic colleagues that I respect more than you know in all ways-- and I think that is how we all should be--please, let's stop wasting…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…clarify the standards on what exact  bias looks like, as well as by striking the 1-year sunset included in  subsection (c).\n\nThis language is already in the Senate NDAA. I thank Senator  Tuberville for his leadership in pushing this forward. I ask for my  colleagues' support on amendment No. 25.\n\nMr. McCORMICK. Madam Chair, I find it rather distracting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. I want to thank Senator Durbin for his leadership in  this area the two or three times we have attempted to do this. One  time, I think we were successful, but it is still not law.\n\nI would like…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…that we are going to get this done and  signed into law as soon as next month.\n\nBefore turning it over to my colleagues, I want to note two things.\n\nOne, I want to say thank you to Senator Cantwell for her partnership.  She and I have worked hand in hand on this. I am grateful for the trust  we have with each other and for the work ethic displayed by Senator…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…families, and the servicemembers defending our Nation, which was  evident with the passage of the measure in the Appropriations Committee  by a vote of 26 to 3.\n\nI want to again thank Senator Ossoff as well as Chair Collins and  Vice Chair Murray for their hard work and collaboration. And also a  special thanks to our staff who worked so, so very hard to put…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and drives opportunity.\n\nWe passed a comprehensive economic plan called the working families  tax cut law. It is the central part of our economic plan. I really want  to thank Senator Mike Crapo, chairman of the Finance Committee, for his  hard work on seeing this through.\n\nRepublicans cut taxes. Every single Democrat voted to raise taxes to  the tune…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…levels. It is about incentivizing  them to reduce emissions and rewarding them when they do. That is how  we both expand energy production and protect our environment.\n\nI thank Senator  John Curtis of Utah for his leadership on this  resolution in the Senate, and I urge my colleagues in the House to  support this resolution.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "Ms. LUMMIS. Mr. President, I want to thank Senator Johnson for his  dedication to trying to pay the Federal workers who are being used in  what is a political battle--I want to excuse them from a partisan  political battle…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…fleet. And I urge my  colleagues to support the Coast Guard Authorization Act of 2025.\n\nWith that, I yield to my colleague Senator Cantwell.\n\nMr. CRUZ. Mr. President, I thank Senator Cantwell and her staff for  their hard work on this bill. I also want to thank my staff on the  committee as well who have put in many hours. This bill is important to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…support on this particular bill.\n\nI thank Representatives Dean and Dingell, and, of course,  Representative Salazar who was also the main sponsor of the bill in the  House. I thank Senator Cruz who worked so very hard to get this done.\n\nThis is a bipartisan accomplishment, and we will protect our kids if  we pass this particular bill. It will go to the President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the floor today to ask  unanimous consent to pass a very important resolution that I try to  move forward every year. It is my Choose Respect Day resolution.\n\nI want to thank Senator Schiff, my lead cosponsor on the other side  of the aisle. And it is to kick off also Domestic Violence Awareness  Month.\n\nAs a former AG like myself, this is really important…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "Mr. HAWLEY. Mr. President, I want to thank Senator Durbin for his  incredible leadership on this issue. It is truly a privilege to partner  with him on this effort.\n\nAnd I just want to say that the premise of this bill…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, I want to thank the Senator from Virginia  for leading this effort. There is likely no issue more important that  confronts us as a nation, as a people, as a Congress, than whether or  not to send…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I want to thank my colleague Senator  Blumenthal and the Presiding Officer for his great service. We do know  the Marine Corps is part of the Department of the Navy, so we are all  related here. I won't…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Senate  cooperation on these issues.\n\nSo that is an important issue for Alaskan Native heritage, culture,  artists, and now it has passed the Senate. So, again, I want to thank  Senator Padilla.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}]