[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…President, before he leaves the floor, I just want to  thank Leader Schumer for all the help. We are going to be focused today  on something that really matters to people, and I thank him.\n\nMr. President, we are beginning, as you can tell, to discuss the  resolution to repeal the global tariff emergency.\n\nAs is becoming routine under this President, Americans…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…from education, zoos,  and the civil rights museum. It is a big loss to Memphis. It is a big  loss to Tennesseans. It is a big loss to Americans.\n\nMr. Speaker, I thank Mr. DesJarlais and Mr. Burchett for joining me  up here. I ask everyone to stand for a moment of silence in the memory  of Frederick W. Smith, Jr., a life well lived.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of Federal courts and the Supreme Court of  the United States of America. That is what he is doing.\n\nMr. Speaker, how much time do I have remaining?\n\nMr. GREEN of Texas. Thank you, Mr. Speaker, for your kindness.\n\nHe is defying the Federal courts. Once you do this, you become a de  facto dictator--you reduce the country to a de facto dictatorship--and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…colleagues, Chairman Williams and Ranking  Member Velazquez, for this incredible work and, as Mr. Stauber said,  allowing us to work together in this way.\n\nMr. Speaker, I thank Mr. Stauber for his incredible work in this area  and for his willingness to advocate for so many Americans, including  his own child. It takes tremendous strength and courage.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…joint resolutions of disapproval  regarding the California waivers at issue does not qualify  for expedited consideration under the Congressional Review Act?\n\nMr. SCHUMER. Thank you, Mr. President.\n\nBefore I yield, I want everyone to understand what the essence of my  question was. This week, the Republicans want to use a legislative tool  known as the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691448/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…time,  President Trump has become the President who fired the most veterans in  our Nation's modern history, over 6,000 fired and counting. Let's set  the record straight.\n\nThank you, Mr. President.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…overdue  compensation to these Americans, the first and the most consistent  victims of our nuclear weapons program, but we still are a long way  from justice.\n\nMr. Speaker, I thank Mr. McGovern for hosting this Special Order hour  tonight and for his years of principled leadership on this issue.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I thank Mr. Neguse for yielding.\n\nMr. Speaker, it is Groundhog Day again in Washington, D.C. You know,  this week is an opportunity to drive down electricity costs, create  jobs at home…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "Ms. LOFGREN. Mr. Speaker, I thank Mr. Liccardo for yielding.\n\nI first met Al and Carmen in the late 1970s. When I was elected to  the community college board, Carmen was the secretary for the president  of City…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691560/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I thank Mr. Pallone for yielding  the time, and I thank Chairman Bilirakis for his partnership in this  endeavor, as well.\n\nMr. Speaker, I rise in strong support of H.R. 1479, the Hotel…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…serving America.\n\nMr. Whittington is most proud of the work he has done as a civilian  helping our Nation safely dispose of nuclear waste through his  innovative products.\n\nI thank Mr. Whittington for his service and his contribution to our  community.                            recognizing jim oregel\n\nMr. CORREA. Madam Speaker, I rise today to honor my…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I thank Mr. McGarvey for yielding.\n\nMr. Speaker, I recognize the colleagues who have joined me in leading  this bill, Congressman Alford of Missouri, Congressman Mfume of  Maryland,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…because of his sexual orientation but also because he would  not comply with the authoritarian regime there.\n\nIs that your understanding, as well?\n\nMr. TAKANO. Mr. Speaker, I thank Mr. Garcia for traveling to El  Salvador on his own resources and to our colleagues who spent their own  resources  because this House of Representatives will not do oversight…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Mr. Neal for the time.\n\nMr. Speaker, time is up. The ACA tax credits are expiring December  31.\n\nThe ACA premium tax credits have provided healthcare access for 15  years to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698372/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…managing Member and for yielding  to me this evening. I thank him for these moments tonight as we are in  a very critical time, as my friend has been expressing before I came.\n\nI thank Mr. Johnson's staff, as well, for taking the time and effort  to put this together tonight and the Litigation Task Force for  convening on the floor tonight.\n\nI am proud to join…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…over the last few days. It       makes me think that maybe he doesn't want to stop the war--      he's just tapping me along--and has to be dealt with       differently.\n\nThank you, Mr. President, for saying that.\n\nOne of the President's staunchest supporters in this body echoed that  statement just yesterday.\n\nSenator Kennedy of Louisiana said:\n\n[P]utin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…quality care to patients at home. More than 140 leading  healthcare organizations, including hospitals, healthcare providers,  and patients support this legislation.\n\nI thank Mr. Smucker, Mr. Evans, and Ms. Moore for their friendship  and bipartisanship on this bill. I thank Leader Scalise and Whip Emmer  for bringing this to the floor tonight. I urge my…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697172/hospital-inpatient-services-modernization-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I thank Mr. Moore so much for the  time. I appreciate it.\n\nMr. Speaker, it is a new year and with every new year, I like to  reflect on where am I going. What am I doing? What do I want…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…GRIFFITH. When debating this resolution, H.J. Res. 35, is it  appropriate to discuss superfluous matters to the matter at hand  currently on the floor?\n\nMr. GRIFFITH. Thank you, Mr. Speaker.\n\nMr. GRIFFITH. Mr. Speaker, let me be clear: I meant no offense and no  criticism. As the gentleman from the other side of the aisle and from  New Jersey knows, I love…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…forward to guest conducting, running  clinics and teaching lessons online, as well as continuing to play his  saxophone. He is the proud father of one daughter.\n\nMr. Speaker, I thank Mr. Parker for his 27 years of service to the  Quakertown community, and I am honored to congratulate him on his well- deserved retirement. His efforts have made an everlasting…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…down on that successful approach.  It seems the deciding factor for Democrats' newfound opposition is  grounded in Trump derangement syndrome.\n\nMs. FOXX. Mr. Speaker, I also thank Mr. Salazar for his work and,  actually, all the staff who work so hard around this Capitol. We are  very blessed.\n\nMr. Speaker, I understand that Mr.--I am going to say this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Chair, I thank Mr. Arrington for yielding  this time.\n\nMr. Chair, what is irresponsible, to those watching this debate, is  the truth about the Biden-Harris policies, that when you combine…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…threat.\n\nWith border crossings thankfully going down since January, I think it  is safe to assume this will drive threats at our border underground  through these tunnels.\n\nI thank Mr. Correa for co-leading with me, and I urge my colleagues  on both sides of the aisle to support this legislation for a secure  southern border.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…This will reduce  wasteful spending and improve government efficiency.\n\nMr. Speaker, I thank Ms. Brown for bringing this important  legislation back to this Congress. I also thank Mr. Fallon and Ms. Mace  for their early and continued support of this bill.\n\nI encourage my colleagues to support this bill, and I reserve the  balance of my time.\n\nMr. TIMMONS.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…called the President and  talked to him about it. And he said: No, I am going to listen to my  adviser, and he agreed to it.\n\nThe President has recently changed his mind. Thank you, Mr.  President. Thank you. Thank you. Thank you. Many in the United Kingdom  are starting to question the decision of Prime Minister Starmer.\n\nThe House of Lords, one of the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I thank Mr. Westerman, the chairman, for  his leadership on this issue and all energy-related issues. He is  providing a great service to our Conference and to the country.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Mr. EDWARDS. Mr. Speaker, I thank Mr. Valadao from California for his  leadership on Modernizing All Veterans and Survivors Claims Processing  Act. This important legislation streamlines the VA claims process,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…effectively serving the  small businesses that Congress intended.\n\nFinally, my colleagues are here to debate the SUPPORT for Patients  and Communities Reauthorization Act. I thank Mr. Guthrie for  introducing this important legislation. This bill reauthorizes the 2018  legislation President Trump signed into law and strengthens it. I am  glad to say that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…force for good, its mission has drifted  far from its Cold War origins. This is a classic tactic of the swamp  where bad policy and corruption hide behind a noble title.\n\nI thank Mr. Mike Benz and other patriots. We have learned that this  organization has engaged in global censorship, domestic propaganda, and  regime-change politics. It has worked to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]