[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…got diagnosed  with Parkinson's after spending months at the World Trade Center.\n\nThe fact of the matter is, on 9/11 my Republican colleagues will fall  all over themselves to thank firefighters and say how they will never  forget. I will tell you something, we are going to never forget the  deafening silence and the inaction as these investigators and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690904/protections-for-firefighters"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…put a lot of work into this  as she serves as the co-chair of the America 250 Caucus and serves on  the Semiquincentennial Commission.\n\nMrs. WATSON COLEMAN. Madam Speaker, I thank Representative Waters  from the great State of California for yielding.\n\nLet me just say, I enjoyed working on this endeavor with my colleague  across the aisle, Mr. Aderholt.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. Speaker, at the outset, I thank the chair and the ranking member  for getting us to this stage on this bill.\n\nI also thank the cosponsors of this bill. Just from the committee, we  have some 13 Democrats…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and encourage our colleagues on both sides of the aisle to  say, yes, we want this bill, H.R. 730, to move forward.\n\nMs. STEVENS.  Houlahan) for her remarks.\n\nMr. Speaker, I thank our wonderful sponsors of this bill. It is  really quite exciting. We continue to move toward urging colleagues to  vote ``yes'' on H.R. 730, the Mathematical and Statistical…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…colleagues' budget bill is signed into law.\n\nWe have to protect Medicaid at all costs. I will continue standing up  against any cuts to these lifesaving benefits.\n\nMr. Chair, I thank everyone who has been part of this fight. This  bill will save lives.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691877/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I rise to note the extraordinary act of  patriotism of one of our fellow citizens. I rise today to thank  MacKenzie Scott, formerly the wife of Jeff Bezos, for donating $50  million to Bowie State University, the largest single contribution in  the school's history.\n\nBowie State…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698077/thanking-mackenzie-scott"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…provide composters to residents. In 2015, Dorothy was named a  Sustainability Hero by Sustainable Jersey. I am confident that the 6th  Congressional District of New Jersey will thank her for her efforts to  keep Middlesex County's greater environment safe, healthy, and thriving  for years to come. As she embarks on this new phase, Dorothy is joined  by…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleague, chairman of  the Foreign Relations Committee about timing.\n\nI want to talk about timing because we have just passed the third  year of this war. This moment is crucial.\n\nThank you to Senator Sanders, Senator Van Hollen, Senator Durbin-- soon we will hear from Senator Bennet. We have resolutions that support  Ukraine at a critical moment in its history.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I want to thank my colleagues in  the Congressional Black Caucus (CBC) for organizing this Special Order.\n\nAs we get ready for Thanksgiving, families across our Nation are  coming together.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Troop 1166\n\nOn behalf of the 1st Congressional District of Missouri, I  congratulate them on their achievement of the highest distinction in  Girl Scouts, the Gold Award. I thank them all for their leadership and  for making such a positive, lasting change in our community.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…service, which recognizes members of the Senior Executive  Service for a sustained record of exceptional professional achievement.  It was aptly awarded and richly deserved.\n\nI thank Ms. Barlow for her tireless public service--which often  included long days, evenings, and weekends--as she worked to ensure  that critical economic and social services programs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…put some limits on things. The problem with the  way it is now is that it opens it up, and it is impossible to even  trace what money is coming in and from where.\n\nI want to thank Senator Kelly for bringing us to the floor today to  discuss such an important issue for our democracy and thank my  colleagues who are here today.\n\nIn the 2024 Federal election,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I thank Congresswoman Schrier for her  leadership, her friendship, and for being an advocate on behalf of her  constituents.\n\nMr. Speaker, I rise today to demand answers on the recent…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…insightful analysis are ending here after his  time in Washington.\n\nIn closing, on behalf of my colleagues in the Senate, I extend my  profound thanks to Ambassador Rudd. I thank him for his steadfast  service, for the wisdom he has shared, and for the friendship he has  offered. The bonds between our two nations are stronger because of his  work. I…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I thank the gentlewoman for putting this  together. I really appreciate it.\n\nMr. Speaker, I rise today in strong opposition to the Trump  administration's attack on our scientific…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Leonard G. ``Bud'' Lomell served as a great example of the Greatest  Generation. It is a fitting tribute to name the VA clinic after him to  tell the story of his service.\n\nI thank the sponsor of this bill, Representative Smith, as well as  the entire New Jersey delegation for honoring their fellow New Jerseyan  with this tribute.\n\nMr. Speaker, I urge…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…now retiring after all  of that time.\n\nBeing a servicemember is tough. It is demanding, and the time spent  away from your family is even harder. Yet, we can never forget to thank  those who make that sacrifice.\n\nI thank him; his wife, Tawny; and his children, Dallas, Ashlynn, and  Teagan, for making sacrifices so our Nation can prosper.\n\nChief Jason,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…and funding Jack Link's  Aquatic and Activity Center. The center provides the Minong area with  its first space for swimming, fitness, and youth programming.\n\nMadam Speaker, I thank Jack Link for strengthening America and  Wisconsin's manufacturing, and offer congratulations to Jack, Mary Jo,  and the entire Link family on this honor.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700132/congratulations-to-jack-link-founder-of-link-snacks-inc"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…laid out-- Mr. BURLISON. Yes.\n\nMr. ROY.--which is to stop subsidizing insurance companies, stop  enriching insurance bureaucrats, and empower the American people?\n\nMr. ROY. I thank the gentleman for his time.\n\nMr. ROY. I wish him safe travel back to Missouri, and hopefully, next  week, we can get busy saving the American people from a broken  healthcare…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…statue of Benjamin Franklin.  It will also be required that the statue be placed in a publicly  accessible permanent location no later than December 31, 2026.\n\nMadam Speaker, I thank Representatives Houlahan and Fitzpatrick and  their 72 additional cosponsors for bringing this legislation forward. I  urge my colleagues to vote in favor of H.R. 250, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…remarkable family.\n\nBehind every Medal of Honor recipient is a family that has also  sacrificed. Our military families often bear the weight of their loved  one's service. I also thank them for their sacrifice.\n\nMr. Speaker, when we observe National Medal of Honor Day, we honor  these heroes, and we affirm our sacred obligation to all who wear the  uniform.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…machines represent the complete collection of the aircraft  flown by the Mighty Eighth throughout the Second World War in both the  European and Pacific theaters.\n\nMr. Speaker, I thank the Barksdale Air Force Base for reallocation  and preservation of these historic planes. Efforts like these allow the  National Museum of the Mighty Eighth Air Force to fully…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…ignored.\n\nFor the sake of our national security, our communities, and the men  and women in uniform who stand the line every day, I urge a ``no'' vote  on this resolution. I thank my colleague for yielding me the time.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…FISCHER. Mr. President, today, the U.S. Senate will vote on my  resolution to overturn the EPA's waiver for California's Advanced Clean  Trucks.\n\nFirst of all, I would like to thank my friend and colleague Chairman  Capito for her strong leadership and work on this very important issue.  This heavyhanded regulation imposes unrealistic emissions requirements…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the answer\n\nMr. JOYCE of Pennsylvania. Madam Speaker, this past weekend marked 1  year since the attempt on President Trump's life in Butler County,  Pennsylvania. While we thank God that President Trump's life was not  taken, we mourn the loss of an innocent father, firefighter, and proud  Pennsylvanian, Corey Comperatore.\n\nPolitical violence of any…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…disparity punishes taxpayers electing to correspond with the IRS  electronically, which should be the preferred method of communication  in this day and age.\n\nMr. Speaker, I thank Chairman Smith for his leadership and for making  tax administration and improved efficiencies a priority within the Ways  and Means Committee.\n\nMr. Speaker, I also thank my…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689375/electronic-filing-and-payment-fairness-act"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Mr. Speaker, this is a narrowly tailored, community-driven proposal  that directly supports clean water, public safety, economic growth, and  good government.\n\nMr. Speaker, I thank Chair Westerman and the members of the committee  for their support of this bill, and I urge a ``yes'' vote on H.R. 655.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…embrace this push for a more developed digital  economy. In doing so, we cannot jeopardize who we are as Americans, and  this bill is designed to ensure just that.\n\nMr. Speaker, I thank Chairman Hill and Chairman Steil for their  tireless work and advocacy on this issue, in addition to the 135  Members of Congress who have joined as cosponsors of our legislation.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…are sad to  see him go, but I also know he won't be a stranger. He has been named  the grand marshal of this year's Paynesville Town and Country Days  parade.\n\nMr. Speaker, I thank Ron so much for his service to the community and  congratulate him on a well-earned retirement.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to honor and thank Dale Anderson  for his service to the Fifth Congressional District of Colorado for  over 18 years.\n\nDale served my predecessor, Congressman Doug Lamborn, in several  roles,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693635/recognizing-dale-anderson"}]