[{"senator": "Greg Landsman", "party": "Democrat", "sentence": "Mr. LANDSMAN. Mr. Speaker, I thank Ranking Member Pallone for  yielding.\n\nMr. Speaker, the Securing Semiconductor Supply Chains Act, as has  been said, is a very straightforward, commonsense bill. It will help  strengthen…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690163/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the ranking member of the Education  and Workforce Committee, Mr.  Bobby Scott, for yielding time.\n\nMr. Speaker, like so many women across the country, I struggled for  so many years…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "Ms. FRIEDMAN. Mr. Speaker, I thank Ranking Member Morelle for  yielding me time.\n\nMr. Speaker, I rise in strong opposition to this so-called SAVE Act,  a bill that is a modern-day poll tax targeting American women and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Chairman, I thank the ranking member for  yielding me time and thank her for everything that she does to protect  the pocketbooks of American families.\n\nMr. Chairman, American families and small business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank the ranking member for yielding.  I also thank the chairman for bringing this legislation forward along  with my colleague from California (Ms. Simon).\n\nMr. Speaker, I rise today in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I thank the ranking member for yielding.  I rise in opposition to this bill, which will only hurt the retirement  savings of millions of Americans.\n\nOur Republican colleagues are once again…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I thank Ranking Member Pallone  for yielding the time.\n\nI stand in strong support of H.R. 2037, the Open RAN Outreach Act. I  am proud to introduce this bipartisan Open RAN Outreach Act with…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "Ms. BROWNLEY. Madam Speaker, I thank the ranking member for yielding,  and I thank him for the very kind words. I appreciate it very much. I  thank the chairman and the ranking member for their support of this  bill, the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Madam Speaker, I thank Ranking Member Morelle for  yielding.\n\nToday, I am so grateful to have the opportunity to rise and offer  this bipartisan legislation, H.R. 250, the Benjamin Franklin statue  placement…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…DAVIS of North Carolina. Mr. Speaker, to the chair and the  ranking member, I thank them for their work and their leadership that  has gotten us here today. I also thank the ranking member for yielding  time.\n\nMr. Speaker, I stand in strong support of the 2026 NDAA. It is an  essential piece of legislation that underscores our commitment to  ensuring…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Chair, I thank the ranking member for the time.\n\nI rise today because I believe the Federal Government has a  responsibility to stand with all communities across northwest Indiana-- big cities, small…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise in support of H.J. Res. 72.\n\nI thank Ranking Member Meeks for his great leadership on this  critical issue.\n\nIt is time to end Trump's illegal tariffs on Canada, his tariffs on  United States' biggest trading partner,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699973/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I thank Ranking Member Smith for yielding  time.\n\nMr. Speaker, as our country wastes trillions of dollars in wars  overseas, the American people are frustrated and saying: Why is it that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, I thank Ranking Member McGovern for yielding.\n\nMr. Speaker, I rise in strong opposition to this rule and the  underlying bill.\n\nFor the first time in history, this bill would force States…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I very much thank Ranking Member DeLauro for  yielding time. I also thank Chairman Cole and the chair of our  committee, Charles Fleischmann, for their cooperation. Please let me  thank our diligent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…Speaker, H.R. 1325 is a simple, bipartisan bill that will help  ensure that the United States remains the global leader in the  commercial remote sensing industry.\n\nI thank Ranking Member Lofgren for joining me in advancing this  legislation, and I urge all of my colleagues to support this bill.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…from Maine, Senator Collins, for her  just constant effort to keep us to task and really working so well with  members of the committee.\n\nI also want to recognize and thank my ranking member, Senator  Merkley. He has been a partner to work with on this committee. Again,  we don't always see eye to eye on the issues, and one wouldn't expect  us to. But…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "French Hill", "party": "Republican", "sentence": "…these improvements in the Housing for  the 21st Century Act fully apply to housing in rural areas, not just  urban areas.\n\nMr. Speaker, first, I have to say a big thank-you to Ranking Member  Waters; the ranking member of our subcommittee, Mr. Cleaver; and the  tireless leadership of  Mike Flood, the chair of our Subcommittee on  Housing and Insurance.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today in support of S. 2392.\n\nFirst, I thank Senator Moran and Senator Blumenthal for leading this  bill in the Senate. I also thank the Ranking Member of the Subcommittee  on Disability Assistance and Memorial Affairs, Mr. Morgan McGarvey, and  Mr. Takano for joining me in co-leading the House companion of S. 2392.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…and  Sexual Abuse Free Environment Act.\n\nMr. BIGGS of Arizona. I am prepared to close, and I reserve the  balance of my time.\n\nMr. BIGGS of Arizona. Madam Speaker, I thank Ranking Member Raskin  for his helpful suggestions that will make this bill much better and  has made it much better. I thank Ranking Member McBath for her support  as well.\n\nIt is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…deserves nothing less from their government.\n\nI thank my committee colleague, Representative Ro Khanna from  California, for cosponsoring my legislation, and I especially thank the  ranking member for working with my staff to help us advance a  bipartisan bill here today.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support the Guidance  Out Of Darkness…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…infrastructure and supports  Arlington National Cemetery. It invests in the improvement, operations,  and maintenance of burial grounds for those who have sacrificed.\n\nI thank Ranking Member Wasserman Schultz. I am glad we are at this  step in the process and hope that we continue to work together to  support our troops and our veterans.\n\nEveryone--everyone,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…that every community, regardless of politics,  regardless of blue or red, can count on the support it needs to prevent  and respond to acts of terrorism.\n\nLastly, I thank Ranking Member Thompson, Resident Commissioner  Hernandez, and former Congressman and Chairman Mark Green for  cosponsoring this bill. I also extend my gratitude to the Major Cities…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, I thank the chairman for his steadfast  support, and I also thank the ranking member for his support.\n\nI rise today in support of H.R. 1664, the Deploying American  Blockchains Act of 2025, bipartisan legislation that I am proud to lead  alongside…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…American people.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 1234.  I urge quick action in the Senate, and I reserve the balance of my  time.\n\nI thank the ranking member, Mr. Morelle, for his support and  bipartisanship in coauthoring this legislation with me.\n\nThis is an easy win for taxpayers, saving taxpayers $4 million using  a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…passed the House last year with bipartisan support,  and this year H.R. 881 passed the Committee on Homeland Security with  unanimous, bipartisan support.\n\nI thank Chairman Green; Ranking Member Thompson; my counterpart on  the Subcommittee on Counterterrorism and Intelligence, Ranking Member  Magaziner; and the Committee on Homeland Security staff for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…the cardinals do their work. He has worked with  Members in the minority and the majority. He has worked with Members of  the Senate and the House. Mr. Speaker, I also thank Ranking Member  Marcy Kaptur and our colleagues across the Capitol.\n\nThis is a strong bipartisan bill. It addresses America's needs and is  a great bill, and it should get bipartisan…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…Senate Financial Services and General Government  Subcommittee Chairman Hagerty and Ranking Member Reed. I appreciate all  of their work on this bill.\n\nSeparately, I thank my ranking member, Mr. Hoyer. I value his  institutional knowledge and his insight on and off this committee. I am  sad to see him leave at the end of this Congress.\n\nI rise today in…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…vitally important that the United  States Government understand the national security implications  associated with its own Federal procurement policies.\n\nMr. Speaker, I thank the ranking member, Mr. Connolly, for co-leading  this bipartisan initiative with me, and I urge my colleagues to support  this commonsense piece of legislation.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, I thank the chairman for this important  piece of legislation. I thank the ranking member for her passion and  her concern for small businesses in America.\n\nMr. Speaker, I rise today in strong support of H.R. 2931, the Save  SBA from Sanctuary Cities Act…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}]