[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "Madam Chair, I thank President Trump for now realizing it is  important we come to Ukraine's aid through our NATO partners."}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank President Buchanan for his hard work and  dedication to serving his country and his community."}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "I want to thank President Lisa Su and the other leaders for their  leadership and service, and I am proud to recognize the organization's  continued positive impact."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "In particular, on behalf of the American People, I want to thank President Xi!'\n\n\"There was no more enthusiastic cheerleader for China and its response to coronavirus in January, February and March than our own president."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "\"I thank President Trump for acting on our request to ensure we have the help needed to keep Montanans safe during this crisis."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "\"This law paves the way for students, teachers, and researchers in Montana to focus on what's at the core of this nation: honoring those who served and inspiring future generations of Americans to do the same.\"\n\n\"I thank President Trump for signing into law our bipartisan bill that establishes a grant program to honor veterans' legacies,\" said Rounds."}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "I thank President Trump for exposing this waste and working to  protect Americans' hard-earned dollars."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "\"I thank President Trump for approving a disaster declaration for Nebraska."}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "I  do want to take a moment, and I want to thank President Trump and his  executive order that he knows that this bipartisan committee for coal  was established over the last 30 years, and it was a bipartisan  approach to make sure that national security, which is our grid,  because if our grid melts down, there is no security."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "I want to thank President Donald Trump and Administrator Andrew Wheeler for taking decisive action that will better the lives of millions of Americans across the Country.\"\n\nSenate Western Caucus Chairman Steve Daines (MT): \"This is about common sense policies that protect our environment and support responsible development."}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "I urge each of my colleagues to vote down this deeply flawed  resolution and instead thank President Trump for continuing to take  historic action to place the safety of the American people first."}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "I want to thank President Trump for granting the Governor's disaster declaration so Western North Carolina can continue to recover from these storms.\""}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "I thank President Trump for inviting me to attend today's signing, and for his strong support of our ag producers and manufacturers.\""}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "\"I thank President Trump for signing this executive order and recognizing the importance of keeping our food supply chain safe, secure, and plentiful."}, {"senator": "Roger F. Wicker", "party": "Republican", "sentence": "\"I want to thank President Donald Trump for approving Mississippi's emergency declaration yesterday,\" Wicker said."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "I want to thank President Donald Trump and Administrator Andrew Wheeler for taking decisive action that will better the lives of millions of Americans across the Country.\"\n\nSenate Western Caucus Chairman Steve Daines (MT): \"This is about common sense policies that protect our environment and support responsible development."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "I thank President Trump for his support in getting this done and I look forward to working with my colleagues to get this historic conservation win signed into law.\"\n\nDaines' new bill requires full, mandatory funding of LWCF at $900 million."}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "\"I thank President Trump for signing into law our bipartisan bill that establishes a grant program to honor veterans' legacies,\" said Rounds."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "I  thank President Trump for green-lighting that."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "We thank President Trump and his administration for this fix, and will continue to work to lessen the impact COVID-19 has had in our rural communities,\" said Rep."}]