[{"senator": "Alma Adams", "party": "Democrat", "sentence": "Ms. ADAMS. Mr. Speaker, I thank Ms. De La Cruz for yielding time.\n\nMr. Speaker, on the final day of Women's History Month, I rise  tonight to highlight the value of the Women's History Museum. Karen  Staser…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Ms. McClellan for  yielding, and I thank Representatives McClellan and Clyburn for  initiating this Congressional Black Caucus Special Order on education.\n\nLet me just say that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…antipoverty program for the elderly and number one antipoverty  program for children, and more veterans rely on Social Security  disability than they do the VA.\n\nMr. Speaker, I thank Ms. Stansbury for her efforts and initiatives.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…agreed to, the preamble be agreed to, and that  the motions to reconsider be considered made and laid upon the table  with no intervening action or debate.\n\nMs. ALSOBROOKS. Thank you.\n\nMs. ALSOBROOKS. Robert F. Kennedy, Jr., Secretary of Health and Human  Services, is presenting a clear and present danger to the health and  well-being of the American people.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, I thank Ms. Waters for the time, although I  must say that I am a little bit confused. I am not going to frame this  as a parliamentary inquiry, but I am very confused.\n\nWe have just…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…has come in and has already been making a  mark. I know she is here with the intent of being a reformer, which is  what we need in Congress.\n\nMr. MAGAZINER. Mr. Speaker, I thank Ms. Ansari for her thoughts on  this matter. Before I yield to the next Member, let me just preface  this by saying, again, we have had a big couple of weeks in this fight  to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Speaker, I thank Ms. Kaptur for bringing us together.\n\nMr. Speaker, I rise in great urgency to voice the concerns of  hardworking families in Indiana's First Congressional District.\n\nCommunities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…that said, I support this bill to award medals of sacrifice to  other public safety officers who lose their lives in service to their  country and their communities, and I thank them.\n\nMs. SCANLON. Mr. Speaker, I endorse the comments of the sponsor of  the bill. I totally agree we should be honoring the sacrifice of our  public safety officers and it is…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699503/medal-of-sacrifice-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…service, which recognizes members of the Senior Executive  Service for a sustained record of exceptional professional achievement.  It was aptly awarded and richly deserved.\n\nI thank Ms. Barlow for her tireless public service--which often  included long days, evenings, and weekends--as she worked to ensure  that critical economic and social services programs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to children.\n\nJacobs),  a person who has been a real champion on the issue of hunger around the  world, to hear her thoughts on the subject.\n\nMr. MAGAZINER. Mr. Speaker, I thank Ms. Jacobs for her long body of  work championing children around the world, particularly on the issue  of malnutrition. I will continue to stand in this Chamber every day we…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…classrooms where they are often told to shrink or stay  silent. She teaches her students more than just math. She teaches them  that they matter. She gives them a voice.\n\nI thank Ms. Suarez for being an incredible teacher and for her work  and deep commitment to her students.           Celebrating Centennial Anniversary of Leyden High School\n\nMr. GARCIA…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…Square.'' This historic renaming will ensure Ms. Figueroa-Villa's  legacy is remembered by all Angelenos in the years ahead.\n\nOn behalf of my colleagues in Congress, I sincerely thank Ms.  Figueroa-Villa for her continued dedication to Los Angeles and lifelong  career in public service.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, I rise in support of my bill, H.R. 618. I  thank Ms. Hoyle, the floor manager for the committee as well as the  chairman, for the courtesy.\n\nIn 1989, Congress enacted the Apex Project, Nevada Land Transfer and  Authorization…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…communication and the outreach that will come  from the office, small businesses will be able to access resources that  should be readily available to them.\n\nI will, once again, thank Ms. Goodlander, Mr. Wied, and Mr. Golden  for their bipartisan efforts on behalf of America's rural small  businesses.\n\nGoodlander).\n\nMr. CISNEROS. Mr. Speaker, I have no further…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697282/office-of-rural-affairs-enhancement-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…freshmen of the Democratic  Caucus and the work that they are doing to  make life more affordable for their constituents.\n\nMs. RIVAS.  Elfreth).\n\nMs. RIVAS. Mr. Speaker, I thank Ms. Elfreth for her remarks.\n\nMs. RIVAS. Mr. Speaker, may I inquire how much time I have remaining.\n\nMs. RIVAS. Mr. Speaker, over the past year, Republicans have chosen  to focus…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…delivery of critical  housing assistance. H.R. 225 simply ensures that HUD operates with the  openness and accountability the American people expect and deserve.\n\nMr. Speaker, I thank Ms. De La Cruz for this important measure, and I  urge our colleagues to support it.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the Congressional  Budget Office estimate…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…EDWARDS. I thank the Speaker so much for giving your time out of  your incredibly busy schedule. You are always really generous with your  time for the former Members. Thank you so much.\n\nMs. EDWARDS. We appreciate that, Mr. Speaker.\n\nThe Chair now recognizes the Honorable Barbara Comstock of Virginia,  who is president of the Former Members of Congress…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Mr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue water  infrastructure improvements in rural Colorado. I thank Ms. Boebert for  her diligent work and attention to these issues.\n\nArizona is no second citizen to this. We want to see this happen and  help everybody.\n\nI urge my colleagues…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…those around her.\n\nThis achievement speaks not only for Ms. Harn's fantastic skills as a  professional, but also for her grateful and compassionate attitude.\n\nMr. Speaker, I thank Ms. Harn for her professionalism, dedication,  and commitment to her field.                        Honoring Nurse Heather Daniels\n\nMr. CARTER of Georgia. Mr. Speaker, I rise…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…manage its software and develop a  plan for addressing any costly, unnecessary licenses. This will reduce  wasteful spending and improve government efficiency.\n\nMr. Speaker, I thank Ms. Brown for bringing this important  legislation back to this Congress. I also thank Mr. Fallon and Ms. Mace  for their early and continued support of this bill.\n\nI encourage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…smart, bipartisan legislation that  codifies the partnership between DOE and USDA, ensuring that they can  continue to work together on these interindustry challenges.\n\nI thank Ms. Lofgren for working with me these past two Congresses on  this bill, and I deeply appreciate her support of agricultural  research. It is always a pleasure to be on the floor…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688981/doe-and-usda-interagency-research-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…of my time.\n\nMr. CRANK. Mr. Speaker, H.R. 2388 takes approximately 1,083 acres of  National Park Service land into trust for the Lower Elwha Klallam  Tribe.\n\nMr. Speaker, I thank Ms. Randall for her work on this legislation, I  urge the adoption of the bill, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Speaker, we have no additional speakers  and are prepared to close.\n\nMr. SMITH of Missouri. Madam Speaker, I yield myself the balance of  my time.\n\nMadam Speaker, first, I say thank you to Ms. Sewell, and Mr. Neal for  their help in order to get this across the finish line. This is an  important piece of legislation that I know my staff, Josh Snead and  Hilary…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…America at the forefront of discovery.\n\nI urge my colleagues to support this commonsense extension, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I thank Ms. Velazquez, and I urge  my colleagues to support this commonsense legislation to continue  uplifting small business innovation across America.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}]