[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…pass the Sickle Cell Disease Comprehensive  Care Act, introduced by my Republican colleague out of Florida,  Representative Neal Dunn. I am a proud cosponsor, and I thank him for  his leadership on this issue.\n\nWe need this so we can better understand and improve how we track and  understand care for patients like Dakota and so we can better identify  where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…something  that may not be popular with everyone in this Chamber and have also  made it enough of a priority to come tonight is a great credit to each  of them. I thank them for their leadership.\n\nMr. MAGAZINER. Mr. Speaker, I come from New England where we also  know something about winning all the time, but we will keep it in  Missouri for now.\n\nMr.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…They  are the bridges between employers and employees. Without labor unions I  often wonder what Life in this country would be? Therefore, I take this  opportunity to thank the leadership of the Chicago Local APWU 0001 for  leadership well provided and a job well done.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697484/congratulating-the-american-postal-workers-union-chicago-chapter-0001"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…abstractions, they are real.''\n\nI was reminded of that during a visit to Kosovo a few years ago.  While standing at Secretary Albright's statue, an older man approached  to thank us for her leadership and for the U.S. role in ending the war  there. It was a clear reminder that when the United States stands with  people fighting for basic rights, it makes a difference.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…past Veterans Day, I was honored to visit the H.E.R.O.E.S. monument at  Freedom Park, and I can attest to the honor it brings to our veteran  community. I, again, thank her for her leadership and tireless efforts.                      Honoring 2026 Teachers of the Year\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize the exciting  achievement of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…state, and local entities. It has been an honor to work with Joe to  protect our communities, and I and the residents of the 6th  Congressional District of New Jersey thank him for his leadership.\n\nIn his early career, Joseph served as the official Corps liaison to  the City of New York in the wake of the 9/11 World Trade Center  tragedy. Throughout his tenure,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…honored to serve as  the ranking member with the distinguished Member of this body, Mr.  Joyce.\n\nIf he would like me to yield to him now, I will. If not, I want to  thank him for his leadership of our committee, which has been collegial  and positive. I think it has led to this resolution today.\n\nMr. Chair, I urge strenuously and by the way, let me mention…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Louisiana because of  his familial ties to the naming of Shreveport, but my across-the-hall  neighbor in the Cannon Building, the gentleman from Indiana (Mr.  Shreve), I thank him for his leadership and support on this issue.\n\nThis bill develops space-sharing guidelines to prevent overbuilding  of new Federal courthouses. As a former Department of Justice staffer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…young women to the global stage.\n\nMr. Speaker, on behalf of Texas' Seventh Congressional District, I  congratulate these four young women on their selection. I thank them  for their leadership and send best wishes for their future endeavors.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688693/recognizing-girl-scouts-of-san-jacinto-county-texas-at-the-united-nations-69th-commission-on-the-status-of-women"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…support the       Setting Consumer Standards for Lithium-Ion Batteries Act and       help move this important public safety measure forward       without delay.\n\nThank you for your leadership and attention to this urgent       issue.            Sincerely,                                                     Manuel Moreno,      BOMA International Chair…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…colleagues to do something really big that hasn't  been done in 40-plus years.\n\nMr. Speaker, I thank Mr. Moore for the opportunity to address our  colleagues. I thank him for his leadership, his Conference leadership  and on the Budget Committee and the Ways and Means Committee. It is an  honor to work with him.\n\nGod bless our great country. Let's get…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…fortunately, that is not the case this  year.\n\nI worked closely with our full committee leadership, Chairman Collins  and Ranking Member Murray, and I want to thank them for their  leadership. They have kept us all to task, and their leadership--and I  particularly commend my colleague from Maine, Senator Collins, for her  just constant effort to keep…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…gentleman from  South Carolina (Mr. Wilson), the sponsor of this legislation.\n\nMr. WILSON of South Carolina. Madam Speaker, I thank Chairman Brian  Mast for yielding and thank him for his leadership on behalf of the  American people.\n\nMadam Speaker, I am grateful for the bipartisan endorsement of this  legislation. It is bipartisan with Republican and Democratic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Chairman, I thank the leadership of Chairman Rogers  and Ranking Member Smith on this important piece of legislation.\n\nI rise today in support of this en bloc package, which contains four  of my amendments.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…end result will be less choice for patients  and higher costs. Even with PBMs, it will raise premiums.\n\nMr. BURLISON. No.\n\nMr. BURLISON. Absolutely.\n\nMr. BURLISON. Thank you for your leadership.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the home for many of my constituents of the Greek  Orthodox faith. I welcome the Ecumenical Patriarch Bartholomew, wish  him well during his time in America, and thank him for his leadership  for the Orthodox Christian faith around the world, numbering 300  million.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695657/welcoming-ecumenical-patriarch-bartholomew-to-america"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…of  Representatives and the people it serves. I wish Noah the best for his  well-earned retirement.\n\nOn behalf of my colleagues and the entire House community, I thank  him for his leadership and longstanding commitment to serving the  People's House.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Montana, and       individuals. I urge the Senate to vote ``yes'' on this       resolution and help safeguard Montana's economic backbone for       generations.\n\nThank you for your leadership on this critical issue.            Sincerely,                                                      Vern K. Lund,                                           Chief…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…power constructively to bring  us together across partisan lines and to pass what are bipartisan,  bicameral bills. I am eternally grateful for that.\n\nMr. Speaker, I thank my own leadership. I don't know where Speaker  Johnson got his patience from, but it must be God-given, because his  support throughout this process working with us, never giving up,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…residents in the Arctic.       Ensuring the NPR-A is open for future lease sales will       maintain America's energy dominance and reduce foreign       imports.\n\nThank you for your leadership on this issue of vital       importance to Alaska's economic future.            Sincerely,                                                    Leila Kimbrell,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…support of H.R. 1912 introduced by my  colleague from Virginia (Mr. Connolly). My prayers are with him and his  family as he once again battles cancer.\n\nMr. Speaker, I thank the leadership teams, especially Leader Scalise  and his staff, for agreeing to move this bill forward in his absence.\n\nRepresentative Connolly's bill would ensure that the VA's fiduciary…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…build strong relationships within the community. As he  moves on to his next position, the chief of police is held in high  esteem in Gettysburg.\n\nMadam Speaker, I thank him for his leadership and his ability to  serve his community and wish him all the best in his next endeavors.                           Honoring John Massimilla\n\nMr. JOYCE of Pennsylvania.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…process and its outcomes, yet       those concerns were ignored.\n\nI think the words from the North Slope trilateral are particularly  strong and powerful, and I thank them for their leadership on the  issues.\n\nThere is a good chance you will see Senator Sullivan and me here on  the floor of the Senate seeking to disapprove any administrative action…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…regional and State  national history day competitions.\n\nShe is proof that when we empower great educators and focus on merit,  then our students thrive.\n\nMr. Speaker, I thank her for her leadership and proudly recognize her  service today.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "French Hill", "party": "Republican", "sentence": "…program would  build upon the previous success that the Arkansas delegation achieved  in the last Congress for the White River Basin Comprehensive Study.\n\nMr. Chair, I thank the leadership of the committee, I thank the Rules  Committee, and Chair Foxx for adding this amendment under consideration  for the floor today and approved by the Rules Committee.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]