[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…way of  supporting them, and we should shelve this budget, which is going to do  nothing but harm the American people.\n\nI thank the Presiding Officer for his patience. I thank the staff for  being here so late tonight even though tonight's lateness is going to  be nothing compared to tomorrow night's lateness.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…worked tirelessly to plan and  execute the 60th inaugural ceremonies. The JCCIC staff, partners, and  volunteers were all crucial in countless ways.\n\nI want to especially thank the staff director of the Rules Committee  Elizabeth Farrar, who also served as staff director for JCCIC.\n\nOur committee's U.S. Capitol Police Liaison Captain Sean Patton  worked…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…support of this bill, but first,  I want to thank the chairmen of the subcommittees and the full  committee and my ranking member for their leadership. Certainly, I also  thank the staff on both sides for the hard work that they have provided  on this difficult bill.\n\nI represent 280 miles of the U.S.-Mexico border. Let me be the first  to say this bill…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…past. I am not  sure that is a good thing, but there was a lot less stuff that came out  here.\n\nEveryone has to do so much work on this to make this happen, so I  really thank the staff for their incredible work. It is a fine  testimony to how vital government employees are to making our country  run, and I really appreciate that.\n\nSecond, I thank Chairman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…solutions that we can act on right now while we try to  overturn Citizens United. I thank all the speakers today. I thank  Representative Neguse for helping organize this. I thank my staff,  including Matt Fisher, for helping get everyone together today.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Chairman Hill, Ranking Member Craig, Subcommittee  Chair Johnson, and so many others who came to the table in good faith  to get this done.\n\nLet me also take a moment to thank the staff, both the majority and  the minority staff. They put in so many hours working on this. I know I  was up late one night. It was probably midnight. I really commend the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…improving our  cybersecurity for the safety and protection of all Americans. It passed  overwhelmingly in the Energy and Commerce Committee. This is a  bipartisan bill. I thank the staff on both sides of the Energy and  Commerce Committee, Republican and Democratic, for helping us put this  together.\n\nMr. Speaker, I urge all of my colleagues to support…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693424/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Seventh every single day, which includes       majority of parts Boston, Cambridge, all of Somerville,       Randolph, Everett, Chelsea and Milton, can we please just       thank my staff?\n\nThen, of course, I wish to thank all of you and a partner       in good to the left of me. I thank Senator Markey for his       collaborative partnership today in this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…make sure that  we continue to invest in the best people for the Coast Guard.\n\nTo do that, we have to pass this legislation and get it on to the  President's desk.\n\nSo I thank my staff Nikky Teutschel, Melissa Porter, Lila Helms, and  all of the committee staff that worked on this bill. And again, thank  the chairman, Chairman Cruz, for bringing this…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…cup won  by the Panthers in franchise history, and our Sunshine State is so very  proud.\n\nThe whole Panthers' roster obviously contributed to this win, but we  wanted to thank the staff and the coaches and all of those who  supported the team on and off the ice. This success could not have been  achieved without everybody who contributed.\n\nWe watched…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…caring power of communities worldwide to advance a  common good.\n\nThey have proven time and time again that when a community unites,  anything is possible.\n\nMr. Speaker, I thank the staff; the board members; the partner  agencies; and countless volunteers for their compassion, leadership,  and hard work  which have made our region a better place to live,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691973/recognizing-united-way-of-the-bradford-area"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…this kind of product come to the floor in these more recent  years of toxicity in this town and in this Chamber. That toxicity is  not reflected in this product.\n\nI also thank our staff for their outstanding work. This is literally  a cumulative product of 11 months of a lot of hard staff work. The  House Legislative Counsel, the CBO, and the Parliamentarian…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…control the scoreboard, but we can  control the hustle. These tenets are the heart of meritocracy and what  I observed during my visit to the Midvale Girls & Boys Club.\n\nI thank the staff for their commitment. I hope the young people enjoy  the experience, remember what they are learning, apply what they have  learned, and, more importantly, pass it on.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693107/recognizing-midvale-boys-girls-club"}, {"senator": "John Thune", "party": "Republican", "sentence": "…literally, the longest shutdown in history. I am very, very happy to be  able to say that we are coming to the end.\n\nBefore we close today, I want to take the time to say thank you to my  staff, who have worked around the clock tirelessly now for the past 6  weeks; to the staff of the Appropriations Committee, who have played a  critical role in getting us…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696667/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Energy and Water  Subcommittee. Senator Murray is also vice chair of the full committee,  and I want to thank her for her partnership in getting these bills  done. I want to thank the staff of the full committee. They have worked  night and day--literally every night and every day--and I am so  grateful for their dedication and hard work.\n\nThis legislation…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…strong bipartisan bill. It addresses America's needs and is  a great bill, and it should get bipartisan support. This is a strong  bill for America.\n\nMr. Speaker, I also thank the staff, and I do not say this lightly:  My staff, Republican and Democratic staff, worked up and through  Christmas and after Christmas to get this done. These men and women…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…floor today. Additionally,  Representatives Stefanik, Kean, Castor, and Khanna have been strong  partners in garnering support for this legislation as cosponsors. I  also thank my staff as well as those fellow cosponsors on the Energy  and Commerce Committee and in leadership for their diligent work on  this important bill.\n\nI also applaud the administration…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…courageously realized that we could  not let this shutdown continue to go on with the harmful consequences  growing worse with each passing day.\n\nI also want to particularly thank my staff. They literally went  without sleep and worked continuously to do all that needed to be done.\n\nI want to thank Leader Thune and Leader Barrasso for their hard work  and…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…With that, I yield to my colleague Senator Cantwell.\n\nMr. CRUZ. Mr. President, I thank Senator Cantwell and her staff for  their hard work on this bill. I also want to thank my staff on the  committee as well who have put in many hours. This bill is important to  the men and women of the Coast Guard and is important to our national  security.\n\n524 and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…intelligence community, and to the future of our Nation.\n\nSenators, as we all know, don't do anything on their own, even on our  best days. So I wanted to take a moment and thank all of the staff and  the clerks who worked tirelessly, who stayed up for weeks on end, who  dealt with ridiculous crises deadlines, who negotiated and renegotiated  in good faith across…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…country--that the third time will be the charm,  that this will become law. I am confident that it will.\n\nI started by thanking the chairman of the committee and his staff. I  thank the staff, along with the chairman and the ranking member. I also  thank, from my team, Vanessa Scott, who is my staffer who has worked  day in and day out. I would be remiss if…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…supporting  cutting-edge aerial drone programs. As with our ships and submarines,  we are paving a smoother path toward building the projection forces of  the future.\n\nI thank my staff and the staff of the committee. I thank the  gentleman for recognizing me, and I thank my fellow, Commander Bobby  Hsu, who did an outstanding job working on this NDAA.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697808/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…which I think is critical  to make sure those who are tenants in HUD programs have the care,  oversight, and safe and sound conditions they deserve.\n\nMr. Speaker, I also thank the staff on both sides of the aisle for  their work in putting this bill together, particularly on the majority  side, Ed Skala and Maura Woosley, for their collaboration on the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Retirement Savings Act  delivers a significant win to retirees across the Nation, and I  strongly urge my colleagues on both sides of the aisle to support its  passage.\n\nI thank my staff for their diligent work on this bill. I thank  Chairman Walberg for his support throughout the committee process and  Leader Scalise and Speaker Johnson for bringing H.R.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}]