[{"senator": "Al Green", "party": "Democrat", "sentence": "…of Federal courts and the Supreme Court of  the United States of America. That is what he is doing.\n\nMr. Speaker, how much time do I have remaining?\n\nMr. GREEN of Texas. Thank you, Mr. Speaker, for your kindness.\n\nHe is defying the Federal courts. Once you do this, you become a de  facto dictator--you reduce the country to a de facto dictatorship--and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…joint resolutions of disapproval  regarding the California waivers at issue does not qualify  for expedited consideration under the Congressional Review Act?\n\nMr. SCHUMER. Thank you, Mr. President.\n\nBefore I yield, I want everyone to understand what the essence of my  question was. This week, the Republicans want to use a legislative tool  known as the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691448/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…many other worthwhile populations, as well.\n\nMr. Speaker, I support this legislation, and I ask my colleagues to  do the same.\n\nMr. McGARVEY. Mr. Speaker,\n\nMr. Speaker, I thank Mr. Pfluger for bringing this bill to the floor,  for his service to our country before coming to Congress, and for  acting on behalf of all of our aviators who have taken off…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…of the positive changes Mr. Patel has brought to our community.\n\nRecently, he was honored by Cypress College's Americana Awards as  Citizen of the Year in Orange County. I thank Mr. Patel for his great  work. He inspires and honors us.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Mr. Neal for the time.\n\nMr. Speaker, time is up. The ACA tax credits are expiring December  31.\n\nThe ACA premium tax credits have provided healthcare access for 15  years to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698372/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Chair, I thank the former chair and ranking member for  yielding. I thank her for her work. I thank Mr. Cole for his work.\n\nAnybody who knows me knows that I am opposed to CRs, but I am for  keeping the government open, if those are the only alternatives.\n\nMr. Chair, this would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…managing Member and for yielding  to me this evening. I thank him for these moments tonight as we are in  a very critical time, as my friend has been expressing before I came.\n\nI thank Mr. Johnson's staff, as well, for taking the time and effort  to put this together tonight and the Litigation Task Force for  convening on the floor tonight.\n\nI am proud to join…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…a strong proponent for small  businesses in the Federal Government and is well-poised to promote  their views in the international regulatory arena.\n\nMr. Speaker, I thank Mr. Williams, Mr. Tran, Mr. Van Drew, and Ms.  Goodlander for their bipartisan work on this bill.\n\nMs. VELAZQUEZ.  Goodlander).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge my colleagues to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687954/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I thank Mr. Neguse for yielding.\n\nMr. Speaker, it is Groundhog Day again in Washington, D.C. You know,  this week is an opportunity to drive down electricity costs, create  jobs at home…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…am so glad that the Financial Services Committee agreed to make the  test available free of charge to anyone who is willing and able to go  through the rigor.\n\nFinally, I thank Mr. Flood, my colleague from across the aisle, for  working with the committee Democrats on a bill that ensures that the  SEC is appropriately overseeing this exam process.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…further improvements to this measure not reflected in  this bill today. I support advancing H.R. 1166 today so that the Senate  can continue to work on this measure. I also thank Mr. Gimenez for this  legislation.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688684/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I thank Mr. Takano for yielding. I am so  grateful for his leadership and for bringing us together on the House  floor to talk about what is happening here in our country every day.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…overdue  compensation to these Americans, the first and the most consistent  victims of our nuclear weapons program, but we still are a long way  from justice.\n\nMr. Speaker, I thank Mr. McGovern for hosting this Special Order hour  tonight and for his years of principled leadership on this issue.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…inventory, which they voluntarily gave up in return for  a guarantee of territorial integrity--one, unfortunately, which we are  not abiding by.\n\nMr. FOSTER. Mr. Speaker, I thank Mr. Takano for reminding us of  Hiroshima.\n\nMr. Speaker, I had the opportunity for the first time in my life to  visit, and the things that stick in your mind are hard to describe.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I thank Mr. Deluzio for bringing us  together and helping us have an important conversation about how we  restore the mantle of fighting for working people.\n\nI was born and raised in…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…over the last few days. It       makes me think that maybe he doesn't want to stop the war--      he's just tapping me along--and has to be dealt with       differently.\n\nThank you, Mr. President, for saying that.\n\nOne of the President's staunchest supporters in this body echoed that  statement just yesterday.\n\nSenator Kennedy of Louisiana said:\n\n[P]utin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "Mr. BALDERSON. Mr. Speaker, I thank Mr. Weber for yielding me time.\n\nI rise today in strong support of S.J. Res. 31. This resolution would  disapprove of the Biden-era EPA's ``once in, always in'' rule, which…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691594/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I thank Mr. Moore so much for the  time. I appreciate it.\n\nMr. Speaker, it is a new year and with every new year, I like to  reflect on where am I going. What am I doing? What do I want…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…the region.\n\nOur mission is clear. We must protect American lives and prevent  future attacks on the homeland by strengthening our counterterrorism  efforts.\n\nMr. Speaker, I thank Mr. Correa for his support, and I urge my  colleagues to support this sensible legislation.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, we have a duty to be vigilant about potential…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…silenced.\n\nWhen the United States shows leadership, we know that others follow.  We must lead now before the Chinese Communist Party permanently  rewrites international norms.\n\nI thank Mr. Connolly for his work on this piece of legislation. I  miss seeing my friend here. As much as we have differences on many  things--and we have had many intense arguments…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…quality care to patients at home. More than 140 leading  healthcare organizations, including hospitals, healthcare providers,  and patients support this legislation.\n\nI thank Mr. Smucker, Mr. Evans, and Ms. Moore for their friendship  and bipartisanship on this bill. I thank Leader Scalise and Whip Emmer  for bringing this to the floor tonight. I urge my…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697172/hospital-inpatient-services-modernization-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Chair, I thank Mr. Arrington for yielding  this time.\n\nMr. Chair, what is irresponsible, to those watching this debate, is  the truth about the Biden-Harris policies, that when you combine…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…threat.\n\nWith border crossings thankfully going down since January, I think it  is safe to assume this will drive threats at our border underground  through these tunnels.\n\nI thank Mr. Correa for co-leading with me, and I urge my colleagues  on both sides of the aisle to support this legislation for a secure  southern border.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…This will reduce  wasteful spending and improve government efficiency.\n\nMr. Speaker, I thank Ms. Brown for bringing this important  legislation back to this Congress. I also thank Mr. Fallon and Ms. Mace  for their early and continued support of this bill.\n\nI encourage my colleagues to support this bill, and I reserve the  balance of my time.\n\nMr. TIMMONS.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…good, Christian-based  education that prepares their students for life.\n\nMr. Speaker, as a fellow veteran and Navy SEAL, I know you can never  have enough marines around. I thank Mr. Grapes for his service to our  country and our community.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689794/recognizing-jesse-grapes"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, on behalf of Florida's Third Congressional  District, we thank Mr. Jeffrey Askew for his storied career in Marion  County.\n\nA native of Auburn, Alabama, Jeffrey joined the U.S. Navy in July  1977 after completing his high school studies.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…services.\n\nWe started almost a year ago in my capacity on the Ways and Means  Committee, chairing the Oversight Subcommittee.\n\nI now chair the Joint Economic Committee, and I thank Mr. Speaker  because he helped me actually have the capacity of hiring a Ph.D. in  healthcare economics.\n\nWe have dropped last week--that is a term where we put in something…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I thank Mr. Jordan for allowing me this time.\n\nMr. Speaker, I rise today to honor the Woman's Relief Corps, the  oldest national women's patriotic organization and the auxiliary to the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "French Hill", "party": "Republican", "sentence": "…granted, and certainly no one on this  House floor who has the privilege of representing our citizens takes  for granted.\n\nEvery day I wake up proud to be an American, and I thank Mr. Aderholt  for his contribution in celebrating 250 years of independence.\n\nI urge my colleagues to support this bill, and I reserve the balance  of my time.\n\nMr. HILL of Arkansas.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}]