[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…his or her duty, or seditious conspiracy  against the Union, which is why the vast majority of crimes are  prosecuted at the local level like assault, murder, armed robbery,  theft, and so on.\n\nFederal law would also be limited, the Founders thought, according to  number because the Federal criminal laws would be organized around  certain  specific principles…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…firearms, or compromising       evidence related to an arrest. The other 20 officers (54       percent) were terminated for reasons such as       misrepresentation of injuries, time theft, fraud, and other       misconduct that violated the Metropolitan Police rules and       code of conduct (see below for examples from the 2022 audit       report).\n\nH.R. 2096…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I certainly support H.R. 5345, the Improving Social Security's  Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security  office…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…be  generous to our fellow Americans. He later inspired us with the call to  ``a rendezvous with destiny.'' In this administration, which is plagued  with corruption, crypto theft, and Musk exploitation of Agencies, it is  a downward spiral, a race to the bottom in an appeal to self-indulgence  and self-enrichment.\n\nThere are many, many other differences,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…storage  devices. This incentive directly supports gun owners who take steps to  store their firearms safely--an action proven to reduce the risk of  accidents, suicides, and theft.\n\nSecond, the legislation directs the Department of Justice to develop  and promote voluntary best practices for secure firearm storage, making  this information readily accessible…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…has this right, but we are creating it  for a handful of Republican Senators. It is immoral. I say it is  unconstitutional.\n\nIt is wrong, and it is probably the most brazen theft and plunder of  public resources ever proposed in the United States Congress. It was  tucked into this legislation, and I speak directly to Republicans who  say that they can't…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…this bill back to the committee. If the House rules permitted,  I would have offered the motion with an important amendment to this  bill.\n\nMy amendment would attach the Wage Theft Prevention and Wage Recovery  Act to this bill, which would establish new and increased penalties for  violations of overtime and minimum wage requirements, a real  commonsense…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…November 2024 joint  statement, CISA and the Federal Bureau of Investigation confirmed that  the Chinese Government hacked ``multiple telecommunications companies  to enable the theft of customer call records data, the compromise of  private communications of  a limited number of individuals who are primarily involved in  government or political activity,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…so  many of my Republican colleagues, they don't get invited to fancy  dinners at Mar-a-Lago or billionaire-hosted fundraisers.\n\nLet's get serious and protect families from theft and end hunger now.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692258/end-hunger-now-snap-skimming"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Trump could get a good headline. I think it was so he could distract  from the lousy economy and the fact that he is still covering up the  Epstein files. I think it is about theft because the oil being taken  from the people of Venezuela is being sold off and used to finance a  slush fund in Qatar controlled by, you guessed it, Donald Trump.\n\nI don't…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…accountability and to increase their profits.\n\nInstead of standing with workers, they weakened rules on overtime,  rolled back safety standards, and gutted protections for wage theft. If  you want any indication where the current President stands on the  Department of Labor and American workers, all you have to do is walk  down the street and you will see…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of Confucius Institutes in the United States has declined from a  peak of 118 in 2017 to fewer than five today. The current protections  against Chinese intellectual property theft through Confucius  Institutes have worked, and Congress should not place additional  burdens on our colleges, universities, and their students.\n\nMr. Speaker, instead of addressing…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…against life's unpredictability and wholly susceptible to exploitation  and despair. I will fight with every ounce of my being to oppose  President Trump's and Elon Musk's theft of Social Security and the  Republican effort to cripple Americans for their greed.", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…increased air pollution the blue sky  initiative. This is just another attempt from my Republican colleagues  to create loopholes that allow employers to get away with wage theft.\n\nAnyone who has visited my district in downtown Las Vegas and the  strip will know that our world-class hospitality workers are the magic  behind the glitz and glamour. With…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…greater       control over how workers are classified and paid, make it       harder for workers to know if they are being paid correctly,       and increase the risk of wage theft in industries where it is       already common.\n\nCollectively, these bills nickel and dime workers' pay at a       time when so many struggle to afford the basics. Wages should…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…scam attempts.\n\n``(3) Promoting the VSAFE Fraud Hotline and VSAFE.gov       website of the Department (and any successor resources) and       identifying other identity theft resources available to       veterans, their families, caregivers, and survivors,       including with respect to actions made by the Secretary to       protect the identities…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…child that in the course of transmission of a social security       card to the child, the confidentiality of such number has       been compromised by reason of loss or theft of such social       security card, the Commissioner shall issue a new social       security account number to such child and make note in the       records maintained with…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…has really grabbed the  attention of Tennesseans. I think that one of the reasons is that  people have seen fraud play out in their local communities. They have  seen title theft, where forgers go in and steal properties. Then  someone finds out their property is going to be sold on the courthouse  steps. They all know of contractors who take deposits.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…it came to Prop 36, an initiative that I helped to lead  and qualify for the ballot that has made crime illegal again in  California by restoring some basic consequences for theft and open drug  use and dealing fentanyl.\n\nNow, of course, Gavin Newsom and the supermajority in California  fought against Prop 36 each and every step of the way. They even…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…5345) to amend title VII of the Social Security Act  to provide for a single point of contact at the Social Security  Administration for individuals who are victims of identity theft, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5345\n\nBe it enacted by the Senate and House of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "Ms. MALLIOTAKIS. Mr. Speaker, I thank the chairman and the Ways and  Means Committee staff for working with me on this legislation to combat  mail theft and fraud.\n\nA few months ago, I raised the issue of stolen checks to the Ways and  Means Committee after my office had been slammed with constituent cases  from taxpayers who…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California has had difficulty stopping       fraudsters who steal benefits destined for the most       vulnerable among us. To gain a greater understanding of the       impact this theft has on Californians and the Nation, I am       asking that the GAO conduct a study on the amount of waste,       fraud, and abuse California has fallen victim to.\n\nWhile fraud…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…something that we should consider doing. It is  necessary. In the face of increasingly unscrupulous tactics from the  Chinese Communist Party such as rampant intellectual property theft,  corporate espionage, the use of slave labor, and environmentally  reckless energy practices, it is imperative for the United States to  leverage every available tool to bolster…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…government  checks stolen from the mail has increased dramatically.\n\nIf I could, I will share just a few statistics:\n\nBetween 2019 and 2022, there was an 87 percent increase in theft from  mailboxes, according to the U.S. Postal Inspection Service.\n\nAccording to the Financial Crimes Enforcement Network, FinCEN,  reports of check fraud doubled from 2021…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…were arrested in Northwest Indiana during Operation  Midway Blitz. These aliens were found guilty of numerous crimes,  including driving under the influence, drug trafficking, theft,  burglary, assault, child abuse, domestic battery, prostitution, and  fraud. More than 40 of them had been issued a commercial driver's  license by States like California,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…representative to representative and from department  to department. Sometimes they even get conflicting advice from people  within the Social Security Administration.\n\nAs identity theft becomes more commonplace, the system at the Social  Security Administration needs to be streamlined to work better for the  victims. The Improving Social Security's Service…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Security's                                   Service to                                   Victims of                                   Identity Theft                                   Act, as amended. H.R. 5346......................  Fair and            None..............  Increase by at     Would increase…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…happening in States like  Massachusetts.\n\nI have an article from the Boston Herald, from February 8, 2026,  titled: ``Massachusetts jury convicts illegal immigrant of identity  theft, stealing benefits, voter fraud.''\n\nThis is an example of the type of voter fraud that is going on right  here in our backyard and right in the backyard of the gentleman from…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…25 times for crimes including possession of a controlled substance;  second-degree robbery; cruelty toward the elderly; arson property;  taking vehicle without consent; and theft.\n\nI could go on and on. Those are the people who ICE is trying to get  off of our streets.\n\nHere is the question. This is how I want to open up a conversation  with my good…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…might not  even know that they are enrolled in multiple policies.\n\nThe excuse given for this practice is it protects the Social Security  number's holder from fraud or identity theft, but I am sure we could  find a better safeguard against Social Security fraud than simply  letting multiple people enroll in healthcare with the same Social  Security number…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}]