[{"senator": "Al Green", "party": "Democrat", "sentence": "…others, and we can't just decide, Mr. President, that the Palestinians  should not have a state and that we can just simply take their land.  This land belongs to them. It was theirs in 1948.\n\nThe majority of the people in Palestine in 1948 were not people who  were there to have a State of Israel. People came into the place called  Palestine and helped…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…we don't have to be veterans to appreciate what members of our  military do for our country. My own service in the U.S. Marine Corps  Reserve pales in comparison to many of theirs and many who have  appeared before the Veterans' Committee over these past 7, 10 days,  many of them decrying these kinds of cuts. Again, these are real  people, affected in…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…life they live. In Colorado, there is not a county anymore where  people feel like their lives are going to be better, where their kids'  lives are going to be better than theirs.\n\nWhen you lose that sense of opportunity, when you lose that sense  that if you work hard, you are going to get ahead, that is a danger to  democracy because, inevitably,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…we, meaning the people who agree with me. People  who don't agree, they will do what they do. That is okay with me.\n\nI am going to vote my conscience. I ask others to vote theirs. Just  vote your conscience, that is all I ask. If we vote our conscience, I  hope that in the end, maybe not today, but someday--Stevie Wonder has a  song where he says: ``someday…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…tomorrow. We owe it to our parents, our grandparents, and our great- grandparents to protect and build upon the progress that they have  made. We owe it to our children and theirs to fight efforts to roll  back that progress now.\n\nMr. Speaker, it is now my privilege to yield to the gentleman from  the great State of South Carolina, the Honorable   James…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…force when the door is set wide  open and the welcome mat is displayed.\n\nDenmark, a NATO ally, owns Greenland legally. If it doesn't choose to  sell it, it remains legally theirs. Thy neighbor's ox and house, not  ours.\n\nAny U.S. military action against Greenland breaks the NATO rule and  puts us at odds with our allies, allies that in the post-World…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…is  their obligation, and they want to do whatever we can to ensure  Ukraine's protection and sovereignty because what happens to Ukraine  and its young democracy happens to theirs and happens to ours.\n\nThe conversations were filled with such emotion and a clear desire to  do the right thing. As cease-fire talks continue, may we strive for an  end to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…claims to staffing shortages at the VA, the consequences for  American families and servicemembers are dire.\n\nVeterans have always had our backs. It is time we step up to have  theirs. I urge my Republican colleagues to join us in opposing the  previous question so that we can take up this important measure to  restore the livelihoods of veterans who have…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in Hartford or a  couple in their sixties, even if the humanitarian impacts are  impervious to you, think about the economic consequences. Think about  your pocketbook, not theirs. Bankruptcy will increase along with the  suffering.\n\nThese price hikes, the taxes on healthcare, are absolutely absurd and  abhorrent. It is incomprehensible to expect any…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…in taxes.\n\nI don't ever want to hear a Republican say they care about rural  America or the debt ever again if they vote for this bill. A budget is  a series of choices and theirs are indefensible.\n\nI will vote ``no.''", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693174/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…America's leaders cannot turn their back to Russia's  murderous forces bearing down including illegally on Ukraine. History  is clear. The dictatorship of Russia takes what is not theirs. Russia  invades territory that does not belong to it.\n\nIf one looks at this map, Russia is a vast country of 11 time zones.  It does not lack for territory. Here is Ukraine.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…our foreign adversaries.\n\nThere is still time for Republicans to join with Democrats and remind  Donald Trump that America does not abandon our friends.\n\nFor our future and theirs, we cannot--we must not--betray the  courageous people of Ukraine.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688655/america-still-supports-ukraine"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Republicans refuse to negotiate.\n\nHealthcare, Mr. Speaker, is a lifeline for families who have upheld  their end of the bargain even when Republican policies have not upheld  theirs.\n\nMr. Speaker, my ask is very simple, and here it is: Congress must  act. Congress must restore these tax credits and protect affordable  healthcare.\n\nMr. Speaker, I guess…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…just about individual coverage. It is the  backbone of family stability across the country; for Florence, for her  daughter, for her parents, and for millions of families like theirs. We  must protect and strengthen Medicaid. Lives and futures depend on it.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691434/gop-tax-scam-hurts-women-and-families"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…of us. From delays in healthcare  and disability claims to staffing shortages at the VA, the consequences  are dire.\n\nMr. Speaker, veterans have our backs, and we must have theirs. I hope  my colleagues will join me in supporting this important bill. Veterans  gave everything for us. It is time we give back to them.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688234/democratic-proposals"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…not accurate to  say that we would go around any of the qualifying. The other side talks  about us tipping the scales toward fossil fuel energy and dispatchable  power, but theirs tips the scale toward wind and solar. I think we need  all of the above, but when you say we are going to subsidize a more  expensive power, that doesn't make power cheaper.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…can surrender our country to mass  migration or we can steel our spines, plant our feet, and fight to  defend our home. I have made my choice. I urge my colleagues to make  theirs.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…see where they are coming from, see them as people, discover surprising  points of agreement, and gain a more nuanced understanding of your own  position by understanding theirs.\n\nThat is something we can all try to do better, especially those of us  in elected office.\n\nI ask every Member of this House, myself included, to think hard  about how we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…his life and their  determination to see that we move forward in this Congress, not only on  this bill but others to make sure that it doesn't happen to other  families like theirs. We are all praying for that dear family.\n\nMr. Speaker, the heart-wrenching stories we have heard tell us all we  need to know. It is time to send the TAKE IT DOWN Act to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…serve the American people.\n\nSenate Republicans are ready. Ready to keep the government open.  Senate Democrats are bragging about being ready to shut it down. The  choice is theirs, and the consequences of that choice will be felt by  the people of our Nation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…wear a kippah not because I am a proud and observant Jew.  I am not all that observant. I wear it out of respect for all the Jews  around America who do not feel safe wearing theirs today. That is  because, by wearing it, they feel they literally have a target on their  heads.\n\nWe have heard for 18 months that the intifada should be globalized.  We have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…than words on  paper.\n\nMr. Speaker, to every Gold Shield family, their loved one's service  mattered. The sacrifice of their loved one will not be forgotten, and  neither will theirs.\n\nMr. Speaker, I urge my colleagues to support H. Res. 364. Let's pass  this resolution and give these families the recognition and community  support that they have long deserved.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…is about  making sure that when a small business owner like those in Texas, or  anywhere else, fills out an application, they know the system is fair  and the resources are theirs to access.\n\nWith every bill codifying President Trump's EOs, we are moving closer  to a government that puts America first, protects American workers, and  restores American…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…Colombia, and nearly $10 billion for NPR,  PBS, and other bloated liberal pet projects that have no place in a  responsible budget.\n\nWashington acts like taxpayer dollars are theirs to waste, but they  are not. Every cent belongs to the men and women who work long hours,  pay their bills, and expect their government to act with a shred of  discipline.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692549/rescissions-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…determine their own future. America must stand with  them, not to orchestrate their path but to affirm it, and not to impose  our own will but to support their right to express theirs.\n\nThat is why I am behind Maryam Rajavi. We know from our own history  that when people rise for freedom, the greatest thing the free world  can do is stand beside them.\n\nMr.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…days, I have been chilled when watching a parade in  Beijing where Xi Jinping, the dictator of the PRC, assembled the  leaders of North Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry. It reminded me of similar  moments in the late 1930s, when the fascist states of Germany and Italy  teamed up with the imperialist…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Thune", "party": "Republican", "sentence": "…right there.\n\nSo, remember, again, 150 million Americans, almost 50 percent, get  their coverage through their employer. Another almost 40 percent, 140  million Americans, get theirs through Medicare and Medicaid. And then  this little sliver right here represents about 23 to 24 million  Americans who are in the ObamaCare exchanges.\n\nNow, I just, as a point…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…terror of  Venezuelan Socialism and oppression. I thank them for taking the time  to support us and for showing why this effort in Congress is so vital.  Without voices like theirs bringing us the true feelings of Venezuelan  Americans, we would only have heard from those who cared more about  opposing the President than bringing an oppressor to justice.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…judge--happened to be Democrat--released him back into the  streets after his arrest in January.\n\nPolice do their jobs, but ideological prosecutors and judges refuse  to do theirs.\n\nThis is not justice. It is a failed social experiment backfiring on  our communities. We see it time and time again.\n\nIn D.C., police recently arrested a carjacking suspect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…troops wondering when they would get their next  paycheck, and for what, Mr. Speaker? Democrats did that to use the  American people as leverage. Don't take my word for it. Take theirs. It  was leverage for more wasteful Washington spending, spending that no  one other than the radical left ever wanted.\n\nTo remind the American people, Democrats wanted to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}]