[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "…preserving and interpreting over 600  years of American history. This redesignation is overdue.\n\nNational historic sites tend to contain a single historical feature  and focus on one theme or period of time, but the Salem Maritime  National Historic Site contains a dozen historical structures across  nine acres. These sites preserve and share diverse histories,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…leadership on Men's Health Month.\n\nMr. Speaker, I am a nerd. I am a proud nerd. Whenever there is an  awareness month, one of the first things I like to do is figure out, is  there a theme. It drives my staff crazy. There is a theme, as you have  heard, for 2025 for Men's Health Month, and it is very enlightening:  Closing the empathy gaps in men's health.\n\nNow,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…the Department of Labor's Office of Disability  Employment Policy (ODEP) was created and was given responsibility for  NDEAM and for selecting and helping promote its annual theme.\n\nThis year's theme is ``Celebrating Value and Talent'', which reminds  us that Americans with disabilities bring innovation, resilience, and  unique perspectives to our communities…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…heard myself  countless examples of how these programs are critical to families, to  their well-being, and how this program, if cut, would be devastating.\n\nThere is a common theme on all these stories; these families are  scared they will not be able to afford or get the care that their  family really relies on. They are also concerned that there is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Speaker, I rise today to recognize Black History Month  and its 2016 theme, ``A Century of Black History Commemorations.'' I  would like to honor retired Army Sergeant 1st Class Oscar Primm, Jr., a  104-year-old veteran from northwest Indiana whose…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Speaker, I rise to celebrate Black History Month and  its 2025 theme, African Americans and Labor.\n\nThe economic foundation of northwest Indiana and our Nation is  reliant upon the advancement of a strong workforce, and I would like to  recognize…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687951/black-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…traveled extensively throughout the United  States to visit AMVETS Departments and Auxiliaries, sharing her  message, promoting her project, and uplifting all with her inspiring  theme--Together We Can;\n\nNow, therefore, I, Congresswoman Marcy Kaptur, proudly recognize and  commend Cindy Rice, National President of the AMVETS Ladies Auxiliary,  for her outstanding…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…original Black History Month resolution for 2025. We have  many persons who have signed up to cosponsor, but it is still not too  late for additional persons to sign up.\n\nThe theme is African Americans and labor. It deals with African  Americans and labor in America. It will trace the history of labor from  enslavement through current times.\n\nThe second…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…diversity is not a threat nor a weakness. It is a competitive  advantage. It is a source of national strength. It has driven  innovation, expanded opportunity, and is a common theme throughout our  shared American story.\n\nIn a time of rising division, these stories call upon us to remember  who we are at our best: a nation that does not just tolerate…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Parade taking place in Chicago's Loop on  Saturday, July 26. The parade takes place 35 years to the day that the  Americans with Disability Act (ADA) was signed into law, and the theme  of the parade is 35 years of ADA: Still Rising, Still Thriving.\n\nThe mission of the Disability Pride Parade is to change the way  people think about and define ``disability,''…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…she can't be sure if they are even going to  be able to keep going, let alone keep growing.\n\nWhen I spoke with business representatives across New Hampshire last  month, the theme they kept coming back to was ``uncertainty.'' As a  former small businessowner, I know that uncertainty is the most  destabilizing aspect of running and growing a business.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…in schools,  churches, and public halls.\n\nThe fraternity's 2025 International Achievement Week is from November  10, 2025, to November 17, 2025. This year's Achievement Week theme is  ``Impactful Service Through Intentional Friendship.''\n\nThe Omicron Kappa Kappa (OKK) Chapter of Omega Psi Phi Fraternity,  Inc. received its graduate chapter charter on…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black Maternal Health Week because as I  said when I started, that one is personal.\n\nAs I got ready for Black Maternal Health Week, I wanted to first  figure out is there a theme this year on which we should focus our  efforts. As I got ready to prepare my social media posts, as I got  ready to prepare the topics that I would have if I had a roundtable,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…leader of  the pack when it comes to Black history, and I am proud to be  associated with them and proud to tell you that this year, for our  Black History Month, there is a theme: A Century of Black History  Commemorations. A century, 100 years.\n\nToday, I have chosen the topic, one that I think embraces something  that is a little bit more contemporary…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…not want the American people to see?\n\nIs it that his story doesn't add up? We don't know because Pete  Hegseth is right now hiding the truth. And, sadly, that has become the  theme with this administration. When facts are inconvenient, they cover  up.\n\nSo, Secretary Hegseth, release the tapes.\n\nI also want to commend my Senate colleagues, including the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…published May 1, 2025. In it, the author reflects on how  society grapples with competing claims of truth and encourages readers  to return to foundational and verifiable sources--a theme with deep  implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance of…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania Farm Show is the  food court. Here, visitors can enjoy various food that features  commodities grown in the Commonwealth of Pennsylvania.\n\nThis year's Farm Show theme, ``Growing a Nation,'' is particularly  fitting as we celebrate 250 years since our Founding Fathers signed the  Declaration of Independence.\n\nFor generations, American farmers…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…marks the pinnacle of their  work. Their family-run operation represents the excellence and  tradition that define Michigan's growers and exemplifies the First  Lady's Christmas theme: Home is where the heart is.\n\nMr. Speaker, I am grateful to honor this achievement and celebrate  the role Michigan will play in bringing Christmas spirit to our  Nation's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697288/recognizing-korsons-tree-farms"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, this is a theme I have been speaking of  which affects States across the Nation, which is the National Flood  Insurance Program and the threat that it might lapse and the inability  of families…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…district, I witnessed the best of  Indiana: highly-skilled, hardworking Hoosiers who are contributing to  the success and the defense of our country.\n\nAbove all, I heard a common theme as I traveled my district: Let's  bring more Hoosier common sense to Washington.\n\nMr. Speaker, that is the commitment I made, and that is what I will  continue to do.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…thank the chairman for yielding.\n\nMr. Speaker, a weekend or two ago in Suffolk County, I stood with  nearly 1,000 Long Islanders at a Vietnam war Veterans Day ceremony. The  theme of the day was simple but powerful: Welcome home.\n\nWelcome home after serving in a war that was unpopular at home.\n\nWelcome home after surviving brutal jungle and guerrilla…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…We are not going back. The American people saw that. They voted for  President Trump. He was very clear about it. This wasn't a footnote in  his campaign. This was a central theme. You may not like it, but that  is what our Republic is about.\n\nFor all the talk of saving democracy and sticking up for democracy I  hear from the other side, it is all nonsense.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…and one win away from the glory. Games 5 and 6  were won by Jacksonville State to even the series 3-3. In game 7, the  Penguins started strongly. Strikes and spares were the theme for the  Penguins, showing the consistency that led them to the national  championship game. With every strike and spare, the crowd roared,  bringing the team one step closer…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690138/congratulating-the-youngstown-state-womens-bowling-team-on-winning-the-2025-ncaa-bowling-championship"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…that their early skepticism toward post-war alliance  commitments stemmed from a fear that allies would rely too heavily on  American leadership.\n\nThis would be a recurring theme. But, importantly, for much of NATO's  history, the U.S. leaders most concerned about burden-sharing were also  fierce defenders of the alliance. They criticized allies because…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…upholding the same high standards  of excellence and service that have defined it from the beginning.  These high standards also earned the Land of Make Believe the award of  ``Best Theme Park in New Jersey'' by MSN.com earlier this summer.  Christopher Maier, Herman's son and the park's current owner, credited  its most recent achievement to the park's enduring…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694756/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Committee  over in the Senate. It is one of my blessings. I get to chair it. We  did something, and both sides were pretty good. Some Democrats took  some pokes at us, but the theme of this Joint Economic Committee  hearing was healthcare.\n\nWe, as a body--we, as Congress--we, as a society, have turned into  financial engineering. The ACA, ObamaCare, is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary talent utilizing a relieving dose of sarcasm       and deprecating self-loathing. We do know that biting dark       humor was used…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…upholding the same high standards of excellence and service that have  defined it from the beginning. These high standards also earned the  Land of Make Believe the award of ``Best Theme Park in New Jersey'' by  MSN.com earlier this summer. Christopher Maier, Herman's son and the  park's current owner, credited its most recent achievement to the  park's enduring…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694751/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "French Hill", "party": "Republican", "sentence": "…have learned in our committee work  that 25 percent of the price of a new home in America is due to  regulatory costs, State, local, and Federal. So, our bill has that as a  theme.\n\nHe has worked hard at making sure these improvements in the Housing for  the 21st Century Act fully apply to housing in rural areas, not just  urban areas.\n\nMr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…safety and security here in our country.\n\nUnder President Trump, we have seen that national security has become  a  priority. In fact, when we look back over the last year, one theme  sticks out about the administration's accomplishments is that President  Trump is keeping his word. He is making America safer and stronger than  ever before.\n\nYou can look…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}]