[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…administration to restore funding for lifesaving food aid  for malnourished children.\n\nRhode Island's Edesia Nutrition has helped save 25 million lives with  this ready-to-use therapeutic food manufactured in North Kingstown,  Rhode Island, supported by USAID. Yet, that work is now in jeopardy.  Trump is now 3 months into his administration, and funding is…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690893/impact-of-volatility-and-policy-reversals"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…weekend, I had a chance to visit the Edesia Nutrition  factory in North Kingstown, Rhode Island, one of two factories in the  United States that manufactures this ready-to-use therapeutic food.  This is used to treat starving children whose organs have failed and  are no longer able to process traditional food to get them back to  health.\n\nFor years, the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693908/restore-food-aid-funding"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Nobel Prize in Physiology or Medicine for  their research to better understand and protect the human immune  system. Dr. Ramsdell's research will help develop effective therapeutic  strategies for those fighting cancer, autoimmune diseases, and in need  of organ transplants, ultimately working to improve their quality of  life and save lives.\n\nProfessor…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…unnecessarily.\n\nEvery day, there are children whose organs are shutting down, who are  unable to eat conventional food, and who can only have their lives  saved by ready-to-use therapeutic food manufactured in the United  States.\n\nEvery day, the clock is ticking. The administration needs to do what  it said it is going to do: restore funding for this aid.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693095/calling-on-trump-administration-to-restore-lifesaving-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…been 2 months since Congress passed and President Trump signed  a funding bill for fiscal year 2025. It included money that can be used  to continue purchasing ready-to-use therapeutic food, a miracle peanut  paste that saves the lives of starving children and is produced by,  among others, Edesia Nutrition in my district in Rhode Island with  ingredients…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…when children are on the brink of starvation, their  organs break down, and they cannot even digest food if it is given to  them.\n\nThere is a proven treatment: ready-to-use therapeutic food, also  known as Plumpy'Nut, a shelf-stable peanut paste. It does not need to  be refrigerated. You don't need to add water. It has the nutrients that  children need…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…has  generational consequences.\n\nThankfully, as Congressman Magaziner has highlighted, we have a  proven treatment to save the lives of malnourished children: ready-to- use therapeutic food, or RUTF. RUTF is the go-to treatment for  malnutrition in hard-to-reach areas and emergencies because it doesn't  require refrigeration, preparation, or any training…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…performing basic science       research on bacterial communication. In short, I am seeking       to understand bacterial chemical communication to find new       pathways for therapeutic development.\n\nAntibiotic resistance is already killing thousands of       Americans each year. We need new treatments provided by       indirect costs to find these cures.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…for the rest of their lives, but there is  a miracle treatment that can save the lives of malnourished children,  even in the most remote corners of the world. Ready-to-use therapeutic  food, or RUTF, is a nutrient-packed peanut butter paste.\n\nRUTF, also known as Plumpy'Nut, delivers the fat, sugar, and protein  that children with malnutrition need to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food aid for starving  children.\n\nWhen children are starving, their organs shut down. At a certain  point, they are not able to eat traditional food anymore. Ready-to-use  therapeutic food is the only chance they have to survive and to get  back to health.\n\nRight now in Rhode Island, there are 87,000 boxes of ready-to-use  therapeutic foods, already bought…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693803/edesia-product-still-in-warehouse"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…sometimes even the  ability to cry. That is what severe malnutrition looks like, and it is  the leading cause of death for children under 5.\n\nThere is treatment. Ready-to-use therapeutic food is a nutrient-rich  peanut paste that delivers the fat, protein, and vitamins that starving  children need to survive. It can save a child's life in just 8 weeks.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…world dies of malnutrition, of  starvation, needlessly and unnecessarily. For decades, the United  States has saved lives, particularly by providing funding for ready-to- use therapeutic food, also known as Plumpy'Nut. This is a miracle  treatment. This is a peanut-based paste that treats malnutrition,  doesn't need to be refrigerated, and can be shipped…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…have, under Democratic and  Republican administrations, guided our foreign policy.\n\nHere is the thing: The Trump administration, while cutting off  funding for ready-to-use therapeutic food, has also been insisting that  it is just temporary and that the funding is going to come back. Elon  Musk even put out a tweet where he named the factory in my district…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise for the third time to call for  funding for global emergency food aid to be restored.\n\nFor years, USAID funded the production of ready-to-use therapeutic  foods at Edesia Nutrition in my district. The food that was  manufactured there has been shipped across the developing world, saving  the lives of 25 million  children…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690575/call-for-restoration-of-global-emergency-food-aid-funding"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Kimberly  started as a Volunteer Coordinator, for Camp Good/Teen Encounter, a  grief support camp for kids and teens who have experienced a loss.  Trained volunteers provide therapeutic activities, in a camp setting,  and help children share their stories with peers, whereby strengthening  their ability to cope. Kimberly was Branch Manager with a local…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…prosecution of a  criminal defendant who is a trafficking victim, or within a conviction  of a human-trafficking victim, victims are allowed to tell their story.  One, it is very therapeutic and helpful to the victims themselves, but  for the law enforcement folks, they can go after the real bad actors.\n\nI think that is the key crux of this bill, and I think…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Response to work hand-in-glove with Texas health officials to       deploy rapid response teams, give comprehensive support, and       provide 7,000 doses of the MMR vaccine and therapeutic       medications to our local communities. He made sure local       health authorities, providers, and families had the tools and       support they needed, providing prevention,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}]