[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…issue, is that of Dr. Ardem Patapoutian. He is a world-renowned  researcher who won the Nobel Prize for his work on researching the  sense of touch.\n\nMr. Speaker, I think we can all agree that is the kind of talent we  strive to encourage in this country.\n\nWhen his research funding was delayed by the Trump administration,  Dr. Patapoutian received a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…for.\n\nUnlike other hearings in Congress, this one was different. It  required every Member--Democrat and Republican--to agree to hold this  hearing. Well, I had to think whether I could agree to this hearing if  there wasn't a commitment to address the corruption I and many across  this country recognize.\n\nWhether a Republican or Democrat, any Member…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…premium tax credits,  which will bring down costs. It will reverse Republican cuts to  Medicaid, remove redtape, and prevent the closures of rural hospitals-- something I think we all agree on.\n\nSo I urge my Republican colleagues, vote for your constituents, vote  to save our rural hospitals, and vote to restore dignity to every  American.\n\nLet's work together…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…they are       more partisan, more tribal more of the time than at any time       I can remember. Our deliberations can still be important and       useful, but I think we would all agree they haven't been       overburdened by greatness lately. Right now, they aren't       producing much for the American people.\n\nBoth sides have let this happen. Let's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…shuttered,  including a 43-day shutdown. We returned hoping for Democratic unity.  Therefore, I was shocked to be called out in a resolution on the House  floor.\n\nI think you would agree with me that voters don't want these  arguments in Congress. The voters want us to be working to help them  afford healthcare, rent, and childcare.\n\nMr. Speaker, none…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…is that regardless of how you feel about the  Federal Government, regardless if you feel that these jobs were  unnecessary or unneeded, even if you feel that way, I think we can all  agree that there is a better way to treat somebody than sending a 20- year worker, a 15-year worker, a 10-year worker an email on a Saturday  night saying you are out of…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…dividends. The President has demanded dividends from any number of  companies. This is command and control.\n\nI am not actually interested in having that debate because I think we  would all agree on much of this stuff, including the fact that we are  now living in one of the most socialist countries on the planet.\n\nWhat I really want to do is talk about affordability,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. Speaker, I think we all agree that the United States' main  competitor is China and the Chinese Communist Party who are intent on  tilting the global playing field to their benefit, undermining our…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…just  denies it and says any agreements are state secrets. Does that work?\n\nIf President Trump said he would pay El Salvador $6 million to  assassinate his rivals, I think we would all agree that that is  blatantly unconstitutional. And if the court said he had to facilitate  the reversal of that deal, and he said, ``Well, it is a sovereign  nation; I…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today in opposition to H. Res. 516,  sponsored by Representative Young Kim. This resolution has a lot of  things I think we all can agree upon, including recognizing the right  to assemble and protest peacefully and condemning violence against law  enforcement.\n\nIn the very last clause, it specifically…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…aisle, they have their ideological reasons for pursuing that. It is  more coal. Again, that is the sum total. It is two words. In my view, I  think most Americans would think and agree that this isn't how we  should be spending our time.\n\nMr. Speaker, I was trying to keep track, and I lost track at some  point, but my colleague from Minnesota I think…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…turning them into a  human inventory for a state-run organ harvesting system.\n\nThis is barbaric. These crimes, these abuses by the Chinese Communist  Party, must end. I think we can all agree that they have to come to an  end.\n\nThe legislation before us today, the Falun Gong Protection Act, takes  long-overdue action to confront this horror. It directs the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…stronger families--I realize all families can  succeed, and I know all sorts of families who do succeed by being very  conscientious with their children. Nevertheless, I think we would all  agree America would be better off if we worked our way back from the 42  percent of children born without a mother and father at home back down  to the 6 percent or 5 percent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…meeting of senior Houthi leaders;  wouldn't be able to strike imminent attacks on our friends in countries  like Israel, Saudi Arabia, or United Arab Emirates.\n\nI think we should all agree that we want a President, when terrorists  are gathered together for the purpose of planning attacks against  American civilians, our troops, or our friends abroad,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…families of all backgrounds.  I, like all of us, know single parents who have done a fantastic job of  raising their children. I commend them for that, but I think, also,  everyone would agree that it is easier on both the parents and the  children if you have two parents there. In essence, bribing a young  couple not to get married is not the way to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…explaining the difference between choosing from investments  selected by ERISA fiduciaries and choosing from investments through a  brokerage window.\n\nMr. Speaker, I think most would agree that advancing a political  agenda at the expense of retirement savings is wrong. Let's be clear:  Americans invest to secure a brighter future for themselves and their…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…public schools.\n\nUpon written request, a parent is entitled to review any curriculum  that was purchased by foreign entities for their children's classroom.\n\nWhile I think we can agree that it can be beneficial to broaden our  children's horizons with new ideas from across global cultures, we must  ensure it is done properly without undue foreign influence.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…adversaries' access to undersea cabling  infrastructure, we can protect U.S. leadership from the influence of  adversarial governments, like the Chinese Communist Party.\n\nI think we can all agree, regardless of which side of the aisle we  stand on, that there is a need to ensure technologies critical to  America's telecommunications infrastructure do not end…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}]