[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…rest of the world to prevent it  before it comes here, that is to our benefit.\n\nThe third is a matter of national security and safety. Mr. Chair, 9/ 11 happened because things were going wrong in other parts of the  world, and they came here. It absolutely impacted people in the United  States of America. The idea that this has no impact on our citizens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…these bills? Because the officers of the State of New Jersey are going  to benefit from them because Donald Trump hasn't targeted these and cut  these, and these are things that are going to help all officers. That  is what this body should do--not pick and choose one State over  another, not pit one State against another, not pit so-called blue  States…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694305/chief-herbert-d-proffitt-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…registered Republican.\n\nNow, we are being told by the Republicans that we can't trust the  nonpartisan Congressional Budget Office to give us correct numbers on  how much things are going to cost or how much the tax cuts are going to  cost. Who do we rely on for that? Is it Elon Musk? Maybe not anymore  because Elon and Trump are fighting.\n\nThe bottom line…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…some other time, I would love to discuss it with him.\n\nI think my colleague will come to find that we use the floor of the  House of Representatives to talk about a lot of things going on. My  Republican colleague might be able to stick narrowly to one particular  topic. Good for him if that is what he would like to do, but we like to  talk about all of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…with the so-called  reciprocal tariffs around the world, it is the lifeblood of the  American economy.\n\nI know Senator Van Hollen is going to say a lot of the same things  that I was going to say.\n\nI would just say to the Presiding Officer again: I know he sells  great cars, but I am not sure if even folks in Ohio are going to be  able to afford $2,000…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…have to imagine anymore what might happen; we know for sure what  is going to happen to tens of millions of people all across the  country.\n\nI want to focus on five things that are going to happen--five things  that are going to happen because we no longer have to talk about a  House version or a Senate version or what the President says he wants  or…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the Subcommittee on Readiness, dealing with the ability of  the troops to have a clean barracks and to be ready to deal with the  issues that are out there, there are many things going on that are  troublesome. It may be time for all of us to just take a deep breath  and go: Wait a minute. What is happening here?\n\nThere are extrajudicial killings going…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the new Secretary of Energy, Chris Wright. In  terms of these companies, he said: ``If it is viable, and it is going  to create jobs, and it is going to do these great things, we are going  to support that project.''\n\nThe Secretary said that he would ask these questions to make the  decisions: Is the investment legal? Is the technology viable? Is the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…tariffs, but virtually every Vermonter  is going to be impacted by increased costs--inflation--as a result of  the tariffs.\n\nAs an example, food, fuel, energy--all of these things are going to  be impacted and really affect people in their day-to-day and month-to- month budgets.\n\nWe get a lot of our electricity, a lot of our home heating fuel, and  a lot…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is going to invent something to make America great. Work hard  and treat people right, you could be a good citizen and make America  great. You don't have to do the things that are going to be written  across the pages of time. You can do the simple things, and these  people are doing these things. They have made our lives better.\n\nYou want to kick…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…function of oversight.  That is one of the checks and balances, and we should be deeply engaged  in making it as effective as possible because here is quite a list of  the things going wrong with the Department of Justice.\n\nThese things beg for hearings to be held, for issues to be  understood, for the press to be able to report, for solutions to be  able…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…promise amongst us all, as Americans, to  protect our seniors, to protect ourselves when we get to that age; and  that no one will be allowed to break it.\n\nAnd one of the things I am going to ask is to make sure that we go  into Social Security's databases and make sure that those ``Muskrats,''  when they went in there, didn't do any permanent damage, didn't…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Give us a little feeling for  the strength and conviction that drives you to do this unusual taking  of the floor for a long time to let the people know how bad these  things are going to be.\n\nMr. SCHUMER. ``Chuck'' is OK.\n\nMr. SCHUMER. So I thank my colleague for his strength, his courage,  and his effectiveness in letting the American people know how…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…honest here, nobody even truly knows exactly  what the hell is in this bill. As Senator Tillis, a Republican, said:  ``I suspect we're going to find out there are some things that we're  going to regret.''\n\nSusan Collins, another Republican, said: ``The rescissions package  has a big problem--nobody really knows what program reductions are in  it.''\n\nYou…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…have, in my opinion, stood the test of  time and been a strong proponent for progrowth tax policy. We are going  to make those permanent in this bill.\n\nThere are other things that are going to be newer to the tax code,  and we will try them out to see how it plays out in 4 years to give us  time to be able to analyze and see how they are being effective…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…around 200. In fact, for the first time  that I can remember in a very long time, when I checked in at the  Border Patrol station and was talking with them about where things were  going and how things were going and what has changed, as we walked past  the area they would typically check in unaccompanied minors, that room  was empty. I can't remember…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…slowly takes away the freedoms of people in  America and makes America more of a country that you would not want to  move to start new manufacturing. That is one of the things that is  going on in this building.\n\nThe next topic to take up--and I am kind of disappointed we didn't  deal with it like we should have in our proposed big, beautiful bill,  but…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…what the right dosage amount is, how that is  going to interact with any other medications that they might be on, and  how it might affect their blood pressure or other things going on with  them personally.\n\nIf we are not giving that option to have that conversation at the  most serious level without worrying about some kind of reprisal for the  doctor…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have enough of a life to watch a presentation like this. It  is a simple philosophy. At the end of the day, the math will always  win.\n\nI am going to try to do three things here. I am going to try to  actually get the reality of what happens and how the tax system works.  When our brothers and sisters on the other side say to just raise  taxes, that that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…right now for what we believe is sort of this fiscal year's  snapshot. We actually have foreign born actually going down. Now, some  of this is self-deportation. There are things going on, we don't have  enough data to completely understand it, but my problem is: I don't  actually have enough folks for the civilian labor force.\n\nLook, something funky happened…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…entire life just to cover those  promises.\n\nNow, if you take it down to a 2 percent discount rate, which is a way  you sort of say that here is where inflation and these things are going  to be, you still need a 22 percent increase on their lifetime taxes  just to cover pension benefits. This is actually based on some numbers  where I think they may have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We could borrow as  much as $2.3 trillion this year. I am going to show some other things  in here such as Moody's, and why they downgraded us, and show some of  the things that are going on.\n\nOn occasion I get this: What are your solutions? Then we always try  to come in and say: Here is the technology chute where you can disrupt  the cost of healthcare.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…bureaucrat and not some  administration. Congress actually got together and said we are going to  have some efficiency standards on showerheads and a number of other  things. We are going to pass this bill, in 1975, and for over 30 years  that was the national standard.\n\nEven the American Association for Mechanical Engineers, this is their  definition…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…children around them did not.\n\nThis past week, it was really a remarkable moment that a lot of  people in this town probably missed, and I understand. There is a lot  of things going on right now. But on the south side of the Capitol,  there was a spot of dirt that was dug up there and a group of  Oklahomans, along with the Architect of the Capitol,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…9-year budget  window, 10-year budget window, your country goes over 120 percent debt  to GDP, surpassing World War II.\n\nAre we going to fix it by little incremental things, or are we going  to do it by a major reconciliation bill that actually takes on big  issues, complex issues, real math? Or will we just continue to pander  and not tell the truth…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the Federal  law in the first place. We shouldn't have to bring this to the floor.  We shouldn't have to engage in this debate. I shouldn't have to explain  these things. However, we are going to, by God, require that our  Nation's Capital comply with our Nation's Federal law.\n\nI encourage my colleagues to take a deep breath, step back and say,  yes,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hour. I am just going to try to  run through a couple of concepts.\n\nI did a little tripping up of some details last week, where we were  trying to explain some of the things we see going on in the math. I  want to walk through a concept.\n\nWe actually, right now, as a country, are remarkably blessed. The GDP  growth, the economic growth, is actually well…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bought a car or been  in a negotiation, when one side gives a completely unserious offer, the  other side often has to walk away until they get serious.\n\nThere are real things going on in the world. Here is an article from  the other day. I have a small stack of these. It is talking about bond  markets and debt markets and others starting to unload…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}]