[{"senator": "Al Green", "party": "Democrat", "sentence": "…himself. So he has the ability to exculpate himself by  simply saying something that clearly is classified saying that it is  not.\n\nMr. Speaker, while he can say so, I think the American public will  have the final word and will be the final judge.\n\nI am honored to tell you who the players are in this coverup. One  person is, quite frankly, a person who…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…will  support, I know the American people will never support putting boots on  the ground. The President said I don't mind using the words ``boots on  the ground.'' I think the American people will mind it.\n\nWith so many troops and assets still in the region, this is the  opportunity for Congress to help determine what our path forward is  going to be…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…preyed on  underage girls, suddenly, they have nothing to say. That is because  they think there is one set of rules for billionaires and another for  the rest of us. They think the American people will forget, that we  will stop asking questions, and that we will let them keep secrets.\n\nLet me be crystal clear: This is not about partisanship. This is  about…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693547/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…bottom line. Will  it, in fact, cause the cost of groceries to rise? Will it, in fact,  cause energy costs to increase? Will it, in fact, cause housing to  increase?\n\nI think the American people deserve answers, and in this moment where  chaos is ensuing all around them, where they are losing their jobs,  where they are losing--many of them--the funding…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…replied: ``I couldn't care less.''\n\nThe Secretary of the Treasury from my home State of South Carolina  was doing quite well financially as a hedge fund manager doesn't think  the American people care either. To quote him: ``Access to cheap goods  is not the essence of the American Dream.''\n\nClearly, Mr. Trump and Mr. Bessent have never struggled to make…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…floor today will only worsen the  Republican affordability crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on this bill, and  I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…viewing public a sense of real debate, as opposed to us  just giving speeches.\n\nMr. Speaker, with much respect to the gentlewoman, I think that is a  shame because I think the American people ought to be able to hear a  fair and full exchange of views in an active debate. I think that is  far more present when we actually have a colloquy as opposed…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…about going after the ``enemy from within''--his  words--and making American towns and cities their ``training grounds''  for the military.\n\nThis is important, and I think every American should understand what  it means if the President of the United States follows through with  what he said and says--that he is now invoking the Insurrection Act.  That…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…governments or others through his illegal  dealings.\n\nI have asked for unanimous consent to schedule floor votes--I want  floor votes--on each of these resolutions. I think the American people  deserve to know where we stand, who is going to allow him to go forward  with these deals, who is going to sacrifice the integrity and  independence of this branch…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…touch are Republicans  with the American people? Like literally, I know Republicans are not  holding townhalls and meeting with their constituents anymore, but do  they think that the American people voted for them to waste our time on  refrigeration standards? That is what they think they were elected to  do?\n\nLiterally, how out of touch are Republicans?…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…great job with efficiency, and if that was  their goal, clearly they ought to be able to come before Congress and  testify as to what they have found.\n\nMr. Speaker, I think every American should be aware that what is  really going on here is an attempt to get at your data and your  information and to further attempt to privatize Social Security. That…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…afraid to ask the drug companies to disclose a price they  publish in private--at least to some sources--and not tell the American  consumer? If they had to do that, we think the American consumer would  think twice about falling for these ads.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…is the color of your hair, or this is the color of your eyes,  or this is what you say, or if this is what kind of accent you have or  not, then you might be safe.\n\nI think the American people need to know which one of them will be  deported next. I think the American people deserve to know which of  their Representatives is going to stand up for them.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…grid.\n\nMr. Speaker, between this bill and the big, ugly bill, every time  Americans open their power bill or see their lights flicker,  Republicans are responsible. I think the American people will hold them  accountable.\n\nFor all these reasons, I oppose this bill, as I oppose the other two  energy bills today.\n\nMr. PALLONE. Mr. Speaker, on that I demand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…people.\n\nRegulations have consequences. Democrats may believe there is nothing  that couldn't be improved by a little government intervention, but  Republicans and I think the American people know what too often happens  when government decides to get involved.\n\nReagan said 40 years ago:\n\n[T]he nine most terrifying words in the English language…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Senator Padilla.\n\nNo. 1, we are going to have an election in November. Senator Padilla  says that sanctuary policies are not part of the problem. I think they  are. I think the American people believe that, when 12 States refuse to  cooperate with the Federal Government when it comes to enforcing  Federal law, they become sanctuary States and cities,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, this week, the Energy and  Commerce Committee finally attacked fraud, waste, and abuse in the  Medicaid system.\n\nI think every American knows that when government runs a program,  there is fraud, waste, and abuse, and that is exactly what the  Committee dealt with.\n\nFor instance, 1 million people have…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…administration has spent months combing through our Federal  budget, line by line, identifying waste, fraud, and abuse. Let me tell  you, Mr. Speaker, there is a lot.\n\nI think the American people would be hard-pressed, or anyone would be  hard-pressed, to say that the government runs so efficiently that we  can't find any more efficiencies. However, don't…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Their position: Cover up the names of people who are already public,  but don't worry about other innocent people who the court said should  remain private.\n\nAgain, I think the American people see through it. They see through  what the Democrats are doing. The American people know what this is.  They know Democrats have nothing else to run on because…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…angry when I find out that people take advantage of the American  people's generosity. It makes me want to knee someone in the groin. It  just makes me furious, and I think the American taxpayers feel the same  way.\n\nWhat I am about to tell you, Mr. President--let me apologize in  advance--is deeply disgusting. It is deeply disgusting. I mean, it is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…cover up public  corruption in the House of Representatives for both Republican and  Democrat Members of Congress.\n\nMrs. LUNA. Mr. Speaker, thank you very much, but I think the American  people know what happened tonight.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696854/parliamentary-inquiry"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…in the Republican  budget resolution, we increase Medicaid expenditures by at least 25  percent over the next 10 years.\n\nYes, we will fight fraud, waste, and abuse. We think the American  people agree that fraud, waste, and abuse robs the Medicaid system from  covering the people like the disabled, the elderly, pregnant women, and  children. It robs money…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690738/republicans-are-not-cutting-medicaid"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…side of the aisle don't like to think  about that, but that is a fact.\n\nAll DOGE is wanting to do is look at spending and see if we can cut  out unnecessary spending. I think the American taxpayers want that. We  continue to pledge to see if we can find wasteful spending and  eliminate it altogether.                 Recognizing Terry Forcht of the Forcht…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the first place, which is another category of ineligible  individuals. So Congress has never authorized federally subsidized  health coverage for noncitizens.\n\nI don't think the American people who voted overwhelmingly for  President Trump last November did so because they want to see taxpayers  subsidize illegal aliens' healthcare.\n\nIn addition to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and issued by the President to change the General Services  Administration's policies to prefer classical and traditional  architecture in Federal public buildings.\n\nI think every American can imagine what we are talking about here.  When you look at the Capitol, our national monuments, the White House,  many courthouses, the classical style very much…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Leave\n\nMr. COMER. Mr. Speaker, that was a long minute for the leader of the  Democratic Party to advocate for more work-from-home policies for our  Federal employees.\n\nI think the American people have spoken loud and clear. They support  our Federal employees, like the Republican Party, but we expect them to  show up for work, not get paid to be home and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…time alter the process. I  certainly think our Founding Fathers would support strengthening the  integrity of our elections.\n\nDemocrats know this, Mr. Speaker. They must think the American  people, though, have forgotten about their for the politicians act in  the 117th Congress, where they basically codified a COVID-era and  fraud-ridden election law.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}]