[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Jewish constituents and Americans are facing. I am  proud to co-lead the resolution with the gentleman, and I think his  interaction with our office is a reflection of how things ought to work  in this Chamber.\n\nMr. Speaker, I thank the gentleman from New Jersey and the gentleman  from New York for their leadership.\n\nMr. VAN DREW.\n\nMr. Speaker, I thank…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…this time of year to the  States for the upcoming school year to support afterschool programs,  STEM education, school counselors, and smaller class sizes, among many  other things.\n\nWill the administration put that funding in the next rescissions  package?\n\nSo, if we pass this bill, we would find ourselves right back here in  a couple of months--with…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…healthcare, and public services, leaving a lasting impact on  countless lives.\n\nOn a personal note, ``CP'' was my friend and supporter for many  years. He always advocated for all things Quitman County. He never told  me what I wanted to hear, he always told me what he felt I needed to  hear. I will be forever grateful for the timbre of his character and  the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…water conservation standards, Mr. Speaker, save consumers  money. The only reason that we have these energy-efficient standards  both for showerheads and for so many other things is that Congress, on  a bipartisan basis, decided to establish a program where if the  Department of Energy or other Departments, mostly the Department of  Energy, could show…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…all. Let's overturn the  congressional and constitutional history that says we only go to war  with Congress and try to hide in the grass.\n\nMany of my colleagues have said things about Iran and how bad Iran  is. None of them have ever introduced an authorization for war against  Iran. If Iran is so bad, do that.\n\nPeople in this body would rather not…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…low. This year, violent crime in D.C. is down 28 percent  compared to the same period last year.\n\nD.C.'s Comprehensive Policing and Justice Reform Amendment Act, among  other things, gave the police chief more authority to discipline  officers for serious misconduct and crimes; strengthened civilian  oversight of the police department; improved public…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Insley Dingell is the dean  of the House Democrats of Michigan, the wife of John Dingell, the  daughter-in-law of John Dingell, Sr., people who stood in this Chamber  and passed things of historical importance.\n\nJohn Dingell was the last World War II veteran to serve in this very  Chamber, Mr. Speaker. He was a respected individual and is still  referenced…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…should be without a home. No one should fear being sick  because they can't access healthcare, not in America.\n\nThis is not a partisan issue, my friends. There are a lot of things  that we can be partisan about. This isn't one. We only have a few days  left to get this right. Let's not let the American people be the  sacrificial lamb over some undisputed…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…administration have pushed out more than 3,500 public servants  there. As a result, the Department of Energy is in trouble. The  Department has even had to ask external lawyers for things like  defending against challenges relating to their illegal cancelations of  projects across the country.\n\nTo bring this bill at a time when people really want to see the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…piecemeal way with all these individual bills to put his face on Mount  Rushmore and the $100 bill?\n\nWe actually have legislation from folks across the aisle to do all  these things: to rename Dulles Airport, to do national holidays. Why  not go all the way? We know that is where this is all heading anyway  since everything is in service of one man's fragile…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Texas shut down all the power  and caused people to freeze. That took place because that grid was  unified, and they couldn't call in power from elsewhere.\n\nThis graph does two things. It takes a look at 1 month, August back  in 2018, and it looks at what power costs at different levels of demand  on the grid. So in 2018, if you had 40 units of gigawatts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…within our region.  We have other routes across the Cascades duly impacted.\n\nSo I can say that there are some positive stories out of this, that  coordination, that actually things that mitigated and adapted with a  levee system to prevent some of the record amount of rain from doing  even more damage have been successful. I am sure that we will all share…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…promising America that his administration would  release the Epstein files and tapes, Trump is now calling it a hoax. He  is calling his own supporters stupid for believing the things he told  them, and you are deeming adoption of a bullshit resolution on Epstein  that does nothing.\n\nLet me be clear. This resolution does not have the force of law. This…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that was supposed to be about affordability, Donald  Trump kept making fun of the word ``affordability.'' Does he have to go  shop for groceries and not be able to buy the things his family needs?  When your car is damaged in an accident and you don't have money for  the deductible and you don't have a car, does he understand that?\n\nDonald Trump is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of this country that we  honor his birthday as a holiday, but it is more than a holiday. It is  an opportunity for us to do some introspection, to examine some of the  many things that are occurring within our country that should be  addressed in a King-like fashion.\n\nDr. King had something that many other intellectuals of his time did  not have. He…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…unnecessary danger.\n\nMy bill just mandates that the District of Columbia is the one city  that Congress has authority over, and therefore, responsibility to be  involved with things like this.\n\nWe shouldn't have to have this law.\n\nWhy? Because the District of Columbia should be following the Federal  law in the first place. We shouldn't have to bring this…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Pleasure; She chatted all the way; But       left me none the wiser For all she had to say. I walked a       mile with Sorrow; And ne'er a word said she; But, oh! The       things I learned from her, When Sorrow walked with me.\n\nAnd I was thinking about that poem and him delivering that poem and  me remembering that poem from probably 30 years ago in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, I think we are all pleased to be back  with a new year and hard at work.\n\nOne of the things that has really captured the attention of the  American people in this new year is the amount of fraud that has been  uncovered in Minnesota. What we have learned is that now…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…subsidizing preferred  sources like wind, solar, and batteries.\n\nInstead of regulating one industry and subsidizing another to make it  competitive, we need to get back to making things affordable in the  first place.\n\nThe National Coal Council plays a critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the energy industry. We  know that we need more energy going forward. We need more electrons on  the grid. We need a larger grid. We need to all work together to do  those things, but if this resource management plan amendment by the  previous administration was balanced, I would hate to see a heavy- handed resource management plan amendment by the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…had over 61,000 attorneys across America  provide pro bono legal assistance to survivors--61,000. That was from a  bill here we had on the Senate floor. These are the kind of things we  can do in the Senate, in the Congress, to address this very significant  challenge in my State and across the country.\n\nSo this resolution builds on what we are doing across…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…country, I am  sure, would love to have Congress change the provisions so that they  were able to use still more tax credits.\n\nWhy at a time when we can do so many other good things would we do  that? I don't know, but they have been very active in this building,  and they are looking to get more tax credits.\n\nThe next thing to remember about this is there…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, we have heard the opposition to this take on  two things: number one, that this has somehow raised the cost of living  and that, somehow, the fentanyl crisis is not a national emergency. I  would like to disassemble those two arguments.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699967/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…President's desk. Again,  I don't care, really, if we send an H.R. or if we send a Senate bill to  the President; we just want to get it accomplished. We want to get some  things done for Alaska.\n\nThe first measure, which is H.R. 42, amends the Alaska Native Claims  Settlement Act, or ANCSA. It amends it to ensure that when Alaska  Native elders, the…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, there are many things that make eastern  Washington the greatest place to live in these wonderful United States  of America. Today, I rise to recognize one of those wonderful things,  the Eastern…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…hardworking families who have been struggling.\n\nIf you listen to the people on the other side, Mr. Speaker, who have  over and over again said they are against this bill and all the things  that are in this bill for hardworking families, you would think the  last 4 years things have been going great for middle America. I don't  know what parallel universe they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…floor and block this bill?\n\nSo anyway, when Secretary Haaland, Secretary of the Interior--when  she went through her confirmation process, I talked to her about a  number of things. She was a Congresswoman at the time. I said: The No.  1 issue I care about more than anything--more than oil and gas, more  than resource development--the No. 1 issue I care…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…paved the way for so many others during her 32 years in the House of  Representatives.\n\nNita was a tireless advocate for the Hudson Valley, and she was  committed to getting things done on behalf of her community. Along with  Congressman Latimer, we now represent portions of the district she once  served. I know I speak for George in saying that we are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…within the House of Representatives. This is a  truly bipartisan caucus. Like the various liberation groups of Iran, we  Republicans and Democrats differ and quarrel about many things, but we  are solidly united in the support of the people of Iran and their  struggle for their own liberation from the tyranny of the mullahs.\n\nThe Iranian regime has made…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…First of all, President Trump received an overwhelming mandate not  just in Kentucky's First Congressional District, but all across  Kentucky.\n\nThe mandate was to do two major things. First of all, obviously, the  mandate involved draining the swamp. That is what President Trump  campaigned on; and, secondly, to pass an America First agenda.\n\nWith respect…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}]