[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…sovereignty in the Executive but to grant the  power to declare war to Congress.\n\nIn April 1798, a future President, James Madison, wrote to another  future President, Thomas Jefferson, underscoring the danger and the  decision. He said:\n\nThe constitution supposes, what the History of all       Governments demonstrates, is that the Executive is the branch…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and the Founders did not want to put  the power to start another war in the hands of any single person.\n\nThe Framers put their thinking on parchment, and in a letter to  Thomas Jefferson, in the summer of 1789, James Madison reflected on how  they had approached this question of war power, which was the subject  of much debate in Philadelphia at the Constitutional…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…NORTON. Mr. Speaker, today, I introduce of a bill that would  require the Library of Congress (LOC) to install the District of  Columbia seal in the Main Reading Room of the Thomas Jefferson Building  of the LOC. Specifically, the bill would require the LOC to install a  stained glass panel depicting the D.C. seal among the panels depicting  the seals of all…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…liberty's cost and our new Nation's  responsibility to uphold the values that our European forebears  bequeathed to us, ones that focused on representative government.\n\nThomas Jefferson knew America does not exist alone on the globe when  he wrote the words: ``Our laws, language, religion, politics, and  manners are so deeply laid in [European] foundations,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…incredible harm to my constituents and Americans across this  country. I call upon my colleagues to not let them be successful in  their attempts to obscure and distract.\n\nThomas Jefferson said: When injustice becomes law, resistance becomes  duty.\n\nResist.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693115/trump-leads-with-smoke-and-mirrors"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…representative democracy in the Western Hemisphere where only White  land-owning men could vote; the home, the birthplace, of American  slavery; and the birthplace of Thomas Jefferson, who wrote that all men  are created equal and endowed by their creator with the unalienable  rights of life, liberty, and the pursuit of happiness. He excluded  nearly…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the idea that we must all tell the truth and the fact-finder can decide  ``beyond a reasonable doubt'' or ``by preponderance of the evidence''  what actually happened.\n\nThomas Jefferson said, ``I consider trial by jury as the only anchor,  yet ever imagined by man, by which a government can be held to the  principles of its constitution.'' Indeed, the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…dictatorship, a preposterous assertion that contaminates the  entire resolution.\n\nThe resolution even tries to conscript to these ideological  deceptions the words of Presidents Thomas Jefferson and James Madison,  enlightenment liberals who lived long before socialist ideology even  existed and would detest the fanatical, theocratic politics of the MAGA  movement…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…independent Nation would see the  representatives of the people make the decision of whether and when to  put American lives on the line.\n\nIn 1798, James Madison wrote to Thomas Jefferson about the danger of  leaving that power in the hands of an executive.\n\nHe said:\n\nThe Constitution supposes, what the History of all       Governments demonstrates, that…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…careful  choice to do it differently, and that choice was described most  eloquently in a letter from the main drafter of the Constitution James  Madison to President Thomas Jefferson. Actually, he was not yet  President. This letter was dated April 2, 1798, and James Madison  described what were they getting at when they vested the power to  declare…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…clause which confides the question of war or       peace to the legislature, and not to the executive       department.\n\nA few years later, in another letter, this time to Thomas Jefferson  as part of their famous correspondence, Madison expounded on that very  simple superlative, naming the war powers clause in the Constitution as  the most important. He…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…bill runs in direct contrast with what was set in motion  by the Framers and the Founders of our great country.\n\nOf course, the Declaration of Independence, authored by Thomas  Jefferson, makes the famous statement: ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it should go  through Congress because our Constitution says so.\n\nIf we go back to how the Founders viewed this situation, we can turn  to James Madison, who wrote to Thomas Jefferson and said:\n\nThe constitution supposes, what the History of all       Governments demonstrates, that the Executive is the branch of       power most interested in war, and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Independence written 250  years ago, which promised that all men were endowed by their creator  with the inalienable rights of life, liberty, and the pursuit of  happiness. Thomas Jefferson didn't mean all men. He didn't include the  men, women, and children that he owned, including his children and the  mother of those children.\n\nWhen James Madison, the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…restore the Chesapeake Bay.  Specifically, three of my amendments support the Continuous Electron  Beam Accelerator Facility and the High Performance Data Facility at the  Thomas Jefferson National Accelerator Facility, commonly known as JLab,  in Newport News, Virginia, and my fourth amendment supports the U.S.  Army Corps of Engineers' ongoing oyster restoration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…gay,  male, female, whatever it was. He would engage with people on campuses  and around this country to pursue truth.\n\nMr. Speaker, one of my favorite quotes is from Thomas Jefferson where  he said that for here, we are willing to pursue truth wherever it may  lead. We need to follow truth wherever it may lead, but you also have  to have the courage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Chinese Communist Party back in 2023, and part of  what this bill is addressing are issues that were brought out at that  time, one of which struck home.\n\nFairfax County's Thomas Jefferson High School for Science and  Technology, which at one time was the number one high school in the  United States of America, has apparently slipped to number five. I did…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…taken to its most extreme and destructive end.\n\nThis is not the classic Republican tolerance you find in the  Federalist Papers or the writings of George Washington and Thomas  Jefferson. It is a tolerance of anything and everything which  overpowers all reason and undermines all distinctions between right and  wrong, good and evil, order and anarchy.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Christian religion is  that it brings the great principle of the law of nature and nations . .  . to the knowledge, belief, and veneration of the whole people.''\n\nThomas Jefferson and John Adams hinted at the incompatibility of  America's Republican virtues with the values of Muslim nations after  meeting with the Islamic Ambassador about the Barbary…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…ladies.\n\nJohn Adams was a chief architect of independence, our Vice President,  and our second President, whose lifelong correspondence with his chief  political rival, Thomas Jefferson, stands as a shining example of the  power of speech and shared principles.\n\nAbigail Adams was an early advocate for women's rights and shaped the  second Presidency through…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}]