[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…already significantly  understaffed, with only five investigators investigating these  incidents across the Nation. At this staffing level, it would take up  to 4 years to thoroughly research and release a report after each line- of-duty death.\n\nThat was until 2 months ago.\n\nUnder the banner of government efficiency and the claim to reduce  waste, DOGE…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…right to search your home without a judicial warrant.  That is illegal, and it is unconstitutional.\n\nThird, they refused to make sure that the use of deadly force is  always  thoroughly investigated. When Renee Good was shot to death, Kristi Noem  declared her a domestic terrorist within hours. The only investigation  Noem was interested in was an investigation…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…least  able to afford it. Healthcare workers would lose their jobs. Millions  could lose coverage. And for what? So billionaires can pay less in  taxes. It is a revolting--thoroughly revolting--agenda.\n\nDemocrats will vehemently oppose this bill and all the harmful  elements of the Republican agenda at every opportunity.\n\nTomorrow, as I said a moment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…privately  employed inspectors temporarily. Our bill ensures public safety by  requiring that all federally funded bridges, tunnels, and roadways are  inspected objectively and thoroughly under the highest safety  standards. This work can and should be done by skilled, qualified  inspectors employed by state and local departments of transportation.\n\nFrom the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…cooperation to target these organizations at  their source. And like everyone here, I recognize the cartels are a  scourge and they must be confronted aggressively and dismantled  thoroughly.\n\nBut that is not what is happening here. Let me begin with the most  fundamental question: What is the operation actually meant to  accomplish?\n\nThe administration has emphasized…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…execute the laws, not to rewrite the Constitution when the  facts or the voters displease him.\n\nYet here we are. Donald Trump's dangerous threat rests on a familiar  and thoroughly discredited premise that American elections are rigged,  fraudulent, or illegitimate. That claim has been examined exhaustively  and has been rejected everywhere it has been…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Speaker, I rise in support of H.R. 2399, the Rural Broadband  Protection Act. This legislation would direct the Federal  Communications Commission to establish a process to more thoroughly vet  internet service providers participating in the Universal Service  Fund's high-cost program.\n\nI have long advocated for reforms to combat waste, fraud, and abuse  in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…of the  complexities of the national airspace system and that we shouldn't take  the precious few moments with loved ones for granted.\n\nWe must investigate this accident thoroughly to prevent this event  from ever happening again and ensure that aviation safety always  remains a top priority.\n\nWith regard to the investigation, we are grateful to the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…how we enforce immigration policy in this country.  We cannot stop there. We must demand that those who are responsible for  terrorizing our communities are investigated thoroughly, not by the  agencies that oversee them but by truly independent authorities.\n\nWe have seen Federal agencies block State investigators and stonewall  accountability. That…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…operators, laborers, and electricians  can get back to work this morning to create a modern and robust energy  grid for the 21st century.\n\nJudge Lamberth, a Reagan appointee, thoroughly reviewed the record of  the New England-based Revolution Wind offshore project and correctly  determined that the Department, in fact, did not find a national  security problem…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…investigate three former Biden  administration officials for criminal wrongdoing in handling last  year's budget shortfall. To say the least, I was shocked by this  letter. We thoroughly addressed VA budget issues last year, and neither  the inspector general nor GAO found any evidence of criminal  wrongdoing--none, Mr. Speaker.\n\nSo why call on Trump's Attorney…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in popularity, we must ensure  that the CPSC adopts a strong Federal safety standard for lithium-ion  batteries. Consumers deserve to know that the products they buy are  thoroughly tested and safe, and this legislation would do just that.\n\nI have to say that compliance with this bill depends on enforcement  by the Consumer Product Safety Commission.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…one.\n\nMr. MERKLEY. I will yield for a question.\n\nMr. MERKLEY. Thank you to my colleague from Vermont. I appreciate  your points, and I do share them, yes. You expressed them thoroughly  and compassionately. And thank you for your advocacy.\n\nI see that my colleague from Virginia is on the floor. Would my  colleague from Virginia consider asking a question?…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…In Florida, pilot  programs have taken innovative steps, such as using long-acting  injectables to help fight opioid addiction. I am encouraged by the  number, and I also thoroughly believe that Congress needs to continue  the program to make this response possible.\n\nOne SUPPORT for Patients and Communities Reauthorization Act of 2025  program I am especially…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…release all       persons detained or imprisoned on politically motivated       grounds and drop any pending charges against them;\n\n(11) to call on the Government of Georgia to thoroughly       investigate all allegations emerging from the recent national       elections, which took place on October 2024, make a       determination whether the elections should…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…maintains stable access to necessary components, boosting domestic  manufacturing and innovation.\n\nTo remain at the forefront of the next generation of technology, we  must thoroughly assess and protect our supply chain. Any disruption  threatens not only our progress but also our national security, our  economic strength, and our global position in the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…impact it was having on my  State as well as his own. Doug was always willing to listen, learn, and  engage on the issues that matter most. He was the most curious man.\n\nI thoroughly enjoyed working with him on a wide range of policies and  challenges that uniquely affect the West and the hardworking  communities we both represent.\n\nDoug was a true friend.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of the DOE and the EPA? Is $60  billion foisted on to our Nation's manufacturers and consumers in new  regulatory and compliance costs not serious enough for Congress to  thoroughly scrutinize?\n\nDemocrats seem to be confused about what it is that the American  people voted for in November, and one of those items was lowering day- to-day costs that are…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "French Hill", "party": "Republican", "sentence": "…allies simply  looked down at their shoes. In 2014, Putin took Crimea without firing a  shot. He is a disgrace to the rich, cultural history of the Russian  people, and he has thoroughly corrupted a false and bordering-on-insane  historic narrative regarding his threats and ambitions in Ukraine.\n\nAmerica, as the instrumental force inside the transatlantic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…to obtain Federal approval in the  first Trump administration, a weaponized court system pulled Florida's  404 permitting out from under us, even though our program was  thoroughly vetted and approved in 2020.\n\nFlorida's DEP has become a national model for environmental  protection, and Washington should be learning from us, not tying our  hands.\n\nThe…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Abraham Lincoln and  end that scourge for America and for mankind.\n\nMr. Speaker, by reauthorizing the Adams Memorial Commission, H.R.  2306 would provide the time needed to thoroughly design, locate, and  construct a memorial truly worthy of the Adams family's commitment to  America.\n\nI, once again, recognize Representative Moolenaar for his bipartisan…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…days away, the House was brought back for one fly-by  vote to ratify what the Senate had come up with as our only opportunity  to reopen the government.\n\nThe Senate was so thoroughly convinced of the House's irrelevance  that they thought that they could literally insert a self-enrichment  scheme into the legislation and get away with it. By the way,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}]