[{"senator": "Dave Min", "party": "Democrat", "sentence": "…has created additional  red tape and hurdles that made it very difficult.\n\nThere is a lot of uncertainty right now. These are companies that,  again, are creating thousands and thousands of jobs, providing billions  of dollars in collective impact to the southern California area. We are  seeing this story writ large across the board right now.\n\nMr. Speaker,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…on egregious attacks against  historic investments in the Inflation Reduction Act, cutting more than  $500 billion in investments and programs, threatening hundreds of  thousands of jobs, and raising monthly household energy bills.\n\nIn 2024--this is the big number--in 2024, 94 percent of all new  electricity generation added to our country was wind and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…on this: Donald Trump's trade war  doesn't create any manufacturing jobs tomorrow in the United States. In  fact, it is far more likely to cost us tens or hundreds of thousands of  jobs. Half of the goods that America imports are intermediate  components, that means parts that our companies manufacture into  finished goods. Every one of those items coming…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Africa and has been a true success.''\n\nAGOA has further contributed to diversification and competitiveness  of Sub-Saharan Africa's economies and supports hundreds of thousands of  jobs across the continent and the United States. I can think of no  better way for America to continue to expand its trade relationships  with Africa than reauthorizing this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…world see what Rhode Islanders  have always known, that there is no place like the Ocean State.\n\nUnder his leadership, tourism became a major economic driver,  creating thousands of jobs and boosting local businesses. He is perhaps  best remembered for the iconic ``Biggest Little State in the Union''  campaign, which cemented Rhode Island's place on the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…helped to kick off a manufacturing boom in America-- as I mentioned, hundreds of billions of dollars, not through government  but through the private sector--hundreds of thousands of jobs. New  factories went up around the country. Battery technology, clean  vehicles, energy-efficient products for businesses and homeowners--it  was already bringing down…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…face of the Earth, and we take the responsibility for  tending that seriously.\n\nThe Great Lakes form the beating heart of our regional economy. They  support hundreds of thousands of jobs, from the auto and steel  industries, manufacturing to shipping, farming to fishing, and tourism  to technology.\n\nOur freshwater coast is a national treasure, and it…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…are justifiably concerned that these unelected intruders  are acting as judge and jury on people's lives and livelihoods as they  gleefully and illegally feed tens of thousands of jobs and vital  programs into a woodchipper.\n\nThis billionaire and his tech bros claim to have found billions in  fraud, waste, and inefficiency, but their methods and results…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…on by this administration's policies.\n\nI was proud to support the bipartisan infrastructure law, which  awarded $1 billion for a clean hydrogen hub that would create thousands  of jobs in northwest Indiana. BP's oil refinery prepared to make a  private investment of over $6 billion. Members of organized labor  created apprenticeship programs to ensure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…dollars of clean energy projects all over this  country in every State--in Virginia, in Missouri--all over the Nation:  billions of dollars of projects that hire people, thousands of jobs  lost. The projects that are being canceled are going to continue this  trend of--at a time of great demand and growth--data centers and all  kinds of uses for AI that,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…country. Millions of Americans have paddled, fished,  swum, and found solace among its pristine lakes and forests. It  supports a multibillion-dollar outdoor economy, thousands of jobs, and  a way of life that has been passed down for generations.\n\nIt is an area that Presidents, reaching back to Teddy Roosevelt, and  Members of Congress on both sides…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…overturned quickly.  As we heard on Friday, the U.S. labor market is weakening, and we know  the cost of electricity is going up.\n\nLeaving Revolution Wind in limbo with thousands of jobs on the line  is completely unacceptable.\n\nIt is no secret that the President doesn't like wind power, but this  project has been permanent, paid for, and is 80 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…more affordable. It undercuts our work to lower prices  for consumers, locking in higher bills for decades and impacting, as  well, jobs.\n\nRevolution Wind is providing thousands of jobs in Connecticut and  Rhode Island. More than a thousand local union workers have already  logged more than 2 million hours on the project. The stop work order  put hundreds…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…poultry farms  to vegetable growers to grain producers, Delaware farmers feed families  here at home and around the globe and contribute to an industry that  supports thousands of jobs in Delaware.\n\nUnfortunately, since taking office, the Trump administration has  broken their promises to our families and breached the trust with our  farmers.\n\nIn week…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, across America, hardworking people are  struggling to pay their bills. This includes housing, groceries,  healthcare, and more. Hundreds of thousands of jobs have been cut due  to the DOGE policies. Our economy is sputtering, and the tariffs are  jacking up prices.\n\nThe so-called big, beautiful bill will decimate Medicaid,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695634/delivering-for-the-american-people"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…would have provided a safe and reliable way  to transport energy resources between the United States and our  neighbor to the north, Canada. It would have created tens of thousands  of jobs, as my colleague earlier said, strengthening our energy  security and generating billions of revenue to boost economic growth.\n\nDon't listen to this chatter out here.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…our bill author,  Dr. Murphy, shares from his time serving as a medical missionary in  Haiti, these trade programs represent an economic lifeline that  supports tens of thousands of jobs and sustain one of the last  remaining formal industries in the country.\n\nFailing to extend these programs would further destabilize an already  fragile situation, worsening…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…progress.\n\nWhom did the Biden administration hurt?\n\nThey hurt the chemical manufacturing sector, which includes thousands  of mid-sized companies representing hundreds of thousands of jobs.  These companies have invested millions in cleaner technologies and  equipment upgrades. Under this Biden-era EPA rule, their investments  will not be rewarded with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…these lands outright, creating long-term certainty for this project.\n\nConstructing this road and allowing access to the Ambler Mining  District is expected to create thousands of new jobs and produce $1.1  billion of revenue for Alaska. Road construction alone will create more  than 350 jobs, creating economic opportunity desperately needed in  rural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…with far fewer choices  and force everyone to pay more for new and used cars to reflect  consumer demand and offset automaker losses.\n\nTo make matters worse, hundreds of thousands of jobs will be  eliminated. The Specialty Equipment Market Association wrote that a ban  on internal combustion engines ``would represent over $100 billion  annual economic…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…needed or because it wasn't safe, but to  appease radical activists.\n\nWith that single decision, the Biden administration cost the U.S.  more than $3 billion in GDP and thousands of jobs, including many in my  State of North Dakota.\n\nThis uncertainty has created a chilling effect on investment in the  infrastructure we desperately need for American energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…America's electricity, and in five States, coal provides more than  one-half. In 17 States it provides more than 20 percent. Together, the  coal industry supports hundreds of thousands of jobs, lifts up small  communities across the country, and provides affordable and reliable  baseload power that helps keep prices stable.\n\nPremature retirements of coal plants…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Utah's energy sector  due to provisions slashing the bureaucratic red tape associated with  permitting delays and by restarting oil, gas, and coal leases. This  will create thousands of jobs in Utah.\n\nThe One Big Beautiful Bill Act also helps Utahns by reauthorizing the  Radiation Exposure Compensation Act, also known as RECA, for another 2  years following…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…good-paying jobs in oil and gas, construction, transportation,  manufacturing, and small businesses that rely on affordable energy. The  Alaska LNG project alone would generate thousands of jobs,  strengthening our economy and supply chains. If we want to grow  opportunity for working families, we must stand with American energy  and repeal the natural gas tax.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]