[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…caused the accident in the first place.\n\nSo we don't allow these families to have any recourse with the  government, but we are still here with a provision that some Senators  thought was  important enough that they get off and can basically sue the government  for millions of dollars. And yet this kind of behavior that makes it  more dangerous for the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…clients unravel       emotionally. Individuals who had made progress in therapy are       now regressing under the weight of uncertainty. Parents       express terror at the thought of losing work authorization       and the ability to provide for their children. Many fear       being forced to return to a country that remains unsafe and       unstable.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…have seen  some reckless moves to undermine medical research, including cancer  research. Research funding has been pulled without reason, without  warning, and without any thought for the consequences.\n\nThis administration has tossed clinical trials into chaos, promising  cures into limbo, and threatened to abandon our historic global  research and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…graduation, which was 3 months away.\n\nWhen I wrote the essay, she came to me several days later and told me  that she had read my essay and was very disappointed in what I wrote. I  thought she had problems with the style, or maybe I didn't get the  subjects and verbs to agree.\n\nWhen I went into her office, she said to me she was disappointed  because I said…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…away.\n\nFor the next 100 years or so, African Americans lived under the  threat of violence. If you looked at a White woman the wrong way, you  could end up dead. If she just thought you looked at her the wrong way,  you could end up dead. That is what happened to Emmett Till.\n\nNot only that, you had African Americans who came back from service  after…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Free D.C.\n\nTo my colleagues across the aisle, I appreciate the debate, but I  have to say I thought we were going to try to fix healthcare, to  address costs, try to fix the economy, and get the country back on  track. Isn't that what the promise at the end of the shutdown…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…have access to healthcare they can afford.\n\nProtecting Michiganders' healthcare is why I ran for the House  originally. It is why I am here in the Senate.\n\nI, frankly, never thought I would run for political office. But, in  2017, I watched on CNN as my then-Representative smiled and cheered in  the Rose Garden as President Trump repealed the Affordable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…unauthorized access to private  data and then blindly firing 5,200 employees across multiple Agencies.  There is nothing competent about cutting the workforce without any  thought about how it would impact operations.\n\nThis is not efficient. This is senseless, and this is heartless.\n\nNIH is based in my State of Maryland, and many of the workers there…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Eliot Trumbull, helped draft their Articles of Association. The  Articles state that the club was formed with the purposes of ``creating  an organized center for women's work, thought and action; advancing the  interests of women, promoting science, literature, and art; providing  an accessible place of meeting for its members, promoting social  intercourse…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…National Security.'' Of course, the SALT talks  were the Strategic Arms Limitation Talks.\n\nGeorge McGovern closed the debate--and I remember this like it was  yesterday--I thought very powerfully. He said that he recalls that when  he was a young Senator in 1963, they were debating the Limited Nuclear  Test Ban Treaty, and Senator Everett Dirksen, who…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…a reality, not       only will we be homeless . . . but we will not be able to       access the healthcare and drug coverage we need to have       quality of life. We never thought we would need government       healthcare, but here we are, and the outlook has darkened       considerably for many dairy farmers since January.\n\nThis fight to protect Medicaid…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the Hyde  Amendment and reintroduce the EACH Act to end it once and for all.\n\nIt is 2025. In 1976, when I was a mere 2 years old, a Congressman  from Chicago was livid at the thought that a woman could be in control  of her own body, especially a Black or Brown woman. So he came to this  floor and put forward an amendment with a simple, cruel aim to ban…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693925/access-to-abortion-care"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…national parks,  metros and buses, and so on, if they are police. I think that that  should be decided by our communities, whether people are doing  concealed carry there.\n\nI thought that a belief in federalism was something that unifies us.  That is something that the State governments can decide in cooperation  with the local governments. The Congress…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…suffer.\n\nMr. Speaker, why would I now decide that I am going to bless, if you  will, condone, a CR that continues what happened, when my Republican  colleagues did what they thought was right, I assumed, and passed the  legislation without the help of Democrats?\n\nIf you can pass the initial legislation without the help of  Democrats, Mr. Speaker, then…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…tonight  because they know they are going to lose because they know their own  Members want to vote for it.\n\nWhat is even sillier is they had this nonbinding resolution, so I  thought surely we would vote on a nonbinding resolution. They don't  even want to vote on the nonbinding resolution in case Donald Trump  gets slightly offended. They don't even want…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…During a shift, we would see the worst of humanity, and then  we went home to our loved ones and pretended everything was okay. That  is because if you didn't, Mr. Speaker, you thought you would come off  as weak or unable to handle the job.\n\nAs a former police officer who required professional help after a  specific call for service, I understand the importance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Biden-Harris administration  DOE's final rule for commercial refrigeration equipment will have a  detrimental impact on small businesses and the consumers. If small  businesses thought this was going to benefit their businesses, I  guarantee you, Mr. Speaker, as a family business owner, we would invest  in it. We would not have to be mandated to invest in…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…an idea whose time has come, to  supplement private-sector innovation in this Nation, is actually  Congressman  Jim Himes' white paper that he shared with me years ago. I  thought it was well-written, and it was another indication that this  was not the direction to go in.\n\nSince that time, I have visited with other central banks around the  world,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…our borders and import millions of unvetted refugees because we  can't bear to turn a single asylum seeker away. We empty out our  prisons because we just can't stomach the thought of keeping anyone  behind bars.\n\nWe let violent criminals off with a slap on the wrist because we see  them as victims of socioeconomic conditions beyond their control. We…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…could. I would, God's honest truth. The Amish are on to  something, but since I can't do that, can we not at least recognize  that these are poisoning our children?\n\nThe first thought I had after I had received word that Charlie was  shot was to call my wife and to figure out how to get word to my son,  also named Charlie, who I knew was an enormous fan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…was scandalous  that we were bribing somebody $25,000 a year not to get married.\n\nI asked a gal who was present in the room that night--her job was a  bartenderess--what she thought about these programs in which you would  get a benefit, not only if you didn't get married, but an even larger  benefit if you didn't work too hard. She said she got married…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the liberal intellectual social circles of the times  with the likes of Norman Mailer and Allen Ginsberg.\n\nHe also wrote for and worked at Commentary, a journal of Jewish  thought which, at the time, fit well into those circles. He became  editor-in-chief in 1960, on the eve of the disorder, chaos, and anti- Americanism that would be unleashed by the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we tell the truth to the American people that we are going to  have to embrace things that are actually hopeful?\n\nThe cost of healthcare--it is always fascinating, I always thought I  would get beaten up for saying this behind the microphone, and,  shockingly, we have had people being remarkably kind to us.\n\nThe economist in my Joint Economic Committee--and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to ratify what the Senate had come up with as our only opportunity  to reopen the government.\n\nThe Senate was so thoroughly convinced of the House's irrelevance  that they thought that they could literally insert a self-enrichment  scheme into the legislation and get away with it. By the way, they  still might get away with it because while we are passing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…review, this is another area where Republicans don't want to have the  debate on this floor. They are hiding behind these things they stick in  these rules.\n\nThey actually thought they stopped time. Republicans passed a rule  that stops time for the purposes of voting  on whether or not we should have these tariffs. They actually passed a  rule that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…affects our platforms. Insofar as the European governments  put restrictions on X or put restrictions on Instagram, it affects  Americans, as well, and that is true. What I thought was even more  significant is, this is what is happening in Europe.\n\nIn Europe, they have lost the right to free speech, which is just  shocking to me. Frequently, bad things…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't want to tell anyone, we are  going to try to do something that should not even be that hard.\n\nRemember $86 trillion in spending, the House was just trying to do 2,  and I thought 2 was absolutely anemic. We should have covered all 4,  $4.5 trillion.\n\nOne of the hardest votes I made in my decade-plus here was standing  right there and swallowing saying:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…take a moment and enjoy  some whole milk.\n\nYou know, I am not the only one that loves eating. America loves  eating. If I can share a story with my fellow Senators, I always  thought that I was my grandma's favorite grandchild, and I thought it  was because I was always the one that was the first to raise my hands  for seconds. Now, I don't know if I was…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, my colleagues on the other side of the aisle  have a choice to make.\n\nThey thought it was cute to defund the police. That didn't work out  for  cities like Portland, Seattle, and St. Louis.\n\nThen they thought it was cute to ignore our border. They allowed…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…told: Oh, by  the way, that Native allotment that you wanted? Sorry. When you were  fighting for your country, we passed a law saying you can't get it  anymore.\n\nWell, look, I thought that was a huge injustice, so I worked on a  bill during President Trump's first term to say: Now, wait a minute, if  you were overseas serving your country, and you missed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}]