[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…violence epidemic in  America.\n\nI have spoken loudly and clearly on gun safety again and again and  again, shooting after shooting. Moments of silence have never been  enough.  Thoughts and prayers have never been enough.\n\nAmericans need real action by Congress to end gun violence. That  means universal background checks, funding and support for community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…floor and to this House his experience and this  legislation. Hopefully, the majority will see the wisdom of it and make  it law.\n\nJohnson), and  I am looking forward to her thoughts.\n\nMr. GARAMENDI. Mr. Speaker, I would like to have a colloquy with the  gentlewoman from Texas if I might.\n\nMr. GARAMENDI. Talk a little bit about where your district is.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…hardest working Members of  Congress and the most dedicated public servants in the United States.  He is as tough as they come, and I know he is going to keep fighting.  Our thoughts and prayers are truly with him.\n\nMr. Speaker, I am pleased to support this bipartisan measure, which  will strengthen U.S.-Taiwan ties, showcase our support for Taiwan, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…though Alftise argued the Government of National Unity       remained more open to a negotiated solution.\n\n``Our government is more flexible, there are even some       thoughts that maybe we can merge the two governments in order       to have an election, and then we will have, of course,       parliamentary elections, and then we have a presidential…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…constituents. That is what they call on us to do.\n\nI am seeing Trump do an all-out assault on Congress's power of the  purse, so I wanted to come here today and ask you your thoughts on how  this President is undermining the power of the purse and how it plays  into your ringing the bells about authoritarianism.\n\nRinging the alarm bells for the authoritarian…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…already been making a  mark. I know she is here with the intent of being a reformer, which is  what we need in Congress.\n\nMr. MAGAZINER. Mr. Speaker, I thank Ms. Ansari for her thoughts on  this matter. Before I yield to the next Member, let me just preface  this by saying, again, we have had a big couple of weeks in this fight  to ban Members of Congress…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…was right or  wrong; this is an opportunity for us to stand up for our responsibility  under the Constitution to be a coequal branch in setting foreign  policy.\n\nI have my thoughts on the wisdom of this action. I have stated that I  think it is very dangerous when the President of the United States  deliberately misleads the country about the efficacy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…these men should still be here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty.\n\nLet us keep them and their families in our thoughts. May they rest in  peace.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…University to start a new semester after the mass shooting in December  that took the lives of Ella Cook and Mukhammad Aziz Umurzokov and  injured nine other students.\n\nMy thoughts remain with the victims, their loved ones, and our whole  community during what, I am sure, has been a difficult few days.\n\nFor the Brown students who returned to campus this…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699251/brown-students-return-to-campus"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…believe that the judge  is going to be objective, that he is not going to be subjected, that he  is not going to or she is not going to subject her most precious  judicious thoughts to the whims of a President who is reckless,  ruthless, and lawless. That is what you want to believe.\n\nOkay. Well, maybe that takes care of the judges, Congressman Green,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…State of  Illinois. I can reflect for a moment about the changes in the Senate  Chamber in the time that I have been here. I am afraid it would take me  too long to express my thoughts on that at the expense of the regular  business of this Chamber. But we have reached a point where there are  few and far between moments where we come together and agree…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…seniors, and  veterans. They are set to explode the deficit by trillions--trillions-- just to reward their wealthy donors.\n\nNow, with even their own Members having second thoughts and regrets  about that vote, as The New York Times reported last week, they are  desperate to change the conversation. However, these bills, these  distractions won't work…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…H.R. 1912, the Veteran  Fraud Reimbursement Act of 2025, authored by my colleague,  Representative Connolly. He cannot be here today as he bravely battles  cancer, and our thoughts and our prayers are with him.\n\nI echo the comments of Representative Bergman. Veterans in the  fiduciary program are some of the most vulnerable in the VA's care.  Because…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…many more facts I would like  to present, but I want to make sure that my colleague, my colleague  from Maryland Senator Chris Van Hollen gets an opportunity to share his  thoughts.\n\nWe have called on addressing starvation, the lack of food, going way  back to January of last year, 19 months ago. We called on the Biden  administration; we called on the…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…at the federal level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical science, we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…apply to them.\n\nThis bill also requires ATF to deny classification to any device that  could be readily modified into a firearm.\n\nI know there is a lot of hearsay, a lot of thoughts about where this  could go in the future, but, quite honestly, that is not the way this  bill was drafted. It is not going to lend itself to being used that  way.\n\nMr. Speaker,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…greater love hath no man than this, that a man lay down       his life for his friends.\n\nThese are the people we would all hope to be at the moment of our  testing.\n\nAgain, my thoughts and prayers are with all the victims of these  deadly floods and with those who continue to work to rescue them.", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693248/central-texas-floods"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…McCONNELL. Mr. President, I know that many of our colleagues and  the American people have seen the tragic news out of my hometown just  yesterday. And I am grateful for their thoughts and their prayers this  morning directed toward the people of Louisville.\n\nFolks around our county, Jefferson County, need those prayers right  now and in the days and weeks…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…longer with us, Doug's significant contributions  to agricultural and rural policies will endure long after his passing.\n\nI will very much miss my friend and my colleague. My thoughts and  prayers are with his wife, Jill; the entire LaMalfa family; his  friends; and his staff.\n\nGod bless you, Doug.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…are published. It is where they are codified. That  is where you go to look them up, and the number of pages has quadrupled  in my lifetime.\n\nLet me just offer a couple of thoughts on how this bill is, in my  view, important for small businesses to get at that problem of the  creeping weight of Federal overregulation.\n\nIn my district, the Second District…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…being a fair-minded,  commonsense legislator who worked with Members on both sides of the  aisle.\n\nFuneral services will take place on Saturday in Malvern,  Pennsylvania. Our thoughts are with his wife of 33 years, Nancy, his  four children, and all of his family.\n\nMay God bless Congressman Dick Schulze.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…voices tonight that remind America  that we lost a great American, we lost a great Californian, and we lost  a great human being.\n\nMy prayers are with Jill and the family. My thoughts are with his  constituents because they lost somebody who each and every day came to  this floor determined to advance their interest, to protect their  values, and to make…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…great Nation. I thank you for serving the great State  of California in the way you did. You left a legacy. You helped all of  us become better Representatives.\n\nTo Jill, our thoughts and prayers are with her and her four children.  God bless you and take care of your family.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698719/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…just such a person, he embodied that call.\n\nGod bless Captain Brady and his incredible life of service and  sacrifice. Katie and I, all Floridians, and this Nation offer our  thoughts and prayers to  the Brady family as they celebrate his life. May he rest in peace.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to honor  Doug.\n\nMr. MOORE of Utah. Mr. Speaker, to close, I again thank the  gentlewoman from California (Ms. Rivas) for yielding a few more minutes  to finish out these thoughts in Doug's memory.\n\nMr. Speaker, I will wanted to give a quick closing message to his  wife, Jill, and his four children: Kyle, Allison, Sophia, and Natalie.\n\nI get an hour…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Legislature. If you listened to what they said about Sylvester Turner,  only knowing him for a day or so, I missed a lot. He seemed to be a  wonderful man, a wonderful person, and my thoughts and prayers and the  thoughts of the Energy and Commerce Committee, and I know the whole  House, are with his family. He is going to be missed.\n\nI will get down to the business…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688548/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…was he  fun but he was thoughtful, he was pragmatic, and he was a really,  really good thinker. I turned to him on issues that I found to be  difficult. I wanted to get his thoughts on them.\n\nHe was a strong conservative. He was warm, kind, and principled. In  my mind, he was exactly the kind of leader that Americans want. He is  going to be dearly missed.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…sunsets on these things--it cannot be done without bringing in the  CENTCOM commander and this commander and this commander and this  commander and saying: What are your thoughts on this? What effects does  this have on our ability to react or deploy? What effects does this  have on those downrange in counterterrorism operations as we speak?  What…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695244/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Algorithms  and chatbots fuel addiction, depression, self-harm, and even suicide,  all while these companies hide behind section 230.\n\nWhen social media leads our kids to suicidal thoughts, our children  believe they are better off gone, and no one is held responsible. This  is a deeply broken system.\n\nI demand accountability. I am standing up for our children,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699340/repeal-section-230"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Mr. Speaker, I, unfortunately, had other  engagements that had been scheduled.\n\nThe resolution was introduced to, again, focus a component of the  dialogue. Of course, our thoughts and our condolences go out, but we  need more than thoughts and condolences. We need to have the  conversation about how to prevent this from happening again. We need to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}]