[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…American, he served Apache Junction with honor, bravery, and  compassion. Tragically, he is the fourth Arizona officer to fall in the  line of duty in just the past 12 months.\n\nMy thoughts are with his wife, family, his many good friends, and  colleagues. I hope his memory brings comfort and strength in the  difficult days ahead.\n\nOfficer Facio's ultimate sacrifice,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…across the aisle, to prevent this from ever happening  again. In the meantime, let us come together in expressing our deepest  condolences and agree to this resolution.\n\nOur thoughts and prayers remain with the passengers, crew, their  loved ones, and first responders.\n\nMs. DAVIDS of Kansas. Mr. Speaker, I urge all of my colleagues to  support H. Res.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Fellow-Citizens: The period for a new election of a  citizen to administer the executive government of the United States  being not far distant, and the time actually arrived when your thoughts  must be employed in designating the person who is to be clothed with  that important trust, it appears to me proper, especially as it may  conduce to a more distinct expression…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…already been making a  mark. I know she is here with the intent of being a reformer, which is  what we need in Congress.\n\nMr. MAGAZINER. Mr. Speaker, I thank Ms. Ansari for her thoughts on  this matter. Before I yield to the next Member, let me just preface  this by saying, again, we have had a big couple of weeks in this fight  to ban Members of Congress…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…at the federal level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical science, we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…wildfire in  California's history. Those we lost helped to shape the fabric of their  communities, and their absence has left a void that cannot be filled.  They are in our thoughts on this 1-year anniversary of the fire.\n\nWe remember Anthony Mitchell, Sr., a 68-year-old father, grandfather,  and great-grandfather who brought everybody together, and we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…hardest working Members of  Congress and the most dedicated public servants in the United States.  He is as tough as they come, and I know he is going to keep fighting.  Our thoughts and prayers are truly with him.\n\nMr. Speaker, I am pleased to support this bipartisan measure, which  will strengthen U.S.-Taiwan ties, showcase our support for Taiwan, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…floor and to this House his experience and this  legislation. Hopefully, the majority will see the wisdom of it and make  it law.\n\nJohnson), and  I am looking forward to her thoughts.\n\nMr. GARAMENDI. Mr. Speaker, I would like to have a colloquy with the  gentlewoman from Texas if I might.\n\nMr. GARAMENDI. Talk a little bit about where your district is.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…prop in  some social media video that is posted later to placate constituents  about ending gun violence. I am going to continue to honor them with  action, not just with thoughts and prayers.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…many more facts I would like  to present, but I want to make sure that my colleague, my colleague  from Maryland Senator Chris Van Hollen gets an opportunity to share his  thoughts.\n\nWe have called on addressing starvation, the lack of food, going way  back to January of last year, 19 months ago. We called on the Biden  administration; we called on the…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…these men should still be here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty.\n\nLet us keep them and their families in our thoughts. May they rest in  peace.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…was right or  wrong; this is an opportunity for us to stand up for our responsibility  under the Constitution to be a coequal branch in setting foreign  policy.\n\nI have my thoughts on the wisdom of this action. I have stated that I  think it is very dangerous when the President of the United States  deliberately misleads the country about the efficacy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…enforcement officials.\n\nMy colleagues across the aisle keep claiming that the Administrator,  along with DOGE, identified a case wherein an illegal alien--we will  get to my thoughts on that term in a minute--received a nearly $1  million loan despite holding only 49 percent ownership of a business.\n\nThese allegations are unsubstantiated. We have seen…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…helped union labor gain new opportunities in the 21st century.\n\nArthur was not only a labor leader, he was also a dedicated father,  grandfather, husband, and friend. My thoughts are with his family at  this incredibly difficult time.\n\nI hope they, as I do, take heart in his service to the movement and  to others. His contributions will not be forgotten.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…his not understanding that there  should be some independence in the judiciary and that the judiciary is  not for him to supervise, I put all of this into my collection of  thoughts.\n\nAs I do so, I have to agree with Vice President Cheney. I mentioned  that in our 248-year history, there has never been an individual who is  a greater threat to our Republic…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…next rules adoption at the end of this term.\n\nI look forward to working with them if that is what they really want,  but I think it is political lip service and not sincere thoughts of  following the direction that Mr. Jefferson set forth after studying 400  years of parliamentary  practice and procedure that he put forward when he was Vice President…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…just such a person, he embodied that call.\n\nGod bless Captain Brady and his incredible life of service and  sacrifice. Katie and I, all Floridians, and this Nation offer our  thoughts and prayers to  the Brady family as they celebrate his life. May he rest in peace.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…that touched  everyone she encountered.\n\nAs her parents, Carmine and Dana, and her siblings, Jordana and Tino,  continue to grieve this unimaginable loss, we keep them in our thoughts  and prayers. Gia's memory will forever shine brightly in the hearts of  all who were blessed to know her.\n\nMay Gia rest in peace and may we all strive to live each day in…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to share my thoughts on the  dilemmas that we face here in Congress.\n\nWatching what is happening not only here at home and here in Congress  but also around the world, we have a great opportunity…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…months, including Hurricane Helene. I visited Damascus in  October, where I cooked and served food for first responders with my  team for the victims of Hurricane Helene.\n\nMy thoughts and prayers have been with southwest Virginia since then  and certainly remain today as they deal with the consequences of  continued flooding.\n\nI rise today to recognize…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688279/recognizing-lynchburg-fire-department"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…procedures and  other medical treatments can range from $8,000 to $100,000. To compare  hip surgery to a sex-change operation, it is two different worlds and  two different thoughts that we just have a complete difference of  opinion.\n\nI think if you take a survey of any of the troops, Mr. Chair, who are  serving this country, the vast majority would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…therapists--I have a couple of things on  my mind.\n\nAs I stand here--as we stand here--uncertain about what this Saturday  morning in August is going to produce, I just had some thoughts. My  first thought seems probably pretty basic, and it is to the Democrats  in the Chamber--specifically, their leadership.\n\nBreaking news: Donald Trump won the election.…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Mr. Speaker, I, unfortunately, had other  engagements that had been scheduled.\n\nThe resolution was introduced to, again, focus a component of the  dialogue. Of course, our thoughts and our condolences go out, but we  need more than thoughts and condolences. We need to have the  conversation about how to prevent this from happening again. We need to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…are published. It is where they are codified. That  is where you go to look them up, and the number of pages has quadrupled  in my lifetime.\n\nLet me just offer a couple of thoughts on how this bill is, in my  view, important for small businesses to get at that problem of the  creeping weight of Federal overregulation.\n\nIn my district, the Second District…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…greater love hath no man than this, that a man lay down       his life for his friends.\n\nThese are the people we would all hope to be at the moment of our  testing.\n\nAgain, my thoughts and prayers are with all the victims of these  deadly floods and with those who continue to work to rescue them.", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693248/central-texas-floods"}, {"senator": "French Hill", "party": "Republican", "sentence": "…``The period for a new election of a citizen to administer the  executive government of the United States being  not far distant, and the time actually arrived when your thoughts must  be employed in designating the person who is to be clothed with that  important trust, it appears to me proper, especially as it may conduce  to a more distinct expression…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…voices tonight that remind America  that we lost a great American, we lost a great Californian, and we lost  a great human being.\n\nMy prayers are with Jill and the family. My thoughts are with his  constituents because they lost somebody who each and every day came to  this floor determined to advance their interest, to protect their  values, and to make…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to honor  Doug.\n\nMr. MOORE of Utah. Mr. Speaker, to close, I again thank the  gentlewoman from California (Ms. Rivas) for yielding a few more minutes  to finish out these thoughts in Doug's memory.\n\nMr. Speaker, I will wanted to give a quick closing message to his  wife, Jill, and his four children: Kyle, Allison, Sophia, and Natalie.\n\nI get an hour…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Legislature. If you listened to what they said about Sylvester Turner,  only knowing him for a day or so, I missed a lot. He seemed to be a  wonderful man, a wonderful person, and my thoughts and prayers and the  thoughts of the Energy and Commerce Committee, and I know the whole  House, are with his family. He is going to be missed.\n\nI will get down to the business…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688548/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…was he  fun but he was thoughtful, he was pragmatic, and he was a really,  really good thinker. I turned to him on issues that I found to be  difficult. I wanted to get his thoughts on them.\n\nHe was a strong conservative. He was warm, kind, and principled. In  my mind, he was exactly the kind of leader that Americans want. He is  going to be dearly missed.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}]