[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Firing staff at  HHS will cripple our ability to quickly identify and respond to public  health threats.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "He wouldn't  seize an oil tanker off the coast of Venezuela or threaten CIA  operations, blockades, and strikes on Venezuela.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2025-12-17"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "States like Texas, Florida, and Tennessee have all  implemented tighter standards to limit pursuits of violent criminals or  imminent threats.", "title": "District of Columbia Policing Protection Act", "date": null}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "In all of this, Donald John Trump has willfully disregarded Federal  laws and the Constitution, imperiled a coequal branch of government,  and threatened the integrity of the democratic system.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-05-13"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Representative Foster has helped raise the alarm regarding the  financial stability threats posed by the AI boom.", "title": "Financial Stability Oversight Council Improvement Act of 2025", "date": "2026-02-09"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "The woman was unarmed, nonviolent, and  posed absolutely no threat to anyone.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Our teams working together put  forward a resolution that addresses the enormity of this challenge,  this threat that our Jewish constituents and Americans are facing.", "title": "Condemning the Rise in Ideologically Motivated Attacks on Jewish Individuals in the United States, Including the Recent Violent Assault in Boulder, Colorado, and Reaffirming the House of Representatives Commitment to Combating Antisemitism and Politically Motivated Violence", "date": "2025-06-09"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "Their story shows that  diversity is not a threat nor a weakness.", "title": "The Story of Brad and Donald Lang, Sr.", "date": "2025-07-16"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "That is a threat to our Republic.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Thus, I agree with the  sponsors of this bill that Congress must stand up for Taiwan and its  people as they confront this threat.", "title": "Pressure Regulatory Organizations to End Chinese Threats to Taiwan Act", "date": "2026-02-09"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Last week, we know that President Trump ordered the illegal  elimination of the Department of Education, threatening the future of  millions of children across every district in our country.", "title": "Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, Chairman Carr issued a public threat to Disney, ABC.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "This level of inequality is a threat to our democracy, and this kind  of economic power concentrated in a few hands truly hurts our families.", "title": "Taxing Excessive Ceo Pay", "date": null}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Today, we face a new threat and danger: The Trump  government is abusing its power.", "title": "Put Hardworking American Families First", "date": "2025-04-30"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Pretending like Iran does not have a credible threat and has no  leverage is a dangerous and ignorant position for our government to be  taking and one of the scariest things about the many threats that we  face right now.", "title": "Risk of Conflict with Nuclear Weapons", "date": "2025-07-23"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mount Spurr, just 80 miles from Anchorage, reached a yellow alert level  due to elevated seismic activity earlier this year, and it is still  listed as a very high threat by the most recent edition of the USGS  National Volcanic Threat Assessment.", "title": "Southcentral Foundation Land Transfer Act of 2025", "date": "2025-12-15"}, {"senator": "James Risch", "party": "Republican", "sentence": "It  is the result of Hamas's grotesque action on October 7, the threat  Hamas poses to American national security, and, of course, Hamas's  treatment of the people of Gaza.", "title": "Providing for Congressional Disapproval of the Proposed Export of", "date": "2025-07-30"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "Speaker, pointing to the threat closer to home, Democratic- sponsored H.R.", "title": "Successful Operation to Arrest Nicolas Maduro", "date": "2026-01-12"}, {"senator": "French Hill", "party": "Republican", "sentence": "1531) to direct certain financial regulators to  exclude representatives of the People's Republic of China from certain  banking organizations upon notice of certain threats or danger, and for  other purposes, as amended.", "title": "Pressure Regulatory Organizations to End Chinese Threats to Taiwan Act", "date": "2026-02-09"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "He will face the nuclear threat of  Tehran.", "title": "Promoting Stability and Prosperity", "date": "2025-02-26"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Speaker, it is undeniable that the People's Republic of China is  the single gravest threat to our national security.", "title": "Taiwan Assurance Implementation Act", "date": "2025-05-05"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(4) Not trusted.--\n\n(A) In general.--The term ``not trusted'' means, with       respect to an entity, that--\n\n(i) the Chair has made a public determination that such       entity is owned by, controlled       by, or subject to the influence of a foreign adversary; or\n\n(ii) the Chair otherwise determines that such entity poses       a threat to the national security of the United States.", "title": "Communications Security Act", "date": "2025-07-14"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Its nuclear ambitions and proxy  networks remain the chief threat to regional stability, yet we have a  rare moment of leverage.", "title": "Preventing Iran From Obtaining Nuclear Weapons", "date": "2025-05-14"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "We have learned that they lost track of more than 320,000 migrant  children who face the threat of abuse, trafficking, and sexual  exploitation.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Drone attacks on a major seaport would pose a serious threat to our  national security.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "The populists argue that the  threat of tariffs is needed to force Canada to stop the flow of illicit  drugs.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(6) Not trusted.--The term ``not trusted'' means, with       respect to a company or stakeholder, that the company or       stakeholder is determined by the Assistant Secretary to pose       a threat to the national security of the United States.", "title": "Promoting United States Wireless Leadership Act of 2025", "date": "2025-07-14"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "To make matters worse, the SBA allowed small businesses to use the  new portal without conducting minimum cyber threat assessments.", "title": "Sba It Modernization Reporting Act", "date": "2025-12-01"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Concern over the threat posed by Confucius Classrooms is not new.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}]