[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…are a direct attack  on the people of this city, particularly the Black and Brown  communities who have called D.C. home for generations.\n\nThese are residents who have built thriving small businesses, who  have received an education from the D.C. school system, residents who  have raised families and who call themselves proud Washingtonians since  birth.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…District and all  Americans to participate by shopping small business and supporting our  local businesses.\n\nComing from California's 31st District, I am proud to represent a  thriving and diverse community of small businesses in the San Gabriel  Valley. From cafes and restaurants, to bookstores, toy shops, party  supply stores, and many more, our district…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…our identity, and our  heritage. They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water to millions. They are home to a thriving  ecosystem for a wide breadth of species. They support countless jobs.  Our Great Lakes' fishing economy alone is worth more than $5 billion.\n\nUnfortunately, there are many…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…makes it harder  for entrepreneurs, for restaurateurs, for childcare operators, and  others to keep their employees paid, to keep their doors open, and to  keep our downtowns thriving.\n\nEvery dollar that Congress gives to the Small Business Administration  in this moment means the difference of a small business opening and  employing folks or filing for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…seed testing  laboratory. They use new methods and human ingenuity to continue to  create custom seed blends that fit the needs of any customer. As we  continue to build a thriving and sustainable future, we look forward to  having businesses like Applewood Seed at the forefront of our state's  economic success.\n\nOn behalf of the people of Colorado's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…just a four-letter acronym or a Federal building in  Maryland, it is the backbone of this Nation's environmental safety and  resilience, which support better health and a thriving economy. When  the Earth shakes the coastline of my district in the Pacific Northwest,  as it inevitably will, it will put the lives and safety of thousands of  coastal residents…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…like her  have the support they need to go to and graduate college.\n\nMy parents understood how important a good education is not only to  individual opportunity, but to a thriving, healthy economy, community,  and democracy. Like my grandparents and great-grandparents before them,  they dedicated their lives to ensuring not only that their children…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…recognized for their  extraordinary leadership, vision, and longstanding commitment to  community transformation. Together, they have grown The Oceanside  Sanctuary into a thriving, historic congregation that serves as a hub  for inclusive, justice-centered ministry in North County San Diego.\n\nTheir work extends far beyond the church walls through ecumenical…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699856/recognizing-reverend-jason-coker-and-reverend-jenell-coker-as-my-december-2025-co-constituents-of-the-month"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…these cuts are not abstract numbers. They are the difference between  stability and crisis, between life and death. I am healthy today  because Medicaid stood by me. I am thriving because I have had  consistent, reliable access to the care I need.\n\nMedicaid makes independence possible. It makes survival possible. It  makes dignity possible. Any threat…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690849/keep-your-hands-off-medicaid"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…anniversary of  Leyden High School District No. 212, proudly serving the western  suburbs of Chicago.\n\nWhat began as a 2-year school in a portable building has grown into a  thriving, two-campus district, East Leyden and West Leyden, now serving  more than 3,300 students with over 200 dedicated teachers.\n\nRooted in blue and gold and soaring under the banner…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…its motto of ``We Go  Where You Go,'' providing the best tastes of home to Soldiers, Airmen  and Guardians around the world. The Exchange, also known as the PX or  BX, is a thriving tax-free benefit that strengthens our nation's  military lethality. The Exchange serves those who serve with department  stores, restaurants, malls, wellness services, combat…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Jersey. I am confident that the 6th  Congressional District of New Jersey will thank her for her efforts to  keep Middlesex County's greater environment safe, healthy, and thriving  for years to come. As she embarks on this new phase, Dorothy is joined  by her beloved two sons, husband, Alex Giamboi, two shih tzus, and  grandchildren.\n\nMr. Speaker, please…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…collapse. In fact, many of our strongest democratic allies on  Earth, including Norway, Sweden, Denmark, Iceland, and Finland, lead  strong, democratic socialist governments and thriving societies and  economies. Yet, House Republicans base their entire resolution on this  falsehood and advance a false equation between democratic socialism and  Communist dictatorship,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…matter their sexual orientation, gender  expression, ZIP Code, background, HIV status, or citizenship status  receive every single thing they need and deserve to live healthy,  thriving lives. I congratulate Omar.                             Honoring Mario Vega\n\nMrs. RAMIREZ. Mr. Speaker, I rise today to honor Mario Vega for his  work to create spaces that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the basis of  religion, to ensure the humane treatment of all, and to join hands  across the world in seeking peace and justice.\n\nIn Oakland County, we are blessed with a thriving Orthodox Christian  community. As their Representative in Congress, I am thrilled His All- Holiness joined us in Washington, D.C., last week. His visit reminds us  to be constantly…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…function well do not require intervention.\n\nSmall businesses are not asking us to preserve the status quo. They  are asking to eliminate the barriers that prevent them from thriving.  By isolating problematic rules, we empower Congress and Federal  agencies to focus time and resources where they are needed most, while  still preserving the regulations…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…accomplished businesswoman and public servant. She is known for her  role in building World Wrestling Entertainment, better known as WWE,  from a small operation to a large and thriving enterprise. And she has  used her success to give back and make a positive impact.\n\nMrs. McMahon led efforts to promote reading and civic engagement  through WWE. She spent…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…students transitioning from middle school to high  school, with a goal of closing that gap. The success of the program is  evident as nearly all students in his program are thriving in math for  the first time.\n\nMr. Wardlaw exemplifies what it means to be a dedicated,  compassionate, selfless, and skilled educator. He is a source of  support for not only…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Trump's first administration, America achieved energy  freedom for the first time in 40 years. We were producing more than we  consumed. Gas prices were low and families were thriving.\n\nThat all changed the day Joe Biden walked into the Oval Office.  President Biden waged an all-out assault on American energy. He shut  down production, blocked development…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…stewardship.\n\nThis approach is validated by this national ranking, showing that  going back to the basics leads to residents prospering, businesses  flourishing, and a community thriving.\n\nProvo's success also reflects the vital presence of my alma mater,  Brigham Young University, at the heart of the community. Home to over  35,000 students and a world-class…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693581/congratulating-provo-utah-as-americas-best-run-city"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Colorado's statehood. The legacy of his  advocacy and public service continue to live on as testament to the  fine people of Carthage.\n\nCarthage stands as a shining example of the thriving communities and  pristine nature our great State of Maine has to offer. I congratulate  the people of Carthage, ME, on this 200th anniversary and wish you all  the best in…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…order.\n\nThis bill sends a simple message: Criminals will be held accountable,  victims will be protected, and Washington, D.C., will remain on the  path to becoming the safe, thriving Capital our Nation deserves.\n\nI urge my colleagues to support the D.C. CRIMES Act and keep our  Capital safe, strong, and beautiful.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…construction  of the State Road 19 bridge over Lake Harris, linking communities and  encouraging economic growth.\n\nToday, with a population exceeding 2,000, Howey-in-the-Hills is a  thriving, family-oriented resort town. The beautifully restored Howey  Mansion hosts custom-designed events, while the town's 1920s mission- style architecture and the Community Church,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Kingdom.  Nearly half think that Muslim women are pressured into wearing a hijab.  Almost a third think that Islam promotes violence.\n\nParallel legal systems are not keys to a thriving society. There must  be one rule of law for all the people.\n\nAll the way back in 1991--a lot of people won't know this--the Muslim  Brotherhood issued a memorandum about North…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to see more  resources pushed back to our State, who has largely led this effort. We  have had meetings for our boy to be able to get into the situation  where he is in a thriving third-grade class at a public school and  where he has a little extra attention on things that he does well. He  is reading well above a third-grade level, but he really struggles…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…weather  in Portuguese. Sixth graders tackled science concepts like ecosystems  in fluent Portuguese.\n\nThis is what happens when we set a high bar. Bluffdale's students are  thriving because dedicated teachers believe in their potential and push  them to reach them. That is merit in action.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691516/recognizing-bluffdale-elementary-school"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Worth, which is now a massive, master-planned, mixed-use  development in North Texas. Alliance is home to a number of important  businesses, residential neighborhoods, and a thriving island inland  port that boosts our country's supply chains. Located along an  interstate with rail and air access, at 27,000 acres, Alliance is  nearly double the size of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…paragon of public service and  remarkable stewardship.\n\nThrough more than two decades of service to the people of Papillion,  Mayor Black helped to guide the city into the thriving economic hub  that it is today. This month, he announced that he will not seek  reelection, which will conclude 17\\1/2\\ years as mayor and nearly 5  additional years of serving…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…successful lives beyond the trauma of trafficking. The impact  Laurie has made is visible not only in the numbers but in the  individual success stories of survivors who are now thriving--getting  jobs, going to school, and, in many cases, becoming advocates  themselves. Laurie is a compassionate leader who connects with  survivors on a personal level, understanding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…neediest among us while simultaneously delivering a foundation for  economic growth and prosperity.\n\nMr. Chair, let us ensure America is once again the land of  opportunity and thriving communities. Passage of this resolution is one  step in that process.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]