[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…contributing significantly to the well-being and growth of families in  our community. By focusing on these initiatives, participants can  develop the necessary skills needed to thrive today.\n\nFounded in 2001 by Baldwin and Crystal Hamilton, It's About the Kids  Mentor Program began outreach in Marietta, Georgia, then following the  Hamiltons' move to Dallas…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…community in Northwest Indiana throughout her  illustrious life. For her dedication to academic success and her  commitment to empowering youth with the skills and knowledge to thrive,  Edith is worthy of the highest praise. Mr. Speaker, I respectfully ask  that you and my other distinguished colleagues join me in wishing Mary  Edith Brown Coleman a very…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Representatives. They feel more and  more that they are in it for themselves and for the corporations and  not to do the hard work of the people.\n\nTrust is vital for a democracy to thrive, and there has been nothing  more powerful in the undermining of that trust, in the years that I  have been in the Senate, than what I have seen in the destructive force  of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…should be. It is a  fairness issue.\n\nI urge my colleagues to not vote to deepen inequality. Instead, vote  to affirm our values. Vote to defend every child's right to learn, to  thrive, to reach for the stars. Let's reject this resolution and  recommit ourselves to closing the homework gap so that all children  have equal access to learning.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…grad in Tamarac who makes enough  money only to pay rent is counting on us.\n\nWe must deliver and extend the ACA tax credits because America is  counting on us to survive, to thrive, and to have another chance.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the values of our country, be they investment in  healthcare, in housing, in education; investments that created good- paying jobs, investments that helped small communities thrive,  investments that helped build infrastructure across the country. That  was the responsibility that was so cherished.\n\nAnd there was a term for those who chaired the 12 subcommittees…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…threats of base realignment, downsizing, and evolving defense  priorities, Gene was a steady and trusted leader who helped ensure that  Naval Base Ventura County continued to thrive as the county's largest  employer, generating an estimated $4.6 billion annually and supporting  more than 24,000 military, civilian, and contractor jobs.\n\nThroughout his tenure,…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…but healthcare is a large expense for a  small business. The ACA premium tax credits provide affordable care to  her employees, allowing her coffee shop and her employees to thrive.\n\nAnother small business owner in my district runs a wine production  business that sells nationwide. Despite her success, she has to rely on  her husband's job for healthcare.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…disabilities and their families, as well as 60  teachers, to take part in this program, some of whom uprooted their  entire lives to be involved.\n\nSeeing your child grow up to thrive, that is the goal of every  parent. I have not met one parent in this country who didn't break  their backs to make sure that they were offering their child every  opportunity…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…families.\n\nWhile raising her children, grandchildren, and now great- grandchildren, Deborah has brought together her community to organize  for the resources they need to thrive, whether it is secure  transportation for school, childcare for working families, or road and  pedestrian safety.\n\nAs a leader with DuPage United, Deborah has been successful…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…SBA for  the last 8 years. He is a Vietnam veteran who has dedicated 40 years of  his life to ensuring that our communities and our veterans have the  resources they need to thrive, and yet DOGE didn't care. Elon Musk  didn't care because he is one of those Federal employees, who just a  few months ago was planning to do an expansive economic development…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691939/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, I rise today in support of H.R. 1642, the  Connecting Small Businesses with Career and Technical Education  Graduates Act.\n\nSmall businesses can't thrive if they can't access a highly qualified  workforce. This legislation will help small business owners connect  with graduates of vocational programs and hire employees who can…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691732/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…core, is not just a set of policies but an embodiment of  American values, values that ensure every citizen, regardless of race,  gender, or background, has the opportunity to thrive.\n\nIt reflects the notion that our strength as a nation lies in our  diversity, that our success is drawn from the breadth of our collective  experiences, and that our unity…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…black smoke into the sky; it was in large part due to the cars  that were being driven.\n\nNow, unfortunately for us, Los Angeles does create the ideal  conditions for smog to thrive. Southern California's sunshine along  with a booming population of people reliant on car travel and all the  exhaust that comes with it combines to make a photochemical reaction…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…International; Catholics for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S. Provinces; Hope Rise       Thrive; Interfaith Coalition Against Domestic and Sexual       Violence; Legal Momentum: The Women's Legal Defense and       Education Fund; National Advocacy Center of the Sisters…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…finding  families for children in need.\n\nAdoption is a powerful act of love that provides children with the  opportunity to grow up in a supportive environment where they can  thrive much like I did.\n\nNational Adoption Month serves as a reminder of the importance of  raising awareness about the needs of children in the foster care system  and the families…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697055/national-adoption-month"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…longer will bureaucrats in Washington prevent pregnant  mothers from accessing services and assistance from faith-based  pregnancy centers, which help their families grow and thrive.\n\nMr. Speaker, we need to be a country that affirms life.\n\nIn tandem, the Pregnant Students' Rights Act communicates a simple  truth to young women: The birth of your child…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…one customer at a time.\n\nThat is why I am committed to cutting government red tape, lowering  taxes, and fighting for progrowth policies that empower our  entrepreneurs to thrive, not just survive.\n\nMadam Speaker, I thank every small business owner out there for all  they do. This week and every week, I am here for them.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…leaders inside and outside the classroom.\n\nThe dedication of the teachers and staff at Hanford Christian School  plays a vital role in helping students across the Central Valley  thrive. I want to thank the entire faculty for fostering a learning  environment that helps our youth become the best they can be.\n\nMr. Speaker, I ask my colleagues in the House of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…unanimously on narrowing the scope of NEPA.\n\nIt is time for Congress to take bipartisan, bicameral action to fix  the broken permitting and regulatory laws so that America can thrive.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…to preserve a predictable tax code in  this country. We are extending the current tax code so that we can have  regulatory certainty, tax certainty, so that businesses can thrive and  grow and not fear the hammer of government that they did in the Biden  years.\n\nThere was an explosion after election day of people ready, willing,  and able to invest…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Kentucky.\n\nFor more than six decades, the Oscar Cross Boys & Girls Club of  Paducah has provided a safe place for young people in McCracken County,  Kentucky, to learn, grow, and thrive. The club is a model of community  service, offering affordable mentorship, recreation, and educational  opportunities to hundreds of children each year.\n\nToday, the club is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the strength of Miami-Dade County Public  Schools' educational programs in a safe and conducive learning  environment reaffirms the district's role in preparing students to  thrive in the global and technological marketplace.\n\nI am proud to celebrate their success and the bright future they are  building for the next generation of Miami-Dade County residents.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…are job creators, innovators, and the  embodiment of the American Dream.\n\nHouse Republicans and President Trump are fighting to make sure they  have the tools they need to thrive. That starts with making the 2017  Tax Cuts and Jobs Act permanent. Those tax cuts are critical for small  businesses, with over 26 million relying on the 20 percent deduction…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…legacy and its enduring role as the heart  of the village. Thanks to the dedication of local leaders,  volunteers, and preservation groups, the South Dayton Depot continues  to thrive as a source of pride for the entire region.\n\nI ask that the United States House of Representatives join me in  honoring the enduring legacy of the South Dayton Depot and congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…businesses and the communities they serve. We have a duty to bring back  the growing economy and to ensure that family businesses that are the  backbone of our country can thrive again.\n\nIf we fail to extend the Trump tax cuts, small businesses will see  their tax rates nearly double, harming local economies and Main Street.  This financial burden would…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and cold running water. Students  helped government workmen lay bricks to build the school's first  permanent two-story buildings.\n\nThe Alabama School of Trades continued to thrive as a training center  for the area's technical industry with increasing student enrollment  and course offerings. In 1942, courses were converted to War Training.  At the close…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…unmatched.  Mrs. Rowe not only instills a strong literary and mathematical  foundation for young learners but also creates a safe and caring  environment where students can thrive and their love for learning is  ignited.\n\nShe is instrumental toward establishing new academic programs,  standards, and expectations for all kindergarten students, leading…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…neighbors  and themselves. On the Education and Workforce Committee, we are  constantly working to promote more pathways for success for students  and young adults so that they can thrive. The Congressional Award  program is yet another step to encourage young people to set goals,  develop a plan, and be the best that they can be.\n\nMr. Speaker, I once again…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…delivering on our promises that we  made to the country last year. This is yet another small step forward  to getting our country back on track and  helping small businesses thrive again. Promises made, promises kept.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}]