[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…debates various veterans-related  legislation today, none are more urgent than the legislation I am  introducing to stop thousands of veterans from losing their homes.\n\nLast Thursday, Secretary Doug Collins and President Trump announced  the abrupt termination of the Veterans Affairs Servicing Purchase  program, known as VASP.\n\nThis program was designed…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…afford these new premiums. The Congressional Black Caucus  has told stories of people concerned that they will be among those 5  million.\n\nMr. Speaker, I have good news. This Thursday, the Senate will have  two competing plans on the floor for a vote. Yet, Speaker Johnson still  has not committed to allowing a vote on the floor in this body.\n\nLeader Jeffries…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President is saying now that someone, Democrats, have engaged in  seditious behavior punishable by death.\n\nThen, he goes on. The article reads: ``President Donald Trump on  Thursday called for six Democratic lawmakers to face arrest and trial  after they made a video encouraging U.S. servicemembers and members of  the intelligence community to refrain…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…receiving care, to investigate       whether or not there's actually child care happening?'' San       Diego City Councilmember Sean Elo-Rivera said at a UDW news       conference Thursday. ``Child care should be universal and       should be affordable for everyone, and it sure as hell should       be saved from extremists.''\n\nThe targeting--plus the potential…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…longstanding friend, the Honorable Judy  Thomas. Sadly, Judy passed from labor to reward on April 19, 2025. A  funeral service to celebrate her remarkable life will be held on  Thursday, May 8, 2025, at St. Luke Church in Columbus, Georgia.\n\nThe genesis of Judy Thomas's life began with her birth to the union  of William H. Lt. (Bill) Williams and Alice Williams.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…keep receiving       benefits.\n\n``Sounds like scammers are jumping on this press release to       trick the elderly,'' one Social Security staffer wrote to       colleagues Thursday, referring to the agency's announcement       of the in-person verification program.\n\nIn Baltimore, an employee who works on critical payment       systems said nearly a quarter…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…addressed President Donald Trump's attacks on the  judiciary. The relevant part of the article stated as follows:\n\n1) ``U.S. Supreme Court Justice Ketanji Brown Jackson said on  Thursday attacks by Republican President Donald Trump and his allies on  judges were `not random' and seemed `designed to intimidate the  judiciary.' ''\n\n2) Specifically, U.S. Supreme…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Highest Level       Since Invasion of Ukraine'' reported that natural gas prices       reached their highest levels since December 2022, with       December futures settling Thursday at $4.646 per million       British thermal units, up 67 percent from a year ago. For       every one dollar increase in the Henry Hub natural gas price,       consumers pay…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President, on healthcare, well, we are at the start of an  extremely important week for Donald Trump and for Republicans when it  comes to our Nation's healthcare crisis. On Thursday, the Senate will  vote on the Democrats' bill for a clean, 3-year extension of the ACA  premium tax credits.\n\nThe question Republicans face this week is very simple: Will…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…congressional Republicans failed to act, to come to the table  to negotiate an extension of the enhanced Affordable Care Act tax  credits before the end of last year.\n\nLast Thursday, the House passed legislation to extend these  healthcare tax credits for 3 years. Seventeen Republicans joined  Democrats. You think about it, they could have done that months…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…second, third, and fourth largest bank failures in  United States history.\n\nSilicon Valley Bank was the fastest bank run ever, with $42 billion  of deposits withdrawn on a Thursday and customers trying to pull out  another $100 billion the next morning when the bank failed.\n\nUpon learning of Silicon Valley's failure, Ranking Member Waters  organized…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…it.\n\nFor a reason of fiscal conservatism, during the last shutdown in  2018-2019, I was able to sort of strategically put a bill on the floor  on a day much like today, a Thursday during the shutdown, and get  colleagues to unanimously agree with the principle that in the event of  any shutdown, Federal employees would get backpay.\n\nIt used to be, in…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…this  package with the hope that we will make those changes. But,  unfortunately, in the face of this Administration's words and actions,  I cannot share that optimism. Last Thursday, White House border Czar  Tom Homan announced that there would be a drawdown of federal  immigration agents in Minnesota. When asked by a reporter that same day  whether a…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…backlog. I understand that argument. I am not talking about  that. I am talking about they just want to go today. They want to leave  today. People have flights today. It is Thursday, and it is not 5 p.m.\n\nSo were we to work a weekend to try to land this airplane, that would  be beneficial to the country, to the body, to Republicans and Democrats  alike.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Alabama's Seventh Congressional District, will honor  Juneteenth with a host of activities. The NAACP in Tuscaloosa will kick  it off with a parade on Saturday and a luncheon on Thursday. In  Birmingham, we will have a variety of events including a unity  breakfast on Friday hosted by DA Danny Carr and the League of  Gentlemen.\n\nWe will also welcome Major…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion  savings.\n\nTo give you an idea of just how absurd this debate is, tomorrow, we  are going to do, I think, a rescission vote. I think it is tomorrow.  Maybe it will be Thursday. Think of the angst, the protests. ``We are  upset. David, you can't lower spending.''\n\nLet's see if we can do this. How many hours are there in a year?  There are 8,700 hours…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "John Thune", "party": "Republican", "sentence": "…except where a privilege or objection  should be asserted. The resolution also authorizes the Senate legal  counsel to represent Ms. Kotschwar in this matter.\n\nMr. THUNE.   on Thursday, June 5; that following the prayer and pledge, the morning  hour be deemed expired, the Journal of proceedings be approved to date,  the time for the two leaders be reserved…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…way they reflect light, but from the way they reflect honor, integrity,  and sacrifice every single day.\n\nToday, I rise in observance of Clay County Police Memorial Day on  Thursday, May 8th, in Clay County, Florida, and to honor the brave men  and women who made the ultimate sacrifice in the line of duty.\n\nClay County Police Memorial Day is more than…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "John Thune", "party": "Republican", "sentence": "…leadership in  financial innovation; and first and foremost, of course, we passed the  Working Families Tax Cut and the rest of our landmark legislation.\n\nJanuary 1 was this past Thursday. If Democrats had their way,  Americans would have been facing a big tax hike at the start of this  year. Instead, thanks to the Working Families Tax Cut, Americans will…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, Thursday marks National  Rural Health Day.\n\nNearly 60 million Americans live in rural areas, and they too often  encounter limited access to primary care specialists and health  services.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…will warn you that the legislation  is almost done. We now have to work with the economists and others to  score it. We have been stunned though that it continues. Even last  Thursday, I think, there was another whole set of investigations or  indictments announced.\n\nLet's get on to some of the math here. Mr. Speaker, I have come  behind the microphone…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…I am really jealous of  a guy like Doug LaMalfa who manages never to say anything bad about  anybody.\n\nOne final thing, the other thing I know about Doug is we met every  Thursday morning in a Bible study known as Capitol Ministries, which is  really a Bible study for the erudite Christian, men of deep faith. I  will tell you, Doug--a lot of people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698712/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I am prepared to close and continue to  reserve the balance of my time.\n\nSince my colleague mentioned the SPEED Act, which we will be marking  up in committee on Thursday, even though it is not on the floor today,  I will put in a shameless plug for our bipartisan legislation that is  not only tech neutral, but it is agnostic to the project,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to recognize and  congratulate Frank Abbate on his upcoming retirement next Thursday,  marking the end of a 36-year career in public service in Brevard  County.\n\nFrank has spent the last several years, since 2017, serving as our  Brevard County manager. Throughout…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690852/congratulating-frank-abbate-on-his-retirement"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…COMMITTEE ON HEALTH. EDUCATION. LABOR, AND PENSIONS\n\nThe Committee on Health, Education, Labor, and Pensions is authorized  to meet during the session of the Senate on Thursday, July 17, 2025, at  10 a.m., to conduct a hearing.                         COMMITTEE ON INDIAN AFFAIRS\n\nThe Committee on Indian Affairs is authorized to meet during the  session…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693750/authority-for-commitees-to-meet"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we can sustain this?  Does anybody alive right now in the Chamber, if they are in the complex  and haven't hopped on a plane to fly home because we had our final vote  on a Thursday morning and we are going to come back on a Monday night  in our usual way of doing things in the swamp, not doing what we should  do, does anybody believe that this is going…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…love of the land, and  his love of the people and rural communities.\n\nMore than anything else, he was a faithful follower of Jesus Christ.  I will miss Doug and our weekly Thursday morning Bible studies.\n\nI will miss his humbleness, his even temper, his humor, and his  presence in this body. I will miss hearing him call me Francis Gary  Powers after…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698735/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…you, a number of folks go on television and confidently predict that we  were going to be out of the shutdown. Some said as early as Wednesday.  One confidently predicted Thursday. A couple more said Friday. So when  I came back on Monday, I was pretty sanguine about things.\n\nIt gives me no joy to say this, but I was wrong. I don't know. As bad  as…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…border, make sure people can  afford healthcare, make sure people can afford housing, and do the  things we said we would do.\n\nMr. Speaker, I will close with this since today is Thursday and a  week from today is Thanksgiving. I know that most of the people that I  represent are deeply thankful to be Americans and to be Texans. Every  Thanksgiving, The Wall…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on Thursday, I sounded the alarm as the  lapse in government funding endangered food assistance for 42 million  Americans and rapidly approached. That was November 1, the approach  date.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696506/government-funding"}]