[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…decline, at the end of the day, will mean empty shelves  and higher prices.\n\nThe over $300 billion in cargo coming through what we know as the San  Pedro Bay port complex is tied to nearly 1 million jobs in the region  alone and 2.7 million jobs across the country. That is nearly one job  for every four containers.\n\nWhen the richest President in history…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today to recognize the traumatic  loss of life around the world and to reaffirm a simple truth: Our  destinies are tied.\n\nToo often, in moments of crisis, we are bombarded with abstract  numbers and detached headlines describing casualties and missiles, but  behind every number is a name. Behind…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…that stem from the resource management plan. Grazing permits, resource  development projects, transmission rights-of-way, all of those leases  and permits, and so on, will be tied up in litigation if this  resolution is passed.\n\nIt makes no sense to me why my colleagues have chosen to take this  approach and endanger grazing permits in North Dakota when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…policies that  were intended to disenfranchise Americans. Let me remind Members what  they were: literacy tests and poll taxes for eligible voters,  grandfather clauses that tied voters' rights to the grandfathers before  the Civil War, all-White primaries to eliminate Black voters' presence  in the electoral process, and now: Show me your papers.\n\nThe…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Division, a  segregated African-American unit, who provided him with the blood for  the 17 transfusions that kept him alive.\n\nAANHPI history and Black history are inextricably tied together and,  in the case of Senator Inouye, a blood bond uniting our two communities  together.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688016/aanhpi-history-and-black-history-bonded-together"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…discrimination that causes lawsuits that are expensive to the company,  that is a social factor. That is a material risk.\n\nIf executive pay is structured in a way where it is not tied to  shareholder performance, that is a risk.\n\nAs a former State treasurer, I know that ignoring these risks does  not make them disappear.\n\nBy the way, the proxy voting process…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…public list of  entities with ties to foreign adversarial governments, such as China,  Russia, North Korea, and Iran, especially if they have a license or  authorization that is tied to our communications networks.\n\nAlong with Representative Wittman, I serve on the bipartisan Select  Committee on the Strategic Competition Between the United States and  the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…one of them.\n\nHe came home from school one day and he looked at his mom, of course,  and said: Mom, will you help me with this project I have? She said:  Honey, I am a little tied up right now. Can I help you out later? He  said: We can't really wait on this. She said: Why not? He said: It is  because it is a big part of my grade. It is a huge part of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Review Act, once a plan is  overturned, the Bureau of Land Management is banned from writing a new  one that is even remotely similar. In other words, the agency's hands  are tied and not just today but for years to come. That is  unprecedented.\n\nIf we go down this road, we will politicize the very foundation of  how we steward America's public lands.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694910/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…of  children.\n\nBut it doesn't stop there. You quoted King. King said in the letter  from the Birmingham jail:\n\nWe are all caught in an inescapable network of mutuality,       tied in a single garment of destiny.\n\nTo think that there could be an injury to their family and their  child and have it not affect you is not only self-defeating ignorance,  it…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…businesses.\n\nTake a walk down a Main Street, Mr. Speaker, and you will hear the  same concern from small business owners up and down the block: The  uncertainty and rising costs tied to the President Trump tariffs are  crushing their small businesses, plain and simple.\n\nWe should be working together on issues that matter: lowering costs  for small businesses.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…themselves in a desperate battle with Emory Hospital.\n\nThe hospital believed that the anti-abortion bill that Georgia  enacted in 2022 following the gutting of Roe v. Wade tied the  hospital's hands and mandated that Adriana's body, her brain-dead body,  remain hooked to machines. Mr. Speaker, this was not because there was  any chance of survival,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Bun's rehabilitation doesn't matter. Trump is now  detaining and deporting Southeast Asian refugees who have had pauses on  their deportation orders for decades and are deeply tied to their  communities. Mr. Speaker, 15,000 of these refugees have deportation  orders and are now being deported as they do the right thing and report  for their ICE check-ins.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…was  punished with death, shot by his own government.\n\nThis wasn't an isolated tragedy, Mr. Speaker. It was the second  public killing of an innocent American in Minneapolis tied to Homeland  Security. Renee Good, a mother of three, was shot by ICE on January 7,  mere weeks before the murder of Alex Pretti.\n\nMr. Speaker, as co-chair of the Tom Lantos…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…training as ``voluntary,'' even when workers feel       pressured to attend to keep their jobs or advance, and       removes current protections that ensure training closely tied       to a worker's job is paid. As a result, employers could push       essential training outside of regular work hours and off the       clock, increasing unpaid work for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…global playing field to  ensure fair trade for American producers.\n\nMs. FOXX. Mr. Speaker, I do have some other Members who wanted to  come down and speak on the rule. They are tied up right now. If the  gentleman is prepared to close, then I am prepared to close.\n\nMs. FOXX. Mr. Speaker, it is good to hear our friends say they don't  share the values of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…last 30 days, for  sure, and they were real troupers, professionals, and class acts. I  thank them all for their dedication and effort.\n\nI also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE. There are other parts in  there,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…finalize the Cape Fox Corporation's remaining Alaska Native Claims  Settlement Act, or ANCSA, land entitlement. In addition, this  legislation will resolve land management issues tied to the Mahoney  Lake power project.\n\nANCSA was enacted by Congress to settle the aboriginal land claims of  Alaska Natives. Under ANCSA, Alaska Native Corporations were  established…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…In March, our economy added 228,000 jobs, beating expectations by  almost 100,000 jobs.\n\nThat same month, falling energy costs pushed inflation down to 2.4  percent. That is tied with the lowest inflation rate since February  2021. That was 1 month after President Biden took office and ushered in  the worst inflation crisis since the 1970s.\n\nPresident…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…was killed in 2024 by an illegal alien from Honduras who  slammed into his family's car while driving drunk.\n\nThere was Kayla Hamilton, a 20-year-old autistic woman who was tied  up, raped, and murdered in her own home in Maryland in July of 2022.  Her murderer, a 16-year-old known MS-13 gang member, had been processed  and released into the country…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…on winning the baseball State championship for the 2A division  in Alabama.\n\nOn Monday night, the Vincent Yellow Jackets were headed into the  bottom of the seventh inning, tied 1-1 with Pike Liberal Arts. That is  when Landon Archer delivered an RBI single that sealed the deal and  crowned the Yellow Jackets as State champions for the first time in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…much of it remains  hidden from public view. In just two universities alone, congressional  investigators have uncovered nearly $40 million in unreported research  contracts tied to the Chinese Communist Party.\n\nNearly 30 percent of disclosed foreign funding lack even basic  details like contract dates or intended purpose. Current regulations  permit…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Huskies on their undefeated season, closing it out with a win over  Waseca in the Class 2A championship last weekend.\n\nThese players were unshakable, even when the score was tied up. They  knew their mission and executed, and they have made their families, the  Albany community, and the entire Seventh District proud.             Congratulating Alexandria…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "John Rose", "party": "Republican", "sentence": "…the Upperman High  School boys' basketball team on securing the first State championship  in program history last month. The historic matchup was a nail-biter as  the game was tied up for much of the night. Nonetheless, it ended with  the Upperman Bees defeating the Tullahoma Wildcats 65-55.\n\nThis TSSAA Division 1 Class 3A BlueCross basketball championship…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…this context, it is no surprise that between 2024 and 2025,  under President Trump, fentanyl seizures at the northern border nearly  doubled. As the supply of fentanyl is so tied to trade through the  movement of precursor chemicals, the President has utilized trade  policy to spur progress.\n\nWhile today's resolution is meant to debate the merits of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…were ranked in the top 100: Seaside Golf Course on  Sea Island Resort ranked No. 24, The Keep at McLemore Resort came in at  No. 25, and Great Waters at Reynolds Lake Oconee tied for No. 73.  Additional courses at Reynolds Lake Oconee, McLemore, and St. Simons  Island also earned national recognition.\n\nGeorgia is home to hundreds of golf courses, but…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…illegally, the  criminals conducted their operation out of Nashville motels between  2022 and 2024. And like so many criminal illegals in our country--no  surprise--they are tied to the violent gang Tren de Aragua, which has  plagued cities across this country with organized crime.\n\nAll too often these traffickers target not only vulnerable women,  they…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…longer get a free pass.\n\nThrough Operation Absolute Resolve, U.S. forces and law enforcement  partners successfully captured Nicolas Maduro and his wife, Cilia  Flores, both tied to narcotics trafficking, in a carefully planned,  coordinated operation, carried out with precision and without a single  U.S. casualty.\n\nThis is what peace through strength…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…we are now faced with is making President Trump's vision of  American energy dominance real.\n\nLNG has a huge part to play in this vision, but we are fighting with  one hand tied behind our back.\n\nAmerican oil and gas producers are restrained by bureaucratic red  tape and the lingering rules and regulations of the Biden  administration.\n\nThe Unlocking…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…unparalleled  ingenuity of West Texas--the groundbreaking of the Crossroads Business  Park in Big Spring, Texas.\n\nThis development is the first major business park in West Texas tied  to the Ports-to-Plains initiative, which will transform the I-27  corridor from Dumas to Laredo. The hundreds of acres of new office  space the Crossroads Business Park will…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}]