[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…largest defined contribution plan.  Federal employees dedicate their careers to serving our country, and  they deserve a retirement savings and investment plan that provides  top-tier customer support and security.\n\nWhile the Employee Benefits Security Administration has oversight  responsibility for TSP, as it does for private sector 401(k) plans,  there…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…election officials and judges with access to the tabulation  process must pass a Colorado Bureau of Investigation background check.  Colorado has spent years implementing top-tier cyber security measures  and audits to prevent hackers from interfering with our electoral  process.\n\nWe have one of the most secure election systems of any State in the  country,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…could be cheaper to the taxpayer as opposed  to people ending up in hospitals. But those hospitals now, because of  what is being threatened in this bill, rural hospitals and tier I  trauma hospitals, are all being threatened in their care.\n\nSo tonight, it is not normal. I ask everybody to understand this is  not a normal moment in America. This is a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…not going to work for this  country.\n\nMichigan is a national leader in public university research, with  nine public institutions in the great State of Michigan ranked as top- tier universities. They are what we call R1 research universities. We  also have R2 universities. They all rank in that top nine.\n\nThis also includes Oakland University, which is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…call it home.\n\nThe distinction didn't come from luck. It came from leadership,  vision, and a community where hometown charm meets national excellence.\n\nIn Flower Mound, top-tier schools set the standard, green spaces  stretch for miles, and small businesses like Flurry's Market +  Provisions bring neighbors together. It is a town where families plant…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…congratulate Mr.  Stephen D. Austin, Assistant Chief of Army Reserve, on his retirement  from the U.S. Army Reserve as a Department of the Army Civilian, Senior  Executive Service Tier 3.\n\nMr. Austin's career is a testament to unwavering dedication and  distinguished service. Over the course of 26 years in uniform and 19  years as a civilian leader, he has…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…progressive  analysis from a few years ago--is that after the 2017 tax reform, the  U.S. tax regime actually became more progressive. There were lower  rates, but it meant the top-tier  of taxpayers were paying more of the Federal budget.\n\nYou walk through saying: Okay. Can I show you? Well, you gave money  to corporations. Yes, but we can show you that the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the Commandant shall       conduct a pilot program to determine the extent to which the       Coast Guard Great Lakes icebreaking cutter fleet is capable       of maintaining tier one and tier two waterways open 95       percent of the time during an ice season.\n\n``(B) Report.--Not later than 180 days after the end of       each of the 5 ice seasons beginning…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…thousands of good-paying jobs, more affordable energy for  families across the northeastern United States, and new tax revenue for  rural communities like mine in the southern tier.\n\nHowever, instead of moving forward, that project was tied up with  endless red tape and obstructed by regulators. Western New York and the  southern tier lost jobs and investment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Affairs Committee, and House Permanent Select Committee  on Intelligence. He provided key legislative guidance that strengthened  our national security and helped assemble a top-tier team to serve the  people of Texas Thirteen.\n\nCurrently, Jeff serves as Senior Vice President of Government  Relations at AxAdvocacy, where he continues to use his vast expertise…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…she has many different roles at Colfax Elementary,  serving as their resource specialist program teacher, working on the  multitiered system of support team, coordinating the tier 2 check-in,  check-out program, and acting as the SST coordinator.\n\nMrs. McCoy's efforts are critical to ensuring that students'  individualized education plans, IEPs, are being…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize a major  milestone for American manufacturing for New York's southern tier.\n\nAlstom, a global leader in smart and sustainable mobility, has opened  its new, cutting-edge plant 4 facility in Hornell, New York.\n\nThis 135,000-square-foot expansion brings…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and\n\n(3) by adding at the end the following new subparagraph:\n\n``(F) a list of all applications submitted and licenses       granted in accordance therewith, listed by tier as defined in       regulation, as well as the rationale for each tier       categorization;''.\n\n(e) Sunset.--Section 60126 of title 51, United States Code,       is amended…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…with students and faculty at the University of Utah, Weber State  University, Utah State University, Brigham Young University, and  Bridgerland Technical College in Logan.\n\nTop-tier research institutions Brigham Young University, the  University of Utah, and Utah State University are preparing the next  generation of engineers, scientists, and innovators…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…dynamic and highly effective professional team,  including recruiting and supervising staff assistants and Congressional  interns.\n\nDuring her tenure, Nicole executed many top-tier engagements,  including meetings for foreign heads of state, national travel, and  managing the 2025 Presidential Inauguration events for approximately  five hundred Iowans…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…financial engineering.\n\nThose of us with assets, we are doing great. You keep hearing people  talk about the K-shaped economy. What they mean by that is if you are  on the lower tier, you don't hold assets, particularly after the years  of inflation. Those with assets, the asset is inflated, and they are  just fine. If you didn't hold assets, you are poorer…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…employee       was operating during such transportation that resulted in       injury or death not later than three days after such crash.\n\n(2) Contractors.--Any contractor (of any tier) of the       Postal Service engaged in the transportation of mail shall       report to the Postal Service any traffic crash involving the       vehicle the contractor was…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Nation's ideals and purity  of purpose. Red honors the valor and the blood shed by those who died  defending our rights.\n\nThis weekend, across Western New York and the Southern Tier, veterans  and families will gather at town centers, VFW halls and cemeteries to  commemorate the fallen and ensure that their sacrifice will never be  forgotten. This is a…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691585/recognizing-the-service-of-those-who-gave-the-ultimate-sacrifice-memorial-day-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…emissions profile.\n\nFinally, let's not forget our small and rural manufacturing  facilities in communities across this country, including in my own  district in New York's southern tier. These facilities include metal  fabricators and food processors, many of whom have taken proactive  steps to cut emissions in very good faith. Under the Biden-era EPA  ``once…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]