[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…refuse to  authorize the use of power has been usurped by the Executive. This  administration has carried out at least four military strikes against  vessels that it asserts have ties to drug trafficking organizations.  These strikes were not authorized by Congress. Congress has not been  shown the evidence of who exactly was on board these ships, whether…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…few days before Christmas.\n\nFatima is one of countless hardworking immigrants who have been  unlawfully or unjustly detained across the country. People like Fatima  with deep ties to our community are being targeted instead of a focus  on apprehending violent criminals.\n\nWe cannot allow the Trump administration to continue violating the  rights that all…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699039/ice-raids-in-north-carolina"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…feeling besieged.       Not a single week went by in which press coverage wasn't at       least 70 percent negative. And amid swirling rumors about the       Trump campaign's ties to Russia, a high profile special       counsel, Robert Mueller, was appointed to oversee       investigations into the case. Just a few months into his       presidency, President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…have undergone major structural conversions, including  liquefied natural gas (LNG) engine retrofits, at PRC-based shipyards  like COSCO's Nantong facility, which has known ties to the Chinese  government and military-industrial complex. These modifications are  frequently reclassified as mere ``major modifications'' to avoid  triggering the 50 percent…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…against  liberty around the world.\n\nXi said that Russia and China should be friends of steel. He said  that they would deepen relationships in all areas, including military  ties, and strengthen coordination in order to decisively counter  Washington's course of dual containment of Russia and China.\n\nWhat is more, North Korean troops who have been fighting…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…stablecoins threaten global financial stability and need a  much more restrictive regime compared to traditional finance.\n\nThe GENIUS Act ignores all of those experts and, instead, ties  stablecoins into our financial system but without the safeguards that  are required by banks and investment companies.\n\nAs the ranking member noted, this allows Big Tech companies…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…emerging technologies, the region is poised to be the next  rising economic powerhouse in the 21st century.\n\nTherefore, it is in America's national interest to strengthen our  ties with the region and encourage this growth by deepening our trade  relations. If we don't nurture this important relationship, China and  others will. We can ill afford to allow…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…was keeping track of those children has recently been cut.\n\nThese Russian abductions represent a deliberate effort to eliminate  Ukrainian national identity, destroy family ties, and are a specific  element of a genocide crime under international criminal law. The  Russians claim, further, that 700,000 children have been seized. None  of this can stand.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691141/peace-talks-with-ukraine"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…technologies like AI and quantum. Our  foreign adversaries and our competitors are in this global race too.\n\nSo that is why economic disruption puts America at risk. Straining  ties with trade alliances also put us at a security risk. Trade wars  have lasting consequences. Trade wars devastate Americans working  families and small businesses and manufacturers.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…nations.\n\nThis great SPP's success lies in its foundation of trust, mutual  respect and cultural understanding. Hawaii's geographic location and  strong cultural and historical ties to the Philippines have made our  state an ideal bridge between our two militaries. This special  relationship has not only strengthened defense readiness but also  developed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…door open for foreign firms that present  a major national security threat, including targets of sanctions, all  to appease those in the Trump family's inner circle which has ties to  those shady entities.\n\nYes, I am talking about Tether, the foreign stablecoin issuer  everyone knows has been used in terrorist financing, organized crime  schemes, and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…and Information, to study the national security risks  and cybersecurity vulnerabilities in American homes posed by routers  and modems manufactured or sold by entities with ties to our foreign  adversary countries. The Secretary must also deliver a report to  Congress of this study within 1 year.\n\nIt is crucial that we understand the cybersecurity and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reporters: ``During conversations led by US Secretary of  State Marco Rubio, the Trump administration told Venezuela's interim  president Delcy Rodriguez that the country must cut ties with China,  Iran, Russia and Cuba, and agree to partner exclusively with the US on  oil production.'' And that ``Rodriguez,'' the Acting President, of  Venezuela, ``must also…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…was purchased from him by church  Trustees: John E. Coates, Joshua Ball, and Joshua Pearson for the sum  of five dollars. FBCM is a church formed from strong community family  ties and has remained steadfastly community focused since.\n\nFBCM remains a vital part of our district today by partnering with  neighbors and local organizations to fulfill local…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Constitution. And they are being  abruptly and illegally fired from critical positions across the  government.\n\nToday, I will share the stories of four Federal employees with ties  to Illinois who have been terminated in the President's DOGE rampage.\n\nOne of my constituents has devoted his career to transit safety. He  dreamed of working for the Federal…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across 34 States hosted a Confucius classroom or  otherwise had ties to the Chinese Communist Party. But wait, Mr.  Speaker, there is more. Disturbingly, the same investigation found that  the CCP specifically targets schools around 20 U.S. military…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Georgian government is increasingly hostile       towards independent domestic civil society and its chief       Euro-Atlantic partners while increasingly embracing enhanced       ties with the Russian Federation, the People's Republic of       China, and other anti-Western authoritarian regimes;\n\n(5) the United States has an interest in protecting and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…to defend.\n\nEnrique Tarrio, a former national leader of the Proud Boys and a  domestic terrorist, was pardoned by Donald Trump.\n\nGuy Reffitt, somebody who brought a gun, zip ties, and body armor,  was pardoned by Donald Trump.\n\nNot only that, they have gone after their pardons, and they haven't  stopped the criminal spree.\n\nA Houston man was pardoned…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…place. As a matter of fact, it is a very  cultured place. It used to be one of the real ``Pearls of the Middle  East.''\n\nBefore 1979, Iran shared intelligence, had economic ties, and  military cooperation with Israel and the United States. This is from  1950, where Ben-Gurion--the first President of Israel--is talking to an  Iranian diplomat in Israel.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…home in Maryland in July of 2022.  Her murderer, a 16-year-old known MS-13 gang member, had been processed  and released into the country despite his criminal record and gang  ties. After he murdered Kayla, he left her on the floor, and he went to  Target with his half-brother to spend the $6 he stole from her. Then  because he was a minor, the Biden HHS…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Representative to  the United Nations, now serving as President of the U.N. Security  Council, is linked to an Ohio home healthcare agency that has  previously been punished for its ties to massive fraud.\n\nThere are other reports surfacing about Somalia's Minister of Foreign  Affairs running a healthcare company in Toledo, OH, who has a business  partner that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 2643) to require the Secretary of State to submit an  annual report to Congress regarding the ties between criminal gangs and  political and economic elites in Haiti and impose sanctions on  political and economic elites involved in such criminal activities, as  amended.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…and tradition.  The Club's annual shrimp dinners have become a beloved local occasion,  bringing people together to share stories, remember the past, and  strengthen community ties.\n\nThe Navy Club's mission is clear: to honor the proud legacy of naval  service in South Carolina. Through veteran outreach, youth engagement,  and the preservation of time-honored…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693998/recognizing-the-navy-club-of-georgetown-sc"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…plan. If you think it is such a good idea,  put that 21-point plan on the floor, and let's  vote on it. They won't do it because they will lose. They know what it  does. It ties up ICE's ability--which, by the way, they already have to  abide by due process. There are already warrants. They know all this.  They want to confuse the issue--mostly because…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…partners in the Arctic since World War II, and brave Danish  soldiers fought and died in America's wars in Afghanistan and Iraq.  There is no ambiguity here--no ambiguity. Close ties with our  northernmost allies are what make America's extensive reach in the  Arctic actually possible. And I have yet to hear from this  administration a single thing we need…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…we are looking for, let's talk about it.\n\nAnd we could pursue that as we pursue other areas of cooperation.  Whether it has to do with trade or tourism or the other economic ties  that bind, that is what we should be doing, but we are not doing it.\n\nInstead, at least publicly, the Trump administration is focused on  acquisition, on ownership, even though…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…efficient delivery of weapons that Taiwan has  purchased from the United States.\n\nThis year, I introduced a bipartisan, bicameral bill to enhance U.S.- Taiwan economic and trade ties. Our partnership with Taiwan is more  important than ever.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690020/recognizing-taiwan-as-a-trusted-leader-in-freedom-democracy-and-trade"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…children--is that of strong  families. I think we have to spend some time pondering why it seems to  be that people who are used to the American culture seem to have weaker  family ties than those people who are coming here from other countries.\n\nIt is my personal belief that the reason we have weak families in  America--and one of the reasons why our American…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Chinese Communist Party-sponsored hackers have  used these vulnerabilities to launch attacks. We should take these  reports seriously.\n\nFurther, we know that companies with ties to the CCP could be forced  to support Chinese intelligence activities. We can imagine how they  could use vulnerabilities in their equipment to aid these efforts.\n\nThat is…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690156/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…also known as the  university endowment tax. The qualified religious institution provision  would exempt any institution that, in short, is longstanding and has  substantive ties to a religious organization.\n\nReligious institutions have served a very important purpose in our  country throughout our history and have, by and large, not been  offenders…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}]