[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I thank the gentleman from New  Jersey for yielding the time.\n\nI rise in opposition to H.R. 4593 with a great concern that House  Republicans simply do not care to work on any solutions to lower the  cost of living for our hardworking…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 28th time to call on  the Trump administration to restore lifesaving food aid for  malnourished children.\n\nThis program began 70 years ago, an idea from a Kansas farmer, and it  was launched…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693626/restore-funding-for-lifesaving-food-aid"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, I rise today to acknowledge that September  is Sickle Cell Awareness Month. It is a time to recognize the  challenges faced by those living with this debilitating genetic  disease.\n\nThis disease is one that disproportionately affects Black people who  make up 90…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, I thank the gentleman from Texas for  yielding me the customary 30 minutes, and I yield myself such time as I  may consume.\n\nMr. Speaker, we have four bills in this rule today. All of them are  completely closed--no amendments, no debate, completely closed. I feel  like I am in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…seem logical, if not for the fact  that it is already illegal and has been for decades. Noncitizens caught  voting in Federal elections already face deportation and even jail  time.\n\nTime and again, when pressed for evidence of widespread noncitizen  voting, Republicans have failed to produce a single credible example.  The reason? Because the problem…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "Ms. FRIEDMAN. Mr. Speaker, I thank Ranking Member Morelle for  yielding me time.\n\nMr. Speaker, I rise in strong opposition to this so-called SAVE Act,  a bill that is a modern-day poll tax targeting American women and low- income Americans.\n\nThis bill bans…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Reliability, and  Interoperability Council, or CSRIC, which focuses on improving next- generation 911, emergency preparedness, network security, resiliency,  and interoperability.\n\nTime and again, CSRIC has improved the reliability, availability, and  performance of our communications networks during natural disasters,  terrorist attacks, and cybersecurity…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…healthcare crisis that they created, the American people  will not forgive them.                        Restoring Lifesaving Food Aid\n\nMr. MAGAZINER. Mr. Speaker, I rise for the 41st time to call on the  Trump administration to restore lifesaving food aid for children  starving around the world. Edesia Nutrition in my district is about to  send 15,000 boxes of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…just done comparative advantage, then they would have been  growing rice for 30 years. That was their comparative advantage. They  said: No, we want to build things.\n\nIt is time America realizes we want to be building things and  realizes the value of advanced manufacturing. Representative Deluzio  certainly gets it. He is one of the brightest voices…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…seeing her premiums  go up more than $5,000 a year. Hillary, from Providence, her family of  four is going to be paying $10,600 more next year for the same  insurance.\n\nIt is time for President Trump and House Republicans to wake up to  what the American people are experiencing and extend the Affordable  Care Act tax credits now. Stop playing games. Let's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696996/extend-the-tax-credits"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…children--our children--stand to lose out on the public education and  opportunity to learn that they deserve, regardless of their ZIP code.\n\nLook, we know we are facing a challenging time in the American  education system. We know that, as a nation, we must turn the tide and  ensure that America is a global leader in educating our children, and I  am committed…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…5 years as the British Ambassador to  the United States and was recently appointed as the United Kingdom's  Special Envoy to the Western Balkans.\n\nDuring Ambassador Pierce's time in the United States, she happily  embraced her role as the guardian of the special relationship between  our two countries. During a time of increasingly strident partisanship,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…changing precipitation  patterns, diminished snowpack, earlier runoff, and changing water  availability. I certainly look to the mountains, the Olympics and the  Cascades, every time I drive around my district, using a very  nontechnological approach to assessing the snowpack on the mountains.\n\nMr. Speaker, there are definitely scientists using much better…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…criminal record erodes civil liberties and threatens  the rule of law.\n\nThe American people have seen this play out with their own eyes, and  they have had enough. This is the time to rein in this lawlessness now.  Congress has 2 weeks to act. With the support of the American people,  Senate Democrats stood firm and made clear we would not provide the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…students with  postsecondary education, employment, and independent living.\n\nIDEA addresses past failures to educate students with disabilities. I  am old enough to remember a time when students with special needs were  educated in the basement of schools or outright denied entry. Before  IDEA, millions of children with disabilities were denied an education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…millions of dollars. By the way, why  should we in the Federal Government care what everyone's desk is like?  Let people choose on that.\n\nThat simple statement, that simple first time that it was actually  used, started a process now of saying: If an administration at the last  minute puts in a rule that Congress then comes in and says ``You  overreached…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…freedom-loving immigrants  have fled from for centuries. They have been running from it. But now  we are changing into that same situation.\n\nThe deep state hasn't wasted any time in 2026 to accelerate its  globalist agenda to destroy this country. And if we don't do something  to stop this Islamic takeover of our country, we will soon be called  the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and the Navy Occupation Service Medal. Leroy  served in the South Pacific on the USS Whiteside. He took great pride  in collecting Navy memorabilia and telling stories of his time at sea.\n\nLeroy was a member of Farmington VFW Post 5896 and when he was able,  frequently attended veterans' events. In his later years, he would rise  from his seat, hold onto…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…production of test and production records; and\n\n(B) random sample testing; and\n\n(4) to allow for the recovery of all associated costs of       foreign inspections to include travel, time, and other costs,       as determined by the Secretary.\n\nMr. EZELL.  1182.\n\nMr. Speaker, in recent years, foreign-produced gas cylinders from  countries like China have entered…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…over  six decades for a reliable water source. H.R. 131 will ensure this  project can finally be completed.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. GOSAR.  Boebert), the lead sponsor of this bill.\n\nMr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…eliminate an American manufacturer of water heaters to benefit their  competitors.\n\nMadam Speaker, our colleagues on the other side of the aisle have  spent an enormous amount of time in the past few weeks arguing that my  Democratic colleagues are the party of blue-collar American workers. In  the spirit of bipartisanship, I encourage my Democratic colleagues…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…another championship team in East Lansing.\n\nThis championship is the result of countless hours of practice and  years of hard work, and it serves as a capstone to all of the time  spent perfecting their craft, playing as a team, and working under the  leadership of head coach Ray Mitchell.\n\nA sincere congratulations to each and every one of them. This…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…spending that is driving the  greatest country in human history off of a fiscal cliff.\n\nMr. Speaker, I urge my colleagues to reverse the curse, and I reserve  the balance of my time.\n\nMr. ARRINGTON. Mr. Speaker, after the Tax Cuts and Jobs Act, the  wages for the bottom 10 percent grew at twice the amount of the top 10  percent and wealth three times the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Speaker, for the purpose of debate only, I yield  the customary 30 minutes to the distinguished gentleman from  Massachusetts (Mr. McGovern), pending which I yield myself such time as  I may consume. During consideration of this resolution, all time  yielded is for the purpose of debate only.                                General Leave\n\nMr. LANGWORTHY.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…some or, for that  matter, many of President Trump's nominees and to oppose nominees they  consider to be historically bad. I have opposed more than one Democrat  nominee in my time. But let's get real here. This obstruction is not  about historically bad nominees. The scores of nominees who have  emerged from committee with bipartisan support are not historically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "French Hill", "party": "Republican", "sentence": "…40 years, I think the  changes proposed by the gentleman from Nebraska are solid.\n\nMr. Speaker, I urge my colleagues to support the bill, and I yield  back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…of limitations for prosecuting fraud within these  programs is set to expire beginning early next year. If Congress does  not act, law enforcement will not have the necessary time to  investigate and prosecute these crimes.\n\nAlong with my colleague, Representative Conaway, I have introduced  H.R. 4495, the SBA Fraud Enforcement Extension Act. This bill…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I thank Mr. Jordan for allowing me this time.\n\nMr. Speaker, I rise today to honor the Woman's Relief Corps, the  oldest national women's patriotic organization and the auxiliary to the  Grand Army of the Republic, which…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I thank my colleague from Georgia for yielding  time.\n\nMr. Speaker, I rise in support of the rule and the underlying  legislation. The four separate measures being considered under this  rule all have a singular commonality. They…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693550/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I thank Chairman Cole for yielding me  time.\n\nMr. Speaker, over 40 days after the Senate Democrats shut down the  Federal Government, we are finally reopening. The result of the  shutdown has been thousands of employee…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}]