[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…where I see      The making of the world that is, and the world that ought to             be.                             by lilliana grinberg       ``Polarization at an all-time high,''      The newspapers report, day after day.      My time here has shown me it's not a lie;      I have seen it in every no and yea.       This is no longer the way things…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…fraction of that.\n\nOf course, the other main beneficiaries will be the wealthiest  executives of the wealthiest corporations at a time when corporate  profits are at an all-time high. Americans who rely on government  services will be told they need to make sacrifices to pad their profit  margins even further. How does that make any sense?\n\nTo pay for…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…law--the very  law that Congress passed to give the Consumer Financial Protection  Bureau the authority to examine the largest Big Tech participants.\n\nPayment fraud is at an all-time high, and these payment apps play a  big role in that increase. I have received more and more complaints  from constituents who have been tricked, scammed, and defrauded out of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…H.R. 862, the TSA Commuting Fairness Act.\n\nYear after year, through holiday seasons and spring breaks, air  travel continues to break records. These numbers are at an all-time  high and are expected to continue to increase this upcoming spring.\n\nThe Transportation Security Administration, or TSA, reported over 3  million travelers on the Sunday after…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…but our country isn't returning the favor.\n\nFewer children than ever outearn their parents. The average age of a  first-time home buyer is 40 years old, which is at an all-time high,  and things feel too costly. Opportunity feels too scarce.\n\nI think Americans need to start believing in young people, and that  is exactly why I introduced my K-30 agenda.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699836/empowering-americas-next-generation"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…are amazed. Today is one of those days where I am wondering  what the hell are these folks doing. While our economy is in crisis,  while groceries and housing are at an all-time high, while our veterans  and our firefighters and our teachers are being illegally fired, while  Elon Musk is dismantling the U.S. Department of Education, and while  the Secretary…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…natural gas.\n\nThe result is an electric grid that is less reliable and increased  utility prices for hardworking Americans. While natural gas demand is  expected to reach an all-time high, accounting for more than 40 percent  of electric generation in the U.S. next year, this is clearly a  pressing issue that must be addressed immediately. H.R. 3668 is the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…meaning they exhibit a serious risk of waste, fraud, abuse, or  mismanagement, and have failed to take corrective steps.\n\nThe number of these high-risk agencies is now at an all-time high. It  has doubled during the course of Governor Newsom's tenure. Among the  findings were error rates when it comes to food assistance benefits  that could cost a loss of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…revenue to strengthen  America's balance sheet and pay down the tax on our children, which is  the deficit. We have gone from 6.3 percent to 5.9, and exports are at  an all-time high.\n\nNow, what is the issue here? It is not about 301, unfair trade  practices, although there are plenty of grievances against our northern  neighbor in that regard. This isn't…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…lot of confusion as to who we should be removing in  this country.\n\nRight now in America, we have no shortage of people who are here from  other countries. We are at an all-time high, even greater than the  1890s or 2010s in the number of people in this country who were not  born here. That is over 15 percent. We are naturalizing about 850,000  people…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dominate the       globe in critical mineral production and processing, while       U.S. dependence on foreign sources for these materials has       recently reached an all-time high. The ban on mining across a       significant portion of Minnesota only set us further behind       as a nation.\n\nAs a result, this mineral withdrawal, an administrative…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…natural gas  to heat 15 million homes for an entire year, equivalent to 100 billion  kilowatt hours of electricity.\n\nU.S. electricity consumption is projected to hit an all-time high  this year, and electricity demand will grow by as much as 128 gigawatts  through 2029. Fueled by new data centers and AI, these estimates of  electricity demand are five…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…border.\n\nThis past February saw the lowest level of illegal crossings ever  recorded in our Nation's history, down 94 percent from February 2024  and 96 percent from the all-time high under the Biden administration.  Along the Del Rio Sector of the border, there was a 98.8 percent  decrease in apprehensions compared to the highest day under President…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the tax side or the spending side? I have done  entire presentations here on the floor where I have shown my  colleagues--go back to the last 65 to 75 years. Here is a time of very  high marginal tax rates. We take in about mid-17 percent of the economy  in tax collection. Very low marginal tax rates, we take in about mid-17  percent of Federal taxes.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the law-abiding, the self-reliant people, which is all we  should need here.\n\nWe took in 850,000 last year on a rolling 3-year average. I still  believe we are at the all-time high of even more than that. We should  be reminding anybody who says we are mean or not doing our share of  taking in people who would rather live here that, in fact, we took…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…global       supply can be easily constricted by foreign governments,       investing in domestic oil production is a matter of national       and energy security. During a time of high inflation across       the country, this misguided rule will almost certainly lead       to higher energy prices for working class families across       America. Restricting…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…look at all the ways you can become citizens, it is not  surprising that today over 15 percent of the people in the United  States of America were born abroad. That is an all-time high. As we  analyze what we have to do on this situation, we ought to remember: If  we do nothing, we are already at an all-time high in the number of  people who are in the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}]