[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…members, staff,  performers, and even Trump-appointed officials were blindsided by this  announcement. There was no plan presented, no consultation, no  transparency.\n\nThe New York Times reports that budget documents describe needed  maintenance, yes, but nothing that required shutting down the entire  institution. In fact, the very official overseeing facilities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…for veterans in New  Mexico.\n\nAs chairman of the Lincoln/Otero County Veterans Leadership Council,  he has seen firsthand the barriers that rural veterans face: long  travel times for medical care, unreliable transportation, and a system  that too often overlooks them.\n\nHis advocacy directly shaped my New Mexico Rural Veteran Health Care  Access Act,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…lawyer, but he championed the cause of a great number more in  not just legal but in political and civil contexts.\n\nHe also failed to disclose that he had appeared more than 150 times  on Russian state propaganda networks, like Russia Today and Sputnik,  when he was nominated to be the U.S. attorney for the District of  Columbia. These are networks that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…=========================       honored and proud to represent the people of Pennsylvania, good,\n\nhardworking, patriotic people who are pretty frustrated. We are not\n\nliving in normal times.This should not be a normal run-of-the-mill  Special Order hour. What I  will convene today, my colleagues on the Democratic side of the aisle,  who you will hear from, these…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Senator Van Hollen, Senator Durbin-- soon we will hear from Senator Bennet. We have resolutions that support  Ukraine at a critical moment in its history.\n\nI have been there six times. I have come to know President Zelenskyy  not only from meetings there, but in Paris, Munich, a number of times  here in Washington, DC, and I will never forget my first meeting…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…often beset  by delays and cost overruns. We spend billions on studies and research  programs that don't lead anywhere. Production timelines are always  being extended. Delivery times are delayed, and per-unit costs are  increased.\n\nIn the face of these glaring business inefficiencies, Congress and  the Pentagon always give the contractors what they ask…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…development, that is backing this back out of the grid. Now it starts  to look more like 2018. If you are buying electricity at this level of  grid load, you are paying three times as much--three times as much.\n\nAnd this is deliberate. You don't think the Trump people don't  understand this? They know perfectly well.\n\nAnd here is the deal. The extra two-thirds…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…blamed the victim with no  pretense of wanting to find out what the facts were. An hour ago we  just had two more people shot by an ICE agent in Portland, Oregon.\n\nThese are dark times, and it is really easy to get bogged down in the  negative, but today, something really good happened. Mr. Speaker,  today, 17 Republicans joined Democrats to override the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…loopholes. America already stands out as an  outlier in the world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…equivalent of six Hiroshima nuclear explosions. Those  bombs, as Senator Sanders said, have been used to destroy more than  200,000 buildings in Gaza. That is more than three times the number of  buildings in Manhattan.\n\nThe bombs have killed thousands of kids, the equivalent of a  classroom full of children every day has been killed in this conflict,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the challenges that are in front of us as Americans and  for really articulating why courage, backbone, and just basic common  sense are so needed right now in these perilous times.\n\nWhy are these times perilous?\n\nThese times are perilous because in Congress we are in the process of  debating and trying to pass this reconciliation bill.\n\nPeople might…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…week, he seemed to mockingly suggest that  ``affordability'' is a word the Democrats made up to attack him. Well,  that is rich coming from a man who has declared bankruptcy six times.  The American people are hurting because of President Trump and the  Republican policies, and they should not be mocked for that. Even FOX  News reported last night that 76…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…suggesting that it does. They say that police need this bill in order  to have access to and use this new taser, this new innovation in  tasers. As I have pointed out a number of times, everyone who has  spoken, in their home State they use these tasers. The police  departments have access to these, and they use them.\n\nAs a matter of fact, all 50 States use…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…fire  department was spending less time putting out fires--and more time  responding to people in mental health crisis. Some residents were  dialing 9-1-1 regularly--several times a week--because they were facing  underlying mental health needs. This cost the city money. It strained  resources. But most of all, it meant residents of Joliet were  suffering.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…of  facts, no transparency, no accountability, and no respect for the  family left behind.\n\nThere was also Marimar Martinez, another constituent. An ICE agent  shot her five times and then arrested her. ICE leveled serious criminal  accusations to justify it. Later, quietly, those charges were dropped.  Why? It was because they were lies, but the damage…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "James Risch", "party": "Republican", "sentence": "…between Congress and the President. There is truly clear  tension between the branches and the Constitution on this matter, and,  of course, that has reared its head many, many times during the  existence of our country.\n\nPutting U.S. troops in hostility is an incredibly serious matter.  These are American lives on the line, and we should not expose them…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…American worker.\n\nPresident Trump is taking decisive action, pausing tariffs for 90  days, except for China, as nations have come to the table.\n\nAs I have made clear multiple times now, when it comes to the pause  on the National Emergencies Act disapproval resolutions, this is a tool  utilized by both majorities, and my Democrat colleagues had no qualms…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Shea.\n\nMitchell first joined Team Scalise as an intern and later moved onto  my full-time staff as a Staff Assistant. Over the past ten years, he  has been promoted multiple times and is currently serving as my Senior  Legislative Assistant.\n\nThroughout his tenure in my office, Mitchell has faithfully served  the constituents of Louisiana's 1st Congressional…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…German recipes to create quality fresh meats and homemade  specialty products.\n\nRandy Alewel, the third-generation CEO of Alewel's Country Meats, has  expanded the facility four times now.\n\nToday, we congratulate Alewel's Meats and thank them for their  contributions to Missouri and the Fourth Congressional District.                          Recognizing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…tasks, and they need additional authorities to be able to make  sure they can fully execute the law that is put in front of them.\n\nSomething that was interesting--the multiple times I have been to the  border the last several years--often the Border Patrol would tell me  they can't put checkpoints up anymore. They used to have checkpoints on  the major…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…That is what my  suspicion was all along.\n\nConsumers don't see the savings. These appliances just don't last as  long because they have got to run their washing machine three times.\n\nI will tell you, Mr. Speaker, one time I had a constituent contact  me, and she said: Morgan, look at this picture. I take a hose from my  backyard to fill up my washing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…pandemic was visited upon the whole  world, jobs were created and revenue rose for the United States of  America. I have to say that.\n\nLet me also say this: There have been times, very recently, when the  Democratic party controlled the Presidency, the House of  Representatives, and the U.S. Senate. And even in those situations-- those recent situations--this…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Commander in Chief of the Armed Forces, not  Congress. So the Commander in Chief is one person, the President.  Declaring war is a duty of the Congress. In the case of modern times,  it requires 535 people to vote.\n\nThe question is, Can you use military force as the Commander in Chief  without a declaration of war?\n\nThe answer is yes.\n\nThere have been…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…she was unflappable. In moments of  disagreement, she brought thoughtfulness. In moments of decision, she  was always guided by principle.\n\nI have relied on her judgment more times than I can count. When I  needed honest counsel, she gave it, even when it wasn't easy. When the  office needed leadership, she stepped forward without hesitation. When  the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…money.\n\nLet's end this Schumer shutdown and pass a clean, short-term CR--the  same kind of clean CR, mind you, that, as I said, 96 percent of  Democrats voted to support 13 times during the Biden administration.  That is what this shows.\n\nLet's pass this clean CR, get back to work, and move our  appropriations bills through regular order. That is how…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Guess who  wanted that to be open. All the indigenous leaders of the North Slope:  the Tribe, the Alaska Native Corporations, the Borough Leadership. They  came down here eight times to DC--eight times--to try to meet with the  Secretary of the Interior, saying: Don't lock up my lands. Don't lock  up my lands. She never met with them. She never met with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…change,  showing remarkable resilience, patriotism, and adaptability. They move  from base to base, often starting over time and time again. They say  good-bye to friends more times than they can remember.\n\nThey celebrate birthdays and holidays with one parent thousands of  miles away. They carry worry, pride, hope, and responsibility,  sometimes all at…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…of goods. The meeting was allegedly setup       in response to a post on the OfferUp platform. When the       victim arrived, he was allegedly robbed and shot multiple       times. The Court concluded that Section 230 barred the claim       against OfferUp.      Craigslist Faces No Accountability for Allegedly Facilitating Sex…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…ensuring that future generations would  never forget the servicemembers who went above and beyond the call of  duty.\n\nSince its inception, the Medal of Honor has been awarded 3,547 times  to servicemembers who have demonstrated extraordinary bravery and  devotion to their fellow troops and our Nation. Among those, 380  recipients have called Pennsylvania home,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…thing to do as stewards of  tax dollars. This is not to mention that it is propping up the  underlying program that, year after year, has raised premiums and  deductibles two times--it has doubled premiums and deductibles since  ObamaCare has been enacted.\n\nWe have fewer choices. Things are worse.\n\nAs Ronald Reagan said so beautifully, so aptly, in this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}]