[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…remaining on the books, these AUMFs only risk abuse by  administrations of either party to sanction military force that  Congress has not considered or approved.\n\nIt is time for Congress to reclaim its constitutional authority over  matters of war and peace, its Article I war powers, by removing these  open-ended AUMFs once and for all.\n\nI am thankful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…higher overdraft fees. No one in America  wants to send a $250 check to the biggest banks every year.\n\nTo put this debate into perspective, Republicans spent a lot of time  last Congress attacking a big bank capital rule called Basel III  endgame. Republicans convened one dozen hearings on the topic and  repeatedly referred to the 426 comments the public…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Mr. Speaker, I thank Congressman McGarvey for yielding me  the time.\n\nMr. Speaker, I thank Congressman Stauber, and I am excited to work  with him so closely during my time in Congress to advance the  opportunities for folks with disabilities in this country. It is just a  deep honor for the two of us to continue on our path of  representing Americans…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691779/thinkdifferently-about-disability-employment-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…with Talia. To my colleagues across  the aisle, I implore you to stop protecting the powerful. Stop serving  the wealthy. Start listening to the people.\n\nTruly, it is time for Congress to get their heads in the game. I  thank Talia for sharing her story, and I want to assure her we will not  give up on this fight.\n\nIt is time we work together to cancel…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…morning, in the Senate Foreign Relations Committee, the  committee considered three bipartisan bills to address Russia's  continued, expanding aggression--for the first time in this Congress.\n\nSo the first time since the beginning of the year, we have actually  taken action in the Foreign Relations Committee, action that you  supported with your proxy votes--and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696340/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…development in Haiti.\n\nThe Haitian people have faced enormous hardships in recent years,  after suffering successive political and environmental tragedies. Now  is the time for Congress to demonstrate our support for the Haitian  people and to promote trade policies that promote stability and spur  economic development in Haiti.\n\nIn 2020, I led the bipartisan…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Yet,  Mr. Speaker, as you know, Congress has not acted on enhancing Social  Security in more than 50 years. Richard Nixon was the President of the  United States the last time Congress, whose responsibility it is, did  anything to extend benefits. That includes a COLA that is out of place,  as AARP indicates, as well as tax cuts for people who continue…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…for reports after wrongdoing is not accountability. Giving  Hegseth and Trump even more authority and more resources will only  embolden their dangerous behavior. It's time for Congress to do its  job.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…that by this Constitution. We have been  promised that by this country, and I know that we will continue to  fight every step of the way to fulfill that promise.\n\nIn my time in Congress, I have been privileged to represent a rich  tapestry of this Nation, woven by the many threads which make us  uniquely American. I have been proud to represent one of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…institution  should work for the people it represents, this is the moment. Extend  the tax credits. Protect the coverage of our constituents. Stand with  us to say that it is time for Congress to put patients ahead of profits  and working families ahead of billionaires.\n\nMr. Speaker, I urge a ``no'' vote on this rule, and I yield back the  balance of my time.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…represent  a district that is home to 12 federally recognized Tribes, Tribes that  led the Nation in co-stewardship, climate resilience, and ecosystem  restoration.\n\nEach time this Congress gathers to address land restoration and  treaty reserved rights, we are doing incredibly meaningful work, not  only alongside the Tribes that we serve, but in service…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…bringing  an impeachment resolution to the floor mere hours after it has been  introduced and without any investigative report--as Congressman Green  is doing for the second time this Congress--sets a harmful precedent.  It undermines the ability of Congress to make a serious and well- documented case for impeachment against this or any future president.\n\nPresident…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…these goals, meet our national security  needs, and support our servicemembers, Congress needs to perform real  oversight over the Pentagon and defense contractors.\n\nIn my time in Congress, I have supported multiple efforts to require  the Pentagon to perform a clean audit with tangible enforcement  mechanisms to ensure compliance. In each case, these efforts…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…signed a discharge  petition to force a vote later this week to extend the tax credits. We  must be ready to act when the bill arrives in the Senate.\n\nAmericans do not have time for Congress to litigate the entirety of  the U.S. healthcare system, but we do need to triage now. Let's do  something to help these people keep their health insurance. I have  spoken…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…want Congress to give trillions of dollars of tax cuts to  billionaires. They do not want cuts to SNAP or Medicaid, vital  lifelines in my home state of Minnesota. It's time Congress starts  working to address the real issues--starting with passing full year  appropriations bills. I am ready to get to work.", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…natural allure of power would be checked  by each branch jealously guarding the prerogative of power.\n\nWho among the Framers would have ever guessed or conceived of a time  when Congress would lack any ambition--any ambition at all? Who would  have predicted a time when Congress would be so feckless as to simply  and obediently abandon all pretense of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…staff the opportunity  to gain knowledge and skills from throughout the department, we give  the intelligence community a leg up in the fight to protect our Nation.\n\nIt is time for Congress to codify DHS' Intelligence Rotational  Assignment program and ensure that our intelligence community has the  breadth of experience necessary to tackle the threats of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Nothing in this legislation alters additional permitting requirements  of other statutes, like the National Environmental Policy Act or Clean  Water Act.\n\nIt is past time for Congress to assert its authority and establish a  modern and transparent process for cross-border energy infrastructure.\n\nMr. Speaker, I thank Representative Fedorchak for her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…sector,  which is a testament to the Maddy Institute's impact.\n\nMy District and Washington, D.C. offices have welcomed interns from  the Maddy Institute throughout my time in Congress. Their local  expertise and interest in government make the interns invaluable  members of my team. I'm proud to support a program that promotes the  next generation of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699141/recognizing-the-maddy-institute"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…TURNER of Ohio. Mr. Chairman, I rise in support of this  appropriations bill, and I support that this bill invests in the  National Endowment for Democracy.\n\nDuring my time in Congress, I have worked very closely with the  National Endowment for Democracy's executive director, Damon Wilson,  who is a great leader in democratic efforts throughout the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…liability.\n\nThere is simply no reason to require a special use permit for an  undersea cable because there is absolutely zero--and I say ``zero''-- environmental impact.\n\nIt is time for Congress to pay more attention to the critical  infrastructure that surrounds us in this country. That is why I  introduced the NEPTUNE Act, to make sure that the Navy maintains…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699958/undersea-cable-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…millions  of their SRS funding while waiting for this legislation to be  reauthorized. Communities across Arkansas and the United States are  sounding the alarm, and it is time for Congress to listen.\n\nThis bill not only shines a light on an educational issue but  underscores the need for an increase in responsible forest management.  That is why I introduced…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…away from danger, law enforcement and first  responders run toward it. They fight crime, protect the innocent, and  too often, make the ultimate sacrifice.\n\nDuring my time in Congress, Mississippi has lost too many heroes: In  June 2023, Madison Police Officer Randy Tyler was shot and killed while  responding to a hostage situation. In January 2024,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Biden.\n\nIt is noteworthy, Mr. Speaker, that the only thing the President  needed to accomplish this was leadership. We heard the last  administration claim time and time again that Congress would need to  pass legislation to secure the border. We heard a blank check would end  the unprecedented illegal immigration happening at our southern border.  Yet,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people might wonder where they came from. I think  they probably came from developers who found a way to snooker the poor  U.S. Congressmen in the late eighties. At the time Congress felt  something had to be done because we had just gotten done with the  apparently increasing the depreciation schedules on new residential  real estate. So in the early…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…District of Columbia, and the citizens of this great city deserve  better. President Trump recognized this fact and has exercised his  authority to restore safety. It is now time for Congress to build on  his good work.\n\nH.R. 4922 is designed to begin to address many of the problems that  stem from the D.C. courts and their refusal to hold criminals  accountable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…establish a public website containing much-needed  statistics on juvenile crime in D.C.\n\nThe Trump administration's efforts have shown that lawlessness is a  choice, and it is time for Congress to step up, adhere to our  constitutional duty, and firmly address crime in the Nation's Capital.\n\nFor the citizens of D.C., I would say, we wish your Council did this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that people are  making.\n\nIn any event, after we have spent about 60 years after the Great  Society, 60 years after Patrick Monahan warned us what would happen, it  is time for this Congress to address this problem, get rid of the  perverse incentives which discourage marriage and get America back to  where we were before the Great Society when we had much…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…conduct a study reviewing the EPA's technical  assistance programs.\n\nAccess to clean and safe water should not be determined by where you  live, Mr. Speaker. During my time in Congress, I have heard from  elected officials across southern Ohio about the difficulties they face  navigating the Federal grant process due to budgetary constraints,  insufficient…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}]