[{"senator": "Al Green", "party": "Democrat", "sentence": "…will have my record show that I fought all the way  out. I didn't come to stay forever, but I did come to make a difference  while here on the great issues of our time.\n\nWhere do we stand? On H. Res. 939, 140 persons voted for H. Res. 939,  140 Members of Congress, not one from the other side of the aisle--140,  Members who hold high positions. I am…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…billionaire class wants subsidies for every  investment they make, even when they are building the Chinese economy  or the Russian economy or the Iranian economy. It is time to stand up  to the billionaire class. China cannot be confronted if people are not  willing to do so.\n\nWe also need to take steps so that Chinese stocks are not included in  index…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…they have earned.\n\nThese benefits are not a Ponzi scheme. These benefits are not  government handouts. They are earned benefits for American citizens.\n\nMr. Speaker, it is time to stand up for Americans and protect these  programs with our lives and our votes.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690237/standing-up-for-social-security-recipients"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this rule to defend the health of our  constituents  and to make sure that polluters are held accountable, not just trying  to rescind this rule entirely.\n\nI think it is time that we stand up to big polluters and billionaires  and re-center the health and needs of the American people.\n\nMr. Speaker, for all of these reasons, I urge my colleagues to vote…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…have had the privilege of traveling to the Baltic. When we speak  with the people there, it is not a question of if Russia will invade.  It is a matter of when. Now is the time to stand firm in our support of  these allied nations to deter Russian aggression.\n\nWhat type of signal does cutting support send to the Kremlin? Cutting  off the BSI is a massive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…and figure out  which way the wind is blowing, to try to think through what type of  reaction might come from the White House if we speak out against this.\n\nThis is a time for us to stand up together and stand up for each  other and for this institution. And not just right now. It is about:  What credibility do we have as a body going forward?\n\nAnd I…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…objection from my colleagues across  the aisle, not even a hint that they might rise from their knees after  having been browbeaten by this administration time and time again, and  stand up for the constitutional prerogatives of the United States  Congress, a coequal branch of government. In the context of this bill,  which was proposed to demand more…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…the  Congressional Progressive Caucus for the Special Order hour and the  Hispanic Caucus for all the work that has been happening at this very,  very serious moment in time.\n\nI stand here as the top Democrat on the Immigration Integrity,  Security and Enforcement Subcommittee on the Judiciary Committee. I  have been conducting shadow hearings both here…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I thank Ranking Member Pallone  for yielding the time.\n\nI stand in strong support of H.R. 2037, the Open RAN Outreach Act. I  am proud to introduce this bipartisan Open RAN Outreach Act with  Representative Richard Hudson of North Carolina.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…voices from every corner of the political spectrum, every  part of our economy. Maybe we should be listening to them and not be a  rubberstamp, I say to my colleagues. It is time to stand up. Otherwise,  why are you here?\n\nMs. KLOBUCHAR. Mr. President, in conclusion, I want to say this: One,  thank you to Senator Kaine and Senator Warner, the two Senators…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…for doing that and for making sure they  remember that they have the ultimate power. They are the ones who  determine what happens with this democracy, and now is the time for  them to stand up and for us to stand with them.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…us to make a new choice.\n\nCommonsense policy reforms to regulate guns and prevent mass  shootings like this one in Glendale have broad, bipartisan support. It  is beyond time we stand up and do something.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690714/mass-shooting-in-glendale-arizona"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…many in my State,  losing healthcare, making it harder for them to be able to deliver for  their family--how can I say that this is a time to roll over, that this  is a time to stand down? No, we draw the line here. We fight for your  healthcare; we fight for your lives; your ability to deliver for your  loved ones; to be able to stand up together and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…lost our power.  So many Americans have been sounding the alarm bell for a long time,  and they have been right.\n\nWe have now reached the inflection point.\n\nNow is the time for us to stand firm and for us to stand with them,  and for all of us to stand with those defending democracy, defending  free speech, defending freedom of religion, defending due…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…1540,  the Falun Gong Protection Act, a bill I have introduced to confront one  of the most egregious, barbaric, and medieval human rights atrocities  of our current time.\n\nAs we stand on the precipice of this vote, I ask you to join me in  taking a stand against the Chinese Communist Party's systematic  persecution of Falun Gong practitioners.\n\nSince…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…my colleague from the great State  of Alabama. He is a patriot. He is a good man. He is a man full of  common sense. He is a man that absolutely cannot stand wasting time. He  can't stand worthless grandstanding, and neither can I. I didn't come  here for that. He will be a great, great Governor.\n\nYou know, I had 8 years of serving the great people of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}]