[{"senator": "Summer Lee", "party": "Democrat", "sentence": "…pay.\n\nEmployees working overtime are the ones who need childcare the most  and the bill undermines workers' ability to pay for that care.\n\nFor this reason, at the appropriate time I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.\n\nMy…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699007/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…commitment to engaging with communities and governments  around the globe, regardless of faith, has made him one of the most  recognizable and respected religious figures of our time.\n\nWhile in the United States, Ecumenical Patriarch Bartholomew will be  awarded the prestigious Templeton Prize for his outstanding  contributions to the advancement of science…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…legislation we  are considering this afternoon, it depends on the existence of a  strong, bipartisan, and independent CPSC to protect Americans from  unsafe products.\n\nAt the same time that our Republican colleagues vote for this bill,  they will continue to remain silent as President Trump's callous  willingness to risk the safety of all Americans continues…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…less than 200 days.\n\nIf we let the New START Treaty expire, we will be left with no legal  limits on the size of the two largest nuclear arsenals in the world. At  the same time, we are seeing headlines about strikes on Iran's nuclear  facilities.\n\nThese actions revive a dangerous question: Can we stop the spread of  nuclear weapons through military…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I thank the gentleman for yielding time.\n\nMr. Speaker, I strongly oppose this unprecedented, undemocratic, and  paternalistic disapproval resolution. This  disapproval resolution would sabotage the District of Columbia's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…these entrepreneurs.\n\nMr. Speaker, I thank Mr. Stauber, Ms. Simon, Mr. Alford, and Mr.  Pappas for their bipartisan collaboration on this bill, and I reserve  the balance of my time.\n\nMr. McGARVEY.  Simon).\n\nMr. Speaker, I thank my colleagues: Mr. Stauber, for sharing his  story, for acting on behalf of his son and so many Americans with  disabilities;…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…when it is taken away. While families  are worried about whether they can afford insulin, inhalers, or mental  health care, Republican leadership chose inaction. They found time to  give tax breaks to corporations but not to protect healthcare for  working people before tax credits expired.\n\nThat tells you everything you need to know about Republican…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…because of who they are. The Americans I know  honor everyone who has the courage to serve. They do not support  kicking people out of the military, people we have invested time and  millions of dollars in training into, just to score political points.\n\nTrump's trans military ban is cruel and shameful. Now, Republicans  want to add insult to injury…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…being used  to make this change and the impact it would have on the ability of this  body to perform its most basic functions. If passed, this bill would  represent the first time this rescissions process would be used to pass  completely partisan rescissions, and in doing so, we would undo  bipartisan agreements.\n\nThat is why I oppose this bill, and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…will continue to stand up for our Federal workforce and to  fight to protect Americans' public lands.\n\nMr. Speaker, I urge support for this bill and reserve the balance of  my time.\n\nMs. RANDALL. Mr. Speaker, I am enthusiastically in support of this  policy, but I think I have to underscore, again, that our public lands  belong to all Americans, as the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…After 2 years of already having kept food out, largely for starving  kids, that has to be provided with the 600 trucks a day unabated,  continuously, and regularly. At the same time, Hamas is score-settling,  is committing public executions, and intimidating the Palestinians who  yearn for peace and a return to some degree of normalcy.\n\nThe impediments…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Speaker, I thank my colleague from Pennsylvania for  his leadership on this issue. I support H.R. 3428, and I urge my  colleagues to do the same. I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…a date that had some other circumstances that we don't often  talk about.\n\nI am just going to read something that will help us better understand  why Bloody Sunday and this time in our history is so horrific, and it  gave a President an opportunity to do something that, but for Bloody  Sunday, he could not have done.\n\nThis is what I would like to read.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…already struggling the most. One example is his budget proposal that  calls to eliminate LIHEAP--a program that helps millions of low-income  Americans pay their energy bills on time.\n\nBetween the sky-high cost of rent, groceries, and utilities,  Americans are being hit from all sides.\n\nThe President has recently floated $2,000 tariff rebate checks as an…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…preparedness.\n\nA little bit of context: One of the reasons I got involved in  politics was as a student at Tulane University in New Orleans,  Hurricane Katrina hit the city at the time.\n\nI couldn't believe the waste, fraud, and incompetence that occurred  at places like FEMA.\n\nHere we are, years later, with an acting FEMA director who doesn't  even know we…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Heart  Health Month.\n\nHeart Health Month is a time to raise awareness about the importance  of cardiovascular health and the steps that we can take to protect our  hearts. Heart disease remains the leading cause of death in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…amendment, I ask Chairman Calvert to commit to  working with me on the continued LC-130 recapitalization project as you  have so graciously in the past.\n\nMadam Chair, I yield such time as he may consume to the gentleman  from California (Mr. Calvert).\n\nMs. TENNEY. Madam Chair, that is a mission of our President, of  course.\n\nMadam Chair, I yield back the balance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Representative Latta, the chairman of the Energy  Subcommittee, for his leadership on this issue.\n\nI urge all of my colleagues to support H.R. 3109, and I reserve the  balance of my time.\n\nWhen I was a young man in the 1970s--when I was a kid, I guess, in  the 1970s--I remember gas lines and having to push my father's car to  get gasoline. At the time, everybody…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…and hug a thug or something and see these  folks down in Central America.\n\nMr. Knott was helping prosecute these folks, and I know the  prosecutors were very frustrated at the time with what they were seeing  with these open borders. I appreciate, one, what he did before he came  to Congress; two, what he is doing now; and, three, hosting this  opportunity…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…he is looking for in order to avoid this outcome. After  all, we are dealing with a so-called clean CR, which simply extends  funding levels as they have been for quite some time now. This is  really not the way things should be done, by the way, but that is where  we are, and it is the only proposal on the table for avoiding such a  shutdown.\n\nI have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695800/continuing-resolution-compromise"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…However, for cylinders manufactured in foreign countries and then sold  and imported into the United States, PHMSA only inspects those  facilities once every 5 years.\n\nOver time, certain foreign producers have deliberately evaded safety  and regulatory standards to gain a competitive advantage over domestic  producers, potentially jeopardizing public…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…not only farmers but consumers, the  environment, and our national security.\n\nApproximately 33 percent of all U.S. corn produced is used for  ethanol, so imagine this the next time you drive down the road: a  cornfield where every third row goes toward helping to fuel this  Nation.\n\nPermanent E15 could boost corn demand by up to 2.4 billion bushels  annually.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the management of ANWR's vast resources and,  again, unleash American energy.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.\n\nI thank my colleagues for supporting this critical legislation and  engaging in this meaningful discussion.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…which is why it fell  apart; it made illegal immigration easier--we had to hold the floor all  weekend long--in a bipartisan affair, by the way--to get Ukraine  funding done in time for Chuck Schumer to deliver $60 billion to  Ukraine at the Munich Security Conference.\n\nWhat I have learned in 3 years here is that the Munich Security  Conference for Democrats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…know is ripe for reform  and taxpayer savings.\n\nMr. Speaker, I encourage my House colleagues to support this  commonsense, bipartisan bill, and I yield back the balance of my time.\n\nMr. COMER. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…but do that in a thoughtful, analytic way that can support a  review of systemic risk.\n\nMr. Speaker, I urge my colleagues to support the bill, and I reserve  the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate on this bill.   EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…office on track, smiling,  and teaching us Armenian history along the way.\n\nWhile he was working around the clock in my office during the past 4  years, he has also been a part-time law school student and devoted  husband, father, and dear friend.\n\nMadam Speaker, my team will not be the same without him, but we are  excited for him as he embarks on this…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…young leaders have remained committed to regular meetings,  coming together to immerse themselves in the legislative process on a  non-partisan, academic basis. Throughout their time in the program,  these students have studied legislation, prepared mock bills, and  worked to better understand critical issues that impact their  communities and countless…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…victim to enrollment in fully subsidized plans without their       knowledge or consent. This fraud harms patients who lose       their health coverage or face penalties at tax time. It also       harms taxpayers who foot the bill for these schemes.\n\nThis policy brief presents a state-by-state analysis       describing how zero-claim enrollment corroborates…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…such human cell and tissue       establishments;\n\n(C) the number and type of inquiries to the Tissue       Reference Group in the preceding year; and\n\n(D) the average response time for submissions to the Tissue       Reference Group in the preceding year, including average       initial and final response time.\n\n(3) Education.--The Secretary, acting through…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}]