[{"senator": "Al Green", "party": "Democrat", "sentence": "…get to the Lincoln  Memorial, which she was there to support but also to push for  impeachment, conviction, and removal. She is truly one of the great  patriots of our time.\n\nI thank you for your courage.\n\nI also want to thank the millions of people now who are associating  themselves with this courage of Bonifaz; with this courage of Denson;  with…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Chairman, I thank the ranking member for  yielding me time and thank her for everything that she does to protect  the pocketbooks of American families.\n\nMr. Chairman, American families and small business owners deserve  lower electric bills,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE. Mr. Speaker, I thank the gentleman for yielding me time.\n\nFirst, I thank the ranking member for his leadership in addressing  the scourge of fentanyl overdoses across our country.\n\nI serve as one of the co-chairs of the Bipartisan Fentanyl…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Ms. ADAMS. Mr. Speaker, I thank the gentlewoman from Connecticut  (Mrs. Hayes) for yielding time. I thank her for her unwavering support  of children and for having been the National Teacher of the Year. I  thank her so much.\n\nMr. Speaker, I rise because dismantling the Department…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I very much thank Ranking Member DeLauro for  yielding time. I also thank Chairman Cole and the chair of our  committee, Charles Fleischmann, for their cooperation. Please let me  thank our diligent staff for all their hard work on this bill,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…punishment.\n\nMadam Speaker, I am happy to yield if he can just clarify that.\n\nMr. RASKIN. I yield to the gentleman from North Carolina.\n\nMr. RASKIN. Madam Speaker, reclaiming my time. I thank my colleague  for that clarification.\n\nMadam Speaker, I am satisfied to believe, again, that there are  people who could end up with the most severe penalties under the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…climate change, but we do have a way to move forward to avert that  crisis and make us stupidly rich. My God, let's move forward.\n\nMr. Speaker, thank you for allowing us the time. I thank Congressman  Levin, Congresswoman Kaptur, and Congressman Subramanyam. For goodness'  sake, let's move forward. I yield back the balance of my time.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…agreeing to these changes when this bill was marked up in committee.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill, and I  reserve the balance of my time.\n\nAgain, I thank the gentlewoman from Missouri (Mrs. Wagner) for her  leadership. I also thank the gentleman from Arkansas (Mr. Hill), the  chairman, for his leadership and friendship.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693959/small-entity-update-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…this  important legislation today, and I encourage my colleagues to support  its final passage.\n\nMrs. DINGELL. Mr. Speaker, I will note that I have no further  requests for time. I thank my colleague from Michigan (Mr. Tiffany) for  supporting this bill.\n\nI invite all of my colleagues to join me fishing on the Great Lakes.  It might be good therapy for…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I thank Representative Dingell for yielding  me time, and I thank the gentleman from Ohio (Mr. Latta), my friend,  for his bipartisan partnership on this important issue.\n\nMr. Speaker, I rise today in support of the NTIA Reauthorization…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Jan  and I extend our deepest condolences and keep Doug's wife, Jill; their  children; their grandchild; and his devoted staff in our prayers during  this very difficult time. I thank the gentleman again for hosting this  Special Order hour.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698743/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I thank Mrs. Dingell for yielding  the time, and I thank Chairman Bilirakis for moving the bill forward to  the floor today.\n\nI rise in strong support of H.R. 906, the Foreign Adversary  Communications Transparency Act. This…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Congress and those across the  country who have been impacted by these crimes, who have seen these  crimes, and who all reject this political violence.\n\nI want to take this time to thank State, Federal, and local law  enforcement for their tireless work to bring the perpetrator to  justice.\n\nWe should be clear: Political violence against anyone is an attack…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I thank my good friend and Representative,  the gentlewoman from Connecticut, Representative Hayes, for yielding  time. I also thank her for putting together this Special Order hour.\n\nThe two of us came to Congress from the classroom. We came from the  classroom to the Halls of Congress. The two of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…the consolidated  appropriations act.\n\nFirst, I thank Ranking Member DeLauro for yielding me the time, but  also for her leadership and perseverance in this challenging time.\n\nI thank Mr. Simpson for his collaboration and partnership in this  committee, and I also thank Chairman Cole for the work he has done on  this committee.\n\nMr. Speaker, I will give…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…bipartisan legislation.\n\nThis legislation passed the House with unanimous support last  Congress. Unfortunately, we couldn't get it over the finish line in the  Senate in time, so I thank Chairman Williams for his important  leadership in getting it back to the floor and across the finish line a  second time in the House. We will get it done this time.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.\n\nI thank my colleagues for supporting this critical legislation and  engaging in this meaningful discussion.\n\nBefore I close, I want to highlight another statement from Director…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…service. He has spent countless hours in here educating the  American people on the dangers of the debt for our country, and we  should all be grateful. I thank him for this time.\n\nI also thank the folks here in the well who are working diligently to  always take down the words that we say, take down our votes, and work  day in and day out, allowing us to speak…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of Utah. Mr. Speaker, I now yield to the gentlewoman from  Illinois (Mrs. Miller).\n\nMr. MOORE of Utah. Mr. Rose and Mr. LaMalfa shared that rivalry with  our vice chair time, and I thank him for spending time with us tonight.\n\nOn to the great island of Guam, I yield to the gentleman from Guam  (Mr. Moylan).\n\nMr. MOORE of Utah. I yield now to the gentleman…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…and to the American people.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 1234.  I urge quick action in the Senate, and I reserve the balance of my  time.\n\nI thank the ranking member, Mr. Morelle, for his support and  bipartisanship in coauthoring this legislation with me.\n\nThis is an easy win for taxpayers, saving taxpayers $4 million…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…me as  Lieutenant Dan. Joan and I are going to truly miss Doug. We send our  deepest condolences to his wife, Jill, and their four kids during this  incredibly difficult time. I thank and ask all of my colleagues on both  sides of the aisle to join us in honoring the great work that Doug  accomplished over the years.\n\nMay we preserve his legacy. May…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…today. He is a great  guy. He is the pride of Poway, California. While it is our loss, it is  going to be the gain of the Pacific Legal Foundation.\n\nI will say one more time, I thank John for all the help he has given  me. He is welcome to come back to our office again and again when he is  on the Hill.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693086/recognizing-john-nagle"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people find friends? They find friends in the work centers, and it is  horrific for the Biden Department of Labor to try to shut these places  down.\n\nIn any event, one more time: I thank President Trump for preserving  the work centers. I hope his Department of Labor continues to look for  more opportunities in these facilities for people at a younger and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…There are days around this outfit when,  quite frankly, that isn't the case. I thank my friend. I appreciate  that. He has been a great partner.\n\nFinally, I will take the time to thank the committee staff on both  sides of the aisle who worked tirelessly over the past month to  negotiate the product before us. On the majority side are Paul Anstine,  Anna…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}]