[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is not what we are supposed to  do. We are supposed to worry about the public.\n\nMr. Speaker, I urge my colleagues to vote ``no,'' and I reserve the  balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our  Subcommittee on Energy.\n\nMr. Speaker, I have a lot of respect for the gentleman from Ohio (Mr.  Balderson), who just spoke, but…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…they go to check out.\n\nMr. Speaker, I thank Representatives Castor, Mullin, Kim, and Fry for  their bipartisan leadership on this issue, and I reserve the balance of  my time.\n\nMr. PALLONE.  Castor), who is the Democratic sponsor of the bill and who  is also the ranking member of our committee's Energy Subcommittee.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…wish, even if it means  driving up utility bills for American families.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy Subcommittee.\n\nMr. PALLONE.  Frankel).\n\nMs. LOIS FRANKEL of Florida. Mr. Speaker, my, my, my. I rise today,  amazed that with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…New York (Mr. Tonko), who is the ranking member of our Environment  Subcommittee.\n\nMr. PALLONE.  Dexter.)\n\nMr. PALLONE. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. PALLONE.  Morrison).\n\nMr. Speaker, I can't stress enough that the EPA's rule, which the  Republicans are trying to repeal, would remove 171 tons of hazardous  air pollution…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and the other consumer protections in this bill.\n\nMr. PALLONE.  Schakowsky), the Democratic sponsor of this bill, who has  worked on this legislation for such a long time.\n\nMr. PALLONE. Mr. Speaker, I agree with Mr. Bilirakis. This is  important consumer protection, and I am glad to see that our committee  and the subcommittee headed by Mr. Bilirakis…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…vulnerabilities and constraints of the agency that is tasked with  completing the report.\n\nMr. Chairman, I urge my colleagues to oppose this bill, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Chairman, I yield such time as she may consume to  the gentlewoman from Virginia (Ms. McClellan).\n\nMr. PALLONE. Mr. Chair, I yield myself the balance of my time.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Castor  and Balderson for their work and leadership on this issue. I urge my  colleagues to support H.R. 1767, the Awning Safety Act, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, obviously, this is an important bill from a  consumer safety point of view. I urge all my colleagues to support it,  and I yield back the balance of my…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…worse, while Democrats are fighting to make it better to try to reduce  prices.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance of my time.\n\nMr. PALLONE.  Castor), who is the ranking member of the Energy  Subcommittee.\n\nMr. PALLONE. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. PALLONE.  Elfreth).…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Dingell, Clarke, Kean, and Walberg for their  bipartisan work on this bill.\n\nMr. Speaker, I urge my colleagues to support H.R. 1765, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan support for this  legislation, and I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Representatives Pettersen and Valadao for their leadership on this  legislation.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, I will close by saying I do think this is  an important bill for avoiding fraud. I am very concerned about fraud  on these dating service apps. I commend…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on this bill, and  I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, I rise in opposition to the amendment.\n\nMr. PALLONE. Madam Chair, I urge opposition to the amendment because  it doubles down on a bogus and misleading…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…What you are doing,  President Trump, is not acceptable. It is going to reverse the progress  that we have made.\n\nMr. PALLONE. Mr. Chair, may I inquire as to the time remaining.\n\nMr. PALLONE. Mr. Chair, I yield myself the balance of my time.\n\nMr. Chair, I want everyone to understand my opposition to this bill.\n\nWhile the SUPPORT for Patients and Communities…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…it, less efficient  appliances means more profits for Big Oil and Gas.\n\nMr. Speaker, I urge my colleagues to oppose this resolution, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our  Subcommittee on Energy.\n\nMr. Speaker, again, I rise in opposition to this resolution.  Republicans make it sound like no one supports…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…communities safe and healthy.\n\nMr. Speaker, I strongly urge opposition to all three bills, including  the one we are debating right now, and I reserve the balance of my  time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. PALLONE.  McClellan), who is a member of the  committee.\n\nMr. Speaker, I want to comment on what the gentleman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…billionaires.\n\nOnce again, Mr. Speaker, I would ask my colleagues to vote against  this resolution, it absolutely makes no sense for anyone, and I yield  back the balance of my time.\n\nMr. PALLONE. Madam Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}]