[{"senator": "Al Green", "party": "Democrat", "sentence": "…man has a good reason to want to do this because you ought to  respect the person who carried you for 9 months, labored with you, and  gave you the breath of life. It is time to make a change.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689706/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the American people how horrible this administration is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.\n\nNow, our healthcare is the main focus right now, and it is amazing, I  would say to my colleague: Isn't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…used to try to eradicate the legacy of Jim Crow  and slavery to divide again, to wedge, to sow division, it is as old as  time.\n\nThe history of this country has been every time we make progress  towards the ideal, there is backlash, and it involves three things:  violence, propaganda, and voter suppression.\n\nMy great-grandfather lived through the first…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the House knows it.\n\nI urge my colleagues to vote ``no.'' We should take real action  immediately by passing the Jeffries bill.\n\nMr. PALLONE. Mr. Speaker, before I yield time, I will make sure that  the gentlewoman from Iowa knows that without the ACA tax credit  extension, a middle-class 60-year-old couple in her district is seeing  their premium go up…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698391/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…rejected, the American public  will know, with every paycheck, with every prescription, with every  hospital bill, which party stood on their side and which didn't.\n\nThe time to make a good-faith effort on a bipartisan basis is now.  Just 13 days from now is the deadline to enroll or change plans before  the first of the year. Before and during the shutdown,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Prada, who is 94 years old.\n\nCristina's story is a very familiar story to us in Orange County. She  came from Colombia in 1973 and worked at two or three jobs at the same  time to make ends meet. She worked as a housekeeper at a nearby resort  and cleaned houses for wealthy movie stars.\n\nCristina began to build her American Dream and watched her family…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…ordinary course, a rulemaking goes through its ordinary  process under the APA; and when it is done, it then comes here to the  Senate, and we have got a short period of time in which to make a  determination whether to try to disapprove it or not.\n\nUnder the proposal that is threatened here, you will be able to take  any Executive decision in decades and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…watched this bill over the years, and it has always been a  struggle to deal with the Homeland Security bill. I thought that we  were really on track to be able, this time around, to make some  significant progress in the Homeland Security bill, and we were on  track to do that.\n\nHowever, then we watched unfold an unspeakable tragedy in Minnesota:  the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…They were flooded out. They lost their appliances. Many  businesses went on the fritz. It would be particularly helpful to know  that they are going to save money over time as they make these major  investments.\n\nThis is exactly what Congress intended when we passed the Energy  Policy and Conservation Act. It was passed in 1975. We directed the  Department…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of this problem. This program, the SNAP  program, known as the Food Stamp Program, is critical to feeding  America for over 40 million of our neighbors and friends. It is time to  make it clear that the payments are going to be made--no ifs, ands, or  buts about it. I hope the President makes that clear today.                            Operation Midway…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…or  eating out at a restaurant.\n\nOne thing is clear. These acts of violence and the trauma they  inflict on all of us are preventable. They are a policy choice. It is  time for us to make a new choice.\n\nCommonsense policy reforms to regulate guns and prevent mass  shootings like this one in Glendale have broad, bipartisan support. It  is beyond time we…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690714/mass-shooting-in-glendale-arizona"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…systems for tax year 2025       will no longer be consistent with District law. As a result,       OTR would need to suspend the current filing season until       such time as it can make the necessary changes to revert the       District's tax administration system to conform with legal       requirements prior to the Tax Amendment Act's enactment. The…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…have been too quiet for too long.  There comes a time when you have to say something. You have to make a  little noise. You have to move your feet. This is the time.''\n\nTogether, we must make a little noise and create good trouble to  protect the progress we have fought so hard for. Together, we can  ensure that the stories and contributions of our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Oregon. Central Oregon is currently  fighting the Flat fire. Thanks to the hard work of our fire crews, it  is now at 52 percent containment.\n\nMr. Speaker, now is not the time to make life harder on our  firefighters. This administration needs to stop the foolishness. I  don't mess around with the safety of my constituents and neither should  the President.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Republicans are standing in the way of  Vietnam-era veteran land conveyances in my home State is ludicrous. It  is simply not true.\n\nIn fact, my bill extends the available time for them to make those  selections by 5 years, and there is nothing in this CRA that prevents  them from making those selections. We hope that they do. In fact, we  want more land to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…NEWHOUSE. It is a testament to the hard work of the committee and  subcommittee leadership on both sides of the aisle and the dedicated  staff that spent an untold amount of time to make this process work.\n\nMr. Speaker, I encourage all of my colleagues on both sides to  support this negotiated bill that provides the resources necessary to  secure our borders,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…investigation, my staff identified employees  who  received these critical skills bonuses while they were under  investigation for misconduct at the VA.\n\nMr. Speaker, it is time to make sure this never happens again. I am  proud of the work done by my friend, Secretary Collins, and I believe  the PRO Veterans Act will support his mission to build up the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections to share data.\n\nIn fact, farmers use information in real time to make smarter  decisions on how to optimize inputs and whether and when to plant or  harvest. When terrestrial or cellular networks are not available,  satellite broadband steps…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…and  circumstances where that is appropriate.\n\nCertainly, protecting our law enforcement officers from malicious  actors who want to intimidate them is important. It is a time to make  sure we are keeping our law enforcement officers safe and making sure  we continue to have people--brave women and men--who want to step up  and do that job.\n\nOne of the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to do fact-based,  the average family's taxes are going up at the end of this year $2,853,  and 62 percent of taxpayers will see hikes.\n\nI am sorry, we just didn't have time to make a much prettier chart  for everyone.\n\nRemember that after 2017 we actually moved up, some of that were some  of the deductions and things that were added, we moved up the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…coordination for common  cancers in women.\n\nNo person wants to hear that they have or that their loved one has  cancer. Having the resources to navigate such a difficult time can make  all the difference in the treatment journey.\n\nVA must give women veterans who have to navigate cancer treatments  the highest quality care that we can offer them. Whether…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to get this across the finish line. This is an  important piece of legislation that I know my staff, Josh Snead and  Hilary Pinegar, have worked tirelessly on for a long time to make sure  that this program does not die. I thank both the Democrat and  Republican staff. I thank Jorge Rueda and Alexandra Whittaker, as well.  I appreciate the hard work.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…recruit and retain  talented officers because they were vilified for deciding to serve  their communities.\n\nMr. Speaker, this is the time for Congress to take the lead. It is  time to make clear that we stand with the men and women of local law  enforcement who protect each and every one of our communities with  honor and courage.\n\nI am proud that this resolution…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}]