[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…congressionally directed funding or dismissing hardworking  Federal employees or upending our closest trade and national security  partnerships.\n\nInstead, today, we are taking time on the House floor to consider a  minor rule that EPA was legally obligated to develop. The rule in  question--to limit hazardous air pollutants from rubber tire  manufacturers--was…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688528/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…nervous.\n\nWe got so many phone calls in our office. Not only are jobs at risk  but retirement savings are put at risk. Investments are put at risk.\n\nI spent too much of my time in this House and in this Chamber trying  to repair the economic damage to our economy from trade deals like  NAFTA, CAFTA, China PNTR. They said USMCA was going to fix everything.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…happen to Venezuela's future? What is our responsibility? What are  we accepting?\n\nThe American people need to be in on that conversation. It is easy, I  learned in my time in the House and Senate, to get into a war but that  it is far more difficult to get out of one. I worry that, many times,  we have blundered into a situation which looks so simple…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…average American.\n\nMr. Speaker, I also want to say in opposition to this bill that  Republicans claim that the National Coal Council is so important that  it demands floor time in the House of Representatives, even though the  President has already reestablished it. We could be passing legislation  to lower energy costs or avoid a spike in health insurance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…as his country's top diplomatic  representative to the United States. Chief Justice Melville Fuller and  his family resided at the House from 1896 to 1910, during which time  the House remained a fixture in Washington, D.C. high society and  hosted President Grover Cleveland, President Theodore Roosevelt, and  Secretary of War William Howard Taft. Illinois…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…security. We broke a  fundamental promise with them, that when you serve your country in the  most dangerous of places, your country will have your back.\n\nI have spent my time on this House floor urging for the reversal of  harmful cuts just like these, and I spend my time in committee  questioning Secretary Hegseth as to why this policy was ever changed…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694036/safe-kits"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…our House floor. We use both our voice and our vote to move our  Nation forward.\n\nAs you so declared, Mr. Speaker, I am, indeed, in the minority party,  and so to gather time on the House floor is sometimes a struggle. To  gather time in a committee is sometimes a struggle. You push for your 1  minute, your 5 minutes, your maybe 15 minutes if you get it.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…about the prior President.\n\nRepublicans are in charge. Republicans have a majority in the House  and a majority in the Senate and the Presidency, and we spend all of  our time on the House floor doing CRAs or resolutions of disapproval,  the weakest vehicle that this House could consider.\n\nMr. Speaker, I know you are aware of this, but the House has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…agree with Monica. This is about survival. This is about the  millions of people who will lose access to food under the GOP tax scam.\n\nMr. Speaker, we demand better. It is time for House Republicans to  stand up and join us in protecting the basic needs of the people  instead of  prioritizing massive tax breaks for billionaires.\n\nI stand with Monica.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691425/gop-tax-scam-hurts-women-and-families"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicare,  Medicaid, and nutritional assistance for veterans, farmers, law-abiding  immigrant families, and small business owners. All the things that we  have spent some time on this House floor talking about, this bill is  trying to destroy, to destroy the American way of life.\n\nI can't find anything in the Bible in the New Testament, certainly  not in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the gentlewoman from Minnesota for  yielding me the customary 30 minutes, and I yield myself such time as I  may consume.\n\nMr. Speaker, last time Members were here, House Republicans rammed  through their latest GOP tax scam, a bill that would rip healthcare  away from over 15 million Americans by slashing Medicaid and, let's be…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…bill  and for his hard work and leadership on Alaska Native health issues. I  urge my colleagues to support H.R. 3620, and I reserve the balance of  my time.                                          House of Representatives,                                Committee on Energy and Commerce,                                   Washington, DC, December 8, 2025.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…exist  despite the legislature continuing to meet each day.\n\nThe House has essentially ruled that days are not days and they are  not to be counted as days until such time as the House again agrees to  allow days to be counted as days. Does that sound absurd? Absolutely.  It is absurd. It is craven. It is cowardice at its best, and it is  dishonest…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…policy fully accounts for the scope of organ trafficking abuses.\n\nMadam Speaker, I urge support of this legislation, and I reserve the  balance of my time.                                           House of Representatives,                                      Committee on the Judiciary,                                        Washington, DC, May 1, 2025.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…continued labor shortages in our Nation's critical supply chains.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.                                           House of Representatives,                                   Committee on Veterans Affairs,                                  Washington, DC, September 3, 2025.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…opening the  government.\n\nI urge a ``yes'' vote. I am proud to vote ``yes.'' I am so  disappointed in my Democratic colleagues because, for the life of me,  throughout my time in the House, I have heard them talk about how  wonderful it is to keep the government open and that a shutdown is so  bad and can never happen. Tonight, they won't even admit that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696720/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…and make baseless assumptions.\n\nMy colleagues across the aisle have mentioned how they find these  measures not worthy of our time. This certainly isn't the first time  they have mocked House Republican efforts to curb regulations on  appliances, from heating systems to dishwashers, refrigerators, and  freezers.\n\nIf this were such an unserious endeavor…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…officers are ``terrorizing our  friends and neighbors . . . and bringing chaos and violence to our  streets.''\n\nI have dozens more of these. I could continue to fill time on the  House floor by going through the absolute vitriolic attacks on the  people of ICE, literally another 30 in the list that I could read off.  That is what is occurring on a daily…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…later, I walked away from Doug very aware of all  the stops that he had made in my great State. From that moment on, I  was always the Mann from Kansas.\n\nDuring our time together on the House Agriculture Committee, Doug  routinely brought the priorities of farmers and ranchers in his  district directly into committee hearings and roundtables. His  multigenerational…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to pursue gainful employment  instead of solely relying on government benefits.\n\nThe Senate has completed our next step by passing President Trump's  budget, and it is time for the House to do the same.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…the finish line in the  Senate in time, so I thank Chairman Williams for his important  leadership in getting it back to the floor and across the finish line a  second time in the House. We will get it done this time.\n\nI urge my colleagues to support this commonsense legislation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…serve by giving them the opportunity to enjoy the lands that they help  protect.\n\nMadam Speaker, I support this bill, and I reserve the balance of my  time.                                           House of Representatives,                                        Committee on Agriculture,                                       Washington, DC, July 9, 2025.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…our Armed Forces, we can help end sea piracy and ensure the  safety of our merchant sailors. I support this legislation and reserve  the balance of my time.                                           House of Representatives,                                      Committee on the Judiciary,                                      Washington, DC, June 16, 2025.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…peace,  and first in the hearts of his countrymen.''\n\nI give my thanks also to Speaker Johnson and the Republican vice  chairman, Blake Moore, for allowing us to use this time on the House  floor.\n\nI encourage all of our citizens to participate in America's 250th  birthday in this year of 2026 as we celebrate on July Fourth the  signing and publication…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…bipartisan group of individuals who do have the  accurate oversight and clearances to watch it.\n\nNow, what is this really about? Politics? Maybe.\n\nDuring the junior Senator's time on the House Intelligence Committee,  then-President Obama had 500 strikes on terrorist organizations. Let's  keep in mind that we are striking terrorist organizations, and no one…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}]