[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…development and enhancement of the total       environment itself.\n\nThe Government's environmentally related activities have       grown up piecemeal over the years. The time has come to       organize them rationally and systematically. As a major step       in this direction, I am transmitting today two reorganization       plans: one to establish…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…room?  Does President Trump have any idea how much an emergency room bill  costs? I don't think so.\n\nIt is time for our Republican colleagues to do the right thing. It is  time to come together in a bipartisan way and listen to the American  people. Let's extend the Affordable Care Act tax credits, reverse the  Medicaid cuts, and lower costs for the American…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…on what you can make. There is a  cap on your salary.\n\nMr. Speaker, having been a contract employee and having done all of  that before I came here, I am so grateful every time I come across an  individual in the customer service industry who has really done a good  job. Paying them tips is the least that we can do to make sure that  they are honored…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…remote mental health and substance use services in  rural America, specifically for individuals working in the farming,  fishing, and forestry industries.\n\nMr. Speaker, it is time we come together to pass legislation that  will address our Nation's growing mental health crisis and provide  farmers and people in rural communities the care they deserve.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…because the men were away, fighting and  serving in battle. These are unbelievable and historic tales of bravery  that we should continue to share for a very, very long time to come.\n\nOf course, this period of time was also met with some social change,  progress, and pushing. Not all the Rosies went back to the home. My  mother's aunt, my great-aunt…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Veterans' Administration was a domestic terrorist.\n\nIf you are a Cabinet-level Secretary and you jump to that, you don't  understand our system. And, certainly, the one time she has come in  front of our committee--one time since she was confirmed--she didn't  seem to understand basic concepts, like habeas corpus.\n\nNow, she is not the only one who is…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Summerton, South Carolina, as Briggs v.  Elliott when a Federal  judge, Waties Waring, himself a great-grandson of a Confederate  soldier, Waties Waring decided that the time had come for us to put  that kind of process behind us, and he wrote the dissenting opinion in  Briggs v. Elliott that Earl Warren used to issue the majority opinion  in Brown v.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…incarcerated are far greater than college kids, who have drug usage  rates at about the same.\n\nSo now you say to somebody who has an arrest record and served some  time that when they come out, they can't get help? People with mental  illness are over-incarcerated. You are going to say to them ``You have  this mental illness. Now you have a record, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…years, the United States saved millions of lives with this  product, sourced entirely from U.S. farmers and factories, until the  Trump administration froze funding.\n\nThe time has come for that funding to be restored, as the  administration promised they would do, but have not delivered on.\n\nFor the 31st time, my message is simple: If you say you will…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693908/restore-food-aid-funding"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…legislation like  this that do absolutely nothing to protect our children.\n\nMr. Speaker, we know this cannot wait. I am just so sick and tired of  the tone deafness. Every time we come to the floor, my Republican  colleagues want to put forward a piece of legislation that fools the  American people into believing that we are really working on their  interests…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…is my dear friend and the person who  has really led this effort.\n\nMr. MORELLE. In closing, Madam Speaker, I thank the people who have  spoken here on an idea whose time has more than come. I think this is  the appropriate way, and particularly, as Ms. Houlahan says, in  recognition of our 250th anniversary upcoming, this will be the  appropriate way…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…supreme clause of the Constitution, is a dead letter--is a dead  letter.\n\nThat is the risk because there are very few wars that are planned so  far in advance that there is time to come and have a monthlong debate.  Wars happen quickly, and they necessitate quick action, according to  the Constitution.\n\nYes, we have always accepted that there has to be…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…is  why I have always supported a ban for elected officials and their  families, because exploiting inside information to enrich yourself  should never be allowed. It is time we come together to stop this  corruption and pass an immediate stock trading ban.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691226/stock-trading-ban-for-members-of-congress"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…their work.\n\nFinally, to my constituents, we will do anything and everything we  can to make sure a tragedy like this doesn't happen again.\n\nMr. Speaker, it will take a long time to come to terms with this  loss, but I know that our community is resilient. It has warmed my  heart to see how it came together for us in the aftermath of such an  awful tragedy.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688367/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is all over.\n\nYou cannot ignore the health insurance problem in America, as the  Republicans hope to do. That is what is driving this government  shutdown, and it is time for it to come to an end.\n\nI hope that President Trump, after last night's election results,  will see clearly that he is being blamed, rightly, for this shutdown  and that it has…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, every time I come on to this floor, I marvel  at the fact that I get the opportunity to serve here, but today it  means a lot more because 35 years ago as a page in this institution, my…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696847/serving-35-years-ago-as-a-page-on-the-house-floor"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…progress that we made when we did the Big Beautiful  Bill, which is truly--truly--a bill for hard-working Americans.\n\nSo I would encourage my colleagues across the aisle: It is time to  come to the table. It is time to pass the stopgap measure, the clean  CR. And I would remind my friends that since last year, they have voted  for these funding levels five…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…dark.\n\nYou have the Dakotas also having problems with flooding. So it is a  50-State problem. And in these States, there are many who don't have  flood insurance, and the time will come when they wish that they did.\n\nThe National Flood Insurance Program can provide certainty for  individuals and for their families. Maybe you  won't see flooding as extreme…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "John Thune", "party": "Republican", "sentence": "…extraordinary  lengths to bring an end to the bloodshed in Ukraine, and we here in the  Senate commend him for those efforts.\n\nNow the ball is in Putin's court. It is time for him to come to the  table in good faith and make a serious proposal for an immediate cease- fire that can lead to a just and lasting peace in Ukraine. I hope he  realizes it is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691644/ukraine"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…create the capacity so we can actually  have the more elegant debate of what should the distributional effects  be and where do we get the most economic growth from?\n\nThe next time I come back, let's actually do a bit of where the  economic growth can come from, and we will walk through the model of  expensing and those things.\n\nMr. SCHWEIKERT. Madam Chair,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…since the beginning of my journey here to D.C.\n\nEmma has served in my office and the constituents of Utah's Fourth  Congressional District for nearly 5 years.  During this time, I have come to rely on her sharp instincts, her keen  attention to detail, and her unwavering commitment to keeping my  constituents back home informed of the day-to-day effort here…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…before the House today is the  culmination, as the Chair was saying, of literally a decade's worth of  work, bipartisan work, I might add. The time has ripened and the time  has come for us to pass all of these.\n\nH.R. 3383 expands access to capital for small businesses, increases  investor opportunities for all, and strengthens our public markets.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…cooperation. However good the intentions, the result was to help fund  the oppression of the Iranian people and the export of terrorism  throughout the world.\n\nI believe the time has now come to provide the same assistance, not  to the oppressors of Iran, but to the people of Iran and the resistance  groups actively seeking their overthrow.\n\nThe overthrow…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of coming behind this microphone. The poor  staff here has to be just exhausted, but I am trying not to speak like  a machine gun anymore. I am trying to slow down.\n\nEvery time I come up here, the numbers are a little bit worse and  what is frustrating is, the economy is actually doing fairly well, but  it is the scale of the debt because we keep spending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…destroyed and  washed away.\n\nIt will take years, if not a decade, for western North Carolina to  fully recover from the damage inflicted by Hurricane Helene. Since that  time, while we have come a long way, western North Carolina is still  reeling from the effects of Hurricane Helene and will continue to feel  the effects of that storm for years to come.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…associate the temple with Utah's capital city. The  temple is built of native granite and took 40 years to complete, with  the goal to construct it so it would last throughout time.\n\nCome experience the spirit of this event with me.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698141/visiting-salt-lake-temple"}, {"senator": "French Hill", "party": "Republican", "sentence": "…not out of ignorance that I have come to the  conclusion that it is a bad idea. One of the contributing factors to my  determining that I don't believe it is an idea whose time has come, to  supplement private-sector innovation in this Nation, is actually  Congressman  Jim Himes' white paper that he shared with me years ago. I  thought it was well-written,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}]