[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…settling in Norwich  before making West Haven their home.\n\nSteve was born in New Haven in 1955 to Margaret and Robert Dargan,  Jr. He and his siblings--Robert Dargan, III, Timothy Dargan and Mary  Margaret Dargan--were raised by their hardworking parents in a  traditional Irish Catholic household on Richards Place in the center of  West Haven. Steve…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Republican colleagues in the Senate, were shown the door at her  demand; the two top officials at the National Security Agency,  including a well-respected four-star general, Timothy Haugh, forced  out, along with the Agency's general counsel, again at Loomer's behest.\n\nThese are critical posts in one of our most important intelligence  organizations,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the legacy and career  of Somersworth Police Chief Timothy J. McLin.\n\nAfter 33 years in law enforcement Chief McLin is embarking on a well- earned retirement. For more than three decades, he has served as a  member of Somersworth…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…many who  came to know her. May her name be honored forever. I thank the Speaker  for allowing me to enter her story into the Record.                      Honoring the Life of Timothy Haase\n\nMs. KAPTUR. Mr. Speaker, I rise to honor the life of Timothy Haase, a  devoted son, brother, caregiver, and the steady heart of Dino's Family  Restaurant in Maumee.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…spirit of civic engagement and community service that strengthens the  social fabric of our region.\n\nThis year's distinguished honorees are Linda Hill Anderson, Sandra  Atkins, Timothy G. Curtin, Barbara Effman, Helena Friedman, Susan  Gilbert, Juanita Gray, Mona Malbranche, Melinda Montgomery, Dr. Irving  Rosenbaum, Zeff Ross, Reverend Jesse Scipio, and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…something, to stand  up on behalf of the veterans who are going to be hurt by this one big,  ugly bill, devastated by this one big, ugly bill.\n\nWe also heard, Mr. Speaker, from Timothy, who I believe may have  written to us from the Commonwealth of Kentucky. He says: ``My name is  Timothy, and for the past 5 years, I have worked at the Department of  Housing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Take Robert Keith Parker, who wore a black hoodie  emblazoned with ``Camp Auschwitz'' on that horrific day.\n\nRobert Keith Parker was pardoned by President Trump.\n\nOr consider Timothy Hale-Cusanelli, whom prosecutors identified as a  ``white supremacist and Nazi sympathizer.'' He told his coworkers that  ``Hitler should have finished the job'' and frequently…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…None of Cliff's achievements would have been possible without the  love and support of his family, including his late wife of 50 years,  Sadie Jean Nix Rutledge, his son, Timothy Thomas; his granddaughter,  Clemitruis Hartley, and his niece and devoted caregiver, Decliffia  Coleman and a host of other relatives who loved him dearly.\n\nOn a personal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…regardless. I would say  that all of these disqualifications by themselves pale in comparison to  Mr. Martin's long and troubling relationship with a Hitler-loving neo- Nazi named Timothy Hale-Cusanelli, who was sentenced to 4 years in  prison for breaching the Capitol during the January 6 attack.\n\nHale-Cusanelli is an outspoken anti-Semite who proudly wears…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in the newer generations don't understand  what Russia is capable of, so I refer them to two books if they are  interested, and I hope they are. One is ``Bloodlands'' by Dr. Timothy  Snyder, now at Yale University, who discusses the history of the region  that we are talking about and what happened yesterday at the United  Nations. Another book is ``Red…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise today to urge all of us to demand  mental health parity enforcement in honor of a young man that I once  represented, Timothy O'Clair.\n\nI first met Timothy when I served in the State Assembly in New York.  Timothy played Little League and had a smile and spirit that burned  incredibly bright. He…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Legal Services       Center; The Law Office of Brett E Marston; The Law Office of       Elliot P. Forhan; The Law Office of Leslie A. Butler, PLLC;       The Law Office of Timothy J. Deffet; The Price Law Firm; The       Public Interest Law Project; The Right to Immigration       Institute; The Shattuck Law Office LLC; Third Act Lawyers;       Towards…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…done without  warning and without consulting Congress.\n\nThen in April, at the beck and call of a far-right, online opinion  influencer, President Trump fired four-star General Timothy Haugh  without warning from his position leading our military cyber forces.  General Haugh--get ready for this--served our Nation honorably with  distinction for 34 years.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to faith and teamwork from a young age.\n\nIn 1982, he married Stacy, his lifelong partner, and together they  built a beautiful life, raising three wonderful sons, Patrick, Timothy,  and David.\n\nJoe earned a business degree from Augusta University and had a  distinguished career in hospitality and real estate. He worked at  Augusta National Golf Club,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Jr., Daniel Cutler, Douglas Davenport, Steven  Davison, Eugene Dorsey, George Dowell, Jerry Downie, Joseph Eddins,  Richard Edens, Rodney Ellner, Bryan Ericson, Daryl Frank, Timothy  Fulton, John Goodman, Michael Graff, Lester Greene, Duane Hahn, Gary  Hausman, James Hawkins, David Hedgpeth, Joseph Heide, Jr., Larry Hobbs,  James Hoefer, David Holm, George…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…standing up for women, for  declaring that there are two sexes, that we were created by God, and  that we need God's help.\n\nMr. Speaker, I urge our country, as it says in 1 Timothy, to pray for  those who are in authority. To every child in America, we agree with  President Trump. They are perfect exactly the way God created them.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…recognize an exceptional man  who recently celebrated 30 years of dedicated service to Waupaca County  and the citizens of northeast Wisconsin.\n\nLast week, Waupaca County Sheriff Timothy Wilz reached a milestone of  three decades of service in law enforcement. From his time as a jailer  and dispatcher to his current role as sheriff, Timothy Wilz's  dedication…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691410/recognizing-sheriff-timothy-wilz"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…honors in the  village cemetery.\n\nOriginally called Orangetown, after the river that powered the  sawmills, the town was renamed Whiting upon its incorporation in 1825  after Timothy Whiting, an early settler and the town's first  representative to the Maine Legislature.\n\nToday, Whiting is a nature lover's paradise of gorgeous scenery and  year-round outdoor…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…his community, which he has  done faithfully for the past 56 years.\n\nIn 1961, he married Dorothy Neal, and the two of them welcomed four  children, Paula, Cynthia, James, and Timothy, seven grandchildren, and  one great-grandchild.\n\nThis year, Elder Childs was rightfully promoted to superintendent,  and he will continue to serve the Kingston community…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Associated Press; Capps, Kriston:       Bloomberg News; Caralle, Katelyn: DailyMail.com; Carey,       Dominic: Bloomberg News; Carey, Mary Agnes: KFF Health News;       Carney, Timothy: Washington Examiner; Carroll, Conn:       Washington Examiner; Carter, Charlene: CQ Roll Call; Cason,       James: La Jornada; Castillo, Andrea: Los Angeles Times;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Caldwell, Traci:       NEXSTAR MEDIA GROUP; Caldwell, Zelda: EWTN.\n\nCaleb, Dwain: CNN; Calvo, Jr., Thomas: NEW TANG DYNASTY TV;       Camah, Malik: REUTERS RADIO & TV; Camarda, Timothy: NBC NEWS;       Cameron, Alexander: GRIFFIN COMMUNICATIONS; Campbell, David:       VIEWPOINT COMMUNICATIONS; Campos, Krystal: POLITICO.COM;       Canals, Sara: CADENA SER;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…commitment to excellence that define championship-winning programs. If  the State of Alabama knows anything, we know what it means to win a  championship.\n\nCongratulations to Coach Timothy Junkins, MVP Landon Archer, and the  entire team on a fantastic season. They have made their school and  entire community proud. I couldn't be more excited to join them in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Borawski, Deputy Chief Paul       Wren, Battalion Chief Casey Lambert, Lieutenant Mike       Hamilton, Engineer Derek Parker, Firefighter Jared       Hoopingarner, Lieutenant Timothy Bedell, Firefighter Tony       Mroz, Firefighter Nicholas Miller, Lieutenant Steve Ryckman,       Firefighter Kyle Lamson (2), Firefighter Jason Burnside, and       Engineer…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Sergeant Major Timothy Babcock, a proud veteran of the  United States Marine Corps and our distinguished Veteran of the Month  for August 2025 from Michigan's 9th Congressional District. His  exceptional…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Group; Cai, Sophia:       Politico.\n\nCalabresi, Massimo: Time Magazine; Calabro, Elaina:       Atlantic Monthly; Caldwell, Leigh: Puck; Caldwell, Patrick:       Politico; Cama, Timothy: E&E News; Camacho, Francisco: E&E       News; Carballo, Rebecca: Politico; Carey, William: Aviation       Week; Carney, Jordain: Politico; Casper, Jericho: Broadband…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Frank Jones;  John Foggia);\n\nMid-Atlantic Aviation Partnership (MAAP) at Virginia Tech, an  official FAA-designated UAS test site (including director, Jon Greene;  president, Timothy D. Sands);\n\nVirginia Center for Innovative Technology, which facilitated public- private collaboration and integration;\n\nAppalachian College of Pharmacy, which played a key…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…of drug addiction  throughout Wisconsin following the loss of her son Archie to a fentanyl  overdose.\n\nMr. Speaker, I personally recognize the work of Lauri, as well as Dr.  Timothy Westlake of Waukesha, Wisconsin, for spearheading legislation  in the Wisconsin State Legislature that culminated in the bill being  debated before us today.\n\nSince 2017,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Elizabeth Compton, Prosper TX; Bryce Tanner Denton,       Anna TX; Corbin Benzi Glass, Parker TX; Garrett Christopher       Hutchins, Lucas TX; Luke Tyler Phillips, McKinney TX; Timothy       Hunjae Seo, McKinney TX.                         u.s. merchant marine academy\n\nJack Quinlin Flannery, McKinney TX.                u.s. military academy civil preparatory…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}]