[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Madam Speaker, I rise today to honor the life and  legacy of David DePetrillo, a tireless champion for Rhode Island.\n\nFor over three decades as our State's tourism director, David made it  his mission to showcase the best of Rhode Island, including our  historic…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…allowing the Internet Archive to digitize and expand public access to  Federal Government publications for years to come.\n\nFor their outstanding commitment to the public good and tireless  preservation of public information, today we celebrate San Francisco's  own Internet Archive. Here is to the next trillion.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the vibrant African-American community in  the Bronx and Westchester County have had a tireless advocate on their  side for decades, the NAACP, fighting for reform and social progress,  the rights of residents who want a fair shot in life and a better today  and tomorrow…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, with admiration and appreciation, I wish to  recognize the 100th anniversary of the Rhode Island State Police. For a  century, these tireless men and women in uniform have traveled the  highways and byways of our state to ensure the safety of our  communities. They have lived up to their creed of honor, integrity,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…students are the key to a good public education.\n\nI congratulate Tracy on earning Teacher of the Year, and I thank the  thousands of teachers across Orange County for their tireless work for  lifting up future generations.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690842/teacher-appreciation-week"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…following a career of more than  thirty years as the Chief Financial Officer for Janicki family  businesses.\n\nDuring her eleven years in office, Commissioner Janicki has been a  tireless leader in fighting the opioid epidemic across our communities  and Washington state, advocating for policy solutions, programs and  investments to end this scourge and repair…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…inequities suffered by rural communities, minorities, women,  the poor, and the disabled. These programs represent America at its  best, acknowledging our Nation's shortcomings and tireless work to  overcome them.\n\nThe ratification of the 14th Amendment in 1868 codified equal  protection as a constitutional principle. Yet, Americans soon  discovered that simply…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…for his exemplary personal and professional accomplishments  as he begins his next chapter of life, enjoying retirement. An  experienced leader, dedicated professional, and tireless advocate,  Gerard serves as a prime example of a true public servant, and most  importantly, a kind, caring, and genuine human being.\n\nA Kansas City, Missouri, native, Gerald…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of Senior Pastor Reverend Charles Ricks,  Jr., and Pastor Lori Ricks, Bethel Temple continues to embody faith in  action. Through partnerships with local organizations and tireless  service for the Hampton community during the COVID-19 pandemic, they  have strengthened the church's legacy of compassion and service.\n\nMr. Speaker, as they mark this milestone,…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…additional transparency of board meetings of the  Tennessee Valley Authority.\n\nI thank Representatives Cohen and Burchett of Tennessee for their  leadership on this bill and their tireless work to improve the TVA.\n\nTVA is the Nation's largest government-owned wholesale power  producer, supplying power to 10 million people across the States of  Tennessee, Mississippi,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692214/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…reaffirm the strong bonds  between the United States and the Ecumenical Patriarchate.\n\nIt is my honor to welcome His All-Holiness to our Nation's capital  and to recognize his tireless efforts in promoting peace, human  dignity, and spiritual leadership across the globe.\n\nI ask my colleagues to join me in honoring this important visit and  in celebrating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…George Glezmann home from more than 2 years of wrongful  detention by the Taliban in Afghanistan.\n\nGeorge is home with his family in Atlanta in large part because of  the tireless efforts of his wife Aleksandra. A devoted Delta airplane  mechanic, George has an infectious zeal for life, travel, and  experience, and I know he is eager to return to a…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691683/welcoming-george-glezmann-home-to-georgias-5th-congressional-district"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…I am hopeful that together  we can make this country safer and healthier.\n\nMr. Speaker, I extend my heartfelt thanks to Adina and her family for  her deep dedication, her tireless advocacy, and for all she is doing  for millions of Americans with allergies to make their lives safer.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692132/recognizing-adina-togal"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…corporate office in El Segundo, California, which brought L'Oreal's  west coast brands under one roof for the first time.\n\nBeyond her professional achievements, Carol has been a tireless  champion for women's empowerment and philanthropic causes. In 2009, she  spearheaded the Armani Acqua for Life program with UNICEF and  subsequently joined both the National…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…I thank the Pancreatic  Cancer Action Network, the American Cancer Society, and all of the more  than 500 stakeholders for all of their efforts. I am so grateful for  the tireless work of our cancer advocates. Without them, this bill  would not enjoy such broad bipartisan support.\n\nAs we wear purple today in honor of World Pancreatic Cancer Day, I…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Diamonds foundation in 1977, THON has  ensured that not a single Four Diamonds family going through cancer  treatment has received a medical bill, thanks in large part to the  tireless efforts of Penn State students.\n\nThe foundation itself was born from heartbreak and hope. Charles and  Irma Millard established Four Diamonds in 1972 in honor of their son,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that  have been limited because of this lapse in funding.\n\nI thank all of my colleagues on both sides of the aisle here today  and in the committees of jurisdiction for their tireless efforts in  overcoming the inertia of this institution and getting this bill to the  floor for a vote today.\n\nI look forward to it passing in a resounding bipartisan way and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697664/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…approach, and deep  commitment to student growth.\n\nIn her teaching style, Dr. Sandfort emphasizes collaboration,  relationships, and the transformative power of learning. Her tireless  devotion to her role has made a meaningful impact in the lives and  learning outcomes of her students. Not only does she empower her  students academically, but she also…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Colonel Shames continued serving our Nation,  eventually retiring as a colonel, and later made Virginia Beach his  home, where he became a dedicated community member and a tireless  advocate for veterans.\n\nAs the last surviving officer of Easy Company, Colonel Shames  represented the very best of the Greatest Generation. Naming this post  office in his…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…has given thousands of hours of volunteer service,  never asking for recognition or reward. Her work has been marked by  passion, humility, and humor. Through her vigor and tireless spirit,  she has shown us all what it means to serve faithfully.\n\nCam embodies the very best of what it means to be a Patriot, someone  who works not for personal gain, but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…recognize Dr. Hagir Elsheikh as a courageous leader,  international diplomat, and philanthropist for her exceptional service  to the Citizens of Pennsylvania, and for her tireless efforts to build  love and compassion into every sector she touches, from healthcare to  charity. Her life stands as a model of resilience, passion, and public  service.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…challenges, grow our economy, and serve our communities.\n\nIt was always a pleasure to run into Wendy on the early morning  flight from Des Moines to D.C., where she has been a tireless advocate  for the Cyclones and for our state's land-grant mission. It's been an  honor to work alongside her and an even greater honor to call her a  friend.\n\nMr. Speaker,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…legislators in Brooklyn Park and Champlin,       Minnesota on June 14, 2025;\n\n(2) honors the life of Speaker Emerita Melissa Hortman for       her devotion to public service and her tireless efforts to       serve the people of Minnesota, and the life of her husband,       Mark Hortman;\n\n(3) honors Senator John Hoffman and his wife, Yvette       Hoffman, who were…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker. I rise today to honor and recognize the  life of Walt Hartnett, a devoted Army Veteran, tireless advocate, and  passionate supporter of Veterans' rights. Walt's unwavering dedication  to serving his fellow Veterans and his community left an indelible mark  on all those…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…penalties for those who assault  or injure these animals in the line of duty.\n\nI am proud to champion the Leo K9 Protection Act alongside the  dedicated team at K9s United, whose tireless advocacy ensures that our  service animals are treated not just as tools but as heroes.\n\nUnder my legislation, the Federal penalty will be up to 15 years when  someone uses…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…along with Superintendent of Schools,  Dr. Jose Dotres, Miami-Dade has once again earned an A rating, the  largest district in Florida to do so.\n\nThis success reflects the tireless work of our students, parents,  teachers, administrators, and the entire workforce, and it remains a  source of pride for our community.\n\nIn 2025, 99 percent of Miami-Dade…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…example of community in action and the power of people  coming together for a greater purpose. At the center of it all is Shawn  Woodruff, a humble and passionate leader whose tireless efforts and  deep compassion inspire everyone around her. She coordinates logistics,  builds relationships, and ensures every person served is treated with  dignity and grace.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize and  express my sincere gratitude to my former Director of Operations, Kathy  Zhu of Kissimmee, Florida, for her exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Over the years, Kathy proved to be an  invaluable asset to my office, where her…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Fame  in 2025, which speaks broadly to his leadership abilities and legacy.\n\nMr. Speaker, I am honored and privileged to recognize Chairman  Jonathan Holmes for his selfless, tireless, and dedicated service to  the Citizens of Jackson Township, York County, Pennsylvania. His  leadership, professionalism, and fidelity will be greatly missed, and  his service…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…Throughout her tenure, Ms. Krzysiak has demonstrated a commitment to  public service and to the residents of Crawford County. Her extensive  knowledge, attention to detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}]