[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The term ``firearm'' is the meaning  given that term in section 921(a) of Title 18, excluding any machine  gun.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "SAMHSA and most of its       programs and activities are authorized under Title V of the       Public Health Service Act (PHSA), of which the Energy and       Commerce Committee has sole jurisdiction.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "SHORT TITLE.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2026-02-10"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, today, I introduce the District of Columbia  Government Title Equality Act.", "title": "Introduction of the District of Columbia Government Title Equality Act", "date": "2025-10-28"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "A speech language pathologist at a title I school told me that most  of her students are on Medicaid.", "title": "Medicaid is A Lifeline", "date": "2025-05-06"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "``We       all still love our country without a doubt.'' Sanders is now       preparing to submit all the necessary evidence to the       Guinness Book of World Records, including GPS data, photos,       and witness accounts, in hopes of officially claiming the       title as the oldest man to bike across America.", "title": "Recognizing Mr. Bob Sanders for Cycling Across the United States", "date": "2025-05-15"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "Speaker, I rise today to congratulate the Lincoln  High School football team on winning their second State title in 3  years.", "title": "Congratulating Lincoln High School Football Team", "date": "2025-03-06"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "JoAnne began her career in Ohio, where she served in Title 1 schools  as a Primary Language Development Specialist and later as a Library  Media Specialist.", "title": "The Year", "date": "2025-12-12"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "It is this kind of leadership that  earned Scott the title ``Coach of the Year'' and a place in the  California Coaches Hall of Fame.", "title": "Recognizing Scott Glabb", "date": "2025-06-04"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "His formal office is Archbishop of Constantinople-New  Rome and Ecumenical Patriarch, a historic title dating to the sixth  century.", "title": "Welcoming His All-Holiness Bartholomew I, Ecumenical Patriarch of Constantinople", "date": null}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "4553 to the       Committee on Appropriations with the following amendment:\n\nAt the appropriate place in title V, insert the following:\n\nSec.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "24, providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Department of Energy relating to ``Energy Conservation  Program: Energy Conservation Standards for Walk-In Coolers and Walk-In  Freezers.''\n\nHad I been present, I would have voted: NAY on Roll Call vote no.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''", "date": "2025-03-27"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "By saying somehow that people  aren't going to be adversely impacted by the cuts in nutrition, I don't  think you understand the nutrition title if that is what you believe.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "You, sir, by your behavior, by your  actions, by your words, by your deeds, you, sir, should not hold the  title President of the United States of America, and you should be  removed.", "title": "Liberty and Justice for All", "date": "2025-12-12"}, {"senator": "French Hill", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Aligning Sec Regulations for the World Bank's International Development Association Act", "date": "2025-07-21"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "105) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``North Dakota  Field Office Record of Decision and Approved Resource Management  Plan'', and ask for its immediate consideration in the House.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "The championship team from Gadsden, Alabama, is led by Coach Rush  Propst and is the school's first football state title.", "title": "Recognizing Coosa Christian School for Winning the Ahsaa Class 2A State Championship in Football", "date": "2025-12-11"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "William Timmons", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Strengthening Agency Management and Oversight of Software Assets Act", "date": "2025-12-15"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "International Traffic in Arms Regulations Licensing Reform Act", "date": null}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Celebrating Lord Botetourt High School's 2025 VHSL Title Victory\n\nMr.", "title": "Recognizing the 75th Anniversary of James Wood High School", "date": "2025-05-21"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}, {"senator": "Roger Williams", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Extension of Sbir and Sttr Authority", "date": null}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Law Enforcement Officer and Firefighter Recreation Pass Act", "date": "2025-07-21"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to recognize a  Georgia town that has earned itself an unusual title, Cordele, Georgia.", "title": "Cordele Watermelon", "date": null}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Even though Arkansas came up short  of the program's first national title, Thomas' relentless hitting in  clutch moments stood out.", "title": "Fletc Celebrates 55 Year Anniversary", "date": "2025-06-26"}, {"senator": "John Rose", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Homebuyers Privacy Protection Act", "date": "2025-06-23"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "The Clerk read the title of the bill.", "title": "Tipped Employee Protection Act", "date": "2026-01-13"}]