[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I commend Representatives Stauber and Cisneros for their  work to bring this important bipartisan legislation to the floor today.\n\nMr. Speaker, Congress and the executive branch have carefully crafted  fair and deliberate policies to ensure that small businesses can  compete for Federal contracts.\n\nThese…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…files. We  believe in accountability for everybody who abuses young women. We  believe in justice. That is kind of what is uniting many of us on this  side of the aisle here today.\n\nMr. Speaker, I thank Representative Khanna for his leadership. I  thank Representative Massie, Representative Greene, and Representative  Mace for their courage and for their…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Uyghurs.\n\nI hope that this bill augurs a return to Senator Rubio, rather than  what is a disheartening and nonstrategic policy that we have seen from  the State Department today.\n\nMr. Speaker, I strongly support this legislation and encourage my  colleagues to do so, as well, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Program to recruit and retain more small firms strengthens the entire  industrial base, promotes competition, and drives innovation.\n\nMr. Speaker, passing this bill today will do that.\n\nMr. McGARVEY.  Velazquez), the distinguished ranking member of the Small  Business Committee.\n\nMr. Speaker, I thank the gentleman from New York (Mr. LaLota) and the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691800/wosb-accountability-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I thank my colleague, the gentlewoman from  Illinois (Mrs. Ramirez), for her incredible leadership and holding us  together today.\n\nMr. Speaker, I rise today to make one thing clear: Trump's cruel  immigration agenda is not about public safety. It is about intimidation  and cruelty. The people of Oregon…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…that this  administration has demonstrated since January.\n\nThey have failed to follow the law, and we cannot trust that they  will even execute this bill if we vote on it today.\n\nMr. BISHOP. They cut SNAP by 20 percent in the big, ugly bill this  summer, dismantled and defunded Federal programs, fired Federal  workers, and illegally ignored court orders.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…innocent  Palestinian men, women, and especially children.\n\nThis level of injustice is something that this country has always  stood against, but we find ourselves today standing with Mr. Netanyahu  and the government that is bringing shame to the country of Israel.  Israel should never do what it despises. I believe that the country of  Israel would…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…could be making contributions to end hunger globally,  decides that we should be cutting program services for working  families, many of which my colleagues will talk about today.\n\nMr. Speaker, as we stand here today in the people's House, I want to  be very clear about something. I will not betray working families by  supporting a budget that harms working…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Students  Association, Editor of The African American Law School Survival Guide,  Chair of the Thurgood Marshall Trial Practice Team, and served as a  Star Mentor to his peers.\n\nToday, Mr. Younger is a respected attorney based in Jackson,  Mississippi. His primary areas of legal practice include medical  malpractice defense, motor vehicle defense, nursing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Kirk Resolution and Political Violence\n\nMr. GREEN of Texas. I bid the gentlewoman a good day, and we will  proceed now, Mr. Speaker, again.\n\nAnd still I rise.\n\nAnd I rise today, Mr. Speaker, with the notion in mind that what I  have stood for I still stand for. What I have stood for I still stand  for. It wasn't that long ago, Mr. Speaker, that I stood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…profoundly said: ``Of all the forms of inequality,  injustice in health is the most shocking and inhumane because it often  results in physical death.'' His words still ring true today.\n\nMr. Speaker, healthcare isn't a nice-to-have. It is a fundamental  human right. It is a matter of life and death.\n\nMr. Speaker, I urge my colleagues to do right by the people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…always get a lot of attention but that matter so much to the people  they protect, you will come to the same conclusion, Mr. Speaker, that  we have.\n\nIf you work in America today, Mr. Speaker, you are less safe than you  were 1 year ago, and you are more likely to be underpaid, exploited,  and ignored. You are more likely to be hurt on the job, Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…harder for this workforce, as  probationary employees have been fired and TSOs' collective bargaining  rights have also come under attack.\n\nThankfully, we have the opportunity today, Mr. Speaker, to make life  a bit easier for the hardworking civil servants of TSA.\n\nThe TSA Commuting Fairness Act, offered by my colleagues from New  York, Mr. Kennedy and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…work together, and Mr. Barr and I worked together  on several issues in this Congress. Both sides worked in good faith to  get this bill done last Congress and again here today.\n\nMr. Speaker, I encourage my colleagues to support this measure, and I  reserve the balance of my time.\n\nAs I have indicated, I support this bill because sanctions have a  role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…longer are we going to continue to supplement, subsidize, and  let other countries take advantage of the American people.\n\nSo I applaud the President today.                                  The Budget\n\nMr. STUTZMAN. Mr. Speaker, I want to talk about our budget. We here  in Congress have a greater opportunity and a responsibility to be sure  that we move…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "French Hill", "party": "Republican", "sentence": "…hurt by the lack of a  regulatory framework. I have to say, Mr. Speaker, in total contrast to  my friends on the other side of the aisle, that is what we are all here  for today.\n\nMr. Speaker, I appreciate your continuing reminder to the Members in  the Chamber to refrain from engaging  in personalities. Yet it has routinely become a part of our morning,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…have more affordability.\n\nMr. Speaker, no, he did not ask to do this bill on the floor today. I  know the President is very interested in this issue, but not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…is relevant to also note that last Congress this bill came  before us, and 52 of our Democratic colleagues voted with every  Republican in the House. It will be interesting today, Mr. Speaker, to  see how many of my colleagues across the aisle have the courage to  stand up and to say that U.S. elections should be for U.S. citizens  only.\n\nThe big difference…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…toward lowering beneficiaries' out- of-pocket costs, which in turn lowers premiums for Americans who are on  the so-called Affordable Care Act, again, by roughly 11 percent.\n\nToday, Mr. Speaker, you will hear my friends and colleagues on the  other side, the Democrats, tell you this plan is not meaningful and  that the only way to help individuals is to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…judges, lawyers, public defenders, bailiffs, and other folks  do you need to actually have 10 million court cases in their version of  due process?\n\nAs our lead prosecutor today, Mr. Knott, will tell us: The law is  simple. If you came here illegally, then the only thing you are allowed  is a ticket out of here.\n\nLet's be honest about immigration. This…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…people behind the counter or  taking your table order who truly make these businesses landmarks in  our communities. We all have them.\n\nThe bill I stand here in support of today, Mr. Speaker, is about  protecting these workers. Restaurants, most of which are small  businesses, operate on very thin margins. The tip credit system is the  foundation on…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…logical legislation that supports our students and our economy. This  bill passed the House in the 117th and 118th Congresses, and I urge my  colleagues to pass it again today.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as teachers prepare the next generation of American STEM  workers, we must invest…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…We agree on the need for additional training. There  is lots we can find in common as we try to work through this, and I  hope we are able to do that.\n\nThe important thing today, Mr. Speaker, is to finish the task, to  take these bills, which represent the vast majority of things where we  have found common ground and agreement in a process of give and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…represent our constituents, and we are supposed to express  on their behalf our views consistent with the Constitution in our  republican form of government.\n\nI am here today to do that.\n\nMr. Speaker, I am here to talk about what has been known now as the  One Big Beautiful Bill Act which is, in simple speak, a reconciliation  package which is supposed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…tax  credits that they made temporary because they decided to make permanent  tax benefits for wealthy environmentalists who support them. That is  why we are where we are today.\n\nMr. Speaker, since ObamaCare has passed, we have seen 150-plus  hospitals close their doors. Since ObamaCare has passed, we have seen  premiums go up more than 80 percent. It…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Act. That is  another product brought to us by Democrat-only votes. The Inflation  Reduction Act ushered in the inflation under Joe Biden that we are  still trying to shake today.\n\nMr. Speaker, since the Affordable Care Act started, Americans have  seen over 80 percent increases in their healthcare costs because of a  bill created by Democrats that they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I thank Representative Gill for yielding time  today.\n\nMr. Speaker, I was proud to vote in favor of the Working Families Tax  Cut Act to deliver tax relief to millions of Americans that included no  tax on tips, no tax on overtime,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699677/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…talking pictures would be all the rage. In this very Chamber,  the House voted to send the 19th Amendment, giving women the right to  vote, to the States for ratification.\n\nToday, Mr. Speaker, I rise to celebrate the 106th birthday of someone  born that year, an American hero named Hazel Womble of Jacksonville,  Florida, who is today one of our Nation's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…critical mental health care. Additionally, this bill will  strengthen the FAA's hiring of medical examiners to help clear the  backlog of special issuance requests.\n\nAs you heard today, Mr. Speaker, this bill will keep pilots flying,  air traffic controllers working, and airspace safe while getting people  the help that they need.\n\nMr. Speaker, I urge support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}]