[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to recognize the outstanding  achievements of the Next Level Community Development Center, a  community nonprofit organization driven by its mission to foster  academic achievement, college…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…military service and his  exemplary public service to our students and schools.                         Recognizing Penny Stevenson\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize an outstanding  community member, veteran, and leader in California's 31st District in  the city of San Dimas.\n\nPenny Stevenson is the board president of the San Dimas H.E.R.O.E.S.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize the outstanding  contributions of the physicians at Dallas Endoscopy Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…energetic members who show  that age is more than just a state of mind.                     Recognizing Bronx Community Board 10\n\nMr. LATIMER. Mr. Speaker, I rise today to recognize the outstanding  work of the residents of the Bronx who labor tirelessly on behalf of  their neighborhood, active in Bronx Community Board 10. Most of the  area is represented…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to recognize the outstanding  achievements of the Albany Young Marines of Albany, Georgia, who have  been named the National Young Marine Unit of the Year. The group  received this well-earned…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today to recognize the outstanding  efforts made by one of my own constituents, Ms. Abby Lachman. Ms.  Lachman, who was diagnosed with Type 1 diabetes at age 6, recently  visited Washington, D.C.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize an outstanding  organization in Texas' 30th Congressional District, It's About the Kids  Mentor Program, a community organization committed to empowering  families and youth…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today to recognize the outstanding  efforts made by one of my own constituents, Mr. Bob Sanders. Mr.  Sanders' feat of cycling across the continental United States at the  age of 85 is a true accomplishment.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Sue Simone has made to our community through her  volunteerism at HPH Hospice. HPH Hospice services Hernando, Citrus, and  Pasco Counties.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding member of our community, Executive Director of the  Association of Asian Pacific Community Health Organizations Jeffrey B.  Caballero, MPH, who has received the…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Joan Moore has made through her work with Gulfside  Healthcare Services. Since February 2022, Joan Moore has touched the  lives of over 10,000…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Daniel Flores has made to our community through his  work with New Beginnings Youth Shelter, which serves homeless kids aged  10-17 who are…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690224/recognizing-daniel-flores"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  two outstanding students from West Shamokin Junior-Senior High School,  Aybrah Zelenski and Elena Gourley, who earned top national honors at  the Future Business Leaders of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693666/recognizing-aybrah-zelenski-and-elena-gourley"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Teresa Piechowicz has made to our community as a  volunteer with the Hernando County Family YMCA. The Hernando County  Family YMCA is more…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Lesa Burnham has made through her work with the  CARES Senior Clinic. Lesa is a tireless volunteer, eager to assist with  all clinic needs.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691080/recognizing-lesa-burnham"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Patricia Schneider has made to our community  through her volunteerism with the Pregnancy & Family Life Center. Ms.  Schneider is part…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Kyle Smith has made through his work with the Pasco  County Human Services Team. The Pasco County Human Services Team has  proven itself to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the outstanding achievements of the PennWest Clarion Small Business  Development Center, which was recently honored at the 2025 Pennsylvania  SBDC Growth Conference.\n\nNot only…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Hugh Townsend has made as a volunteer with the  Board of Hunter's Ridge Homeowner's Association. Over the past 30  years, Hugh has worked…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692162/recognizing-hugh-townsend"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Kimberly Godding Brooks has made to our  community through her volunteerism. Since 2008, 17 years, Kimberly  Godding Brooks has volunteered…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jordan French has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Mr. EMMER. Mr. Speaker, I rise today to recognize an outstanding  public servant from my district, Carver Fire Chief Cally Trimbo. Chief  Trimbo retired earlier this year after 22 years of service to the City  of Carver and…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Danielle Bierman has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}]