[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Speaker, one of the most important and critical  responsibilities any nation has, any community has, any State has, is  the education of its children.\n\nMr. Speaker, I rise today to highlight the extraordinary work of an  organization from Los Angeles that has lessons for every community in  America.\n\nNearly two decades ago, then-Mayor Antonio Villaraigosa…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker. I rise today to highlight the rising danger  posed by the unchecked expansion of global nuclear arsenals. As we mark  80 years since the Trinity test, we must confront the urgent need to  reverse…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise today to highlight the growing  mental health care crisis in rural America.\n\nNearly one in five adults live with a mental illness, yet rural  communities lack the providers, facilities,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696908/rural-mental-healthcare"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to highlight this  administration's lies to the American people about Social Security.\n\nOn the campaign trail, President Trump promised to protect your hard- earned Social Security…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…veterans--courage in war, compassion in peace, and service that never  ends.\n\nrecognizing 75th anniversary of orange county water district\n\nMr. CORREA. Mr. Speaker, I rise today to highlight the 75th  anniversary of the Municipal Water District of Orange County. For 75  years, MWDOC has been our county's water supplier.\n\nIn Orange County, they have been critical…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…epidemiologist. After residency, I       trained for 2 years at the CDC and then worked in Washington,       D.C., at an NGO and the D.C. Health Department.\n\nI am here today to highlight the impact of recent policies       and actions on scientific institutions and how that impacts       us in Michigan.\n\nOur scientific institutions are being attacked…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, September is National Suicide Prevention  Month. That is why I rise today to highlight the urgent need to support  the mental well-being of our rural communities.\n\nThe suicide rates among farmers, ranchers, and agricultural managers  stand at nearly 44…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Madison, and we look forward to seeing  all the great things that she does.                        U.S. Embassy Visa Uncertainty\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to highlight a concern I  have heard from many constituents about the delays and uncertainty in  the visa process at U.S. Embassies, particularly in Islamabad.\n\nFamilies in my district…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…at success, a vision  of a level playing field on which they can prosper and have the support  to rise as far as they could and as far as they would want.\n\nWe are here today to highlight our vision and to show the American  people that there is a disconnect between what the Republicans want and  are actually doing and what American families really need.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Madam Speaker, I rise today to highlight a bipartisan  resolution introduced alongside my northwest Ohio colleague,  Bob  Latta. It proclaims May 9 to May 18, 2025, as National American Birding  Week.\n\nEach…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…all the best and thanks her for her  years of community service and creativity.                         Recognizing Dreams of Faith\n\nMs. McBRIDE. Mr. Speaker, I rise today to highlight the voices of my  Delaware constituents, Dwain and Karen Johnson, who turned the  unimaginable loss of their daughter, Faith Deanna Johnson, into  lifesaving advocacy…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "Mr. MOSKOWITZ. Mr. Speaker, I along with my colleagues,  Representative Wasserman Schultz and Representative Cherfilus-McCormick  rise today to highlight and celebrate the 2025 Honorees of the Senior  Hall of Fame, an esteemed tradition made possible through the tireless  efforts of the Area Agency on Aging of Broward…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Madam Speaker, I rise today to highlight my young  neighbor, Kendall Pierson, who just graduated summa cum laude, which  means really good grades, from Mater Dei High School in Santa Ana.\n\nKendall was a member…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to highlight a  remarkable act of kindness happening right here in the State of  Georgia.\n\nGeorgia Tech faculty and staff opened their homes to students who  could not travel home…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697596/georgia-tech-thanksgiving"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Representative Kennedy for  yielding and for leading this important Special Order tonight to talk  about all the wins in the One Big Beautiful Bill Act.\n\nMr. Speaker, I rise today to highlight an important promise President  Trump made to the American people that the one big, beautiful bill  fulfills.\n\nThe One Big Beautiful Bill Act delivers a long list of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Mr. President, I want to start by thanking my friend from  Utah Senator Lee, the chairman of the committee of jurisdiction for  hosting this unanimous consent request today to highlight the  importance of many pieces of legislation but including the Big Bend  National Park Boundary Adjustment Act.\n\nIt is no secret that Texas is home to a lot of wide-open…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691670/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "Mr. CRANE. Mr. Speaker, I rise today to highlight Colorado as a top  producer of Olympians representing Team USA at the 2026 Olympic Winter  Games in Milano Cortina.\n\nColorado's Fifth Congressional District is known…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699727/recognizing-olympians-from-colorado"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to highlight the work of Mr.  Jeff Mittman and congratulate him on his appointment by President Trump  to serve as a member of the U.S. AbilityOne Commission.\n\nMr. Mittman served…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695725/highlighting-the-work-of-jeff-mittman"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to highlight The Flying W  Wranglers band, who are part of The Flying W Wranglers Original Western  Stage Show at the Flying W Ranch in Colorado Springs. Flying W Ranch  was opened…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Madam Speaker, I thank the chairwoman for her  leadership.\n\nMadam Speaker, I rise today to highlight the many ways that Texans,  hardworking families, and small business owners across America are  benefiting from the One Big Beautiful Bill Act.\n\nThis is one of the most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today to highlight the national  security investments in the One Big Beautiful Bill Act, investments  that reaffirm President Trump's commitment to peace through strength.\n\nThis bill delivers…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to highlight  the Pennsylvania Farm Show which kicked off this past weekend.\n\nFor 110 years, farmers have met each January at the Farm Show in  Harrisburg, Pennsylvania. The event…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to highlight  the student-run cafe at Clearfield County Career & Technology Center.  The cafe opened last week and gives students the opportunity to serve  food to their peers.\n\nThe…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699201/highlighting-student-run-cafe-at-clearfield-county-career-and-technology-center"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to highlight some good  points made by our opinion editor at Florida Today, John Torres.\n\nHe writes: ``The pushback over DOGE's cuts and the doomsdayers on  social media have me perplexed.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today to highlight 10 provisions  in the House-passed One Big Beautiful Bill Act, 10 commonsense reforms  that too often get overlooked.\n\nOne, the bill modernizes our air traffic control…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692871/ten-commonsense-reforms"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, I rise today to highlight an issue of  national importance: Our commitment to space exploration and Alaska's  vital role in securing America's presence in space.\n\nSpace exploration drives innovation,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to highlight just one way the  House-passed One Big Beautiful Bill Act will help more people live the  American Dream.\n\nAs the chairman of the Housing and Insurance Subcommittee,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…time of what we have been  living through, of growing divisiveness.                                     Year in Review\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to highlight  some of the great work that my office delivered in 2025 that was  reflected in my year-end report.\n\nLast year was full of legislative victories. From ensuring more milk…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}]