[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…happening. President Trump,  through an arbitrary Executive order, has told this body: Your  intentions will not be followed.\n\nThe legislation that is being proposed today--the President has  already said that those DOJ grants will not go to certain States-- Illinois, California, New York, New Jersey--that they are not eligible  for these grant programs.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…And during President Trump's first term, he withdrew from the Iran  nuclear agreement, after which Iran, as we know, accelerated its  uranium enrichment program.\n\nToday, some of President Trump's advisers have even proposed that we  resume nuclear testing. We cannot do that. It would be an unmitigated  disaster, subjecting countless Americans to cancer-causing…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…general counsel and student  loan ombudsman summed up our current situation well. He testified:  ``You, your family, your neighbors, and your community are at risk  today because President Trump, Elon Musk, and Russell Vought have  corruptly handed over the keys of our Nation's consumer watchdog to the  largest banks and tech companies in the world.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…chose to claim her place  in this country, not as an outsider, but as a full participant in  shaping its future.\n\nHer naturalization is particularly worth reflecting on today, when  President Trump seeks to roll back the hard-won rights of immigrants,  especially the right to birthright citizenship, which is guaranteed  under the 14th Amendment of our Constitution.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…wrong. The Senate  must do the same tomorrow.\n\nThis whole bill is about protecting the innocent. Mr. Speaker, the  Senate must pass the bill, as we are passing it today and as the  President has said he would sign it, after changing his position on the  bill over the weekend when he could see the tidal wave of public  opinion moving against him. Let's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…They are capable of defeating Russian aggression and remaining  a free nation only if they have sufficient support from their allies.\n\nIt is all the more concerning that today President Trump said it may  be better to let Ukraine and Russia fight for a while before pulling  them apart like children in a schoolyard. Ukraine and its people don't  have that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692023/increased-support-for-ukraine"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it is committed by. The difference  here is that Governor Newsom will not pardon people who committed  violent crimes.\n\nAgain, Mr. Speaker, as we are gathered here today, we have a  President who all he seems to want to do is tweet. As I said before, he  has posted nearly 30 times since midnight. He took credit for a cease- fire which, by this morning,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…of items by  bad actors who aim to jeopardize our national security or foreign  policy interests.\n\nWhile this bill passed the House last year, it is even more critical  today. President Biden took steps to prevent the remote access of U.S.  chips by our adversaries in his Artificial Intelligence Diffusion Rule.  That rule is not perfect, but President…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…protesters, he asked our military: Can't you just shoot them?  Just shoot them in the legs or something?\n\nThankfully, his former Secretary of Defense shot down that idea.\n\nToday, the President seems to be choosing military leadership he  believes will say yes. He is purging dedicated, capable leaders with no  explanation other than removing roadblocks.\n\nThis…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688243/removing-roadblocks"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…went through to get there.  They did their job. They did their job. They did it excellently.\n\nAnd now Congress has the responsibility to do our job here. As we  meet here today, President Trump is blockading Venezuela's ports from  exporting oil while threatening to collapse their economy and also to  threaten future military strikes against the country…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…To see that happen at the U.N. yesterday, I thought, what have they  been drinking up there?\n\nUkraine is the scrimmage line for liberty on the Continent of Europe  today, and no President of the United States should cavort with  dictators. We have always been the bastion of freedom. Our people have  died for it, defending these ideals around the world.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…concerned about costs being  passed down to consumers, they would be standing up to the Trump  administration and pushing back on tariffs.\n\nI am mentioning the tariffs today because the President, again, is  starting to impose new tariffs. The last one was on automobiles. Large  appliances such as refrigerators and washing machines rely, in part, on  steel,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today because the President is out  here in these streets cutting funding for programs that support a lot  of things Americans care about: Survivors of sexual assault, programs  that offer…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690993/support-safer-communities"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise today because this President is  poised to strip away healthcare from American families again. If  Congress doesn't act to pass this measure, Americans will be forced to  jump through more hoops…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today President Trump announced that the  U.S. will provide NATO allies with weapons to send to Ukraine. Finally.  This is welcome news, but it comes 6 months late.\n\nWasn't it candidate…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693516/actions-speak-louder-than-words"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Cubans had to flee. It is  the rest of the hemisphere and the rest of the world. Just look at  Russia, look at North Korea, and look at Iran.\n\nWhat a coincidence that, today, President Trump is receiving in the  White House the mayor-elect, Mr. Mamdani, from New York City. I salute  the President for receiving Mr. Mamdani because he won fair and square,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…with the law of armed conflict.\n\nMost importantly, these strikes have dramatically reduced drug  smuggling operations.\n\nThe bottom line is that Americans are safer today because of  President Trump's actions. Let's not return to the old, failed playbook  of treating our counterterrorist administrations solely as a law  enforcement matter. We tried that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…antimony, which is  essential to defense manufacturing for systems like radar. That is not  a theoretical risk. It is active leverage being used against the United  States today.\n\nUnder President Trump, the United States has begun to change course  by prioritizing domestic production, strengthening supply chain  security, and treating critical minerals as a…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…housing supplies,  of energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out of frustration about high  prices.\n\nWell, today, President Trump has announced he is going to impose  tariffs on virtually every trading partner we have, and I rise in  support of a piece of legislation we are about to vote on…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Natural  Resources, pending which I yield myself such time as I may consume.                                General Leave\n\nMr. WESTERMAN.  504.\n\nMr. Speaker, we are here today as President Trump has returned H.R.  504, the Miccosukee Reserved Area Amendments Act, to the House of  Representatives without his approval.\n\nH.R. 504, sponsored by Representative…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…brave servicemen and -women were  not harmed in the strikes, and I continue to pray for the safety of our  troops and Americans in the region. The world is safer today because of  President Trump, and we pray that the Lord would continue to give him  wisdom and discernment as he leads our Nation and continues to work on  bringing down tensions in the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…sensitive about this that they don't want to tell us  what it is going to cost. Of course that irritates me, but most  importantly, it is not fair to the consumer.\n\nToday, we have a President, we have a Vice President, and we have a  Secretary of Health and Human Services all on record supporting this  commonsense measure to require prescription drug ads…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, the fallout from Joe Biden's disastrous  decision hurt Americans then, and it continues to hurt Americans today.  President Trump and Republicans are working to reverse these failures.  The President is strengthening law enforcement. He is deporting  criminals who are here in our country illegally,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…my friends, we are ready now. We are going to deliver what we  were sent here to do, and every American will benefit from it.\n\nIn 1793, just steps from where we stand today, President George  Washington laid the first cornerstone of the United States Capitol.  Over 50 years later, on July Fourth, Members of this body gathered once  again to lay a second…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…burglarizing businesses. The previous       administration's open-border policies and disregard for the       law led us to the chaos and lawlessness we are seeing today,       and it is President Trump's responsibility to restore law and       order. That is why I fully support his decision to send       Marines and National Guard troops to LA.\n\nUnfortunately,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…reliable. This has powered  our Nation for  over a century. It continues to be a major source of power for our  Nation, and we need it far into the future.\n\nAnd today, to that case, President Trump is going to sign an  Executive order making clear his commitment to American energy  independence. The President is moving very quickly in terms of boosting…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}]