[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…and funding before the  consequences become dire to families across Delaware.                     Celebrating Seaford's Transformation\n\nMs. McBRIDE. Mr. Speaker, I rise today to celebrate the  transformation happening in Seaford, Delaware, an investment in  economic growth, opportunity, and the future of western Sussex County.\n\nSeaford is a small city…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, I rise today to celebrate Black History  Month.\n\nBlack History Month means a lot to me, and it means a lot to my  constituents in northeast Ohio.\n\nJust in the last few days, we have been reminded…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Mr. DELUZIO. Mr. Speaker, I rise today to celebrate the career and  honorable public service of Indiana Township Police Chief Steven  Colucci, who retired after 29 years on the force this summer.\n\nChief Colucci first put…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Mrs. HAYES. Mr. Speaker, I rise today to celebrate the life of Joyce  Reid-Coleman, who passed away on December 15 after a courageous battle  with cancer.\n\nPoochie, as she was affectionately known, was beloved by the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. LARSEN of Washington. Mr. Speaker, I rise today to celebrate the  christening of the USNS Billy Frank Jr.\n\nBilly Frank Jr. was a proud member of the Nisqually Tribe and a  dedicated leader on tribal treaty rights and environmental…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…degrade our readiness, hurt  recruitment, and empower our enemies.                   Life and Legacy of Ernest Charles Tanner\n\nMs. STRICKLAND. Madam Speaker, I rise today, as we celebrate Black  History Month, to recognize the life and legacy of Ernest ``Ernie''  Charles Tanner.\n\nErnie Tanner was born in Indianapolis, Indiana, on June 5, 1889. His  family…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…and for her work  and deep commitment to her students.           Celebrating Centennial Anniversary of Leyden High School\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today to celebrate a  century of excellence in public education, the 100-year anniversary of  Leyden High School District No. 212, proudly serving the western  suburbs of Chicago.\n\nWhat…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Florida Supreme Court Justice James Perry, Anne Piervil, Lisa Williams,  the late great State Senator Geraldine Thompson, and the late  Eatonville Mayor Eddie Cole.\n\nToday and always, we celebrate their achievements and continue to  honor Black excellence, not just Black history, but also the history we  are continuing to create.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700051/black-history-month"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…discipline, perseverance, and hope. Her contributions have had a  profound and enduring impact, shaping not only the schools she led but  also the countless lives she touched.\n\nToday, we celebrate Mrs. Shirley Knox Benton not only for her  historic achievement but also for her unwavering devotion to education  and the advancement of future generations. Her example…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695981/recognizing-mrs-shirley-knox-benton"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, I rise today to celebrate an extraordinary  man, a man of faith and courage, Father Paul Shaughnessy. He was born  in Worcester, Massachusetts, and currently serves as a parish priest at  St.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692491/welcoming-reverend-paul-shaughnessy"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to celebrate the Monroe Red  Jackets high school football team, led by Coach Terrell Cunningham and  New York State Gatorade Player of the Year Messiah Hampton, who made  history…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698991/congratulating-monroe-red-jackets"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Bad Bunny por usar su talento para unir a  comunidades diversas y dar voz a nuestras experiencias compartidas.\n\nGracias, Bad Bunny.\n\nMrs. RAMIREZ. Mr. Speaker, I rise today to celebrate a creative  designer, community cultivator, and artist--my constituent, Denise  Ruiz.\n\nDenise is a queer Boricua from the Humboldt Park community of Chicago  and is the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, I rise today to celebrate a stunning,  dominant victory by the UConn women's basketball team yesterday over a  very good University of South Carolina team by a margin of 23 points,  which actually…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today, we celebrate the 238th birthday of  the U.S. Constitution, and we reflect on the document that enshrines  the freedoms that we hold dear.\n\nAt the heart of those freedoms is the First…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I rise today to celebrate Sahli Negassi, a  NJ-10 student at West Orange high school who received a perfect score  on the SAT this year. Less than 1 percent of SAT test-takers earn a  perfect…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688149/recognizing-the-perfect-sat-score-of-sahli-negassi"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to celebrate  Frozen Food Month and recognize the vital role that frozen foods play  in American households. Frozen food is more than just a convenient  option. It is a solution to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…memories.\n\nArrowhead Pointe exemplifies the best of public golf, offering a  world-class experience, welcoming players with warm southern  hospitality, and fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community well-being.                         Congratulating Berry College…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to celebrate the birth of  Henry David Boylan.\n\nHank was born on November 24, 2025 at Virginia Hospital Center  weighing eight pounds, two ounces to loving parents Ansley and Matt…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698466/recognizing-henry-david-boylan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to celebrate  Bailey Little, a 2023 Bellefonte High School graduate.\n\nBailey recently received an American degree from the Future Farmers  of America. Bailey is the first Bellefonte…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699980/recognizing-bailey-little"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…sacrifice, strengthened by service, and sustained by quiet  resolve.\n\nMr. Speaker, we honor Hazel Womble not only for the years she has  lived but the example she has set. Today, we celebrate an American who  continues to inspire us all more than a century after her journey  began. America is very proud of her.\n\nWishing Hazel a happy 106th birthday.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…leaders  from throughout New England came together in Poland Springs, ME, to  develop a strategy to reverse the decline in our traditional industries  and our communities. Today, we celebrate a century of accomplishments  by the New England Council to foster prosperity and opportunity.\n\nWhen Captain John Smith explored our rugged coast more than 400 years…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696025/100th-anniversary-of-the-new-england-council"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…dedication have ensured that Hoskins  Drug Store remains a beloved part of the community, staying true to its  principles while adapting to the changing needs of the times.\n\nToday, we celebrate the achievements of Hoskins Drug Store, Mr. and  Mrs. Hoskins, and the ongoing contributions of Mrs. Dudley Hoskins  Bostic and Mrs. Molly Hoskins Scarbrough. Their…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I rise today to celebrate my incredible  Marine Corps fellow, Captain Simona Elvin, for her tremendous work this  past year in my office.\n\nSimona has been instrumental in helping prepare for legislation,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I rise today to celebrate the 50th  anniversary of the Wyoming Trauma and Emergency Medical Services  Conference.\n\nOn August 21, 2025, the Wyoming Department of Health Office of  Emergency Medical…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I rise today to celebrate the Village of  Tontogany's Sesquicentennial. The perseverance of pioneers and settlers  to overcome come the challenges faced during the early years of the  village's…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to celebrate Dr. Barbara J.  Finlayson-Pitts who was recently recognized as the North American  laureate of the 2025 L'Oreal-United Nations Educational Scientific and  Cultural Organization…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692467/recognizing-the-achievements-of-dr-barbara-j-finlayson-pitts"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to celebrate the  unanimous appointment of Matt Harris as president and chief executive  officer of the Northwest Georgia Joint Development Authority.\n\nMr. Harris brings a strong…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…resorts and experience the best of Georgia's  hospitality.\n\nCelebrating the Georgia Safari Conservation Park in Madison, Georgia\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to celebrate the  Georgia Safari Conservation Park in Madison, Georgia, for being named  one of TIME magazine's World's Greatest Places for 2025.\n\nThis 530-acre park offers an unforgettable…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to celebrate the birth of  Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to celebrate the  55th anniversary of the Federal Law Enforcement Training Center, FLETC.\n\nOn July 1, FLETC will celebrate this monumental milestone at their  headquarters in Brunswick,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}]