[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to honor the remarkable legacy  of Mrs. Shirley Knox Benton, a pioneering educator whose leadership and  vision broke barriers as the first female principal in her community.\n\nThroughout…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695981/recognizing-mrs-shirley-knox-benton"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…attacked  by a violent mob.\n\nNo tweet, no post, no spin, no disgusting lie-filled website is going  to change the facts of the history of what happened on that day.\n\nI rise today to honor the men and women who with great courage and  sacrifice defended this Capitol Building. Our Capitol Police are still  being treated with disrespect and now denigration…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698536/a-somber-day-of-remembrance"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, I rise today to honor the counselors,  outreach workers, and credible messengers who save lives as community  violence interrupters in Michigan and across the Nation.\n\nThese programs, supported…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, in recognition of National Police Week, and  on behalf of New York's Fourth Congressional District, I am proud to  stand here today to honor our brave men and women in law enforcement.  Every day, our officers are on the front lines of the most urgent  public safety challenges in service to our community.\n\nWhen…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…support  of his bill. I can't possibly do justice to the passion and the  eloquence that the gentleman brought to this floor just a minute ago.\n\nMadam Speaker, we vote today to honor the young men who reinspired a  country at the height of the Cold War. The legislation awards three  Congressional Gold Medals, as the gentleman from Minnesota outlined.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to honor an exceptional  member of our community, Mr. Robert Phillips, the recipient of D  Magazine's Volunteer of the Year Award.\n\nFor more than two decades, Mr. Phillips has dedicated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, today I rise to honor Diana Barrios, a  homegrown, passionate leader.\n\nDiana graduated from Oxford Academy at the young age of 16 after  finishing her sophomore year. She then earned a bachelor's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…his heart, and his unwavering  commitment to the people of our community.                           Honoring Pauline Medrano\n\nMs. JOHNSON of Texas. Mr. Speaker, I rise today to honor County  Treasurer Pauline Medrano for her extraordinary dedication to public  service in her newly elected role as president of the County  Treasurers' Association of Texas.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to honor Anita Altman, a  distinguished New Yorker and cherished member of our community, who  will celebrate her 80th birthday on June 2, 2025.\n\nAnita has devoted her life to building…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Mr. BOYLE of Pennsylvania. Mr. Speaker, I rise today to honor The Pew  Charitable Trusts, an incredible organization that is focused on  improving and invigorating civic life. Founded in 1948, The Pew  Charitable Trusts has been advancing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…reminding us of the need to advance meaningful, lifesaving  solutions.           Honoring Lieutenant David Moyer and Trooper Brian Nieto\n\nMs. McBRIDE. Mr. Speaker, I rise today to honor two extraordinary  public servants, Lieutenant David Moyer of the Millsboro Police  Department and Trooper Brian Nieto of the Delaware State Police. They  were recently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, I rise today to honor Mauro Reza, a  Vietnam War veteran from Palmdale, California, whose service and  sacrifice exemplify the highest ideals of patriotism and dedication to  our Nation. Mr.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ms. STRICKLAND. Mr. Speaker, I rise today to honor Mayor Victoria  Woodards, who is retiring as Tacoma, Washington's 39th Mayor.\n\nA graduate of Lincoln High School, she proudly served her country in  the U.S. Army, thinking…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…their efforts. I am so grateful for  the tireless work of our cancer advocates. Without them, this bill  would not enjoy such broad bipartisan support.\n\nAs we wear purple today in honor of World Pancreatic Cancer Day, I  ask my colleagues to join me in supporting H.R. 842, the Nancy Gardner  Sewell Multi-Cancer Early Detection Act.\n\nMr. Speaker, let's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…incredibly proud. We can't wait to see  what they will achieve next season.                            Honoring Michael Nolan\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today to honor my  constituent, Michael Nolan, who dedicated 48 years of his life to serve  our country at the Social Security Administration.\n\nHe is a great example of dedication and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today to honor the life and legacy of  Gerald ``Jerry'' Danforth, a distinguished Tribal leader, a decorated  Navy veteran, and a beloved husband, father, and grandfather, who  passed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…of all, mother.\n\nMr. Speaker, I wish Eileen a very happy 100th birthday.                       Honoring the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker, I rise today to honor the life of  Bob Sekerak, a proud Clevelander.\n\nBorn to John and Mary, and beloved husband to Linda, Bob's greatest  joy was his son, Brian.\n\nDrafted into the Army during…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…in uniform. I thank him for  his service and wish him all the best in his retirement.                            Honoring Jake Bridges\n\nMr. HARRIGAN. Mr. Speaker, I rise today to honor a young man from  North Carolina's 10th District, firefighter Jake Bridges of Hickory,  who died while serving his community.\n\nJake was just 20 years old. He was born in…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}, {"senator": "French Hill", "party": "Republican", "sentence": "…mary fine\n\nMr. HILL of Arkansas. Madam Speaker, on this anniversary of V-J Day,  I rise to recognize Mary Fine.\n\nMary Fine turned 100 years old this past March 12. I rise today to  honor not only this incredible milestone in her life but her service to  our country.\n\nMs. Fine was a member of the Women's Army Corps and served our  country during America's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Ms. ERNST. Mr. President, I rise today to honor a fellow Iowan and an  exemplary leader, GEN James J. Mingus, upon his retirement from the  U.S. Army after more than four decades of distinguished service to our  Nation.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor a remarkable  leader, dedicated family man, and proud son of Bucks County--Mr.  Michael J. Mabin, Jr., President and CEO of PennFab, Inc.,  headquartered in Morrisville…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…of Florida, who shared the  heartbreaking story of her son who fell victim to sextortion and later  took his life.\n\nEach of these precious lives was taken too soon, and today, we honor  and remember them. Yet, under current law, law enforcement is not fully  equipped with the tools necessary to prosecute those who push children  into these acts. Sextortion…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Mr. KUSTOFF. Mr. Speaker, I rise today to honor the life and legacy  of Frederick W. Smith, who left us this past Saturday, June 21, 2025,  at the age of 80.\n\nMr. Speaker, if I were to stand and speak at this podium…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…identity, and I look forward to the 54th annual trip  next year.             Honoring 2025 Graduating Class of Leadership Rocklin\n\nMr. KILEY of California. Mr. Speaker, I rise today to honor and  recognize the 2025 graduating class of Leadership Rocklin. This  prestigious program is run by the Rocklin Area Chamber of Commerce and  provides an opportunity for…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…him all of the best and continued  success in the years that lie ahead.                 Honoring the Life and Service of Jim VanWert\n\nMr. MACKENZIE. Mr. Speaker, I rise today to honor the life and  service of Jim VanWert, a dedicated member of the Lower Macungie Fire  Department, who recently passed away after 45 years of service to our  community.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Jake Tyner for his  career in the United States Congress.\n\nA Towson, Maryland native, Jake began his career in Washington, D.C.  in 2016 as Director and Associate Policy…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…passing Congress  and being signed into law by President Trump.               Expressing Gratitude to Arnie and Linda McClure\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor the  community impact of Arnie and Linda McClure of Shirleysburg,  Pennsylvania.\n\nArnie is an accomplished businessman, a farmer, a published author,  and a civic leader.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kate O'Connor Harper  for her service to the House Committee on Energy and Commerce.\n\nA native of Chicago, Illinois and a graduate of the University of  Chicago, Kate began…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I rise today to honor the life of  Dr. Jon Cozean of Farmington, Missouri. Dr. Cozean, a veteran of the  U.S. Marine Corps, died November 11, 2025, at the age of 87.\n\nJon was a lifelong learner.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor the life and  legacy of an extraordinary constituent and community member, Krista  Wynne Moore, of Oaks, Pennsylvania, who passed away peacefully on March  13, 2025, at…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}]