[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today on the 16th anniversary of the  United States Supreme Court's Citizens United decision, a decision that  disfigured our political landscape, reorienting power away from voters…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I am a woman of faith. I know I am joined in  this Chamber by fellow believers of all kinds. Today, I am reminded of  Ezekiel 34:3, a story about the selfishness and greed of shepherds who  used their sheep for their own gain, while neglecting their primary  duty which was…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689257/digging-deep-for-courage"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…bidding on and winning government projects.  That is what this bill will do.\n\nMr. Speaker, again, I thank Mr. Latimer and Mr. Alford for their work  to bring this to the floor today and to increase transparency and  accountability for our small business government contractors. I urge my  colleagues to support it, as well, and I yield back the balance of…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691759/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…is why I voted against the big, ugly bill that  is now putting healthcare coverage at risk for millions of Americans  while raising energy costs for families.\n\nIn fact, just today there is a report that came out that showed over  120,000 Ohioans chose to forgo their healthcare because they simply  couldn't afford it. These are real people, and that bill…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…as well.\n\nCongratulations to the Lightridge High School class of 2025.              Congratulating Riverside High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the  Riverside High School graduating class of 2025.\n\nIn their time as Rams, they have competed in the State and regional  championships, performed plays, and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. NEAL. Mr. Speaker, I rise today to honor a remarkable milestone  in our Nation's history, the 50th anniversary of the Springfield Armory  National Historic Site (NHS).\n\nEstablished during the Revolutionary…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the Coast Guard bill. Chairman Cruz and I worked  diligently on this bill in the last Congress with many of our  colleagues.\n\nUnfortunately, the clock ran out, and we are here today to pass this  important legislation. We hope our House colleagues will just take this  up and pass it as well. The Coast Guard Authorization Act of 2025  provides the tools…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Medicaid to see a doctor. They may only have a meal to eat  because of WIC or food stamps, or they may live in subsidized housing.\n\nIf tomorrow's servicemembers are worried today about having their  most basic needs met, then they are being held back from their fullest  potential, and that weakens our national security.\n\nIn the bill before us, rather…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…legislation in 2023. Over the course of his time working with       our Embassy, he has shown deep expertise and incredible work       ethic to help take AUKUS where it is today. He has helped to       strengthen the bilateral relationship between our countries       and advance our Alliance collaboration at a critical       strategic moment. He is…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Dulce Villegas  Menez for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nDulce has overcome many challenges along her journey to success,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691114/recognizing-dulce-villegas-menez"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…labs create an underlying foundation for all of our  nuclear security efforts including the nonproliferation and national  security priorities that we are talking about here today. In order to  ensure that current and future arms control efforts are properly  fulfilling their mission, we have to invest in our scientific workforce  to maintain our leadership…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Chairman, I thank the ranking member for yielding me  time.\n\nMr. Chair, I rise today in opposition to H.R. 3944, the fiscal year  2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act. Unfortunately, I must ask my colleagues…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Courts and Public Defender Service Employment Non-Discrimination Act,  which would provide for coverage of employees of the local D.C.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698864/introduction-of-the-district-of-columbia-courts-and-public-defender-service-employment-non-discrimination-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginia's population. That is  more than one in eight. When I was born, it was 1 in 100. I was born in  1958. So 1 of 100 Virginians in 1958 had been born in another country.  Today it is one of eight. I guess that must mean, if you follow the  President's logic, that this has been a horrible thing for Virginia. To  the contrary, Virginia, by my last checking,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to share the story of  my constituent, Marwan Marouf.\n\nMarwan has lived in the United States for more than 40 years. He is a  devoted father of U.S. citizens, a respected community…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696969/marwan-marouf-needs-humanitarian-parole-now"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…1540.5 of title 49, Code of Federal Regulations).''.\n\nMr. GARBARINO.  260.\n\nMr. GARBARINO. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise today in support of S. 260, the Bottles and  Breastfeeding Equipment Screening Enhancement Act.\n\nThis legislation will require the administrator of the Transportation  Security Administration…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…honored  Hall Ambulance for its foundational leadership, recognizing the  organization among seventeen native Californians who helped shape  emergency medical services nationwide. Today, more than 500 dedicated  employees continue Mr. Hall's legacy, upholding a mission rooted in  care, compassion, and service.\n\nMr. Speaker, Representative Vince Fong and I…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…scenes, and that is to work towards, perhaps in our next  reconciliation bill, a program to stop the hatred of the traditional  family that is the marker of the Democratic Party today.\n\nAgain, I emphasize we have to look at every one of these programs:  the earned income tax program, the Pell Grant program, the low-income  housing program, and the Section…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today in strong support of H.J.  Res. 24, legislation led by my friend Representative Stephanie Bice.  This reverses yet another burdensome Biden administration mandate that  will…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "Mr. ESTES. Mr. Speaker, I rise today to honor a friend and fellow  fiscal hawk on her last day of work, my district director, Debbie  Luper.\n\nHow can I possibly frame up the service and political activities of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Merlyn Lewis has made to our community through her  work as an exceptional volunteer for Service Dog Alliance, an all- volunteer…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691758/recognizing-merlyn-lewis"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to recognize the  extraordinary service of Master Sergeant Arcadio Santiago-Rodriguez, a  proud member of the Army's 65th Infantry Regiment, known as the  Borinqueneers.\n\nDuring…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688609/recognizing-arcadio-santiago-rodriguez"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, I rise today to recognize September  as National Prostate Cancer Awareness Month and the importance of  saving lives from Prostate Cancer through awareness, education, and  effective treatment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…financial statements, and related       documents); or\n\n``(ii) consulting, broker, or referral services with       respect to a loan under section 7(a).''.\n\nMr. Speaker, I rise today in support of H.R. 1804, the 7(a) Loan  Agent Oversight Act, introduced by Representatives Meuser and McIver.\n\nH.R. 1804 is an important piece of legislation that brings an…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, from hearing my Democratic colleagues talk  today, it is clear that none of them has ever been to a pregnancy  resource center, and they certainly have never used their services.\n\nMr. Speaker, 17 years ago, my wife, Sallyann,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to highlight a  remarkable act of kindness happening right here in the State of  Georgia.\n\nGeorgia Tech faculty and staff opened their homes to students who  could not travel…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697596/georgia-tech-thanksgiving"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, I am sure what you are going to  hear on the floor today is what you have heard in the past, these  rumors that somehow those mean, nasty Republicans are going to cut  Medicaid.\n\nIt reminds me of what Groucho Marx once said: Who…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today to recognize an exceptional  young leader from my district, Jayden Coffey, a student at Cass Job  Corps in Franklin County, Arkansas, and the latest recipient of the  Westerman…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, 32 years ago today, I joined President  Clinton, Governor of Iowa Terry Branstad, and members of the Iowa  congressional delegation to tour catastrophic flood damage in my home  State. The great…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Randy Moje, who has devoted 50  years to serving the Town of Pendleton and the Wendelville Volunteer  Fire Company.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}]