[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I thank my colleagues for considering my important  legislation, the Great Lakes Mass Marking Program Act, today.\n\nI thank my friends, Representatives Huizenga and Walberg, for their  bipartisan support and partnership on this bill. I also thank Chairman  Westerman and Ranking Member Huffman…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…who wrote, called, and shared their stories  with our office. Their advocacy drove much of this effort. Their  persistence is why we are passing this bill into law today.\n\nAgain, I thank my Republican colleagues for working on this piece of  legislation with me and other members of the committee.\n\nI am proud of my community. I am grateful for their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…healthcare. You are  either going to be paying more, or you are going to lose your coverage.  That is just a fact based on the math that they put out publicly and  voted on today.\n\nSo I thank my colleague for the opportunity to do my first colloquy.  I didn't know this was a thing that we could do. Thank you for giving  me that opportunity, and I will let…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Representatives who will bring about positive  change, not just cater to the interests of these obscenely wealthy  donors and megacorporations. I am glad to be here today, and, again, I  thank my colleague for doing this.\n\nIt is my belief America is about representing all of us, ordinary  people as well as wealthy people. After all, are we a country of,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Personnel.\n\nMr. DAVIS of North Carolina. Mr. Speaker, to the chair and the  ranking member, I thank them for their work and their leadership that  has gotten us here today. I also thank the ranking member for yielding  time.\n\nMr. Speaker, I stand in strong support of the 2026 NDAA. It is an  essential piece of legislation that underscores our commitment…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…serve knowing  that their work is bigger than any one person. It is about protecting  our communities and upholding the law for our families and loved ones.\n\nMr. Speaker, today, I thank the brave law enforcement officers of  Spotsylvania and Fredericksburg and all officers serving across the 11  counties of Virginia's Seventh Congressional District. Their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691301/commending-virginias-seventh-district-law-enforcement-officers-for-their-bravery"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to thank Matt Jansen for over  six years of outstanding service in the United States House of  Representatives working with the House Judiciary Committee, the House  Ethics Committee,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to thank Alison Cohen for two  and a half years of outstanding service to the constituents of New  York's 12th Congressional District.\n\nA native of Northern Virginia, Alison attended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…schools.\n\nHer work reminds us that educators don't just teach; they shape the  future. As a dad of two kids who have attended Virginia schools, I am  grateful.\n\nMr. Speaker, today, I thank Mayor Devine and all the teachers across  Virginia's Seventh Congressional District who go above and beyond to  make sure every student feels seen, valued, and empowered.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…community so that these founders can turn their  vision into jobs and economic growth.\n\nI urge all my colleagues to vote in favor of this commonsense,  bipartisan legislation today. I thank Representative Flood, Chair Hill,  and Ranking Member Waters for their leadership.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…America I  want to raise my three beautiful children in--Adelina, Raul, and  Joaquin. They, along with my amazing husband, Sol, and my wonderful  Mama Ramona are here with me today.\n\n``Thank you for your support and your love.''\n\n``Muchas gracias por su apoyo y tu amor.''\n\nThank you to ``the people,'' ``la gente'' of southern Arizona for  making history, electing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to thank Rebecca Sawyer  Smith of Lakewood, Colorado for her 38 years of service within the  Department of Veterans Affairs and congratulate her on her retirement.\n\nRebecca began…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…within that pledge. Those words are: ``Liberty  and justice for all.''\n\n``Liberty and justice for all.''\n\nI do pledge allegiance to liberty and justice for all, and I rise  today to thank the courageous persons who, on just yesterday, took a  stand for liberty and justice for all.\n\nI rise to thank the 140 persons who, on yesterday, voted to support  H. Res.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…I sent those memos to the Global Health staff, to keep for       their records, in the event the blame game ends up pointing       the finger at them.\n\nThat brings us to today.\n\nThank you again for the opportunity to speak before you.  Senate Roundtable on the Dangerous Consequences of Funding Cuts to U.S.                           Global Health Programs…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…bipartisan vote of 51-0.\n\nMr. Speaker, I thank Chairman Mast, as well as my bipartisan co- leads, Speaker Johnson, and Leader Scalise for helping to move this  bill to the floor today.\n\nI thank my colleagues on both sides of the aisle for supporting this  bill in committee unanimously and certainly strongly encourage a  unanimous vote here on the floor.\n\nWe all…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…congressional intent.\n\nI thank Chairman Mast and Ranking Member Meeks for supporting this  legislation and working together to see that this bill made it to the  floor today. I also thank the co-leads of this bipartisan and bicameral  legislation, Congresswoman Sara Jacobs, Senator  Jim Banks, and Senator  Mark Warner.\n\nGreater transparency and accountability…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…forward in challenging circumstances and offering  assistance without hesitation, Special Agent Cephus embodies what it  means to serve with professionalism and care.\n\nToday, we thank Special Agent Joe Cephus for his service,  partnership, and example of servant leadership in law enforcement.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Senate to get behind this bill. It simply says that we are  going to raise the stakes for anybody who would knowingly do harm to a  police officer.\n\nTo every officer serving today: Thank you for your courage. You have  earned my unending gratitude.\n\nBy supporting this bill, Members of the U.S. Senate can demonstrate  their enduring gratitude to law enforcement.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, in honor of National EMS Week, I rise  today to thank the great men and women of the emergency medical  services.\n\nAs the former CFO and State fire marshal for the State of Florida, I  saw these men and women firsthand in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…spirit: faith, family, and hard work. On behalf of the people of the  27th Congressional District and the countless lives he has brightened,  I am proud to recognize him today and thank him for reminding us all of  how one person truly can make a difference and make a community feel  like a home.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…all the members of the FSGG subcommittee for their hard work,  and I certainly thank Kim Betz for her hard work in keeping this  program online and on track to be here today. I thank all the members  of the subcommittee because we would not be here without them.\n\nThe bill we are considering today has a total base discretionary  funding level of $26.3…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…without a large rural border, one that you can  simply walk across with impunity normally, which has been used to  smuggle drugs successfully.\n\nThe point I make here today--and I thank the chairman for the time-- is: Every life matters. If the President of the United States cares  about his 5,000 or 500 or 5 or 1 enough to use the power of the  executive…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…is time for fair  punishment for the people who interfere with people's daily lives,  specifically those with prior convictions. The revolving door of  justice ends today. I cannot thank Representative Donalds enough for  his vital work on this legislation.\n\nIt is time to push back against soft-on-crime judges and DAs. We are  a nation of laws, Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to thank the Colorado Springs  Chamber of Commerce for hosting the chamber fly-in to Washington, D.C.,  this week.\n\nOver 90 members of the Chamber, from the Aerospace and Defense,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695829/2025-colorado-springs-chamber-of-commerce-dc-fly-in"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…a wonderful family with his wife, Betty, and 2  children, 4 stepchildren, 13 grandchildren, and 8 great-grandchildren.\n\nI am proud to honor Mr. Fullerton on the floor today, and I thank him  for his service to our great Nation.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I rise today to thank President Trump for  saving the world. For those who don't recognize it, we have been at war  with Iran for the last 46 years, or more likely and more accurately,  Iran…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I rise today to thank an outstanding member  of my team as he departs for a new opportunity.\n\nMichael Kraan has served as one of my legislative assistants for the  past 2 years. He has covered…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…their  father, Charles Peltz shared with me his priority was making sure that  this never happened to another family again. That is why we are working  to pass this bill today.\n\nI thank Charles Peltz for his work with my office and with me  directly. I am grateful for the bipartisan support, and I urge a  ``yes'' to pass it on the floor.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…The good news is, this legislation has support in the Senate and was  unanimously reported out of the Senate Agriculture Committee earlier  this year. My main message today is to thank Senators Marshall and  Welch along  with Senator McCormick and Fetterman for leading the bipartisan  legislation and championing policies that promote a balanced diet…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}]