[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…currency competing against the dollar.''\n\nMelania was actually the first to get involved in the crypto  ecosystem. In January 2022, she announced an auction of her non- fungible token, or NFT, collection. Trump then followed suit in  December 2022, launching his own NFT collection, ditching his concerns  about crypto because he saw it as a way to pad his…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Federal Reserve System (FRB) that, among other things,       set a 30-day deadline for state member banks to submit a       required notification to FRB relating to certain dollar token       activities did not substantially affect the rights or       obligations of non-agency parties. There, the state member       banks already had an underlying obligation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…commenter said that the Trump meme ``is       effectively a `for sale' sign on the White House.'' Some,       including an author in the Washington Post, characterized       this token as a ``sh--coin.''\n\nIn short, it appears Trump is not soliciting money in       exchange for an investment or tangible product (such as a       Bible, sports shoes, or a guitar),…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Israelis have to understand that Palestinian babies have lives that  have to be respected to the same extent as they want Israeli babies'  lives to be respected. By the same token, Palestinians have to respect  Israeli babies' lives to the same extent that they want Palestinian  lives to be respected. All babies have to be respected equally. All  babies.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…These hardworking Americans put their lives on the line to protect  and serve our communities every day. An America the Beautiful pass is a  small but hopefully meaningful token of appreciation for their public  service.\n\nFurthermore, let me say that I am glad to see my Republican  colleagues acknowledging the importance of our public servants, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…champions of the week.\n\nTheir app, Eagle Express, is an innovative system that allows  students and teachers to better track and complete transactions within  their school's token-based incentive program. The app will help  teachers better manage students and students better manage their  finances.\n\nNamed after STEM High School's mascot, Beak Bucks allow…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…engaged in another form of crypto corruption, and that  involved saying: We are going to have a stablecoin. And a stablecoin  means you give me a dollar, and I give you a crypto token that you can  use in international transactions.\n\nThen there was a transaction involving--I believe; I hope I still  have this right--the United Arab Emirates. They basically…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…remained noncommittal and indifferent. The plaque is  actually completed. It is ready to be put up. We can show it again. It  is not as big as this poster, but it is the smallest token of  recognition and honor that we should be able to extend to the Capitol  officers, many of whom are still with us on the force, for their  sacrifice and the sacrifice that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…launched his family's  crypto venture called World Liberty Financial, a decentralized finance  crypto platform. The Trump family now has a claim on 75 percent of net  revenues from token sales and 60 percent from World Liberty operations.\n\nConcerning crypto industry data also shows that many investors in  World Liberty's crypto are based abroad in countries…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…TECHNOLOGY INNOVATION  Sec. 201. Short title. Sec. 202. Study on blockchain technology and its use in consumer                protection.                         TITLE III--TOKEN TAXONOMY  Sec. 301. Short title. Sec. 302. Findings. Sec. 303. Report on unfair or deceptive acts or practices in                transactions relating to tokens.       SEC.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…several       States, the District of Columbia, each commonwealth,       territory, or possession of the United States, and each       federally recognized Indian Tribe.\n\n(5) Token.--The term ``token'' means a transferable,       digital representation of information recorded on blockchain       technology or other distributed ledger technology.\n\n(6)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…assets? We have needed a bright-line test since this market  began to decide who regulates them.\n\nI introduced the first piece of legislation on this back in 2018  called the Token Taxonomy Act. Think of the harm that could have been  prevented if we had that bright-line test all this time.\n\nThe other essential component is self-custody, the ability to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693776/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…National Guard to San Francisco just 2 years ago  saying: ``. . . we cannot let rampant crime continue.''\n\nOf course, he did let rampant crime continue, and it was really just  a token measure. Yet, even now, just a few days ago, while saying that  there is no problem with crime in California, the Governor has  announced that crime suppression teams will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…on the line to protect our families. It seems fitting that  we should extend this small courtesy to them. It is simply a way to say  thank you to them, a simple but tangible token of our gratitude and  esteem.\n\nI first introduced this legislation during the George Floyd riots,  when BLM rioters were chanting: ``Pigs in a blanket, fry `em like  bacon,''…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…order; and\n\n(3) use a system that electronically records the date,       time, and identity of each individual who accesses a cadet       room using an electronic access token, code, card, or other       electronic means, which shall be maintained in accordance       with the general schedule for records retention, or a period       of five years,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]