[{"senator": "Al Green", "party": "Democrat", "sentence": "…protect  Medicare, and to prevent the demise of Social Security. It is time for  us to take that stand. Incivility emanating from the highest office in  the land cannot be tolerated and has to be negated.\n\nI did it, and I have said to people that while I respect others and  while I absolutely was cooperative when they led me away from the  floor, but…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…political opponents.\n\nI also rise today to amplify the resolution's call that we all  reaffirm our commitment to a democracy where violent rhetoric and acts  like this are not tolerated.\n\nTheir call is echoed in my resolution to honor the life of Wadee  Alfayoumi, a 6-year-old boy from Illinois whose life was taken in the  act of anti-Palestinian violence.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692861/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…violence--sometime deadly violence--against  Palestinians with impunity. These attacks and gratuitous destruction  and theft of Palestinian property are often observed and tolerated by  IDF soldiers. This too fuels hatred and more violence.\n\nAbsent a legitimate claim of self-defense, violence is wrong no  matter who engages in it. But the incarceration,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…statutes of limitations from 5 years to 10 years because  of this bill.\n\nPassing this bill into law will send a strong message to fraudsters  that their behavior will not be tolerated, and those who committed  fraud will be held accountable in the years to come.\n\nThe pandemic upended regular SBA operations, and the agency executed  14 years of lending…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697226/sba-fraud-enforcement-extension-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…strongest message to those who seek refuge in our  country, only to come here and commit crimes and harm innocent people.  They should know that their actions will not be tolerated, and they  will have no home here.\n\nAs a Member of Congress, I will continue to fight for policies that  confront anti-Semitism, extremism, and hate wherever it is found.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…opponents.\n\nOn this 15th anniversary, we honor those who we lost by recommitting  ourselves to the work that they believed in, a democracy where  disagreement is not just tolerated but celebrated, where robust debate  strengthens rather than threatens our institutions, and where every  American can engage in civic life without fear.\n\nThat is the America…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…the hands of people who are ill-trained, who have ill  intent, and who seek to cause the damage that we have seen with our  mass shootings.\n\nFor far too long, our Nation has tolerated an epidemic that is  killing our children, our friends, and our future. Gun violence has  ravaged this country. While every American feels the impact, Black  communities…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…the wake of this tragic event: devastation, fear,  grief, and outrage.\n\nWhether we agree or disagree on policy issues, politically targeted  violence like this must never be tolerated.\n\nMy wife, Jackie, and I teach our kids that it is possible to  respectfully disagree with others. We have to do the same as a society.  We have to lead by example and put…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…broad, bipartisan support, and I urge my  colleagues to join in advancing it on the floor today.\n\nWe must make it unmistakably clear: Forced organ harvesting will not  be tolerated. It will not be tolerated in this world, and those who  carry it out, support it, or profit from it will face serious  consequences.\n\nHouse of Representatives,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…to unite in       this moment of pain and tragedy and reaffirm our commitment       to a safe, civil, and peaceful democracy where violent       rhetoric and acts are not tolerated.\n\nMr. Speaker, on June 14, a horrific tragedy was inflicted on America  and the State of Minnesota.\n\nEarly that morning, a deranged assassin ambushed State Senator John…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "French Hill", "party": "Republican", "sentence": "…financial and diplomatic  consequences for China to invade Taiwan. Full stop.\n\nThe U.S. must send a clear message that China's aggression toward  Taiwan will not and is not tolerated, and the PROTECT Taiwan Act does  just that.\n\nI thank the gentleman from Oklahoma (Mr. Lucas) for his work in  standing up for our keen allies in the Indo-Pacific, not just…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Republic.\n\nMr. Speaker, I am in a 50/50 district. I am blessed. I represent a  really well-educated population. They are fairly prosperous. They are  smart people, and they have tolerated--not because they are thrilled  about what I say, but I think they believe what I say. I go to great  lengths to get the math right. There is hope. There is a path. There…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…teachers into the classroom or, worst of all,  from the perspective of those who ran the legislature, place almost  half of their teachers in charter schools simply couldn't be tolerated.\n\nIndeed, at the time, in 2019, Gavin Newsom, who had just taken  office, had declared a war on charter schools. Charters, which are  public schools that have a high level…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Trump carried out  targeted, strategic strikes to prevent the pending threat of Iran's  nuclear enrichment program.\n\nHe was also clear: Attacks on U.S. Forces will not be tolerated, and  there will be grave consequences for such action. This is what  leadership looks like, and I applaud President Trump for putting  America first.\n\nAudrey and I are grateful…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…We all came together in this body last year and said that such  monsters as these must never be admitted into our country, never given  safe haven on our soil, and never tolerated where they are found.\n\nH.R. 176 says that anyone associated with Hamas or Palestinian  Islamic jihad, in any capacity, or anyone who assisted these terrorist  activities…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Army programs jeopardize the       safety and security of our Soldiers and their families. When       discovered, fraudulent activities by Army employees will not       be tolerated, and those involved will be brought to       justice,'' said Special Agent in Charge Maria Thomas for the       Department of the Army Criminal Investigation Division,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…funds,  full stop. The message is straightforward and simple to education  administrators who don't understand the concept of American patriotism.  This behavior will not be tolerated and no longer subsidized by the  American taxpayers.\n\nUnder this Republican majority and this Trump administration,  American education will be protected and renewed. Our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…take our constituents  many times on a tour through Statuary Hall and we see the desk location  where John Quincy Adams served as President.\n\nSome of our Founding Fathers tolerated slavery. John Quincy Adams  knew it for what it was, a stain on our soul, and he worked so hard,  dedicating his life to eliminating slavery. I can't help but think of  the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…wielded them for an agenda that doesn't serve America's interests.  Wasted government revenues siphoned off the backs of Americans' labor  through tax dollars should not be tolerated.\n\nI commend the $1 billion rescission to the Corporation for Public  Broadcasting. Taxpayer funding for woke media entities is absurd. NPR  and PBS already have a business…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692522/rescissions-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…proactive policy toward Beijing today. As China  continues to show aggression in the South China Sea, the United States  must show clear resolve that aggression will not be tolerated.\n\nThe United States' response to an invasion of Taiwan should be robust  and include numerous sanctions and economic penalties. Exclusion from  international bodies must…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…independent redistricting. We are told that we should fight  fire with fire, even if that means the whole world burns.\n\nThis perversion of Federal elections simply cannot be tolerated by  the United States Congress. We have a duty to protect the rights of  voters in selecting their Representatives in this body, and we have the  authority to do so under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…our troops,  and national security.\n\nI urge my colleagues to support this commonsense measure to send a  clear message: Trespassing on U.S. military property will not be  tolerated.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]