[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…in Louisville as a lone gunman  walked into Old National Bank on Main Street and opened fire. We lost  Josh Barrick, Deana Eckert, Juliana Farmer, Jim Tutt, and my friend,  Tommy Elliot. Five friends, neighbors, and loved one were taken too  soon.\n\nAmong the eight wounded was Officer Nick Wilt. Just 10 days out of  the academy, he bravely ran toward…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Tommy Seiler  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nTommy has overcome many challenges along his journey to success,  demonstrating perseverance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691920/recognizing-tommy-seiler"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…an incredible 2025 season with an 11-7 victory over  Loudoun County. Along the way, they won the Region 4D championship with  a 14-3 win over Jefferson Forest and claimed the Tommy Girani Cup,  achieving all three of their goals.\n\nTheir journey was defined by resilience and determination. After  falling short in last year's quarterfinals, they returned…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Tommy Baker has made through his work with NAMI  Hernando. Tommy works as the Operations Manager of Meares Plumbing and  Electrical and former Board President of NAMI Hernando. He…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…America's faith in Congress once again.\n\nThere is no reason in the world, Mr. Speaker, that we are  individually trading stocks. Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual stocks. It is all a mutual fund.\n\nPresident Trump said if Congress passed a bill banning stock trading…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…debate on the nomination       of Executive Calendar No. 90, Brian Nesvik, of Wyoming, to be       Director of the United States Fish and Wildlife Service.          John Thune, Tommy Tuberville, Bernie Moreno, Tim Sheehy,             John Barrasso, John R. Curtis, Cindy Hyde-Smith, Mike             Rounds, Katie Boyd Britt, Roger Marshall, Pete…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694589/9999"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…least amongst us and try my dadgum hardest to  make the lives of east Tennesseans better, Mr. Speaker. I don't sell  stocks. I have a mutual fund. I talked to my broker today, Tommy Siler,  and I am proud to say that I have recovered from any losses, and I am  almost at $11,000 with my mutual fund. Mainly, I trade baseball cards  and comic books on eBay,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Master Sergeant Tommy J. King, a proud veteran of the  United States Army and our distinguished Veteran of the Month for  September 2025 from Michigan's 9th Congressional District. His  exceptional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…lost their lives, including Franco       Aparicio, Luciano Aparicio, Sarah Lee Best, Brielle Beyer,       Justyna Beyer, Jonathan D. Boyd, Jonathan Jay Campos, James       ``Tommy'' Thomas Clagett Jr., Chris Collins, Casey Laurance       Crafton, Pete \"PJ\" Diaz, Kiah Duggins, Chief Warrant Officer       Andrew Loyd Eaves, Danasia Brown Elder, James ``Brian''…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}]