[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…But it also sounds like nobody really  knows what the plan is because, like so many other things with Donald  Trump, he keeps changing his mind. Who knows what he will do tomorrow.\n\nTo date, we have heard no clear goals, no clear timetable, no clear  explanation for what Donald Trump's objective is in Venezuela. This is  unacceptable, and it is dangerous.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: The House       Committee on Oversight and Government Reform is scheduled to       markup fourteen bills tomorrow related to the operations of       the District of Columbia. With the exception of H.R. 2693,       the District of Columbia Electronic Transmittal Act, I write       in strong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…science. Really?\n\nAt a time when we need to increase our domestic AI and STEM focused  workforce, we need students to be familiar with the artificial  intelligence systems of tomorrow, so that they can contribute to our  continued leadership in tech.\n\nMr. Speaker, I keep looking for examples in history on this retreat  from knowledge. There were England's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…answer. Health  insurance costs going up, grocery prices going up, and the economy in  free fall? More coal.\n\nI don't know what piece of legislation we are going to be debating  tomorrow, but I suspect it will involve coal production.\n\nIt is bordering on obsession for the House Republican Conference, and  it would be comical if not for the real-world consequences…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…said: Why not? He said: It is  because it is a big part of my grade. It is a huge part of my grade.  She said: Okay. I will help you out with it, but when is it due? He  said: Tomorrow. She said: When did you know about this project?\n\nAs it turned out, he knew he had this assignment months ago, but he  hadn't done anything to get ready for it. He hadn't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…seniors at the Social Security  Administration.\n\nMr. Speaker, these are the American people's benefits, and we are  fighting to ensure that not only are they here today and tomorrow but  for future generations to come.\n\nThat is why I am so proud to be in this fight with my dear colleague,  the man, the legend, the Congressman who has fought for Social…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694191/hands-off-our-social-security"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…up for Dreamers and farmworkers  and law-abiding immigrant families in this country. We will not abandon  our Nation's heritage as a country of immigrants, not today, not  tomorrow, not ever. As part of what American exceptionalism has been  all about, these are stories that need to be told.\n\nWilliam writes to us from the great State of Minnesota.\n\nI…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…don't know that  they have this inherited risk. Why? Big boys don't cry. We suck it up.  That little pain will go away. It is nothing. I will shake it off. I  will feel better tomorrow. It is the check engine light that we ignore  except it won't get better. In most cases, it gets worse.\n\nThat tingling in the hand may every now and then go away, but it…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Mr. BENNET. Mr. President, today, I want to recognize the leadership  of Manuel Heart, who retires tomorrow after 15 years as chairman of the  Ute Mountain Ute Tribe and 27 years on Tribal Council.\n\nFor time immemorial, the Ute Mountain Ute Tribe has called the vast  landscape of…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…better. More  insured Americans is good for patients, good for families, and good for  our country. More research paves the way for cutting-edge treatment and  the cures of tomorrow.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…1, Rebecca will pay $796 a month.\n\nThis is totally unacceptable. All of these are too high. Let's make  healthcare available to the American people. Let's pass today, not  tomorrow, not the next day, the Federal tax credits.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698790/breaking-the-gridlock-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…to  do.''\n\nWell, those stories dehumanized Haitians who were here legally  working and rebuilding a city. Now the Trump administration is turning  those lies into policy.\n\nTomorrow, they plan to revoke TPS, despite Haiti's collapse. Legal  status today, illegal status tomorrow. This is the Project 2025  playbook for a morally corrupt mass deportation…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699519/ice-coming-to-springfield-ohio"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: The House       Committee on Oversight and Government Reform is scheduled to       markup fourteen bills tomorrow related to the operations of       the District of Columbia. With the exception of H.R. 2693,       the District of Columbia Electronic Transmittal Act, I write       in strong…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…administration.\n\nTruly, the difference between the bills we have in front of us and  President Trump's absurd budget request or  the House Republican budget that cuts like there is no tomorrow or  another yearlong CR that enables all kinds of misuse and corruption by  Trump is night and day. Because Democrats were at the table, there are  real meaningful wins that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…communities.\n\nDemocrats have been clear. We need legislation to truly halt ICE's  abuses. Otherwise, what Tom Homan says today could be reversed by  Donald Trump, on a whim, tomorrow. Without legislation, Donald Trump  could choose to put a rogue force in any city he wants and have them  operate without guardrails at all.\n\nThe proposals that Senate and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700064/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…JOYCE of Pennsylvania. Mr. Speaker, I rise today to speak on the  importance of my bill, the RED Tape Act, which will be marked up by the  Committee on Energy and Commerce tomorrow.\n\nThe RED Tape Act amends the Clean Air Act to streamline the review  process for Federal projects. The U.S. is facing a rapidly growing  demand for energy production and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today to recognize WDAY Chief  Meteorologist John Wheeler.\n\nOn May 16, tomorrow, John will deliver his final forecast, sunsetting  a memorable 40-year broadcasting career.\n\nJohn joined WDAY in 1985 as the station's first on-air meteorologist.  Since then,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691313/congratulating-john-wheeler-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…environmental stewardship.\n\nThe blue FFA jacket is more than just a uniform. It symbolizes hard  work, commitment, and leadership. The young men and women who wear it  today are tomorrow's farmers, veterinarians, researchers, policymakers,  and business leaders.\n\nTheir dedication to agricultural excellence and community service  exemplifies the very best of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN.  tomorrow.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694879/hour-of-meeting-on-tomorrow"}, {"senator": "John Thune", "party": "Republican", "sentence": "…considering any  further attacks against U.S. forces or interests, it should think long  and hard about the consequences.\n\nI look forward to hearing from the administration during tomorrow's  all-Senators briefing.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692769/iran"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…Congress on hire dates and  placement rates. Transparency generates performance.\n\nWe are not just addressing the issue today. We are ensuring  bureaucrats cannot hide and escape tomorrow.\n\nTo those who would say 90 days is too aggressive, my response is: How  long should a veteran wait? How long should a trained physician sit  idle? The current state is intolerable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER.  tomorrow.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690822/hour-of-meeting-on-tomorrow"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…living healthier. Mr. Speaker, what  if some of the money goes to the cures so we don't finance your misery,  we finance your freedom from that misery?\n\nI say these things and tomorrow morning there will be an army of  lobbyists or an army of groups from my district saying, David, you  don't understand. We need the cash. Don't make us do it in a modern…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…have clarity from our  President, the House, and the Senate about how we address the imminent  health security crisis that confronts millions of Americans and, for  today and tomorrow, keeps our government shut down.\n\nAmericans care about security. We care about security for our  families from healthcare costs, and we care about security for our  Nation…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that one.  I will walk us through the straight number.\n\nWe are still vetting the number because we are doing predictions. All  of this could mean nothing if the Supreme Court tomorrow changes its  rules on the President's authority to  do the enhanced tariffs--let's just call them that--and whatever  authorities the President may have to supplement those…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…cultivate a student  experience that combines classroom learning with cutting-edge research  and public engagement, preparing CFANS graduates to become the world's  ag leaders of tomorrow.\n\nI thank Brian for his years of service to the College of Food,  Agricultural and Natural Resource Sciences and the many contributions  he has made to the U of M's legacy…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…dominance.\n\nThis investment in American energy will strengthen our national  security, bolster our economic competitiveness, and power the future,  including the technologies of tomorrow like artificial intelligence and  data centers. I congratulate T1 Energy on this milestone and look  forward to their continued growth and contribution to our Nation's  energy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats have voted against  reopening the government 13 times. Democrats are holding food  assistance for 42 million Americans hostage, and they are going to do  it again tomorrow. They are doing it tonight.\n\nDemocrats knew their actions threatened food assistance. They were  fully aware of it. This was organized and orchestrated in Chuck  Schumer's…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…Biden administration and  congressional Democrats to shield this EV mandate from the will of the  American people, the Senate will have its say.\n\nI urge my colleagues to vote tomorrow for the resolution of  disapproval.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…I say thank you to SGA,  Alex Caruso, Chet, Jalen, and the entire Thunder team. They truly have  inspired us all, and we are all proud of them.\n\nAlthough I can't be there tomorrow, it is time to celebrate. Mr.  Speaker, Thunder Up.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692772/congratulating-the-oklahoma-city-thunder"}]