[{"senator": "Raphael Warnock", "party": "Democrat", "sentence": "Mr. WARNOCK. Mr. President, I rise tonight in strong opposition to  this awful, and, frankly, immoral budget. Recently, I was appointed to  the Finance Committee of the U.S. Senate, and the reason why I wanted  to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, tonight I rise with my Democratic  colleagues, frankly, to call out the dangerous and draconian  antiscience agendas of this current administration. Since day one, this  administration…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…There are 10  Republican cosponsors of that bill, including MAGA stalwarts like  Representatives Marjorie Taylor Greene, Lauren Boebert, and Tim  Burchett. We have the votes tonight to pass it, but what happened in  the Rules Committee is they don't want to have this vote tonight  because they know they are going to lose because they know their own  Members…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…friend, Congresswoman  Jennifer McClellan, a Democrat from Virginia's Fourth District, for her  outstanding leadership and for leading this incredible hour.\n\nMr. Speaker, I rise tonight during National Gun Violence Awareness  Month not just with sorrow but with a sense of urgency. I rise tonight  during the National Gun Violence Awareness Month to shake the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the gentlewoman from Virginia (Ms.  McClellan) for yielding, and I thank the gentlewoman for anchoring this  Special Order hour tonight on behalf of the CBC.\n\nMr. Speaker, I rise today to speak out against the Republican assault  on every American's right to a quality public education in this  country.\n\nFor…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American people to know what their agenda is. Well, if  Republicans won't be straight with the American people about their  agenda, Senate Democrats are glad to do it for them.\n\nTonight, my colleagues and I will begin to put the Republican agenda  on trial before the court of public opinion here on the floor of the  Senate. It is going to be a long few days…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…assistance to go up and down stairs. This tax credit will help  multigenerational families afford to make the upgrades necessary for  seniors to age gracefully in one place.\n\nTonight, we will hear from some of the freshmen of the Democratic  Caucus and the work that they are doing to  make life more affordable for their constituents.\n\nMs. RIVAS.  Elfreth).…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…my colleague from  Wisconsin, Senator Baldwin, for such excellent, poignant, moving  descriptions of the real cost of this budget plan that we are on the  floor to consider tonight.\n\nI rise today to join my colleagues and the people of New Hampshire in  standing up against the attempt by the Trump administration and some of  my Republican colleagues…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…skyrocketing. In the  richest country on Earth, no one should have to worry about choosing  between paying for groceries, making rent, or having healthcare.\n\nRandall), my cohost for tonight's Special Order hour and my friend and  fellow freshman classmate from the beautiful State of Washington.\n\nMs. RIVAS.  Hoyle).\n\nMs. RIVAS.  Ansari).\n\nMr. GOLDMAN of New York.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I thank my friend and colleague,  Representative Stansbury, for bringing us together tonight to discuss  an important and alarming situation.\n\nEvery American should be outraged at the Trump administration's  attempt to erase American history and specifically to erase…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…continue abiding by the numerical  limits set under New START, even in the absence of a successor treaty.\n\nI thank the 24 Members of the House, several of whom spoke here  tonight, who have cosponsored that resolution. Maintaining those limits  are an essential step to preserve strategic stability while we work on  future arms control.\n\nI thank the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…most States. That is not an  acceptable strategy. That is going back to saying people are not going  to get SNAP benefits in November.\n\nYou know, this resolution that I have tonight--it is very simple and  expresses a number of thoughts that I have heard from both sides of the  aisle. It is a sense of the Senate that the Trump administration is  obligated…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, tonight, as I stand here, people across this  country are being terrorized by ICE with our tax dollars. Americans do  not support this, and I will be their voice tonight on the floor.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699478/ice"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…colleagues, Congressman   James Clyburn of South Carolina  and Congressman Steny Hoyer of Maryland, for co-anchoring this  Congressional Black Caucus Special Order hour.\n\nI rise tonight with my colleagues of the Congressional Black Caucus  and the House Democratic Caucus to reflect on the solemn anniversary of  the January 6 attack on the United States Capitol.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…this  country.\n\nMr. MURPHY. I did.\n\nMr. MURPHY. Will the Senator yield?\n\nMr. MURPHY. There is so much similarity between the debate that you  are forcing this Senate to have tonight and the debate that we were  having back in 2016 on this epidemic of gun violence. I would describe  it this way. The only thing that matters, the thing that matters more…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…fill up 20 minutes, 15 of which your  dad would actually take. He would go on and on. I would try to get him  to wrap up so I could go to dinner. He was always there for me.\n\nTonight, we ran over time with the amount of people who wanted to  come and take time out of their very busy schedules to come and share a  brief message. They sat for an hour to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, tonight I will talk one more time about  what I think is the most pressing problem facing America as we try to  address the crime rate, the drug problem, and the education problem.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…abuses do need to be addressed, just not in  this mechanism.\n\nI encourage all my colleagues in the House of Representatives to vote  ``aye.'' I hope we have a unanimous vote tonight, as we pass H.R. 6019.\n\nMr. STEIL. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…eliminating ridiculous regulations that really impede  manufactured housing.\n\nMr. Speaker, as chairman of the Subcommittee on Financial  Institutions, I will spend my time here tonight highlighting the  section of the bill that provides regulatory relief for community  banks.\n\nTo drive down costs, we need to make it easier for those community- based lenders…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…FEDORCHAK. Mr. Speaker, this microphone isn't picking up that  well, but I thank the gentlewoman for this opportunity.\n\nI had a really hard time deciding what to talk about tonight because  there are so many great things about the One Big Beautiful Bill Act.  Should I talk about student loan reform and the impact that is going to  have on driving down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…and spending hundreds of billions  of dollars in taxpayer money.\n\nWe must stop providing generous incentives that run contrary to the  types of energy resources we need, and tonight I want to highlight 10  reasons why. Yes, you heard me right. There are 10 good reasons to  eliminate these incentives.\n\nFirst, the cost to taxpayers is enormous. Over the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…On the other hand, passage of this confirmation would pretty much end  our week, and that would prevent us from getting a lot of work done  later on this afternoon and into tonight and tomorrow if we have to  stay until tomorrow to confirm this very important officer as Chairman  of the Joint Chiefs of Staff.\n\nSo, in a way, we can have it either way,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, tonight is the NCAA championship, but  the magic of March Madness is gone. Every number one seed has made the  Final Four. There are no upsets, no Cinderellas, just bigger brands…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689618/protect-college-sports"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…using the misery they inflicted on the American people as leverage to  achieve their leftist wish list of demands, slowly twisting the heads  of the American people in a vice.\n\nTonight, I am relieved to say the misery of the Schumer shutdown is  on our doorstep.\n\nMr. Speaker, this package proves that when Republicans stay united  and put America first, we…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696721/continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT. Mr. Speaker, Mr. Green caught us a little bit off  guard. He suddenly stopped, and I am not used to him doing that.\n\nMr. Speaker, we are going to try a couple of things tonight, and I am  going to try to do this as efficiently as possible. I hate doing it  this way, but part of what I am going to do tonight is respond to  basically a little bit--actually,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…as Uber drivers. They aren't able to show up for work because they have  bills and rent due. They are trying to put food on their table, and  Democrats want to vote ``no'' tonight to keep denying them food.\n\nThe 42 million SNAP recipients are people who are low-income and who  need those food benefits.\n\nMr. Speaker, if Democrats vote ``no'' today, then…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Hearing the bitter recriminations from our leftist colleagues, it  seems unlikely we will see much bipartisanship today, but with or  without, we will reopen the government tonight and get back to  addressing the challenges that confront our country.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696689/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…are still going to vote to keep the government  closed and keep this funding from being delivered.\n\nIt is time to fix the damage that Democrats have caused. With this  vote tonight, Republicans will restore SNAP payments and get TSA, air  traffic controllers, and Federal workers paid.\n\nMr. MEUSER. Mr. Speaker, I thank the chairman for the additional…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of this body.\n\nI think that the gentleman from South Carolina is right to have  brought this forward. I think that the body should hear this debate and  that we should vote tonight to censure and refer to the Ethics  Committee for further consideration.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…KENNEDY of Utah. Mr. Speaker, I thank my good friend, the  gentleman from Florida, our new chairman of the Subcommittee on Space  and Aeronautics, for inviting me to join him tonight. I am excited to  join him as a new member on the subcommittee and highlight Utah's  exciting role in the future of space exploration.\n\nWhen we think of iconic American places…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}]