[{"senator": "George Latimer", "party": "Democrat", "sentence": "…philosophy with that which was expressed in  Matthew 25:\n\n``For I was hungry, and you gave me something to eat, I was thirsty  and you gave me drink, I was a stranger and you took me in, I was naked  and you clothed me, I was sick and you ministered to me, I was in  prison, and you visited me.\n\n``Then the righteous will answer, `Lord, when did we see…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689931/elon-musks-lack-of-empathy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…poll taxes to be able to vote  in Tennessee.\n\nAll of this was done to make sure that local election officials could  deny people they didn't want to vote the ability to vote. I took my  oath of office on the Bible where my father kept his poll tax receipt,  which is behind me. He kept it in there because it was a sacred right.\n\nI swore to uphold, protect,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…waste, let's eliminate it. But as the national  commander of the VFW--Veterans of Foreign Wars--said to us in one of  our hearings, when he was wounded in combat, the surgeon who took the  shrapnel out of his arm did it with a scalpel; he did not cut the arm  off with a chain saw. Let's give up Elon Musk's chain saw, and if there  is waste, do it with a scalpel.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…youth mentor, mother, and community leader who calls the city of  Anaheim home.\n\nDenise is the head coach of the Anaheim High School boys' and girls'  water polo teams.\n\nDenise took on the challenge to rebuild Anaheim High School's aquatic  program after 20 years with no swimming pool and no swimming program.  Under her leadership, the girls' water polo…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Transportation Safety Board, or failure to have it at all,  as a cause of multiple aviation accidents, including a very famous one  right here on the Potomac River, a flight that took off in 1982 from  Ronald Reagan Airport.\n\nMoreover, with climate change contributing to more extreme weather  across the country, deicing fluids and equipment have become even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…with an ideal that was revolutionary: it said the power  of government derives from the people.\n\nMy ancestors believed in that ideal just as much as yours, Mr.  Speaker, but it took us a long time to participate in that government,  in that promise. That is what the civil rights movement was about.\n\nIt was also about recognizing the basic decency and dignity…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Washington confirmed that  the Washington, D.C., Metropolitan Police Department was investigating  Representative Cory Mills for an alleged assault of a 27-year-old woman  that took place on February 19, 2025, at the residence of  Representative Cory Mills.\n\nWhereas, the first police report, provided to NBC4 Washington by a  source and confirmed by a second…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, today, students returned to class at Brown  University to start a new semester after the mass shooting in December  that took the lives of Ella Cook and Mukhammad Aziz Umurzokov and  injured nine other students.\n\nMy thoughts remain with the victims, their loved ones, and our whole  community during…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699251/brown-students-return-to-campus"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rescinded by the OCC.\n\nYou heard me right. President Trump's Acting Comptroller of the  Currency rescinded this very rule last week when it issued an interim  final rule that took effect on May 15.\n\nI am not surprised that my Republican colleagues weren't paying  attention to this development, or maybe they were. Maybe they think  that it was something…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…hours, with the last vote that just concluded,  brings to its completion a sad and a sordid moment in the history of  the Senate. I want to just wrap up to leave a record of what took  place.\n\nBefore we got into this parliamentary rigmarole, there were two  things that were pretty clear: one, a Congressional Review Act, a  statute in American law, that allows…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…release this  unclassified report, which includes details that are relevant to  policymakers and Americans who care about the security of their  phones.'' The Biden administration took no action in response to my  letter.\n\nCISA's inaction on telecommunications security prompted the Agency's  top telecommunications security expert to file a whistleblower report…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…religious institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad actors took advantage of  the halo, if you will, of being in a church to get investments that  were inappropriate. This has been an issue for Ranking Member Waters.  She has negotiated…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the economic effects of Dobbs. That report has just been  released 3 years later. My first reaction was: Why did it take so long?  My second reaction was: Thank goodness you took that long and you did  an honest and accurate appraisal of what the effects are.\n\nHere is the bottom line: Dobbs has been a death sentence--literally,  a death sentence--for…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…``The Pink Journal'', in partnership with Community  Food Club Grand Rapids, addressed the various stereotypes and  misinformation surrounding periods in our community. Adelyn took action  by designing and producing digital and printed bilingual period  information resources. These resources are being shared throughout West  Michigan, which will have a…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…New York's  17th Congressional District.\n\nWhen I first ran for the New York State Assembly in 2020, before  there was a congressional office or a seat in this Chamber, Nate took a  leap of faith and helped build a campaign from the ground up. Together,  we delivered a victory many said was impossible, defeating an incumbent  in a district with a 2-1…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…system.\n\nThird, the old system failed to give SIFI designees due process or an  opportunity to address the perceived risk before designation. As a  reminder, the MetLife case took years to settle.\n\nLastly, it failed to incorporate the views of the primary regulator,  who typically would have better insight into a company's financial  standing.\n\nMr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…in drugs and crime and alcohol and violence. And maybe for the  first time in their life they were truly treated with the respect of  man to man is when I arrested them and took them off the street and  walked them through the booking process. I told them then that they  have a potential for a better life and a better day, but their path to  a brighter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…dispatch of a vehicle that we are looking for? Has it  potentially been involved in a crime that requires police interaction  in an effort to enforce and address that crime that took place?\n\nThere are a number of factors that a police officer has to figure,  but it has to be an option that you can pursue that car.\n\nWhat D.C. has done, one of the factors,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…colleagues  listened to the testimony of Ray Cullen, who lost his son Zach to  fentanyl poisoning. Nobody should have to experience this pain.\n\nEarlier this year, the House took a critical step to get illicit  fentanyl off our streets in passing the HALT Fentanyl Act, which was  led by my friend, Congressman Morgan Griffith.\n\nI am proud today to lead…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Army Aviation and Missile Command.\n\nIn 2017, he earned his first star as a deputy program executive  officer at PEO Missiles and Space. His second star came in 2019 when he  took over the PEO role. He is credited as a primary driver for the  modernization and integration of fires within the Army.\n\nHe earned his third and final star in 2022, becoming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Administrator Rick Ziegenfuss, who is retiring this month after 23  years in this position.\n\nMr. Ziegenfuss is a native of Cedar Falls, Iowa, but came to Missouri  when he took his Army Infantry basic training at Ft. Leonard Wood in  central Missouri. During his 22-year Army career, he graduated from  Infantry Officer Candidate School, Infantry Officer…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in  this country. I think when you have proposals in Congress that  encourage that, that are very much thematically aligned with the pro- Hamas, anti-Semitic encampments that took over universities in the  country, it is very important that that is condemned strongly and  unequivocally. I am very proud that that is exactly what the House of  Representatives…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…as has been said, we agree to come to this Chamber, 435 of us.\n\nMr. NORMAN. If you want to get into Members of your own party who  voted coming off boats and just basically took a vacation, it ends  today.\n\nThat is why I fully support this.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…criminals on our streets?\n\nMadam Speaker, I yield to the gentleman from Pennsylvania for the  purpose of a colloquy.\n\nMr. ROY. Gang members. Tren de Aragua gang members who took her under  a bridge in Houston, Texas, for the last moments of her life, raping  her and killing her, and her beautiful mother today is standing up and  saying: Enough. Enough.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…been Saturday morning--the Senate  passed their version of a reconciliation budget. It was a completely  unserious document.\n\nI am going to show over and over here how they took a pass on doing  what was difficult. If this is a negotiation between the House and the  Senate, for example, Mr. Speaker, if you have ever bought a car or been  in a negotiation,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Metz, Jr.'s newly designated bicentennial farm was founded in  1825 by Johann Metz, his third great-grandfather. After more than 150  years of family farm lineage, Richard Metz took ownership in 1996.\n\nToday, the original 110 acres exist and grow soybeans, corn, and hay.\n\nMadam Speaker, I offer my sincere congratulations to Richard Metz and  his family…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, yesterday marked 6 months since President  Trump took office, and today is the 200th day of the Republican  majority here in the U.S. Senate.\n\nIn that time, the Trump administration and Senate Republicans have  been hard at work…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the law. I think one of the  difficult problems he has dealt with is we just got done with a  President who did all he could to ignore our immigration laws. As a  result, we took in about 10 million people here in the last 4 years,  and that is not something that we should have done.\n\nWhat can we tell the people who feel we are being unnecessarily  cruel?…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…of this international criminal. Talk about Trump  derangement syndrome.\n\nIt is funny; I don't remember Democrats trying to tie the President's  hands when Democrat Presidents took far more extensive military action  that involved thousands of troops or airstrikes over weeks and months  in Libya, Bosnia, Serbia, and Haiti. Most recently, in 2024, they…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]