[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…and international students around the  world: Come to America, and you may be imprisoned instead of empowered.\n\nThen there is Ardem Patapoutian, who came to the U.S. from war-torn  Lebanon at 18. He worked nights delivering pizza to become eligible for  the University of California. Years later, with the help of an NIH  research grant, he launched a lab…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…to Benjamin, imagine who else  it is happening to.\n\nI have been urging ICE leadership to answer for their chaotic,  inconsistent, and cruel decisionmaking processes that have torn apart  families across the country.\n\nThis is why I introduced the INFORM Act. My bill holds ICE  accountable for the nightmare they are forcing families like Benjamin's  to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697460/fighting-dhs-immigration-raids"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…majority. Are they serious?\n\nWhat has been the President's focus during all this time he has  called the affordability crisis a hoax? Well, he paved over the Rose  Garden. He has torn down the East Wing of the White House to make way  for a grand ballroom funded by people who have business in front of the  Federal Government.\n\nI haven't been over to the White…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Security Secretary Kristi Noem. Secretary Noem has violated the  Constitution, and she needs to be held accountable for terrorizing our  communities.\n\nOperation Midway Blitz has torn apart the Chicagoland area. President  Trump declared war on Chicago, and then he brought violence and  destruction to our city and our suburbs in the form of immigration  enforcement.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today on behalf of our neighbors  and community members, our immigrant brothers and sisters who are being  targeted and abducted, taken from their homes, torn away from their  babies, and disappeared on their way to church, work, and school.\n\nThere are children crying in their teachers' arms, families  separated, and communities traumatized…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…interests and on their behalf, when it really does not do that at all.\n\nWe know that the longer we do nothing, the more likely it is for  someone else to have their family torn apart like I have or for someone  else to attend a wake or a funeral instead of a wedding or a graduation  ceremony. It doesn't have to be this way.\n\nMr. Speaker, I just--if…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…parents who were detained on the way to urgent care.\n\nNext month? It could be another sick second grader in your community.\n\nChildren are being traumatized, communities are being torn apart, and  people are being murdered.\n\nRepublicans need to wake up from the delusion that what Trump is  carrying out in your name is lawful, needed, or making us safer.\n\nWhen…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699670/horrific-ice-abuses"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…allow  it.\n\nTrump wants America to believe that his cruelty makes us safer. It  does not. When communities live in fear, they cannot trust law  enforcement. When families are torn apart, our Nation grows weaker.  Real safety comes from stability, trust, and community, not fear and  force.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…their loved ones after they are detained by ICE. I have been urging ICE  leadership to answer for their chaotic, inconsistent, and cruel  decisionmaking policies that have torn apart families across the  country. My bill respects the dignity of immigrant families and  promotes government transparency.\n\nI will continue showing up to detention facilities…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696867/artificial-intelligence-is-here"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…those who cannot speak up for themselves because they are too afraid.  This compassionate student has been raising money to help people in his  community whose lives are being torn apart by this administration's  immigration enforcement tactics.\n\nMr. Speaker, hundreds of students across northwest Oregon have  bravely protested the ongoing immigration enforcement…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…residents:\n\nWe did have over 30 swift water rescues . . . have some       folks taken to the hospital.\n\nWe have been up and down trails looking at the homes that       have been torn up there . . . these people have been in these       homes for 70-plus years.\n\nWe're issuing alerts and warnings to get to higher ground.\n\nThese are the alerts that communities…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of his National Security Advisor General McMaster; and over the  objection of his Chief of Staff General John Kelly.\n\nHad President Trump, in his first administration, not torn up that  agreement, we would be celebrating Iran's tenth anniversary under the  nuclear deal with no path to a nuclear weapon. By ripping up the Iran  nuclear deal, Trump opened…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…thousands of decent people this year, often  in unspeakable conditions and without a fair process. That includes  over 10,000 people in my home State of Florida, including a mother torn  away from her child while nursing her baby. These people are largely  good, decent mothers and fathers who are workers contributing to our  communities.\n\nWe do need to take…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…country by improving access to treatment, increasing recovery  opportunities, and strengthening prevention initiatives. The opioid  epidemic has devastated communities and torn apart families across our  country, and H.R. 2483 is the latest in a long line of bipartisan  efforts to address this problem and ensure Americans get the help they  need without…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692133/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…tonight, we stand on their shoulders.\n\nHarold flew combat missions with unparalleled skill and valor. He  loved to fly, taking on some of the most dangerous missions over war- torn Europe. His service came at great risk. The plane we see there, he  liked to fly privately also and would wear a scarf around his neck. He  was a great teacher, and he managed…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…all its great interests and see whether we also in our day and  generation may not perform something worthy to be remembered.''\n\nYet, for 50 years, the environmental left has torn down these great  achievements and waged war against everything that is mined or grown.  They have piled tax upon tax, restriction upon restriction, and  regulation upon regulation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Mr. Speaker, as you can see, there is nothing refined about how a  wolf goes about feeding itself. You can imagine the feelings of the  rancher when he or she finds livestock torn apart and dying.\n\nMr. Speaker, these animals may have been part of the herd for a  decade or more.\n\nWe can try to imagine the incredible anger they feel, knowing they  are legally…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…population we are  dealing with, the individuals in Afghanistan--many of them are  functionally illiterate. And, of course, many of them are coming from  this country that was war-torn and literally run by the Taliban, which  is an international terrorist organization. Consequently, many of these  aliens have likely committed acts of terror or have ties to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Uyghur Muslims in Xinjiang.\n\nThe evidence, documented by human rights organizations, journalists,  and survivors, is overwhelming: over a million people detained,  families torn apart, entire communities forced into labor in factories  that feed global supply chains. Some of those goods end up right here  in the United States on our shelves and in our…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…synthetic opioids, saving countless lives.  This is something that is extremely critical in fighting this  devastating epidemic that we are facing.\n\nThe fentanyl crisis has torn families apart and left communities in  mourning. These amendments are a targeted, urgent response to fight  back against this deadly drug.\n\nMr. Chair, I urge my colleagues…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…body and tested soul,\n\nWrapping me, his other saved possession,\n\nIn a magical garb whose sacred fringes I playfully       unraveled,\n\nEver since attempting together tie what\n\nTorn away is forever gone.\n\nThe youngest member at the Shoah (Holocaust) survivors'\n\nMinyan (quorum) in Germany's Wetzlar Displaced Persons       Camp,\n\nI hear louder and louder…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…in. Essential components of this  process were 30-day registration, in-person election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election day, counting ballots in secret,  ballot harvesting, same-day…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…across every level. As Chief of Staff for the 49th Armored  Division, he played a pivotal role in preparing the unit for deployment  in support of peacekeeping operations in war-torn Bosnia. Once  deployed, he assumed the role of Chief of Staff for the Multi-National  Division (North), leading a diverse team of officers from over ten  nations, including…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…were not'' vetted.\n\nIt didn't matter to Joe Biden. He waved them all into our country.\n\nRepublicans warned repeatedly that bringing people without proper  clearance from a war-torn country was a major national security risk.  The negligent Biden administration ignored the warning.\n\nIn 2021, 13 American heroes were killed in the botched withdrawal  from…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…together, and cannot be  drawn in the interest of partisanship or to favor or disfavor any  politician, are all thrown out.\n\nThis map tears communities apart. My district is torn into six  different pieces. The county where I live is torn into three or four  different pieces. It is being designed for the explicit purpose of  partisanship.\n\nGavin Newsom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]