[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…trafficked. It makes sure  these children aren't stuck in cages in Border Patrol facilities for  extended periods of time. This office also supports refugees who are  victims of torture and human trafficking and who have been admitted to  the United States by this administration, by the Trump administration.\n\nLastly, I will note that this program and its…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699443/consolidated-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…desecrated in death.\n\nThis is cruelty. It is the latest episode in a long history of the  experimentation and exploitation of Black bodies. I grieve for  Adriana's family, for the torture they are experiencing layered with  the daily uncertainty that they are navigating as they try to do right  by their daughter and lay her to rest peacefully.\n\nHer parents…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…criminals.\n\nWhy is it, then, that last week ICE attempted to deport a constituent  of mine who had been granted legal protections against removal under  the Convention Against Torture?\n\nThis woman, the victim of unspeakable crimes in her home country,  came here to the United States for her safety which is now being  undermined by this administration.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…foreign countries without a  trace.\n\nThis administration is violating Federal law by sending people to  places like CECOT and, soon, maybe Libya, where they may very well face  torture or some other horrific treatment.\n\nFor anybody who thinks this may not concern them because they are an  American citizen, think again. You may not actually be given an  opportunity…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…would require an assessment from the Secretary of State of  the conditions in El Salvador's Centro de Confinamiento del Terrorismo,  including an assessment of allegations of torture and other gross  violations of human rights.\n\nRemember again that the Trump administration has acknowledged that at  least one of the individuals who was deported was deported…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…teaches self-improvement  through meditation based on slow movements and regimented breathing.  For over two decades, Falun Gong practitioners have suffered from  detention, torture and organ harvesting at the hands of the Chinese  government.\n\nWe must fight to raise awareness of those persecuted in China who  cannot raise awareness themselves. On May…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691790/supporting-the-falun-gong-practitioners"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…no criminal record?\n\nAnd, importantly, where in the world is this money coming from? Does  anyone here remember voting to pass a single dollar in appropriations  to fund a torture prison in El Salvador? Because I sure don't, and the  last I checked, Congress has the power of the purse.\n\nDo you know what else we don't know? We still don't know the names…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…own teammates for war crimes as  well as military contractors convicted of killing 14 Iraqi civilians.  He has also called for reinstating waterboarding and other forms of  torture.\n\nIn his book ``The War on Warriors,'' he wrote:\n\nShould we follow the Geneva Conventions?. . . . If our       warriors are forced to follow rules arbitrarily and asked to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…group of  people who persevered through the worst of circumstances in this  Nation, a group of people who literally emerged from bondage, a group  of people who emerged from torture, from rape, from kidnapping, and  from family separation.\n\nThat is why it means so much to us. That is why it is important that  we recognize Black History Month because contributions…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…7 of 2023.\n\nIn doing so, the bill treats the atrocities of October 7 on a par  with the Immigration and Nationality Act's current treatment of Nazi  persecution, genocide, torture, and extrajudicial killings.\n\nDoes anyone seriously argue that we should repeal the sanctions  against persons who aided and abetted the Nazi's Holocaust?\n\nIf not, then why…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…to reimburse States, like Texas and Florida, for the cost of  statutorily required assistance to certain legal refugees and to  support victims of trafficking and victims of torture.\n\nI urge my colleagues to vote against this amendment.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699430/consolidated-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…get America out there on the world stage.\n\nAlso, with this NDAA, as many know, we are repealing sanctions on  Syria that were placed there because of Bashar al-Assad and the torture  of his people. We are giving Syria a chance to chart a post-Assad  future. We do that while also holding the new government accountable  for its actions and giving the White…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697811/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Inc., HSE  Staffing Agency LLC, Autism Care Solutions LLC, and KMission TV LLC.\n\nA serial entrepreneur, nurse, educator, and a former Sudanese refugee  who survived political torture and violence, Dr. Elsheikh came to  Pennsylvania in 2001, where she rebuilt her life and impacted thousands  through programs that serve children with autism, train and employ…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Universal Declaration of  Human Rights: disbanding all agencies in charge of censorship and  inquisition, and seeking justice for massacred political prisoners,  prohibition of torture, and the abolishment of the death penalty.\n\nFour of the 10-point plan, separation of religion and state, and  freedom of religions and faiths.\n\nFive, complete gender equality…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…1967, when he was  shot down over North Korea. Allen was captured and spent more than 6  years--that is 2,237 days--as a POW in the infamous Hanoi Hilton,  enduring brutal torture, unimaginable conditions, and profound  isolation. He never broke. He returned with honor.\n\nAfter his release in 1973, Allen didn't retire quietly. He returned  to Active…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Hamas started, Israel was doing  nothing to deserve this. Instead, Hamas invaded the country. They  killed 1,200 people. They took 251 hostages.\n\nIf that wasn't enough, the torture that they committed on that day  was horrific. For those of you who haven't seen the film of what they  did, I  strongly recommend you don't look at it because you won't sleep.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Chinese Communist Party continues to deny its genocide against the  Uyghurs and other ethnic minorities. We know that forced sterilization,  forced labor, brainwashing, and torture are rampant in the Xinjiang  Uyghur Autonomous Region.\n\nDespite exposure of the CCP's crimes, Xi Jinping is doubling down. A  civil society investigation uncovered that the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…communities in the XUAR.\n\n(9) PRC authorities have made use of the legal system as a       tool of repression, including for the imposition of arbitrary       detentions and for torture against members of the Uyghur       community and other minority populations.\n\n(10) Uyghurs and Kazakhs who have secured citizenship or       permanent residency outside of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…percent of China's  population, were practicing Falun Gong.\n\nThis popularity triggered a brutal response from the CCP, unleashing  a campaign of illegal detentions, forced labor, torture, and most  horrifically, forced organ harvesting, a practice that amounts to mass  murder.\n\nOn July 20, 1999, the CCP detained hundreds of thousands of Falun  Gong practitioners…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…pouring over the  U.S. Embassy. Our Embassy personnel--50 American hostages--were held  for 444 days by these nutjobs. They were subjected to intense physical  and psychological torture throughout their captivity, such as mob  executions, beatings, solitary confinement, and very bad living  conditions. This is what they did when they took over. They came…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…mothers and children--have been deadly. Putin knows that he has failed  to achieve his objectives on the battlefield, so he continues trying to  achieve it through civilian torture--even today.\n\nIndeed, Putin has failed in his two overriding goals. First of all,  he has not weakened NATO. Under Putin's watch, NATO has expanded and  awakened. Secondly,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}]