[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…rural hospitals close.\n\nDon't take my word for it. Take the word of Senator Josh Hawley, who  represents the State of Missouri. He said that these Medicaid cuts  would be a total betrayal by the President and the Republican Party of  the working class.\n\nI never thought I would be quoting Josh Hawley, but everyone should  read his op-ed. He was pretty…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…$200,000 to implement  this rule, and they have described what sounds like onerous associated  paperwork and a big administrative burden.\n\nNow, understand, that is $200,000 total, across all manufacturers  throughout the country. I mean, we are not talking about a huge amount  of money here. The thing is that the Department of Energy already has  certification…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…transparency, clarity, and respect. But across agencies, this  administration continues to blindly and abruptly fire Federal workers.  What do we have to show for it? A complete and total brain drain.\n\nWe are losing talent and expertise in our Federal Government, all  while the administration prioritizes tax cuts and handouts to the  biggest corporations.\n\nTo…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…just talk about the full amount of money that is in politics today as  compared to let's say 1976--a few years before Senator Durbin was first  running for Congress.\n\nIn 1976, total Federal election spending by candidates and committees  was $160 million. In the last election, in 2024, candidates and  committees together spent $15.9 billion. OK. Now, it…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…chosen once  again to advance a resolution under the guise of denouncing  ``socialism.''\n\nLet me be clear. This resolution is an embarrassing distraction from  the complete and total failure of the Trump administration to deliver  actual results for the American people, and the American people see  right through it. Sixty-one percent of Americans say that…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…uncertainty for  their business, not knowing if Trump would roll back or increase the  tariffs. And just today, Trump imposed additional tariffs imported  aluminum, bringing the total tariffs on Canadian aluminum up to fifty  percent. This will force small businesses like Wyoming Machine to  adjust their operations once again. Trump isn't hurting Canada…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…entered into force on January 22,  2021. It is the first legally binding international agreement to  comprehensively prohibit nuclear weapons with the ultimate goal being  their total elimination. Mr. Speaker, 73 nations are party to the  treaty. The United States is not. Neither are the other eight nuclear  powers.\n\nWe won't get there overnight, but we…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…program helps small businesses to grow, create jobs, and invest in  their communities.\n\nSince its inception in 1986, the program has provided approximately  $400 billion in total project financing and created over 3.3 million  jobs. In California alone, that translates to $95 billion in total  capital and the creation of over 715,000 good-paying jobs.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…warheads. They  gutted the National Weather Service so badly that right now we might  not have enough meteorologists to warn communities about tornadoes and  hurricanes.\n\nDOGE was a total, complete failure, and now Republicans want to lock  their disastrous cuts into law?\n\nCome on. That is insane. That is crazy.\n\nMr. Speaker, look at what these cuts are targeting:…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…and coinsurance to get a diagnosis and  receive treatment.\n\nAnother constituent, a schoolbus driver named David, saw his premiums  double. He is now spending 12 percent of his total pretax income on  health insurance. David wrote:\n\nIt's difficult and frustrating to see life crumble before       your eyes. Just trying to get ahead and just to find setbacks…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…nominee of his second term, Whitney  Hermandorfer, to be a circuit judge on the Sixth Circuit.\n\nWe all know when it comes to judges Donald Trump cares only about one  thing: total unyielding fealty to Donald Trump--not experience, not  judicial independence, not knowledge or desire to pursue the law, but  brazen, uncomplicated fealty to Donald Trump.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693417/nomination-of-whitney-d-hermandorfer"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…both publicly and privately operated       ones, state media has reported. The U.S. has around 77,300       charging locations with about 230,000 EV-charging points in       total, data from the Joint Office of Energy and       Transportation showed. It is unclear if the two figures are       directly comparable, but industry experts widely regard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…unlike him,  were actually brave enough to serve our country in uniform.\n\nWhat he has done to our veterans in just a few months since he has  been back in office amounts to a total betrayal. For no apparent  reason, he has already fired more veterans than any other American  President in modern history, over 6,000 and counting. He has been  forcing the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…on their own--and not a Justice Department  bailout--all while November 1 is fast approaching and tens of millions  of Americans face this healthcare crisis: rising cost or a total  elimination of their healthcare or medical debt. Costs are already  high--and now this. It is time to do the right thing and to take a  stand.\n\nAnd with the President poised…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…deployment of troops, could lead to a cascade of events that       might spark ``a most violent political Earthquake through the       whole British Empire if not its total Destruction,'' he wrote       in January 1773 to Rhode Island's deputy governor, Darius       Sessions.\n\n``I have long feard that this unhappy Contest between       Britain…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…postseason, as Rivera won gold medals in both  events during the Lancaster-Lebanon League championship and the  District Three championship weeks prior.\n\nWith two state titles and a total of 6 gold medals during the track  and field postseason, Sophia Rivera has firmly established herself as  one of Pennsylvania's best in shot put and discus. I offer my sincere…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…process, and then interest is off of the table because  you have to pay it. You can't just magically not pay the interest. That  adds up to what? It is about 47 percent of the total fricking budget.  It is half the budget.\n\nMr. ROY. Correct.\n\nMr. ROY. I have done it before.\n\nMr. ROY. Right.\n\nMr. ROY. Right.\n\nMr. ROY. Yes.\n\nMr. ROY. If the gentleman is…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…longest monolithic, single-cast solid  rocket boosters ever manufactured and flown. The boosters delivered  more than 900,000 pounds of thrust, nearly two-thirds of the vehicle's  total thrust at liftoff.\n\nIt is not just about technology. It is about what this technology  enables. Northrop Grumman's advancements in propulsion have opened up  incredible possibilities…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Issuance of Letter of Offer Pursuant to           Section 36(b)(1) of the Arms Export Control Act, as           amended\n\n(i) Prospective Purchaser: Government of Ukraine.\n\n(ii) Total Estimated Value:\n\nMajor Defense Equipment* $0.\n\nOther $180 million.\n\nTotal $180 million.\n\nFunding Source: Foreign Military Financing.\n\n(iii) Description and Quantity or Quantities…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694285/arms-sales-notification"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Thirty-five years ago, a group of students gathered around a flagpole  early in the morning to be able to pray for their school. It was in  1990. It ended up being about 46,000 total students in 4 different  States, including my State of Oklahoma, that just kind of gathered. The  word kind of spread organically that one Wednesday morning in  September,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of this title, the educational       assistance payable to the individual under this chapter shall       be paid--\n\n``(A) in a lump sum calculated by multiplying--\n\n``(i) the total amount of contributions described in       paragraph (1)(A) with regards to such individual; and\n\n``(ii) the sum of the number of months described in       subclauses (I) and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…on which the violation continues; and\n\n``(B) an amount equal to the retail value of the human cell       and tissue products that are the subject of the violation.\n\n``(2) The total civil penalty under paragraph (1) may not       exceed $10,000,000 for all such violations adjudicated in a       single proceeding.\n\n``(3) In this subsection, the term `human…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to undermine it and who want advance  sharia law, who want to bring their flags of their country here instead  of adopting and becoming an American--shouldn't we not take a total  review of our immigration system, from top to bottom, in addition to  codifying security of our border and ensuring the integrity of our  election, that only citizens vote…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…for a day. Go on a ride-along  and learn what they do. I have, as I said, had the privilege to do that  many times.\n\nI recall being on a ride-along in the middle of the night, total  darkness, walking up on a car. The police officer has a flashlight, and  had I not been there, that police officer would have been there by  themselves, and essentially they…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…capital gains on Form 2439, credits for Federal taxes paid on       fuels claimed on Form 4136, and any other refundable credits,\n\n``(ff) income tax,\n\n``(gg) other taxes,\n\n``(hh) total tax,\n\n``(ii) Federal income tax withheld or excess tax withheld       under section 3101 or 3201(a),\n\n``(jj) estimated tax payments, including amount applied       from prior…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…want to give a special shoutout to the father-son duo of West  De Pere Head Coach Chris Greisen and all-star quarterback Patrick  Greisen, who set the Division 2 record for total passing yards in a  championship game, an extraordinary achievement on an already memorable  day.\n\nMr. Speaker, I once again congratulate the team on this  accomplishment,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…committee with such  strong bipartisan support. It would provide a better quality of life to  the men and women of the American military and their families. It would  invest, in total, $852 billion in our national defense--expanding  shipyards, expanding munition production, creating stockpiles of  critical weapons that we know we need for the future, investing…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Kits; ruggedized laptops;training       equipment publications for HIMARS and munitions; and other       related elements of program and logistics support. The       estimated total value was $495 million. Major Defense       Equipment (MDE) constituted $440 million of this total.\n\nThis transmittal reports the correction of the previous       designation…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…something that should receive bipartisan support. Our  commitment to fiscal discipline is clear. Conservatives on the Budget  Committee added a provision that incentivizes a total of $2 trillion in  reductions.\n\nMr. Speaker, the American people are begging for Washington to unlock  the Trump agenda, which this bill does. They gave us a mandate to save…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…the  contractor that I want to put in gas heat, like I have back home in  Georgia. He said that you can't do it.\n\nA heat pump will not work below 32 degrees. Plus, you have a total  electrical system when the heat pump shuts down.\n\nWhy are we running short of electricity? Because they aimed  everything at electricity. There was a war on our gas industry,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700167/dont-mess-with-my-home-appliances-act"}]