[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…balance of my time.\n\nMs. McCOLLUM. Mr. Chair, I rise in opposition to this amendment.\n\nTo be clear, I have disagreements with Prime Minister Netanyahu's  government.\n\nIsrael totally had the right to defend itself after the heinous  attacks on October 7, and all the hostages should come home.\n\nThe Israeli military campaign has been an absolute tragedy…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…even threatening to use the gun that he had legally in his possession.  ICE officers--2 of them--shot him 10 times. Ten times. That is what  happened.\n\nWhy aren't we all just totally shocked? That is not acceptable.\n\nThen that is all done with the authority of the State--with no  restraint.\n\nThen the Secretary of Homeland Security, who is responsible for…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…by foreign entities of concern to exploit  energy supply chain disruptions. That is why I have been dismayed at  the fact that President Trump and the Republican Party have totally  dismantled the infrastructure that we built up to strengthen our energy  supply chains.\n\nThe reality is that there are more threats to our energy supply  chains today than…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…wanted to make Canada the 51st State. Greenland didn't  think so.\n\nWhy do we want to think that what this man says last is what he meant  at first when what he said at first totally contradicts what he said at  last? It makes no sense. Therefore, Mr. President, you shall have  Articles of Impeachment presented by Al Green, Member of Congress,  because…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…pretended to open a magic spigot,  and he dumped and wasted a bunch of water a couple of months ago into a  dry lakebed.\n\nOur friends across the aisle retweeted all of these totally fake  narratives, and now half the world, the world in that other parallel  universe, believes this stuff.\n\nIt is a constant challenge just to bring the subject back to facts…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…enforcement--languishing in  El Salvador.\n\nNow, the Trump administration is admitting to deporting a 2-year-old  U.S. citizen with cancer. It is cruel, it is despicable, and it is  totally illegal, no matter what Stephen Miller or Tom Homan may say.\n\nThese cases are not just about these specific people or children sent  on planes to foreign prisons by the U.S.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…additional $300 per month. On the North  Side, Emily will pay an additional $150 a month, raising her cost to  $600. Beginning January 1, Rebecca will pay $796 a month.\n\nThis is totally unacceptable. All of these are too high. Let's make  healthcare available to the American people. Let's pass today, not  tomorrow, not the next day, the Federal tax credits.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698790/breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I will go right through the list.\n\nWe can debate waste, fraud, and abuse all day. The money that DOGE  has supposedly found in waste, even if you believe that number, is  totally offset by the tax breaks for billionaires in this resolution. I  mean, with all the chaos in our economy right now, does anybody really  believe that we have to help out billionaires,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…law enforcement follows the law. They  wear body cameras. They are subject to disciplinary actions if they  violate due process rights.\n\nICE is completely unaccountable and totally out of control. We have  seen them assault citizens. We have seen them assault elected  officials, including Members of Congress and my colleague from  California, Senator…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…since World War II.\n\nAll of this would seem to be part of the President's embrace of a  ``spheres of influence'' arrangement with China and with Russia. The  President seemed totally fine with allowing China to dominate Asia and  Russia to dominate Europe, as long as they let us dominate the Western  Hemisphere. That is a 19th century idea if there ever…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…standing up for the rights of all citizens and  their constitutional rights to be enforced and protected, and that  brazen attack on the Civil Rights Division will leave it totally  unable--as the President, apparently, prefers--to defend the democratic  right of our citizens to vote.\n\nI urge my colleagues to oppose the President's Executive order.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…not something you want to be known for.\n\nTo be clear, they made history for running the most closed,  antidebate Congress we have ever seen. In total, Republicans issued 115  totally closed rules, meaning 115 times where the House could not  debate a single amendment on the House floor. Republicans basically  told us: nope, no debate, no amendments, no…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump and Russell Vought insist on rescissions, and an  obedient Republican Congress goes along--even though many of them know  how wrong it is--it makes the spending process totally partisan.\n\nThe leader's words and his actions are a complete contradiction. He  can't have it both ways.\n\nAgain, not 1 week ago, Republicans jammed a rescissions package…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enforcement action that has cost multiple  billions of dollars, please let me know. Call my office.\n\nThe briefings we received before Christmas were hollow, and as we  know now, totally misleading. The bipartisan briefing yesterday  described the operation but not the costs.\n\nAgain I ask: Name the accounts exactly from which billions of dollars  have been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…as we can possibly get,  which means we need interstate transmission, and we need to not just  permit new projects but at a minimum let the projects that have been  almost totally built be plugged into the grid.\n\nSo this is not a climate speech; this is a ``people can't afford  their electricity bills'' speech. And I just hope some of my Republican…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Valadao  for his leadership on that committee.\n\nMr. Speaker, it has been a long road to bring this bill to the floor.  It is a road that was made significantly longer by a totally  unnecessary Schumer shutdown that we have been living in. The bill  before us not only reopens the entire government, but it ensures that  the House and its supporting agencies…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…terrorists. Every  Venezuelan knows that Maduro is just a thug and a delinquent who has  been in the drug-trafficking business for 27 years since he took over  the country. They have totally destroyed the most prosperous country in  Latin America, Venezuela.\n\nOf course, Congress has the crucial role in authorizing wars, but the  President has independent authority…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Some are going on codels. Some are heading overseas. Some are going  home. Some have elections coming up. There are lots of things that are  happening this weekend, and I totally understand everyone wanting to be  able to get to those spots, but we have unfinished business. We should  be here until it is done, and we should hold harmless the folks…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…thank Mr. McGarvey for managing the floor today.\n\nMr. Speaker, this is who we are, and I point out that Mr. McGarvey  said this is the way the Founding Fathers would want it. I totally  agree with that. One of the gentleman's constituents brought the  concern, and it took us a little while to get there, but we got there.\n\nMr. Speaker, we are working in a…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691757/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…ideologues doing things that are simply not in  the interest of the American people.\n\nMaybe USAID has done some good things, but they have also done many  things that were totally inappropriate. Agencies like this need to be  defunded or reformed. The American people aren't going to put up with  it anymore.\n\nTo that end, why is the government still…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692539/rescissions-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…things that are simply not in the  interest of the people of the United States.\n\nUSAID has done some good things, but they have also done things that  were an enormous waste, totally inappropriate, and, in fact, they lost  the trust of the American people. Agencies like this need to be  reformed. The American people aren't going to put up with it anymore.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…things  more affordable, and to make things just a little bit better. If we can  take a half a step today and a full step tomorrow, eventually we can  get this economy, that was totally screwed up by the previous  administration under Biden and Harris, back on track to serve the  American people.\n\nThe material previously referred to by Mr. McGovern is as…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…of a law enforcement officer. It  is incredibly dangerous, as they are trying to execute official duties,  to have people interfere with them. The distraction of not being  totally focused on what they are doing endangers not only them but  those around them, and we have seen that happen in this country.\n\nI expect every one of the colleagues in this…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…these bills signed into law--no continuing  resolutions that lock in previous priorities that don't reflect today's  realities, no more disastrous government shutdowns that are totally  unnecessary and so harmful.\n\nAgain, I want to thank my colleagues for supporting the final passage  of this important package so that we can send it to the President for…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…colleagues that I respect more than you know in all ways-- and I think that is how we all should be--please, let's stop wasting  time; and please, let's stop this unnecessary and totally useless  grandstanding politics. We have got to stop this. This is a total waste  of time.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…the founding  of America, namely that rights come from our creator. Ours is a  Christian-based culture. Sharia, on the other hand, is a culture of  violence and domination, totally anathema to the concept of individual  freedom.\n\nThe United States Constitution and sharia are fundamentally at odds  with one another. The Constitution begins with: ``We…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…valid.\n\nI think fraudulent voter registration is a problem. I think requiring  a valid photo ID, as President Jimmy Carter and former Secretary of  State Jim Baker said, is totally a way to ensure integrity in our  elections and is not a burden on the people.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the VA.\n\nRepresentative Womack's bill would close the loop and modernize the  delivery of prescriptions by making the current waiver permanent.\n\nWhile telemedicine will never totally replace in-person care, the VA  must be granted the tools to deliver 21st century healthcare. This bill  would remove burdens on veterans who need VA care so they can get…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695456/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…for her  daughter, that was ruined in a flood. There were wedding pictures from  a grandparent, parents, and daughters--multigeneration--and an album to  save for generations totally lost in a flood. There were, in this  flood, neighbors who went out and died, not recognizing the place they  were stepping wasn't the side of a road but rather a ditch, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…National Historic Preservation Act,  protections already exist for offshore operators, and it requires them  to identify and avoid marine archeological sites, making this rule  totally redundant.\n\nMr. Speaker, the purpose of the Biden-era rule wasn't just for  redundancy. It was to put shackles on offshore energy production and to  put higher costs on American…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]