[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fiscal  responsibility comes at the expense of starving children, crumbling  democracies, and public-private partnerships that channel American  innovation to solve the world's toughest challenges.\n\nMr. Speaker, foreign assistance, which has long represented just  about 1 percent of our national budget, is not charity. It is strategy.\n\nDon't take my word…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…I want to thank Senators Graham, Murray, and Collins as well as  Representatives Diaz-Balart and Frankel for their partnership in  negotiating the bill. It was one of the toughest negotiations and most  important negotiations I have ever been involved in.\n\nAnd I also want to thank the incredible staff here in the Senate who  worked tirelessly to get…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…representing constituents  living in the heart of New York City.\n\nI value Matt's hard work, his impressive skill set, and his  friendship. He has been by my side when I faced the toughest primary  challenge of my career, when we fought together to pass the Respect for  Marriage Act into law--ensuring marriage equality for LGBTQ+ families  across the country,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…there were a lot of major Wall Street traders--Jim  Cramer--who are experts on Wall Street, and they talked about what a  devastating day this has been. This was actually the toughest day, the  biggest tumble the stock market has taken since 2020 in the pandemic.  But this was not a pandemic. This was not a global pandemic. This was a  self-inflicted wound…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…serves our country, which until now I thought was a noncontroversial  and bipartisan idea.\n\nMr. AUSTIN SCOTT of Georgia.  Foxx), the Chairwoman of the Rules  Committee and the toughest lady in Congress.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…ravaged our coast. His efforts have  strengthened our environment, commercial fisheries, and coastal  communities.\n\nWhile Commissioner, Pat engaged stakeholders on some of the toughest  issues facing our state. He worked diligently to understand the  concerns of Maine's fishing communities and translate those concerns  and recommendations into public policy.…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…service and his ability to gain the trust of  multiple Members of Congress from diverse backgrounds.\n\nNot all positions on the Hill are equal, and Daniel has had perhaps  the toughest assignment. He routinely handles the most challenges  questions put to lawmakers by the Capitol Hill press corps. They are  trained to find vulnerabilities in any argument…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…He felt called to public service as a police officer. When he went to  work, he joined the Metropolitan Police Department in Washington, D.C.,  and was sent to some of the toughest neighborhoods in Washington, where  I had actually been a prosecutor many years before.\n\nOn that tragic day, he was one of the 140 officers who were attacked  and injured.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Iraq with my colleague, Congressman Seth Moulton.\n\nMr. Speaker, Father Shaughnessy is not just a priest. He is a quiet  force who brings peace and strength to those in the toughest of  circumstances. I am honored to have him here with us today.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692491/welcoming-reverend-paul-shaughnessy"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…loyalty among the teams. He doesn't just work  hard; he works well with everyone.\n\nWhen the stakes are the highest, he always delivers results. I have  watched Arjun take on the toughest challenges and find solutions that  other people have missed. That is exactly what Social Security needs  right now in our Nation because for 90 years, Americans have relied…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…over 20 years of service, and I  fought alongside the best that this Nation has to offer. I have also  stood beside too many of my brothers and sisters as they face their  toughest battles--not in  the air, but when they got home, in hospital rooms, fighting a disease  that they never saw coming.\n\nThat is the story of my friend, Colonel Andy ``Pablo''…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…of California but to the California Air Resources  Board.\n\nThis standard, believe it or not, of the three California regulations  we are discussing today, has probably the toughest timeline of  compliance.\n\nNow, Madam Speaker, you had to pay close attention because at first I  thought my team had made an error. This rule would require a 75 percent  NOX…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…of  our Nation's independence.\n\nThis time capsule is one way that Congress will participate in the  Nation's yearlong celebration of liberty and independence. Amidst our  toughest challenges of the day, this legislation reminds us that we can  all work together.\n\nUnder this bill, leaders from both parties will work alongside the  Architect of the Capitol…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…arguments.\n\nShe is also well known and well respected by our own Senate Judiciary  Committee. The committee has called on Professor Mascott repeatedly to  testify about some of the toughest constitutional and statutory  questions. She has also filed amicus briefs on behalf of Members of the  committee in very important cases. We trusted her judgment then, and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…turning 250 on July 4, 2026. This time capsule represents  one way that Congress will participate in the Nation's yearlong  celebration of democracy and freedom.\n\nAmongst our toughest challenges of the day, this legislation reminds  us that we can all work together. The contents of the capsule will be  selected by the Speaker of the House, House minority…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the prosecuting attorney's office, where he was  elected in 2014 and has since dedicated himself to justice in our  community.\n\nOver the years, Larry has tackled some of the toughest cases--murder,  assaults, gun crimes, gangs, witness intimidation--always with  integrity and unwavering commitment to public service.\n\nLarry once said that being elected…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Dr. Jackson was honored with the Outstanding Alumna of  2025 Award from the University of Arkansas Community College at  Morrilton.\n\nThis incredible woman overcame life's toughest challenges and  hardships, experiencing extreme poverty at a young age. She was forced  to drop out of school in the eighth grade to take care of her disabled  brother.\n\nDespite…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…spot in this  otherwise very troubling picture has been Teach For America, otherwise  known as TFA.\n\nWhat TFA does is recruit recent college graduates to go teach in the  toughest schools, schools in low-income communities. It is a very  selective program. In some years, the acceptance rate for those who  apply to be TFA teachers is as low as 11 percent.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Iditarod just concluded in Nome with a stunning first-time win by  Alaskan Jessie Holmes and his 10-dog sled team.\n\nThe Iron Dog Race, that is a snow machine race, longest, toughest  snow machine race in the world, was won by--that is done in kind of  tandem--Robby Schachle and Bradley George, their second victory of the  Iron Dog snow machine race.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…him for service in the 75th  Ranger Regiment, where he served as an operations officer and later  commanded the 4th Ranger Training Battalion, helping to shape the  Army's toughest trainees into elite warriors.\n\nThroughout his career, General Mingus was repeatedly entrusted with  greater responsibility. This was a reflection of the confidence placed…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}]