[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…flock to each  year.\n\nUnfortunately, this tax-breaks-for-billionaires bill threatens to  upend the district's economy, shutter small businesses, and disrupt  south Florida's tourist industry.\n\nAs it is currently written, this bill would impose excessive fees on  employment authorizations sought by asylum seekers and individuals  holding temporary protective…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…modernizing TSA, full-strength staffing at Customs and Border  Protection, and extensive marketing efforts. New York City, which I  represent in part, is a major worldwide tourist destination.\n\nThere is still time to build this industry to make us the best in the  world.\n\nMr. Speaker, I thank the U.S. Travel Association for leading the way.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to rewrite the history of what happened here on January 6, 2021.\n\nThey are so desperate to paper over what happened that day, to  whitewash it and to pretend it was a normal tourist visit. I was here,  Mr. Speaker, here in this Chamber where you are sitting right now, and  you can be damn sure I am not going to let anyone pretend that January  6 was a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…other place in the country.\n\nThroughout the 1950s, the visible mushroom clouds often loomed in the  distance. They could be seen from the strip, and they became part of a  tourist attraction there in southern Nevada.\n\nThese tests were conducted for a number of reasons. They were to  better understand the power and effects of nuclear weapons, what were…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…happening in Virginia. Agritourism is now a billion- dollar industry across the country, and it keeps growing. It is  revitalizing local, rural, and small-town workforces. The tourist  dollars are also expanding hotels, restaurants, and businesses nearby.\n\nThese farms also offer unique educational and recreational  opportunities for children and families…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…events, as well, such as an  art show in May and the recent 20th annual Seniors Week in October with  multiple activities. There are trips planned to shopping locales and  tourist sites, as well.\n\nFrom the floor of the House of Representatives, we salute the work of  the Dobbs Ferry Seniors and the active and energetic members who show  that age is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…national parks we have, including the Congaree National Park.  They  are going to come visit Fort Moultrie, Fort Sumter, the Reconstruction  Era National Historical Park--six big tourist attractions.\n\nI just read the other day that already tourism and visitations at  Myrtle Beach are down over 15 percent already. Why? Because this is the  time of year that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…attacking officers, including Mr. Tate, with bear spray and a  metal whip.\n\nYou heard a moment ago that our President and some of our Republican  colleagues said that this was a tourist event, but I know not many  tourists bring bear spray and whips to the Capitol. The man who  attacked him was also a fugitive from justice at the time he came here.  He had…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…airports. I represent Disneyland, and I know many tourists from across  the world want to come and hang out with Mickey and Minnie, and they  don't want to wait to spend those tourist dollars in my district.\n\nWhile we need more manpower at our ports of entry, technologies will  help get people and goods across our borders quickly and safely.\n\nThis bill…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are being cruel.\n\nMr. Speaker, 850,000 people. That is something to remember. That is  before you get all the people coming here on work visas, all the people  coming here on tourist visas, and all the people coming here on student  visas.\n\nOne just has to look around and realize that the idea that we are  being cruel to people who came here across our…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…measures such as pedestrianized city centers,       commercial districts, residential neighborhoods, public       parks, recreational areas, educational institutions, and       tourist destinations.\n\n(C) A comprehensive summary of actions taken by the       Department of Homeland Security, the Transportation Security       Administration, and the Cybersecurity…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Myrtle Beach.\n\nShe is a pioneer. She has worked harder than anyone. In fact, she is  one of the hardest-working women that I know to make North Myrtle Beach  not just a premier tourist destination but a place we are all proud to  call home.\n\nShe has championed beach renourishment, expanded recreational  opportunities, and helped build major infrastructure,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…wished they were all dead'' and would conduct the attack again if he  had the chance. He, too, was able to enter the United States through  the front door, this time with a tourist visa, under the Biden  administration.\n\nThis can never be allowed to happen again, regardless of which party  controls the executive branch. While we have a President who…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…district as the Saratoga National Battlefield Park.\n\nSaratoga County, New York, is the fastest growing county in New York  State and features a robust economy and world-class tourist  destinations for families and history buffs alike. However, this  prosperous community in upstate New York would not exist if not for a  series of legendary events that took…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…but it will  make the front page of your local paper.\n\nEstablished by Congress in 1972 to enhance public recreation, the  Glen Canyon National Recreation Area is a premier tourist destination  that offers world-class water-based, backcountry, and off-highway  recreation opportunities. Off-highway vehicle recreation predates the  recreation area's establishment…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…harvesting and  mining.\n\nThese are good mining job. Mr. Speaker, according to 2023 statistics,  the average miner in the State of Minnesota makes $115,000, and the  seasonal tourist employee makes $35,000.\n\nUnions, LIUNA, NABtu, operating engineers, the Iron Range, and  building and construction trades all support this project. These are  good union jobs.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we took in  850,000 naturalized citizens; those are new citizens.\n\nThat is not including the approximately 10 million people who are  here on student visas, work visas, or tourist visas. As far as people  who want to spend a short time here, particularly to work, we are even  more generous that way. I have heard of no strong efforts being made to  greatly…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…established in 1880.\n\nOriginally a mining community, the area has become known throughout  Colorado for its gorgeous scenery, its incredible outdoor recreation,  and its unique tourist attractions.\n\nThis year's award honors Rico for excellence in both leadership and  economic development. The town earned this distinction through its  commitment to revitalizing…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697140/recognizing-2025-small-community-of-the-year-rico-colorado"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…send it to the Senate,  and let's fix our broken immigration system.\n\nI introduced legislation today to say that we should pause legal  immigration except for very short-term tourist visas. Yes, pause it  all. We have 51 million people in this country who are foreign born. We  have massive abuses with diversity visas and chain migration in which  tens…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…agricultural community, Lou Taubert has grown to be a cornerstone of  the Casper community. Now, over 100 years later, it does not matter  whether you are a rancher, a cowboy, or a tourist passing through, you  are treated to the authentic spirit of the West at Lou Taubert's.\n\nPlease join me in recognizing and celebrating the accomplishments of  Casper, Wyoming's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}]