[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…there is no  other Republican on the floor, to try to forget what happened, erase it  from the minds of Americans, and erase it from the history books. It  was just a group of tourists taking an amble through the Capitol.\n\nMr. Speaker, the President of the United States inexplicably has  described January 6 as ``a day of love.'' Mr. Speaker, I call it what…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…businesses in my district and the entire country. It hurts  consumers as well.\n\nOn top of that, this is summer tourism season in Rhode Island, and we  typically get a lot of tourists from Canada and Europe who come to  Rhode Island for our beaches, our food, and our hospitality. Wouldn't  you know it, international travel into Rhode Island and the entire…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tariffs. Our farmers are taking a beating.\n\nIn New York, Donald Trump's 35 percent tariffs on Canada have been  devastating. We depend on tourism. More than a quarter of the tourists  who visit Niagara Falls and the wine country in the Finger Lakes region  are from Canada. So many from Canada flood New York City every year.  And yet, this year, tourism…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…Falls is the crown jewel of our  great city. After Niagara Falls, by volume, it is the largest set of  waterfalls east of the Mississippi River. Hundreds of thousands of  tourists come from all over the world to be inspired by the beauty of  its roaring water.\n\nAdditionally, our Great Falls are unique as both a historical and  national landmark. Alexander…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…billion in  economic output and an estimated 88,000 jobs.\n\nBesides this tremendous cost, no one likes to wait in line at  airports. I represent Disneyland, and I know many tourists from across  the world want to come and hang out with Mickey and Minnie, and they  don't want to wait to spend those tourist dollars in my district.\n\nWhile we need more manpower…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…business is not the only one. Many of our small  businesses in New Hampshire are reliant on travel and tourism.\n\nI have heard from business across our State about Canadian tourists  canceling plans already, about bookings that they rely on that are not  going to come through. Last week, we saw that airline tickets from  travelers coming from Canada this…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…with bear spray and a  metal whip.\n\nYou heard a moment ago that our President and some of our Republican  colleagues said that this was a tourist event, but I know not many  tourists bring bear spray and whips to the Capitol. The man who  attacked him was also a fugitive from justice at the time he came here.  He had been released on bond from Texas. He…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…agritourism across the country, 1,500  of which are in the Commonwealth of Virginia.\n\nAgritourism, for those who don't know, is exactly what it sounds  like. We are bringing tourists to farms or agricultural venues and  offering experiences related to farming, rural life, and food.\n\nFrom wineries like Stone Tower in Leesburg, farm breweries like  Wheatland…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…District. That money, taken from  D.C.'s budget and paid by D.C. taxpayers, goes toward supporting public  safety, social services, and critical infrastructure that residents and  tourists alike rely on.\n\nThe Senate already passed the fix. The bill is ready for us to vote  on. Even Donald Trump says he supports it. I can't believe it, but he  says that he supports…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…correct this.\n\nYou know, we all want what the President wants. The President wants  our Nation's Capital to be the safest, cleanest, most welcoming city.  DC gets 26 million tourists every year. In 2026, we are going to  celebrate 250 years. We want to show off DC and the whole region. If we  allow this mistake to take place, DC will lay off cops. It will…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688853/district-of-columbia-local-funds-act-2025"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…south Florida businesses the flexibility they need to keep moving and  to keep thriving.\n\nI also have an amendment that strikes the visa fee for this bill.  Imposing a fee on tourists at a time when U.S. tourism is experiencing  instability and unprecedented lows because of reckless trade wars would  be catastrophic to our economy.\n\nFurthermore, my amendment…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…impact in my home state of South Carolina is in the  tourism industry. Tourism is a clear example of people, interacting  with unfamiliar people and places, benefit both the tourists themselves  and the communities they visit.\n\nThis Administration's divisiveness is turning people off, and South  Carolinians are suffering the consequences.\n\nThe tourism…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…included the       society among its list of free attractions--open by       appointment and closed on weekends--in Lower Manhattan. Even       then, only a half-dozen or so tourists might wander in every       week.\n\n``This is both a big and a small place,'' Wartenberg Kagan       said. ``That's one of its problems.''\n\nFor the last several years, the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…great Nation.\n\nIn no way, shape, form, or fashion should we be charging adults as  minors and allowing them to return to commit similar or more violent  crimes. The citizens, tourists, businesspeople, and every other member  of this city deserve safety and security. I urge my colleagues to  support this bill, which will ensure just that.\n\nWe will restore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…handed us the blueprint to restore safety in  America's cities. Families are safely going out to restaurants,  businesses are seeing life return to their neighborhoods, and tourists  feel secure, knowing law enforcement officers are empowered to do their  job and enforce the law.\n\nThe D.C. CRIMES Act ensures that the gains we have made are not  rolled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Commerce  Committee.\n\nSo this is about as bipartisan as it gets. And what I want to do is  to cut through the confusion that there now exists with certain States  and a lot of tourists in my great State, to affirm the right of the  Alaska Native people to continue these centuries-old practices of  sustainable, respectful ivory carving, entirely within Federal…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Pappas, a distinguished gentleman who devoted more than 30  years to the restaurant scene in Savannah, Georgia.\n\nAs a longtime owner of the Olympia Cafe, he united locals and  tourists with his cherished recipes, exceptional culinary skills, and  warm personality. Under his leadership, the restaurant gained  significant acclaim, being ranked in the top 10…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…from grace of a once enthusiastic       recruit on a sacred national mission of accompanying Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary talent utilizing a relieving dose of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…role in wildlife conservation by educating the  public and supporting endangered species. The park's success has  significantly contributed to Madison's economy by attracting tourists  from across the Nation.\n\nAccessibility is a priority with wheelchair-friendly amenities  ensuring all guests can fully enjoy the experience. TIME highlights  Georgia's commitment…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to reduce government spending is called the Washington  Monument strategy. If anybody suggests cutting the budget, then just  shut down the Washington Monument until enough tourists complain to  their Congressman.\n\nWe saw this strategy implemented with a vengeance during the  government shutdown under Obama. All reservations at the national parks  were…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…mentioned. It is beginning of the  summer tourism season, right around the corner. The first cruise ship  will dock in Southeast Alaska in less than 2 weeks, and thousands of  tourists from all over the world will come to our great State.\n\nAnyone watching in the Gallery, we would love to have you. Come to  Alaska.\n\nFor many of these tourists, this is going…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…restrict access to parts of their county over their  objections.\n\nThese roads we are talking about are important to those residing in  Wayne and Garfield Counties and the tourists who come here from all  over the world. They have used these paths to get to places that are  part of their history and part of their recreation for generations.  These road…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a solid fact case.       With help from Joe David Rice of the Arkansas Department of       Tourism, we discovered the fact that Texans were the number       one source of tourists in Arkansas.\n\nThe Senator was amused, but nonetheless agreed to co-      sponsor S. 2125. He announced his intent on February 20, 1984       in a statement inserted in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]