[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…loans,  and technical assistance for farmers who want to participate in  agritourism.\n\nThese resources will attract private investment not only in  agritourism but also support tourism and hospitality industries in  rural areas, which will keep our farms and rural communities strong,  resilient, and thriving.\n\nI also plan to relaunch the bipartisan Agritourism…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…frontline communities.\n\nThis bill also greenlights unchecked offshore oil and gas leasing. It  guts environmental reviews and public comment requirements. It  threatens fisheries, tourism economies, and coastal communities that  will see pollution, spills, storms, and sea level rise long after the  members who voted for this bill are gone. It abandons and condemns…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…from us.\n\nWe have seen this time after time. Now, it is with the illegal sweeps  of immigrants, including immigrants who are here on travel visas,  leading to a stark drop in tourism, and the possibly illegal usurpation  of our taxation authority by an unprecedented series of tariff  announcements.\n\nA great gauge of how corrupt things are right now is…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…national marine sanctuaries encompass over half a million square  miles of America's most precious underwater ecosystems. They are  economic engines generating billions in tourism revenue, sustaining  entire coastal economies. They are living laboratories also where  families snorkel with sea turtles, divers explore historic shipwrecks,  and scientists…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…flexibility they need to keep moving and  to keep thriving.\n\nI also have an amendment that strikes the visa fee for this bill.  Imposing a fee on tourists at a time when U.S. tourism is experiencing  instability and unprecedented lows because of reckless trade wars would  be catastrophic to our economy.\n\nFurthermore, my amendment eliminates the cruel remittance…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…sought after location for film production. As the backdrop for major  television shows and box office hits alike, film production in Oregon  brings with it good-paying jobs and tourism that in turn support local  businesses and economic development across the State. Certainly all  film producers in Oregon and across the country should aspire to  achieve…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the face of environmental change.\n\nBeyond ecological damage, invasive species impose billions in  economic costs each year. They harm agriculture, forestry, fisheries  and tourism by reducing crop yields, damaging forests, disrupting  marine ecosystems and degrading natural landscapes that communities and  industries rely on.\n\nIn Hawaii, this threat…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Madam Speaker, I rise today to honor the life and  legacy of David DePetrillo, a tireless champion for Rhode Island.\n\nFor over three decades as our State's tourism director, David made it  his mission to showcase the best of Rhode Island, including our  historic landmarks, small businesses, and stunning coastlines.\n\nTo him, this work…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…in many ways. And then when you  add to it the insults that were hurled at Canada--the ``51st State,''  the ``Governor of Canada''--it has had a catastrophic impact on the  tourism Vermont has depended on from our Canadian neighbors with whom  we have enormous respect.\n\nThat is not just true for Vermont. New Hampshire, Maine, Montana are  seeing an incredible…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…taking it out in the first place? That is  what education is all about. We are in need of bringing our people  together.\n\nMy number one industry in South Carolina happens to be tourism. When  I came to Congress, the two big things in South Carolina were tobacco  and textiles. Today, it is transportation and tourism.\n\nTourism is big for my State. People are…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…lumber to soil to energy to food and  even to hockey teams.\n\nThis damaging trade war with Canada has caused prices to rise, led to  more job losses, disrupted trade, and caused tourism to drop 31  percent. These are no victories.\n\nMr. Speaker, I just wish to say that I voted to end this upside-down  trade mess today. Let's strengthen our economy and make…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise to speak in support of H.R. 617, the American  Music Tourism Act.\n\nMadam Speaker, I know Republicans want to pretend like it is business  as usual around here, but the daily chaos and illegal activity that we  are seeing from the Trump…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…coming out of this  White House is appalling. Enough.\n\nMr. McGOVERN. Mr. Speaker, I am not going to respond to the gentleman  who characterized January 6 as a normal day of tourism here.\n\nMr. McGOVERN. Mr. Speaker, I thank the gentleman for pointing out  these anecdotal cases of voter fraud, and I appreciate the fact that he  mentioned they were all…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…President's social media posts from just 2 days ago where he said:\n\n``Ontario won't even put the U.S. spirits, beverages, and other  alcoholic products, on their shelves.''\n\nTourism from Canada is down 30 percent. People in the hospitality  industry--Las Vegas, my home State of New York, and the chairman's home  State of Florida--are losing their jobs…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…event leverages public- private partnerships to promote conservation of migratory bird  populations and promote millions of dollars of economic development  through nature tourism, research, education, and outreach.\n\nOhio is proud to host our guests from near and far. We welcome  everyone during America's Birding Week. Let this continue for  generations…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…growing conditions, residents were successful in  farming, and in establishing factories to produce lumber, boots, shoes,  and barrel staves.\n\nAs the town grew, so did trade and tourism. The Cumberland and Oxford  Canal opened in 1832, tying together the Sebago Lake and Portland  economies. Later, in the 1870s, the Portland and Ogdensburg Railroad  expanded…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Kentucky. Mr. Speaker, I rise today to honor the memory  of Tony Sloan, a founding father of tourism and excellent marina  operations on Lake Cumberland in southern Kentucky, and on Dale Hollow  Lake in Tennessee.\n\nTony was baptized into lake life at an early age, working…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…has served the Alabama Municipal Electric Authority  (Chairman), Alabama League of Municipalities (Past President), Alabama  Monument Protection (Vice Chair), Auburn-Opelika Tourism Bureau, Lee- Russell Council of Governments, Opelika Planning Commission, Auburn  University Regional Airport, Master Mason and member of Twin City Lodge  No. 76, Emeritus…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "John Thune", "party": "Republican", "sentence": "…safety and security,       and subsistence impacts associated with the hypoxia or       harmful algal bloom event, including to fisheries and       aquaculture, recreation and tourism, monitoring and       management, resource use, and event response activities,       assessed in comparison with historical data from when a State       or region did not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for Moroccan pottery classes; $2 million for sex changes and  LGBT activism in Guatemala; $33,000 for being LGBTI--I can't even keep  up with this stuff; $6 million to fund tourism in Egypt; $32,000 for  transgender comic books in Peru; and $1 million to help disabled people  in Tajikistan become climate leaders.\n\nIs that what Democrats think their taxpayer…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…decision.\n\nRDC is a statewide, non-profit trade association founded in       1975. Our membership is comprised of individuals and       companies from Alaska's fishing, tourism, forestry, mining,       and oil and gas industries and includes Alaska Native       corporations, local communities, organized labor, and       industry support firms. RDC's…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…service fees. It would also require the lodging and  booking industries to clearly display the final price of a stay,  providing transparency for consumers and improving American tourism and  hospitality.\n\nMr. Speaker, I thank Representatives Castor, Fry, and Mullin for  their collaboration on this bipartisan, commonsense, pro-consumer  legislation, and I…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690198/hotel-fees-transparency-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…connect two Cape Fox parcels and  honor a promise made decades ago.\n\nThis bill also paves the way for a renewable energy corridor and  year-round access to vital subsistence and tourism areas. It enables  local development, supports energy independence, and strengthens  southeast Alaska's economy, all while respecting Tribal sovereignty and  the original…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…land. It has wide  support, as noted by my friend, including our local county and city  officials in the county where it is located: Governor Sarah Sanders,  Arkansas Parks & Tourism, the leadership of our Game and Fish  Commission, and many other local  leaders and outdoor recreation groups in our State.\n\nRest assured also, Mr. Speaker, the current forest…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…many years of dedication to  public service.\n\nMayor Keller has long been a committed civic leader in New Hope, a  historic river town known for its vibrant small businesses, tourism,  and strong sense of community. Throughout his time in public service,  Mayor Keller has worked diligently to preserve the character of the  borough while supporting responsible…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…ecological health through stewardship, education, and outdoor  recreation.\n\nWhile serving as chairman, Dr. Clark was instrumental in expanding  the park's mission to promote tourism and education. Under his  leadership, the park strengthened partnerships with organizations such  as the University of Georgia, focusing on conservation efforts to  maintain…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Texas.\n\nFollowing his military service, Commander Lux continued to  demonstrate his dedication to his community. He has served on the Cedar  Park City Council, the Cedar Park Tourism and Advisory Board, and the  Planning and Zoning Committee. Additionally, he is a member of the  Board of Directors for the Williamson County Appraisal Board, where he  also…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…views, and a  legacy of excellence.\n\nIts pristine beaches and award-winning accommodations make it a  standout destination. Both resorts contribute significantly to  Georgia's tourism industry, attracting visitors from across the  country. Their recognition highlights Georgia's ability to offer  diverse and high-quality travel experiences. I encourage everyone…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Heritage Community of the Year  through the PA Route 6 Alliance.\n\nThis award is presented each year to one designated heritage  community  that has embraced their heritage tourism work plan and has implemented  worthwhile projects that show impact and results in their community.\n\nCoudersport will be officially recognized during a ceremony on  Wednesday…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695113/coudersport-2025-heritage-community-of-the-year"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "…act.\n\nWe have the opportunity today to vote on legislation centered around  something that brings us all together, and that is music. Today, we  will take the American Music Tourism Act under consideration. It is a  bipartisan piece of legislation that I am proud to have led through the  House alongside my co-lead, Representative Nanette Barragan.\n\nIt…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}]