[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…reality is that the Federal  Government should be spending its scarce resources to focus on  protecting communities closer to roads because that is where the  people, homes, and towns are.\n\nCan I talk for just a minute about the economics of building roads in  roadless areas? The Forest Service maintains a more than $8.6 billion-- with a ``b''--backlog on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…in creativity  and care for one another.\n\nI am proud to represent Milford in Congress, and I will keep fighting  for the investments, partnerships, and policies that empower towns like  Milford to thrive. When small towns succeed, our whole State grows  stronger.\n\nCelebrating the Anniversary of the Liberation of Delaware\n\nMs. McBRIDE. Mr. Speaker, I…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…would do  to the region we call home. It was a worthy and passionate fight then.  We were proven to be right many times over since when we go to the  hollowed out cities and towns of our country. I just feel so honored  that he was a part of that great struggle for America's people.\n\nFollowing his service with Sherrod Brown, Steve would join our office…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…beautiful repeal instead.\n\nLet's pass the Protecting Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that people  in small towns and rural communities will have more access to quality  care, not less.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…agriculture, and industry--serving as a vital link       in both Ohio's past and its future; and\n\nWhereas, its 406.8 square miles of rich farmland, flowing       rivers, and vibrant towns have been home to generations of       Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud       testament…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the modern-day realities of law enforcement.  Those realities are that police forces are the ones equipped and  trained to contain the kinds of potential threats in cities or towns or  States that purportedly Donald Trump wants to use the military to  quell.\n\nWell, the simple fact is, on the streets in those neighborhoods,  there is no threat of violence…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…to list out some of the things that I have heard and we  have seen, and I want Americans to think about how they would feel if  these very things were going on in their own towns, in their own  States, in their own communities.\n\nImagine being pulled over and asked for your papers as you pull into  the parking lot at Target. Imagine Federal agents waiting…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…who have  been taken by ICE since this administration began had no criminal  convictions at all.\n\nThat is why we read articles in The Wall Street Journal about small,  rural towns that voted for Donald Trump. They are up in arms and are in  an uproar because people who have done nothing wrong and are pillars of  the community are being taken away from…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…our shores. I was proud to be one of them. We  gathered in the streets. We gathered in front of State capitols. We  gathered on beaches and at national parks and in cities and towns, big  and small alike. For the most part, the demonstrations were peaceful.  In some cities, there were acts of unlawful disruption, and those who  broke the law should be…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…developed societies, there is waste energy that is renewable, reliable,  and constantly available in those vast, underground, big pipes that run  through all of our cities and towns.\n\nGeothermal energy doesn't depend on the weather. It doesn't depend on  the season or geographical conditions. It exists as a consistent and  dependable source for a clean…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…They have already warned us: Unless something is done, there is going  to be a lot of closures and a lot of reductions of services in these  hospitals in rural areas, in small towns, and the inner city. That is a  fact.\n\nIf you want to give tax breaks to the wealthiest people and you don't  care about the impact on the regular families of America, that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…organization in 2016,  has expanded its outreach efforts through tours, educational public  programs, partnerships with schools, and markers in more than seventeen  cities and towns. More recently, the Trail has begun enhancing its  efforts to foster more inclusive and informed communities through  augmented experiences, the first of which was unveiled…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to equitable, universal delivery is one that is near  and dear to my heart as a Senator from Illinois. Across Illinois,  especially downstate, we have many rural counties and towns that  struggle to attract the attention of for-profit shipping corporations.  For these communities, USPS is often the only option to receive mail  and send packages. That…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…throughout Kent County  year in and year out, consistently standing alongside their community  and demonstrating that successful small businesses are the bedrock of  our small towns.\n\nSayers is one of many examples in Delaware and beyond that reminds us  how essential it is that we support small businesses, innovation,  entrepreneurs, and the folks in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…westward movement into the midland of our country, into the  States that border the Great Lakes.\n\nWith that came the development of a necklace of communities dubbed  ``mill towns'' that became the epicenters of invention and innovation,  that inspired all sort of product delivery and responses to the needs  of this world, and impacted favorably not…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…That fuel is E15. E15 is simply gasoline blended with up to 15  percent ethanol, or corn. Ethanol is grown, produced, and refined right  here in the United States, often in towns and communities where  agriculture is the backbone of the local economy, where every dollar  spent at the co-op, in the grain elevator, and at the plants and  refineries that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, in small towns and communities across  America, rural hospitals are critical lifelines. They provide emergency  care, support seniors and veterans, deliver behavioral health services,  assist…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…step toward safer classrooms  across America.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, the reality is that school shootings and acts of  targeted violence continue to devastate towns and communities across  this country. They leave lasting trauma in classrooms, in families, and  in the hearts of children who should never have to wonder whether they  are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…unimaginable for the sport of  hockey.\n\nThose Minnesotans from my district were Buzz Schneider, Mark  Pavelich, Bill Baker, Phil Verchota, and John Harrington. Look at the  small towns where they came from: Grand Rapids, Eveleth, Babbitt,  Virginia, and Duluth. These players grew up loving the game.\n\nThey put that USA jersey on and were coached by Herb Brooks.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…enduring  generosity to her community. Her legacy of care, craftsmanship, and  commitment stands as a model of the quiet, steady contributions that  strengthen families and towns across our Nation. On behalf of myself,  Congressman Jason Smith and the community she served, I offer profound  appreciation for her remarkable life.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…nation grounded in rights, not repression, but grounded in  freedom.\n\nMr. Speaker, that spirit is alive today in the streets of Tehran,  Shiraz, Isfahan, and more than 1,000 towns and villages across Iran.\n\nWe often talk about the American Revolution, but we rarely pause to  recognize what it really was: a movement of ordinary people who refused  to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…badge they wear. They make the badge honorable because of the lives  they live.\n\nEvery time I return to my district, I meet with the sheriffs of the  24 counties, cities, and towns I represent and hear directly from them  about the troubles they face in the line of duty.\n\nIf we want to see safer streets and communities in our country, then  we must ensure…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…changed the course of World War II and, ultimately, the course of world  history. But behind that massive operation were brave individuals like  Floyd--young Americans from small towns like Wauchula, Florida--who  answered the call to serve without hesitation. Mr. Wells' bravery, and  the bravery of all who fought beside him, helped secure the freedom we…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…ratify the  land claim settlement agreement between the Saint Regis Mohawk Tribe,  the Mohawk Council of Akwesasne, New York State, Franklin and St.  Lawrence Counties, the towns of Fort Covington and Bombay, and the New  York Power Authority.\n\nFor more than 40 years, the Saint Regis Mohawk Tribe and the Mohawk  Council of Akwesasne have worked diligently…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…entered into by the Saint Regis Mohawk Tribe,       the Mohawk Council of Akwesasne, the State of New York, the       Counties of Franklin and Saint Lawrence, New York, the Towns       of Fort Covington and Bombay, New York, and the New York       Power Authority.\n\n(2) Any transfer of land, right-of-way, or easement that is       the subject of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…at home. They shipped the good- paying, middle-class American jobs that once were the backbone of our  economy to places like Mexico and China, transforming once prosperous  towns and cities into hollow shells of their former selves, often  defined by addiction and death. All the while, in the forgotten corners  of this land, the men and women who built…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…calling for defunding local  police departments. We recently expanded it to include firefighters and  wildland firefighters, to whom we owe so much for protecting our homes,  towns, and communities, as well.\n\nThe bill was proposed to me by Janine D'Agostini, the wife of then-El  Dorado County Sheriff John D'Agostini, as a small token of appreciation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…around capital formation is centered on  financial hubs like New York and San Francisco, but the backbone of  America's economy is the local business communities in cities and towns  and rural areas across all 50 States: the family-run manufacturers,  agricultural innovators, entrepreneurs, and small-town tech startups.  These businesses face unique but…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692759/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…quality, consistency, and community  support of a small business operating in a humble setting.\n\nThis commendation serves as a reminder that entrepreneurship thrives  in small towns and family-owned storefronts across America.\n\nToday, I congratulate NFA Burger for this tremendous achievement.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking is not just a distant overseas problem. The issue  is here. It is in our communities. It is in our small towns. It is in  our big cities.\n\nI am from Texas and Texas being a border State, we are a hot spot for  human trafficking. We lead the country in that issue. I asked our  elected…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]