[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…own crowd didn't like  that, his own crowd of MAGA people.\n\nSo Donald Trump simply doesn't get it. It takes a special kind of  delusion to tell parents to buy their kids fewer toys and pencils while  bragging about new ballrooms and gold in the Oval Office. You cut back  on your Christmas presents for your kids, who might really want  something and have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…clear this tax is not being paid by other countries.  American small businesses pay the tax. Main Street is paying this tax.  And President Trump is taxing food and clothing and toys and even tea.  And as a small business owner reminded me, the last time there was a  tax on tea, there was a revolution in our country that began in Boston.\n\nSmall businesses…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…country. The global economy is in chaos. We are teetering on the brink  of recession. Administration officials are telling us we should perhaps  prepare to ration dolls and toys this Christmas. Yet, they want to  debate renaming the Gulf of Mexico.\n\nCongress, which more and more appears to just be a joke, is now  advancing a bill that literally started…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the American  people: I have failed you.\n\nI mean, just last week, Donald Trump seriously suggested the one way  families can lower costs is for parents to buy their kids fewer toys.  What kind of Christmas is that? Donald Trump is like the Grinch--just  with a lot more bronzer.\n\nNow, today, Senate Democrats will hold a special caucus lunch to roll  out…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…families will not go hungry in the  holiday season.\n\nTerri also created Operation Hope--a project where she collects and  restores used items such as furniture, clothes, and toys, to give to  any family that reaches out for assistance. Terri began this effort  when she learned that one of her former students was living hand to  mouth, and she decided…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Chicago's most famous  landmarks.\n\nHuggins is an eminent civic leader, as well. He served as acting  chairman of Metra and founded the famous Christmas in the Wards to  distribute toys and other gifts to Chicago's needy.\n\nHe also cofounded the Chicago Football Classic, which is a yearly  football game between two HBCUs at Soldier Field. The game is  accompanied…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689205/congratulating-larry-huggins-on-a-life-of-service-and-achievement"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…administration, which knows no limits. And just in time for the  Christmas holidays, ``President Grinch'' is stealing medication from  dad, inhalers for grandma, insulin for children, toys right out from  underneath the tree.\n\nSo it is absolutely essential that we vote to extend the Affordable  Care Act premium tax credits. We must listen to the American people…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…that long ago.\n\nToday, we have a tax on cars. We have a tax on coffee. We have a tax  on the eggs we import to fill the empty shelves. We have a tax of 125  percent on clothes, toys, and electronics.\n\nWhat does this all add up to? It adds up to a tax of $4,600 a year on  American families. While Trump shrugs at all those rising costs, he  certainly wants…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…healthcare systems and saddle  generations of our people with trillions of dollars in debt so that he  and his billionaire friends can have a few more tax breaks and a few  more toys in their collection.\n\nIs that what you stand for? Is that why you ran for office? Is that  what the GOP and the Republicans in charge of this Chamber ran for and  stand for?…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…visited that apartment building and saw firsthand the destruction  those agents left. Doors to people's homes or apartments were kicked  down. Belongings, including little kids' toys, were strewn about in the  hallway. That raid and so many others shook our community, not just  immigrants, but everyone.\n\nNow, Secretary Noem has brought her reign of terror…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…District.\n\nAfter serving for 10 years in the United States Marine Corps, Rita  has dedicated over 20 years of her life to coordinating the Marine  Corps Reserve DuPage County Toys for Tots program. The program  distributes thousands of toys to more than 25,000 children via a  network of local nonprofit organizations, churches, and community  agencies.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, no matter who you are shopping for this  holiday season, you will be paying a lot more due to Trump's illegal  tariffs.\n\nPrices for toys and games are up 17 percent. Clothing and shoes are  up 20 percent. Electronics are up 34 percent.  Home and kitchen gifts are up a whopping 38 percent.\n\nToo many Arizona families…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698328/president-trumps-illegal-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…cute, soft, and  cuddly. He is only triple the cost of a normal bear like him. He is  here to show us how this administration's tariffs are raising costs on  families' favorite toys, clothes, and shoes because toys like him are  becoming unaffordable to families.\n\nI recently got a letter from a concerned young Scout who is worried  that the administration's…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692923/lowering-costs-for-all-virginians"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…China. But there is no plan. The President is making it up as he  goes along, and the people who are going to suffer are going to be the  small business people.\n\nIf you import toys, and there are maybe 20 different countries from  which you import your toys to put on the shelves of your stores on Main  Street everywhere, and parents can go in to buy the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the morning after--the  scene of one family sitting charred around the breakfast table; out in  the yard, bits and pieces of children's clothing; the broken arm of a  doll; toys and debris scattered over the landscape. And he said: `I  thought about that scene, and I said that someday Everett Dirksen will  be buried in Illinois, and when that happens,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the early days of HEARTS and served on its  board of directors for many years advocating for his fellow veterans in  addition to his support for the local Marine Corps League, Toys for  Tots and Semper Fi Fund. It is this advocacy and impact which lead him  to be tapped to serve on the inaugural Congressional Veterans  Commendation committee for East Texas.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…in community service initiatives to benefit North Texans. He serves as  the President of the NCT 911 Board and the Chairman of the Wise  County's Santa's Deputies to deliver toys and food to families in need  during the holidays. Moreover, Lane is an accomplished author, and in  2024, he published his first book, The Point: Dawn of the Texas Meth  War,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…economy and our national  security. These tariffs will cost the average American household about  $1,200 a year. They will raise costs for avocados, appliances, diesel  fuel, dog toys, car parts, Christmas tree lights, tomatoes, and  tequila. I could go on.\n\nOur economies are so closely integrated--the United States, Canada,  and Mexico--that it will increase…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Produce, Chick-Fil-A, Cocina Cafe, Health First Hospital, Gator  Automotive, Frog Bones-Family Shooting Center, Z88.3FM, All Digital All  Day, Grifols Plasma Distribution Center, Toys for Tots North and South  Area, Al Dia Today Newspaper, Martin's Famous Potato Rolls, and  Premiere Oaks 10 Cinema, the mission of this event is simple but  powerful: to create…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…granted early release.\n\nThe parole board has granted parole to Mr. Funston, a serial child  molester, who, according to the Sacramento County Sheriff's Office,  used candy and toys to lure children 7 years old and younger. He was  convicted of 16 counts of kidnapping and child molestation. According  to the sheriff, multiple young children were victimized,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…and grief, then  redesigning the children's waiting room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting positive impact on  the community.\n\nOn behalf of the 17th Congressional District…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Detachment of the Marine Corps League is a  community service organization composed of active, retired, and former  Marines. Since 1947, the mission of the U.S. Marine Corps Reserve Toys  for Tots program has been to collect new, unwrapped toys through  October, November, and December each year and distribute them as  Christmas gifts to less fortunate children…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698118/recognizing-nittany-leathernecks"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…year--my friends across the  aisle are quick to point out that America is getting sicker and that we  are spending more and more money on healthcare. Yes, we have all sorts  of new toys and new treatments available and new drugs out there, but  if you want me to impact the true cost of healthcare--whether you are  getting your insurance through your workplace,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Response Team and the Homeless  Outreach Team, where he serves our vulnerable population with  compassion and with grace.\n\nSergeant Chaney has also served as Santa Claus for the Toys for Tots  program. He is part of the honor guard, and he is an active participant  in the Cadet Explorers program.\n\nMr. Speaker, I ask my colleagues in Congress to join me in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691305/recognizing-sergeant-olav-chaney"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…countless lives  with his infectious smile and genuine love for every person he meets.\n\nWhether Brother Gary is emceeing the Gorgeous Grandma Pageant,  championing the Marine Toys for Tots on television commercials, firing  up the crowd at Riverside Stadium for the Victoria Generals, or leading  the Christmas parade, Brother Gary shows up with enthusiasm…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Baraga School, teaching students about patriotism and proper  flag etiquette. His community commitment is further reflected in his  charitable efforts, including distributing toys at Christmas and making  pasties to support his local VVA chapter.\n\nMr. Speaker, let us all join in recognizing Roger Sarrault for his  extraordinary courage as a member of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…studio in Chicago, turning it into a  thriving business. More recently, he continued his service to others  through volunteering for the Marine Corps. Richard helped run the Toys  for Tots program in Illinois and served as an ombudsman for local  nursing homes. His dedication earned him the title of Volunteer of the  Year, further demonstrating his compassion…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}]