[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…and services in Ukraine, Iran, and across  the Indo-Pacific.\n\nAnd I want us to understand that what happened in the spring around  DOGE and USAID--a lot of people are not tracking some of these funding  areas, but, for instance, this is about getting our message out in  Ukraine, this is about countering the Government of China's propaganda  in the Indo-Asia…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…unauthorized attempts to access the network user location data of  communications service providers operating in the USA.''\n\nHe added that foreign surveillance went beyond location tracking and  included ``the monitoring of voice and text messages'' and ``the  delivery of spyware to targeted devices.''\n\nCISA's multiyear coverup of the phone companies' negligent…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…could give to the  predators and creeps who want to stalk and spy on children. Sexual  predators will have a far easier time stealing and extorting  photographs of children, tracking their phones, and spying on their  private messages once encryption is breached. Doing so threatens the  privacy and security of every single law-abiding American.\n\nLast Congress,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…quotas they have been given.\n\nThe Congressional Hispanic Caucus and the Congressional Progressive  Caucus are standing up for the people. We are calling for transparency,  tracking every incident, and working on laws to curb unchecked power  and to restore our constitutional rights.\n\nIn the Fourth District and across the country, every family deserves…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…they have  the audacity to increase the deficit by $4 trillion to pay for tax cuts  for the 800 billionaires that my Republican colleague from Pennsylvania  is so carefully tracking. It is shameful.\n\nThis bill, make no mistake, Mr. Speaker, is a war on rural America.  They are closing rural hospitals by virtue of the bill they passed 15  days ago. Now…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693711/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…President's policies are making  us pay more for goods, such as groceries.\n\nI have learned in my career that results mean more than rhetoric. I  invite my colleagues to join me in tracking what is actually happening  in the country, not the words that are being said.\n\nI ask my colleagues to make a list this week when they shop and jot  down the prices they pay.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695047/buckling-under-the-weight-of-rising-costs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…centralized master file, a de facto digital ID on every American.\n\nThis would be a digital record containing most anything that any part  of the government knows about you, tracking where you live, where you  work, your earnings, your bank account, your health insurance, your  child support agreements, and more.\n\nTo understand the scope of this extraordinary…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…About Smart Devices Act.\n\nMr. Speaker, the Internet of Things has ushered in a new age of  convenience and efficiency for Americans. Smart thermostats save  consumers money by tracking and reporting home energy use and making  recommendations about adjusting temperatures to meet consumers' needs.  Smart refrigerators provide recipe suggestions based on the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Registry for Cancer, which tracked cancer cases and deaths  of firefighters.\n\nCancer is now the leading cause of death for firefighters, and this  database was critical to tracking health and safety improvements for  firefighters and improving working conditions. In another sweeping  effort to cut costs, DOGE eliminated the entire office. Now, this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…unauthorized attempts to access the  network user location data of communications service providers  operating in the USA.'' He added that foreign surveillance went beyond  location tracking and included ``the monitoring of voice and text  messages'' and ``the delivery of spyware to targeted devices.''\n\nCISA's multiyear cover up of the phone companies' negligent…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…catastrophic diagnoses in veteran  populations with similar markers. I, for one, look forward to a day  when we are preventing deaths from occupational exposures instead of  merely tracking them. This bill begins to tackle that.\n\nThis isn't a magic wand to fix and modernize all of VA, but it is a  start. I am confident that with modernization efforts like this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we discern      From our vantage, but hidden when C-SPAN airs      Behold the resolute heels of Senator Blackburn!      They've traveled here from Alabama's waterfalls      Tracking dust from Jersey streets onto the blue rugs      Long ago, Webster's boots echoed across these halls      Stepping over many tobacco spittoon jugs.      Do I belong here?…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…offered no real plans, no real solutions, just more  empty promises with painful cuts and a whopping Federal deficit  increase looming on the horizon.\n\nThat is why I have been tracking congressional inaction day after day  after day on my social media, because families in Maryland and across  the country cannot afford to waste any more time.\n\nHere we are,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689057/voters-sent-us-to-congress-to-lower-costs"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…killed.\n\nWe have seen the images of people being maced at point-blank range.  You can see this in the final pictures of Alex Pretti before he is  killed.\n\nWe know that they are tracking demonstrators with facial ID  technology, following them home to intimidate them. And, in fact, I  have heard stories from demonstrators who have been led home by ICE  agents--so…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the functions of the  laboratory.\n\nThis bill also requires the Assistant Secretary to establish an  initiative to support the development of emergency communications and  tracking technologies. These technologies would then be used to locate  people trapped in areas where wireless connectivity may not be  available due to natural disasters and other…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693437/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…similar       medication be available for members of the Coast Guard--\n\n(1) on all Coast Guard installations; and\n\n(2) in each operational environment.\n\n(c) Participation in Tracking System.--Not later than 1       year after the earlier of the date of enactment of this Act       or the date on which the tracking system established under       section…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Personnel Oversight and       Shift Tracking Act of 2025'' or the ``POST Act of 2025''.       SEC. 2. IMPROVED DATA COLLECTION AND PERFORMANCE                     ACCOUNTABILITY.\n\n(a) In General.--Not later than 1 year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…advancements that are crucial to our global competitiveness.\n\nThis bill also directs ITS to establish an initiative to support the  development of emergency communication and tracking technologies for  use in locating trapped individuals in confined spaces. This is an  important initiative that has the potential to protect and save  American lives.\n\nLast…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in strong support of H.R. 1450, the OFAC  Licensure for Investigators Act.\n\nWhen it comes to combating illicit finance, effective public-private  partnerships are critical. Tracking and disrupting sophisticated crime  networks requires cooperation between our government and private-sector  experts.\n\nThese partnerships play an integral role in our ability…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Marksmanship Ribbon, Armed Forces Expeditionary Medal,  Republic of Vietnam Campaign Medal, and Air Force Outstanding Unit  Award.\n\nAfter leaving the Air Force, Danny became a tracking pilot/recovery  supervisor at the National Center for Atmospheric Research. He was  located in Palestine, Texas at their Balloon facility, wherein,  alongside some of the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Secretary, to provide updates to the information included       in the initial report under paragraph (1) and information       collected pursuant to subsection (c).\n\n(c) Continued Tracking of Cholangiocarcinoma in Covered       Veterans of the Vietnam Era.--The Secretary shall track the       prevalence of cholangiocarcinoma in covered veterans of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689625/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…like CDFIs, which support  communities and high-intensity drug trafficking area programs that are  critical to strengthening this administration's interdiction and  fentanyl tracking efforts.\n\nIn conclusion, this bill funds critical government agencies and  programs and preserves and protects Congress' responsibility of  overseeing how these funds are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…similar       medication be available for members of the Coast Guard--\n\n(1) on all Coast Guard installations; and\n\n(2) in each operational environment.\n\n(c) Participation in Tracking System.--Not later than 1       year after the earlier of the date of enactment of this Act       or the date on which the tracking system established under       section…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…activities involving access to controlled  technologies such as advanced AI chips.\n\nOne example would be conducting surveillance to undermine human  rights through spyware location tracking or biometric identification.  That is not good stuff. We don't want the Chinese and our countries of  concern to be using the best American technology remotely to do that.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…later than 90 days after the date of       enactment of this Act, the       Postmaster General of the Postal Service shall issue       regulations to require the collection, tracking, and public       reporting of information related to deaths and injuries       resulting from traffic crashes involving vehicles       transporting mail. Such regulations…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…via the       LwCLU after mating and prior to launch.\n\n4. The missile is autonomously guided to the target using       an imaging infrared seeker and adaptive correlation tracking       algorithms. This allows the gunner to take cover or reload       and engage another target after firing a missile. The missile       has an advanced tandem warhead and…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…The fact of the matter is that MedPAC, The Wall Street Journal  series, and the ProPublica series have gone over Medicare Advantage. If  any of you have your phone and like tracking stories, put in ``Medicare  Advantage fraud'' right now. You will see at least five major articles  from The Wall Street Journal, ProPublica, and some of the others. In  some…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…citizen, should  live in fear of being targeted for their beliefs, their vote, or their  service.\n\nI would also like to recognize the valiant effort of law enforcement  in tracking down and capturing the suspect in this case.\n\nDespite knowing the danger the alleged murderer posed, for 40 hours,  officers across numerous departments and agencies worked…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…actively monitoring weather and crop health.\n\nIt can also improve our ability to prepare for and respond to natural  disasters by instructing flood plain mapping, tornado tracking, and  drought monitoring, topics that are all front-of-mind for all  Americans, but especially those in my home State of Oklahoma.\n\nCommercial remote sensing can also be helpful…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…environmental reviews and       authorizations is critical for--\n\n(A) effective project management and process improvement;\n\n(B) enabling workflow automation, transparency, and       tracking; and\n\n(C) simplifying reporting requirements;\n\n(5) modern business process management systems that track       Federal agency workflows and produce vendor neutral,       interoperable…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]