[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…percent.\n\nThe vast majority of Democrats voted ``no'' on that bill, which was  the action which made China a worldwide economic superpower. It got  China into the international trading organizations and opened up access  to our markets. We voted ``no'' when a Democratic President was  twisting our arms to vote ``yes.'' It was our proudest moment. I hope…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…pursue opportunities she otherwise would not have. She  is now a U.S. citizen, married, with two beautiful boys. She owns a  home. She manages a global team at a commodity trading company in  Connecticut.\n\nAnother DACA recipient who also came to the United States when she  was 9 years old said DACA was ``monumental.'' It gave her a sense of  independence.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…offering our country none of these things and is  instead pulling the rug out from under this critical sector by  increasing their construction costs with tariffs on critical trading  partners, creating unstable market conditions through careless policy,  in my opinion, and abruptly firing the government workers and domestic  manufacturers who depend on…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…a sign in front of the White House saying: Justice for sale.\n\nWe should be clear that Congress doesn't have to wait to act. We can  ban Members of Congress from holding and trading stock. We can pass  transparency laws like the DISCLOSE Act. Ultimately, we need to pass a  constitutional amendment reversing Citizens United. This is a choice  between democracy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…included the phrases ``at their  best'' and ``on a level playing field.'' And it is regrettably true  that in recent decades, our public education system and international  trading system have not been at their best, and have not brought  students, workers, and countries together, as effectively, they could  have, to learn and to trade on a level playing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…cryptocurrencies  and stablecoins,  allowing exchanges and insurers to continue risky, fraudulent, and  illegal practices with limited oversight by the SEC or Commodity  Futures Trading Commission.\n\nThese bills give the crypto industry exactly what it wants. They get  the illusion of a real regulatory regime and the legitimacy that would  bestow. They get…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…want these  arguments in Congress. The voters want us to be working to help them  afford healthcare, rent, and childcare.\n\nMr. Speaker, none of us wants to spend the next year trading divisive  disapproval resolutions.\n\nMr. GARCIA of Illinois. Our voters do not want this either. We should  not be distracted by political ploys when our constituents want…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…supporting the restoration of integrity  and transparency to Washington.\n\nTogether, I honestly believe, with enough reformers, we can change  the Congress. We can ban stock trading by Members of Congress. We can  end dark money in our politics. We can overturn Citizens United. We  just have to have the political will to do it.\n\nMr. Speaker, I thank the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699238/restoring-election-integrity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…risk, many  investors purchased President Trump's meme coin, and in the first few  weeks after its launch, the President, in his second term, profited up  to $100 million in trading fees, while more than 200,000 investors lost  money. There has never been a precedent for anything like this in the  history of the Presidency.\n\nThen President Trump auctioned…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…House floor on overturning a D.C.  city law, we could have done something on corruption or something on  Congress. We could have banned Members of Congress from buying and  trading stock. We could have done something to put some guardrails on  the Presidency so that no President can make money off of being the  President of the United States. We know…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…my time in  this job, and I have introduced legislation to require all Senators to  do the same exact thing.\n\nI have also led on legislation to ban Members of Congress from  trading stocks. Let me be clear. Nobody should be able to use this job  to profit personally. It is horrendous, and it is a huge problem. One  of the first things I did after being…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…make in order  amendment No. 10 to the SAVE America Act, which prohibits Members of  Congress, the President, the Vice President, their spouses, and  dependents from owning or trading stocks.\n\nMr. McGOVERN. Mr. Speaker, to discuss our proposal, I yield 2 minutes  to the gentleman from New York (Mr. Morelle), the sponsor of the  amendment and the ranking…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…he capitulates to Beijing, he is  raising tariffs on Canada.\n\nHow nonsensical. How stupid. How thoughtless.\n\nCanada--one of our strongest allies, one of our most important  trading partners. I don't know of two large economies that are more  entwined than America's and Canada's. And after a year and a half of  failed trade war, Americans have not gotten…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…provision I worked on to ensure  continued public access to Greenbury Point near the Naval Academy and  my efforts with Senator Kennedy to protect investors from foreign  insider trading. And there are provisions that will assist in future  oversight by requiring the Department of Defense to share more  information with Congress.\n\nBut these are not ordinary…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…have to have some credibility and this Chamber, this town, this  Congress, needs more credibility. One way to build that back is to  start with banning congressional stock trading. I think it is an easy  place to start. You talk to people in western Pennsylvania, you talk to  people all over this country who think it is ridiculous that folks in  power…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Street pros were able  to pull that off. I think that has got Americans asking: What does  Congress have, a secret strategy?\n\nThe sad part is, they did. It is called insider trading.\n\nMembers of this body are so good at investing that apps like the  Pelosi Tracker exist as a stock tip machine. It has given investors a  45 percent return in the last year…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…newly imposed 25-percent tariffs on countries doing business with  Iran are designed to strike at the economic lifelines that enable this  repression. Some of Iran's largest trading partners unsurprisingly are  our adversaries. It is both in the interest of our national security  and in the interest of the Iranian people to hold these enablers  accountable.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…the  clarity that U.S. companies need to comply with the tariffs and to make  critical business decisions.\n\nSimilarly, as the administration continues to negotiate with our  trading partners, I appreciate that my colleagues, as well as our  constituents, may be nervous about what comes next. However, at this  juncture, this resolution is counterproductive…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696441/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I rise today in strong support of the  effort to ban congressional stock trading because public service must  never be compromised by private financial interest. The American people  deserve to know that we are acting on their behalf, not for our own…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…stop searching for  the ones who remain missing and unaccounted for until they are returned  to their loved ones.\n\nThat is why today I reintroduced a resolution that urges our trading  partners to aid in the search and recovery efforts of our Nation's  missing servicemembers.\n\nMr. Speaker, we will never stop searching until all our  servicemembers are brought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695819/national-powmia-recognition-day"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Chairman of the Board of Governors of       the Federal Reserve System, the Chairman of the Securities       and Exchange Commission, the Chairman of the Commodity       Futures Trading Commission, and the Secretary of State, shall       conduct a study and issue a report on the exposure of the       United States to the financial sector of the People's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Committee, I am concerned about  Main Street. I am concerned about the 772,047 individuals that I  represent. That is what we should be here about, not trying to get rich  on trading stocks.\n\nMy bill is bicameral. It is bipartisan. As I said before, it is led  in the Senate by Senator Josh Hawley. President Trump has announced  that he will support this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…misses so many  things and, particularly, gives Xi Jinping and the Chinese Communist  Party a giant pass in terms of their history and what they have done to  the international trading system.\n\nFirst, the Freidman article kind of condescendingly mocks, to be  honest, a lot of us. He quotes some Senators, U.S. Senators, and says,  you know, these Senators…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…doing it.\n\nNext week, President Trump has announced plans to impose 25-percent  tariffs on products coming into the United States from Mexico and  Canada, our No. 1 and No. 2 trading partners.\n\nThese tariffs will be disastrous for our economy and our national  security. These tariffs will cost the average American household about  $1,200 a year. They will…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…continue its work on future  reforms to address and strengthen U.S. priorities. After all, U.S.  businesses have invested $8 billion annually under AGOA while our  African trading partners have begun to open their markets for U.S.  agriculture.\n\nProtecting market access for America's farmers and ranchers is  incredibly important to the rural communities…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…voted  for President Trump said they did so out of frustration about high  prices.\n\nWell, today, President Trump has announced he is going to impose  tariffs on virtually every trading partner we have, and I rise in  support of a piece of legislation we are about to vote on here in the  Senate that gives us the chance to do something.\n\nSo to my colleagues,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…create a central  bank digital currency, you have empowered the central bank to see every  side of every transaction.\n\nIn fact, the former director of the Commodity Futures Trading  Commission, Giancarlo, talked about digital dollars. He has gone around  for a long time talking about it and touts the features. They call it  programmable money.\n\nIf you…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…believe that my colleagues  would not just resort to political maneuvers.\n\nI am not a fan of tariffs. That is no secret. I am in favor, however,  of robust engagement with our trading partners. Let me be very clear.  In trade, there is no stagnation. If we are not gaining ground, I think  we are losing ground, and data would show that.\n\nDuring the Biden…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it was that, on both sides of the aisle, there were blatant  abuses of this trust that the American people put in the people who  represent them not to violate that trust by trading securities for- profit on the very issues they are supposed to be voting on objectively  to benefit the United States of America. Yet, that is precisely what  has happened.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Reagan said:\n\nProtectionism costs consumers billions of dollars, damages       the overall economy, and destroys jobs.\n\nRonald Reagan's vision for America can be seen in our trading  relationships with Canada. In 1986, President Reagan said:\n\nOur trade policy rests firmly on the foundation of free and       open markets. . . . I . . . recognize the inescapable…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]