[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…rural America are  paying the price for all of this chaos.\n\nRight now, the real threats to rural America and to water security  and the livelihoods of America's farmers are trade wars that are  hammering agricultural exports. It is not this endangered fish.\n\nThey face a shrinking Federal workforce hollowed out. The very  agencies responsible for permitting…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…happened to the workers in Lorain, Ohio, should happen to no  worker in this country. They deserve better for the hard work that they  do.\n\nMr. Speaker, let's stop the chaos of trade wars, arbitrary pauses,  crazy tariffs, and threats. The American people sent us here for  solutions. They don't need more tariffs that are really taxes on their  cost of living.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…security  circumstances during which tariffs are necessary, that, generally,  ``high tariffs inevitably lead to retaliation by foreign countries and  the triggering of fierce trade wars. Then the worst happens: Markets  shrink and collapse; businesses and industries shut down; and millions  of people lose their jobs.''\n\nThis new tariff hike isn't about security.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…lose their health insurance.\n\nThis budget resolution does nothing to deliver on the current needs  of the American people. As inflation continues to grow and threats of  trade wars persist, the cost of necessities like groceries, childcare,  and housing will continue to increase putting a greater burden on  American families.\n\nTheir budget resolution…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise on behalf of all of the  families who are being hurt by this administration's reckless trade  wars.\n\nLast week, I met with Minnesota families and childcare providers to  talk about how expensive it is to raise a family and care for young  children. I met Nana Renee. She…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…country safe.\n\nI am committed to speaking up for American families and small  businesses that have been shouldering the burden of higher costs  because of President Trump's trade wars.\n\nSo I know he is not listening, but I call on President Trump to  reverse course, to spend the next 100 days fulfilling the promises that  he made during his campaign--promises…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…It is because they are more afraid of his retribution than they  are concerned about the budgets of their families back home, families  who are paying for Trump's endless trade wars.\n\nAccording to the Joint Economic Committee, Trump's tariffs cost  American households more than $1,600 last year--that is $1,600--and  that will continue to rise if Congress…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699901/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…tariffs are also hurting farmers across this country who will  incur greater costs when purchasing potash, a soil fertilizer often  imported from Canada. And by inciting these trade wars, Trump is  cutting off essential export markets for our farmers.\n\nAmericans know these tariffs are going to hit us hard. Our financial  markets are in free fall because Americans…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…embraced  as their salvo to save them from the bleak economic picture that our  country faces today: higher joblessness; Trumpflation; a host of  reckless policies, including trade wars, that have cost the American  people.\n\nThe Republican big, bad betrayal bill is unpopular everywhere in the  country no matter how you spin it because Americans know that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…struggling to try to  get their way. He backed off of the giant tariffs that he put in, but  he left 10 percent tariffs in place.\n\nWe are still in the middle of one of the worst trade wars we have  ever seen in human history based on--what is it?--140 percent now with  China. At some point, it is going to be zillions, I suppose, with those  sorts of tariffs.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…then, while all this is going on,       something even worse occurs. High tariffs inevitably lead to       retaliation by foreign countries and the triggering of fierce       trade wars. The result is more and more tariffs, higher and       higher trade barriers, and less and less competition. So,       soon, because of the prices made artificially high…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…seeing the consequences of allowing the President's  unhinged behavior go unchecked. American families, small businesses,  and farmers are paying the price for these endless trade wars.\n\nTrump's tariff tantrums have cost households more than $1,600 a year  in higher prices. Families in the United States are paying more for  groceries, cars, housing, utilities,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…didn't wish to be ruled by a King who ``cut off our trade'' and imposed  ``taxes on us without our consent.''\n\nBut today we have a President unilaterally declaring costly trade  wars on our allies and imposing hefty taxes on his citizens, a  President who withholds the people's tax money already appropriated by  Congress based on his latest whim. The…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…question was no--are you better off economically than you were 71  days ago?--where were you?\n\nDid you speak up at a time when the President of the United States  was launching trade wars against our closest allies, when he was firing  regulators who investigate America's biggest banks and biggest  corporations to stop them from taking advantage of the little…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…700,000 manufacturing jobs during President Biden's time in office.\n\nHowever, we must not allow President Trump to put this great progress  in jeopardy with his chaotic trade wars and uncertain tariff policies.  I urge my colleagues on the other side of the aisle to stand with the  domestic manufacturers they claim to support by speaking out against…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690288/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…new deals as we speak.\n\nThis is the same decisive leadership that secured stronger trade  agreements with the EU, Japan, the U.K., and partners across Asia.  These aren't trade wars. They are trade wins that deliver more jobs,  higher wages, and greater opportunities for American families and  American products around the world.\n\nMr. Speaker, the same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]