[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…these checks and balances in the Insurrection Act that I have  submitted. It well serves the interests of our States--indeed, our  States' rights--our military, and the traditions and ethos of our great  National Guard and Active-Duty military, and it serves the American  people in preserving rights and liberties that our Founders were  zealous to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…care for creation.\n\nFor more than three decades as Ecumenical Patriarch, His All-Holiness  has been a global voice for reconciliation among peoples of different  faiths and traditions. He has also been one of the first religious  leaders to insist that harming the environment is not simply a failure  of policy but a moral failing. His leadership reminds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…diplomats, military leaders, national security experts, and  even former Trump administration officials have denounced these actions  as undermining our democratic norms and traditions, and I would like to  highlight one such open letter from former U.S. leaders.\n\nWe swore to support and defend       the Constitution against all enemies, foreign and domestic.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…global recognition, including the U.S. Congressional  Gold Medal and the Templeton Prize.\n\nPatriarch Bartholomew's tireless work ethic and dedication has  bridged religious traditions, championed interfaith dialogue, advanced  environmental justice, and fostered unity among diverse Christian  communities. On behalf of Nevada's Greek Orthodox community,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694986/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…a  very positive time, which he harkened us back to and challenged us to  return to.\n\nI thank Steny.\n\nMr. Speaker, his deep knowledge of the institution, respect for its  traditions, and commitment to public service have earned him the  admiration of colleagues on both sides of the aisle.\n\nPersonally, Steny has not only been a trusted partner in leadership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Orthodox community is an important part of our  State's civic and cultural life. Parishes across the State serve as  places of worship, education, and service, and they host traditions  that strengthen families and connect generations. Their contributions  are an important part of Arizona's diversity and character.\n\nI am proud to join Orthodox Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…governance, agriculture  and navigation.\n\nYet, like so many other indigenous peoples, post-contact Native  Hawaiians endured marginalization, suppression and loss of their  traditions in their own homelands. While estimates vary, it is believed  that there were more than 300,000 Native Hawaiians prior to the arrival  of Captain Cook, but by 1920, that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…aside in 1960 by President Eisenhower to protect its wildlife and  habitat values.\n\nBut that is only part of its story.\n\nThe Arctic Refuge is also deeply connected to the traditions and  daily life of the people who have lived there for thousands of years-- longer than this building, this city, this country have existed-- because the refuge is not just…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…proclamation:\n\nI have the honor of representing Ohio's 9th Congressional District, a  region that embodies the industrious spirit, deep-rooted history, and  rich educational traditions of our great state. Today, I am privileged  to join in commemorating an extraordinary milestone in our community-- the 175th anniversary of Defiance College.\n\nWhereas, Defiance…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…services and products that all Americans rely on each and every day.\n\nFor instance, Mr. Speaker, Irving Naxon invented the slow cooker. He  took inspiration from Jewish cooking traditions in Europe to allow  Jewish communities to have fresh and hot meals on Shabbat.\n\nSylvan Goldman invented the shopping cart, transforming the ease with  which people are able…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…of Nigeria (ICAN) DFW and its  annual Igbo Day Celebration.\n\nFor over 25 years, ICAN DFW has played a pivotal role in preserving  the rich customs, language, values, and traditions of the Igbo people,  while also fostering cross-cultural understanding throughout the  Dallas-Fort Worth Metroplex. The annual Igbo Day Celebration is much  more than a cultural…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Capitol.  Preventing commercial filmmakers and photographers from shooting  throughout the Capitol Complex is neither business-friendly nor true to  the Nation's democratic traditions. Encouraging commercial filmmaking  and photography at the Capitol would help spread the story of democracy  around the world.\n\nThis bill would give the Capitol Police complete…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699181/introduction-of-a-bill-to-permit-commercial-filmmaking-and-photography-on-the-grounds-of-the-us-capitol"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…on the caribou herd, reside along the herd's  migratory route, making any disruption not only a threat to  biodiversity but also an assault on indigenous livelihoods and  traditions.\n\nLet me read a quote from the Executive Director of the Gwich'in  Steering Committee, Kristen Moreland. She says: ``It is unthinkable  that our congressional decisionmakers…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…councils, restores long-oppressed churches, and recognizes the  independence of emerging Orthodox churches. His tireless efforts to  bring together Christians of different traditions do not go unnoticed.\n\nHis All-Holiness is a champion for interfaith dialogue and a  steadfast advocate for interfaith understanding. He builds meaningful  relationships with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…diversity of  Rochester, New York. Under his leadership, the Plaza has grown into a  welcoming space where small businesses, artists, and community members  share food and traditions from around the world. His guidance has  uplifted local entrepreneurs while fostering stronger connections  across the region.\n\nJason's heritage and perspective deeply inform…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…enemy and successfully  destroyed the guns . . . . First Sergeant Lomell's bold and outstanding  leadership in the face of superior numbers is in keeping with the  highest traditions of the military forces of the United States and  reflect great credit upon himself and the United States Army.''\n\nLomell also received a rare battlefield promotion to second…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…economy.\n\nEqually important are the contributions of Turkish Americans to our  society. Turkish Americans enrich our communities through their  entrepreneurial spirit, cultural traditions, academic and scientific  achievements, and civic engagement. Their success reflects the shared  values of opportunity and perseverance that define both our nations.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…encourage Han Chinese migration       into the XUAR has placed immense pressure on those who seek       to preserve the ethnic, cultural, religious, and linguistic       traditions of the Uyghurs and other ethnic and religious       minority groups.\n\n(6) PRC authorities have supported an influx of Han Chinese       economic immigrants into the XUAR,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…to essential       services. Without a stable economy, our communities will       suffer, along with our ability to fully engage in and sustain       our Inupiaq cultural traditions, including our vital       subsistence way of life.\n\nThe North Slope of Alaska spans an area nearly the size of       the state of Minnesota and, within that expansive area,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…particular belief structure       following a most challenging crisis impacted by the       shattering Holocaust, was enabled to reach beyond the       confines of his own faith's traditions and give credit where       it's due.\n\nHis own Jewish people historically have not lacked       fracturing divisions among opposing ideologies not allowing       for urgently…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…made the restaurant a  cornerstone in this area.\n\nToday, the Wagon Wheel continues to thrive under their daughter,  Mina, and her husband, Bill Nixon, who carry on the same traditions and  standards that have guided the restaurant for nearly 50 years. Their  son, Mike, also remains actively involved, especially during the  busiest times of the year. Together,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Coast Guard, as our Veteran of  the Month for December 2025 from Michigan's 9th Congressional District.  His more than two decades of dedicated service exemplify the highest  traditions of our Armed Forces.\n\nCWO4 McInnis devoted more than 24 years to honorable service in the  United States Coast Guard after enlisting in 1980 and completing basic  training…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…of this  horrific attack from leading a resolution representing the families, I  hope it is simply because he has been here for only 6 months and does  not understand the traditions of this institution.\n\nIt would be a shame if this is where this institution has gone, if  the partisanship has gotten so deep, so raw, and so uncontrollable that  we can't…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…arrival of  early settlers under the Homestead Act, Delano has welcomed people from  Latin America, Asia, and Europe, each contributing to the city's  distinct character and traditions.\n\nMr. Speaker, I ask my congressional colleagues to join me in  celebrating Delano on its 110th anniversary, and to honor its rich  history, diverse community, and the spirit…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}, {"senator": "John Thune", "party": "Republican", "sentence": "…historical heritage and robust rural spirit. Since its beginning 125  years ago, the community of Veblen continues to serve as a strong  example of South Dakota values and traditions.\n\nI offer my congratulations to the citizens of Veblen on its  quasquicentennial and wish them continued prosperity in the years to  come.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…contributions Jewish Americans have made to the United       States through the arts, entertainment, science and       technology, military, government, business, culinary       traditions, and other fields;\n\nWhereas there are many Jewish American inventors that have       impacted the everyday lives of Americans for the better;\n\nWhereas Irving Naxon invented…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…in  Missoula.\n\nTo Montanans, the Brawl of the Wild is more than a football game.  It's a celebration of the state's competitive spirit, community pride,  and deep-rooted traditions.\n\nMany households in Montana are divided, heck, even my office is  divided.\n\nBut the magic of the game is its power to unite our state through  sport, bringing together students,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696930/recognizing-the-124th-playing-of-the-brawl-of-the-wild-as-delivered-to-wake-up-montana-on-nonstop-local"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…role of Commanding Officer, I know that  Commander Russell will continue to execute vital maritime patrol and  reconnaissance missions with precision and uphold the highest  traditions of Naval Aviation.\n\nMr. Speaker, Commander Russell is a true patriot and distinguished  American who has devoted himself to the service of our Nation. It is  appropriate…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…in mind, this is a recreation area, not a preservation  area.\n\nMr. Speaker, the people of Utah deserve better. They deserve a  government that listens, that respects their traditions, and  understands the importance of balancing conservation with access.\n\nGlen Canyon National Recreation Area is very popular, as my colleague  across the aisle pointed out.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…greater Tulsa community, as well as their unwavering faith in God  and commitment to His will. One hundred years of service is an  extraordinary accomplishment.\n\nThe rich traditions of the Orthodox Church extend back to the  earliest days of Christianity, established in the lands surrounding the  Mediterranean, where the first Christian communities lived…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}]