[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…condoms and $100 million  for condoms in Gaza, and then they said, never mind, we got it wrong.  We made a mistake. Oopsy-daisy.\n\nThey decided to offer all of the air traffic controllers 8 months  free pay for quitting, and then they say, oopsy-daisy. Then today Elon  Musk tweets: There is a shortage of top-notch air traffic controllers.  If you have…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…shouldn't let the  military fly without this important broadcast system, so that people  know when they are in the region and can translate that communication,  so that air traffic controllers and other aircraft in a busy airspace  know when the military is there.\n\nWe know what happened when a Black Hawk involved in the January 29  collision wasn't actively…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Active-Duty troops, our hardworking Federal  employees, our civil servants, our TSA agents, our Capitol Police, our  staff here in the House of Representatives, and our air traffic  controllers for their service, their sacrifice, and for the work that  they do on behalf of the American people each and every day. It is our  promise to all of them that we will…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…this week, Americans flying in and out of Newark Airport  have experienced increasing delays and disruptions. Airlines are  canceling flights. There is a shortage of air traffic controllers. They  are relying on 1990s technology in 2025. One Newark air traffic  controller even said that flying into Newark is ``not safe.''\n\nKeeping the flying public safe…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…million,  in addition to providing more than $26 billion for the Disaster Relief  Fund. It increases funding for TSA by $149 million and provides a pay  raise for air traffic controllers and uniformed members of the United  States Coast Guard.\n\nThis is important funding, and I am glad that these provisions which  we fought for were included in the bill.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…want to stress  how many people have been impacted by this tragedy and how important it  is that we connect folks to resources and help.\n\nFinally, I thank all the air traffic controllers, the MWAA employees,  and the DCA employees who have returned to their jobs and worked  tirelessly to keep our airspace safe. I know it has to be incredibly  difficult,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to recognize and  congratulate the extraordinary Air Traffic Controllers of Manassas  Regional Airport. Despite challenging circumstances during the 2025  federal government shutdown, the dedicated Manassas Tower workforce  worked arduously…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697601/recognizing-manassas-regional-airports-air-traffic-control"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…assistance.\n\nFor transportation, the bill invests in the safety of the flying  public by increasing FAA operations by nearly $230  million, enabling the hiring of 2,500 new air traffic controllers. It  increases funding for air traffic control towers and facilities by 26  percent above fiscal year 2025.\n\nThe bill also protects investments for continuing Amtrak…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…``government waste,'' President Trump and Elon are  targeting and illegally terminating the Federal workforce, the  employees who make our country run.\n\nThese are the air traffic controllers who make sure your flights land  safely, the workers responsible for sending Social Security checks out  the door for millions of older Americans, the national security…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, let me pick up where the Republican leader  left off on air traffic controllers.\n\nThe biggest, busiest airport in the United States is O'Hare, when you  count both passengers and cargo traffic. After the government reopened,  I went to O'Hare, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…thank Congressman Stauber as well as Chairman Graves and Ranking  Member Larsen for all of their support and close collaboration on this  bill.\n\nToday, pilots and air traffic controllers who seek mental health care  are unfairly penalized by a system that perpetuates a culture of  silence. Current regulations mandate that if they seek care, then they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…intransigent refusal to work across the aisle to  negotiate a solution has resulted in the ongoing government shutdown.\n\nDuring this shutdown, military servicemembers, air traffic  controllers, and TSA employees are among those who simply must come to  work despite the lapse in congressional appropriations. They should be  paid for that work. That is why today…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696375/s-3012"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…careers, possibly ending it.\n\nMany of us in Congress have heard from our constituents about the  FAA's difficult aeromedical process. We have spoken to overworked air  traffic controllers about the consequence of mounting job pressures. We  have seen qualified airline pilots grounded for months, in some cases  even years, due to delays with FAA medical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…bidder.\n\nWe should be strengthening the Postal Service, not selling it off,  because some things should serve people, not profit.                Addressing Shortage of Air Traffic Controllers\n\nMs. McBRIDE. Mr. Speaker, this week's travel delays and cancelations  are frustrating millions, but behind the headlines is a deeper issue: a  national shortage of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…away.\n\nLet's get one thing clear: Our Federal employees are absolutely  essential to keep our country running.\n\nMrs. DINGELL. They are firefighters, nurses, doctors, air traffic  controllers, food inspectors, law enforcement, and public safety  officials. They impact every part of our lives, and we take them for  granted. We cannot hurt them. We must support…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise today to commend the air traffic  controllers and the men and women of the FAA.\n\nFor 43 days, while the Democrats kept our government closed, the  aviation system that they rely upon and the traveling public depend…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697078/commending-air-traffic-controllers-and-faa-employees"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…going to lie to the  American people. I think we are going to be in it for a while.\n\nNow, as everyone knows, folks aren't being paid while we are in a  shutdown. Our air traffic controllers are not being paid. In fact,  starting tomorrow, the airlines are going to be canceling flights. Our  staffs are not being paid. Federal employees are not being paid.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…are making the  recommended changes, provide funding for further modernization of our  aviation system, advance new technologies at the FAA, and train and  support air traffic controllers. We cannot--we should not--miss the  moment to act and ensure lasting change.\n\nI cannot imagine the pain each of the families of the victims has  experienced every day…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…dysfunctional shutdowns. Any of the Federal workers who  are forced to work because they are in our military, they are in  Federal law enforcement, they are TSA, or they are air traffic  controllers--they are keeping this Nation and Americans safe--if we are  going to force them to work, at a minimum, let's make sure we pay them  and pay them on time.\n\nI came down…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…ones  least impacted by its decisions.\n\nWere the far-left activists and Democrats here in this body the ones  not getting paychecks? No, Mr. Speaker. That was the air traffic  controllers, our troops, and our Capitol Police officers.\n\nWhen these same people passed ObamaCare, were they the ones impacted  by the law, or was it the middle-class teacher in…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Maybe  it is to go after President Trump. Never forget that they shut down the  government for 43 days. They said: Don't worry about our military.  Don't worry about air traffic controllers. Don't worry about our  economy. Don't worry about American families. No, no, no. Close the  government for 1\\1/2\\ months because it might hurt the President.\n\nFor the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…that  funded critical services and would have given us time to negotiate  long-term solutions. It was a yes vote to keep the government open and  to pay our troops, air traffic controllers, and Federal employees.\n\nEvery Democrat but one voted no. Every Democrat but one voted to shut  the government down. This is not opinion, and this is not messaging…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…inflicting this pain on the American people, taking away  food stamps from 42 million Americans, defunding WIC, and not paying  our troops, our Federal employees, and our air traffic controllers. It  is a disgrace, and you should all hang your heads in shame.\n\nVote ``yes'' to pass the bill and reopen the government.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…against reopening the government 14 times. That is 14 votes against  paying our troops, 14 votes against paying our Federal workers, 14  votes against paying our air traffic controllers, 14 times against  Border Patrol agents, and 14 times against paying our TSA agents.\n\nThe Democratic Party has been hijacked by socialists, and now they  are holding…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…never have happened. It has caused real suffering  for American families. Our men and women in uniform had to wonder  whether or not they were going to get paid. Air traffic controllers  already had a really stressful job and then had to show up for work  without getting paid. They missed multiple paychecks.\n\nWe know a lot of those air traffic controllers…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the price.  Nationwide, 1.4 million Federal employees--many of whom, of course, are  living paycheck to paycheck--are furloughed or working without pay, and  13,000 air traffic controllers have already missed 1 paycheck and will  miss another soon.\n\nSNAP, the Supplemental Nutrition Assistance Program, and food  stamps--these benefits run out November 1…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…to  work and serve the American people.\n\nWhat we have here is a political standoff between Democrats and  Republicans in Congress. It has nothing to do with the air traffic  controllers. Some of them are Democrats, and some are Republicans. It  has nothing to do with any other essential or furloughed Federal  workers. Some of them are Democrats; some,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…funding from being delivered.\n\nIt is time to fix the damage that Democrats have caused. With this  vote tonight, Republicans will restore SNAP payments and get TSA, air  traffic controllers, and Federal workers paid.\n\nMr. MEUSER. Mr. Speaker, I thank the chairman for the additional  time.\n\nYou know what, Mr. Speaker, yesterday was Veterans Day. Veterans…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Resolution 1032 also enables us to consider  legislation that funds the Department of Transportation's Federal  Aviation Administration, the FAA, and our country's air traffic  controllers, who keep our skies safe.\n\nGiven my district's proximity to Hartsfield-Jackson Atlanta  International Airport, I proudly represent more air traffic controllers  than…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…American people as pawns. Because of that, their constituents and,  indeed, nearly 700,000 Tennesseans are without their SNAP benefits.\n\nBorder Patrol agents, our air traffic controllers, and Federal law  enforcement have been working a month now without pay. This is why you  have the AFGE and the controllers union saying: End the Schumer  shutdown now.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]