[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…essential to their business.\n\nIn practice, the main real-life-use case for crypto is money  laundering. Crypto is used by Mexican cartels to launder their proceeds  from drugs trafficked into the United States. Terrorist organizations  fund their operations with crypto, and countries like North Korea use  cryptocurrencies to avoid U.S. sanctions and fund…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the role that America's  lax gun laws play in arming and enabling drug cartels to traffic  fentanyl. Consider this: An estimated 200,000 to 500,000 American-made  guns are trafficked into Mexico annually. A study by the Bureau of  Alcohol, Tobacco, Firearms, and Explosives found that 70 percent of  crime guns recovered in Mexico from 2014-2018 and submitted…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…involving Jeffrey Epstein, every single  one of us, all 100 Senators, know that Jeffrey Epstein was a monster, a  monster who groomed and abused underage children, a monster who  trafficked girls to rich and powerful men, a monster who destroyed the  lives of hundreds of young women.\n\nAs I speak, the U.S. Department of Justice has files detailing the  names…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…ability to hold them accountable.\n\nI thank Representative Teresa Leger Fernandez of New Mexico for  working with me on this bill.\n\nFor years, survivors who were abused, trafficked, and exploited by  Jeffrey Epstein were ignored by the justice system. They were told  nobody believes them. They were told to be silent.\n\nWhen the truth about Jeffrey Epstein…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…critical, bipartisan  legislation that would provide long-overdue relief to victims and  survivors of human trafficking to help them overcome the lasting  effects of being trafficked and allow them a chance to heal.\n\nIt recognizes their unique traumas, the immense challenges that they  face after escaping their exploitation, and their right to rebuild…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…universal  background checks. We need weapons of war off our streets. We need  strong red flag laws to keep guns away from abusers.\n\nState laws are not enough. Guns can easily be trafficked across State  lines.\n\nThoughts and prayers didn't save children at Sandy Hook, Uvalde, or  in that Minnesota church. They won't save the next victims unless we  act. We have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695226/calling-for-substantive-action-on-shootings"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…helps some of the most vulnerable in our country. This  office helps shelter and care for children who are seeking safety. It  makes sure that these children aren't being trafficked. It makes sure  these children aren't stuck in cages in Border Patrol facilities for  extended periods of time. This office also supports refugees who are  victims of torture…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699443/consolidated-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…clemency, commutation, or pardon for  Ghislaine Maxwell.\n\nMr. RASKIN.  Leger Fernandez).\n\nMs. LEGER FERNANDEZ. Mr. Speaker, there were thousands of girls and  young women abused, trafficked, and used by Epstein and the elite and  the powerful who believed they could get away with it.\n\nEpstein told the young victims that he controlled the banks and the  government.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…The administration has emphasized fentanyl as the primary  justification for these strikes. Yet their own officials have  acknowledged that cocaine is the predominant drug trafficked through  these Caribbean routes. The fentanyl that is devastating American  communities flows overwhelmingly through different routes. So what  problem are we actually trying…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…pro-life, and standing up against  human trafficking. So I ask my colleagues on the other side: Where is  the outrage now? Where is that moral clarity when the lives of  trafficked and abused girls demand your courage?\n\nThis is not about partisanship. This is about whether the United  States Congress will side with survivors or with abusers. Will we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…crime.\n\nAll too often these traffickers target not only vulnerable women,  they also target children. According to our TBI data, there were 514  reports of children being sex-trafficked in Tennessee in 2024. That is  1 year, 514 reports. That was more than twice the number of reports of  adult sex trafficking.\n\nThe report also notes that there has been an…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to be able to defend America from  these terrorists. Even more tragic is the fact that nearly 80,000  Americans overdosed last year on fentanyl, cocaine, and other drugs  trafficked by cartels. Democrats don't want to protect us from that  either.\n\nIn fact, yesterday, after we had a classified briefing, the gentleman  on my left, the ranking member,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…people, the same people in this picture, over and over. There  are countless others that aren't here who died from drunk driving  incidents, died from drug overdose, human trafficked, lives destroyed  forever. If only they got to stay alive, if they even had that  opportunity to stay alive.\n\nThere is so much outrage from my colleagues on the other side…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…watch list, members  of the Taliban, members of the Chinese Communist Party, not to mention  MS-13, gangbangers, human traffickers, and fentanyl distributors. They  have also trafficked over 300,000 children, and who knows what hell  those young people are in right now because of our callousness.\n\nThat has not happened under this President, though. Under…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in China. China owns 80 percent of the industrial cobalt  mines in the Congo and controls 15 of 19 of the primary cobalt mines in  the Congo. These mines are operated by trafficked child slaves. Since  when do we not care about that?\n\nThe idea that California can do this unilaterally is preposterous.  They are the only State allowed to seek waivers…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…victims       through coercion or without informed consent and sold       illegally. This means that patients undergoing organ       transplants abroad are at-risk of receiving trafficked       organs.\n\nIn many countries, impoverished people are targeted and       coerced to sell an organ from which the traffickers make a       significant profit. The `donor'…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…successful arrest. The public will never know  their names or see their faces. Americans who have suffered from drug  overdoses in their families brought on by illegal narcotics trafficked  to the U.S. by Maduro and his cronies will never get to thank those  individuals. I thank them, and I want them to know that they are being  prayed for and thanked for all…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Accountability for Allegedly Facilitating Sex                        Trafficking of a 15-Year-Old\n\nBack in 2008, a then fifteen-year-old girl began to       allegedly be forcibly trafficked for commercial sex, which       allegedly continued for a decade across Miami-Dade County.       She was allegedly frequently expected to perform commercial       sexual…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…people. They were  silent.\n\nWhere were our good friends with the 15 to 20 million illegals coming  into this country, with the drugs flowing in, with the children that  were trafficked? Where were they? They were quiet. They didn't say a  thing. Mr. Speaker, it is anti-American.\n\nThis package is not about tightening belts. It is about cutting loose  the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…encouraged the illegal trafficking of human  beings and drugs into our country.\n\nOver 200,000 Americans are now dead. They can't vote for either  party. They are dead from drugs trafficked into our country in those 4  years. They are dead from fentanyl poisoning.\n\nThere are 435 of us here and 100 Members of our colleagues across  campus in the Senate. There…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…our country even more so than now with this issue.\n\nI have talked to school board members. I have talked to parents. I  have spoken to young men and women who have been trafficked, and it is  hard to speak about. A lot of the young ladies like to keep that to  themselves, but we have to look past that.\n\nWe in Congress have to legislate forcefully.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]