[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the use of power has been usurped by the Executive. This  administration has carried out at least four military strikes against  vessels that it asserts have ties to drug trafficking organizations.  These strikes were not authorized by Congress. Congress has not been  shown the evidence of who exactly was on board these ships, whether  they were all…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…said he would  give a full and complete pardon to Juan Orlando Hernandez, the corrupt  former President of Honduras. It is disgusting.\n\nTrump is going to erase a major drug trafficking conviction against  Hernandez, who is serving 45 years in Federal prison for his crimes. He  was convicted by an American jury for working with drug cartels to move  400…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697176/juan-orlando-hernandez-former-president-of-honduras"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…these technologies  as quickly as possible to the front lines.\n\nNew technologies don't just help with catching drugs. These  technologies also help detect victims of human trafficking or  immigrants in need of a rescue. These technologies can also help Border  Patrol agents communicate reliably in remote areas. When an agent gets  ill or injured or runs…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…people is  a joke.\n\nIf this were about drugs, why seize an oil tanker and threaten an  illegal Navy blockade? If this were about drugs, why would the  President pardon a drug-trafficking former President of Honduras?\n\nThis is not about drugs. This is about regime change and control of  Venezuela's resources.\n\nNicolas Maduro is a dictator, and you don't have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…support-- overwhelming bipartisan support. The DHS components have unique but  important functions beyond immigration enforcement--securing our  borders, combating human trafficking, seizing deadly narcotics being  smuggled into our country, and facilitating trade and travel--but  personnel from these components have been pulled from their core  missions…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "Ms. DAVIDS of Kansas. Mr. Speaker, I rise today to recognize the  crucial work of the High Intensity Drug Trafficking Area program, also  known as HIDTA.\n\nFar too many Americans have been tragically impacted by our nation's  opioid epidemic. Thankfully, there is hope. Overdose deaths dropped…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…skin or because they are engaging in peaceful protests.\n\nFinally, Republicans refused to prioritize the very real work that  DHS does in our communities: stopping fentanyl trafficking, stopping  child trafficking, and stopping cartels. DHS is taking those  investigators off those cases and putting them on ICE raids. It is at  the expense of our national…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense. Communities across the United  States have seen the devastating impact of addiction. But that does not  give Donald Trump the right to go to war, to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President Hernandez had a man killed in prison to protect him.\n\nHonduras has become a bastion of the global drug trade. This former  President Hernandez orchestrated a vast trafficking conspiracy that  prosecutors said raked in millions of dollars for cartels while making  Honduras one of Central America's poorest, most violent, and most  corrupt countries.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…these children aren't stuck in cages in Border Patrol facilities for  extended periods of time. This office also supports refugees who are  victims of torture and human trafficking and who have been admitted to  the United States by this administration, by the Trump administration.\n\nLastly, I will note that this program and its funding are supported…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699443/consolidated-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and establishing a democracy since Trump outright dismissed any  possibility of helping the opposition party to build a true democracy.  And it is clearly not about drug trafficking. After all, not even a  month before this, President Trump pardoned the former President of  Honduras who was convicted of the same crime. But the real reason--it  is so…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, Republicans have to decide if they are going  to protect pedophiles or seek justice for survivors of sex trafficking  and abuse.\n\nI sat across from survivors--some of them were as young as 13 and 14  at the time--and they told us over and over again to follow the money.\n\nThe Treasury Department,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696833/epstein-remarks"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…for decades, Jeffrey Epstein's  abuse was an open secret powerful people knew. Agencies knew. Some in  government knew. Yet, year after year, he continued to operate in  trafficking, exploiting, and destroying the lives of children and young  women.\n\nThis was not only sexual violence. There were financial crimes.  Epstein's empire was built on money,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…stopping drug traffickers, I don't think there would  be disagreement or objection here to a law enforcement-based approach  to do exactly that. Of course, we want to stop drug trafficking. But  the Trump administration seemingly can't decide if it wants to be crime  fighters or warmongers, and they have decided to use the U.S. military  to bomb their way…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Epstein died in a Federal prison overseen by Donald Trump's Department  of Justice. We know that Jeffrey Epstein in 2008 was given a generous  nonprosecution agreement for sex trafficking charges. That agreement  let him continue his criminal activities, and that agreement was  offered by Alexander Acosta, who is Donald Trump's chosen Secretary of  Labor.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…concerning adversaries all around the world,  whether it is Cuba, whether it is Iran, whether it is Russia or China.\n\nAnd, in fact, Venezuela had become a hub for illegal drug  trafficking, along with everything else that goes with that. And it  also had become a foothold for Iranian terrorist organizations like  Hezbollah and was using the money they were…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…takes serious steps toward confronting, for example, the  regime in Cuba and includes limitations on funding for countries and  organizations that participate in the human trafficking of Cuban  medical professionals while directing the Secretary of State to revoke  visas for officials of countries involved in this grotesque human  trafficking.\n\nMr. Chairman,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributions that Laurie Swink has made to our community through her  work with Selah Freedom. Laurie's passion, tireless efforts, and  unwavering commitment to fighting human trafficking have not only  impacted the lives of thousands but have sparked systemic change across  the Nation. With over 7,000 survivors of human trafficking having found  hope, healing,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…news every  day like they were several months ago, and that is hordes coming across  our southern border.\n\nI want to remind people of how much the illegal drugs and human  trafficking have stopped on our southern border.\n\nI remind people of that because it was just a few weeks ago that  President Trump stood in this Chamber. He addressed the joint session…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…matter preceding paragraph       (1), by inserting ``or (5)'' after ``paragraph (4)''.\n\nMs. LEE of Florida.  6719.\n\nMr. Speaker, as we recognize January as National Human Trafficking  Prevention Month, I am proud of all the work the House Judiciary  Committee has done and continues to do to protect children and our most  vulnerable populations.\n\nIn the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…let heartache keep us  down. Our family and this country, we do not weep in the wake. We rise,  we fight, and we prevail.\n\nWhen America enforces her laws, we win. Fentanyl trafficking is down  54 percent. Border encounters are down 93 percent. Thousands of MS-13  thugs have been thrown out.\n\nThis is no accident. It is the result of strong leadership,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690382/fentanyl-awareness-day"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize Human  Trafficking Awareness Month and to speak about the serious threat human  trafficking represents here and globally.\n\nHuman trafficking is the second largest criminal enterprise in the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Families Tax Cut law signed by the  President on July 4, securing historic support for the Byrne JAG and  COPS Programs for local police as well as efforts to combat drug  trafficking.\n\nAdditionally, four bipartisan bills the Judiciary Committee passed  during Police Week in May became law with the passage of the National  Defense Authorization Act. These…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1503) to combat forced organ harvesting and trafficking in  persons for purposes of the removal of organs, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…during the joint session Tuesday night,  Republicans cheered for the vision, plan, and great future of America.  We cheered for secure borders, wiping out fentanyl and human  trafficking, and an energy policy that lowers fuel cost and inflation.\n\nWe cheered for our military, increased recruitment of young patriots,  and readiness. We cheered for peace, world…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688654/america-is-worth-cheering-for"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…me  on this important issue.\n\nAs to the bill, Mr. Speaker, no matter the type or category, all  crime is made worse by illegal immigration. Theft, assault, murder,  drug trafficking, human trafficking, violent crime, and property crime,  you name it, Mr. Speaker, illegal immigration makes it worse.\n\nWhat is perhaps most unfortunate is that many of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…well-reported, and if you want  to see more, it is certainly available in the Intelligence Committee.\n\nThe people carrying those drugs were terrorists, plain and simple.  They were trafficking drugs that financed a designated foreign  terrorist organization. These strikes were fully compliant and fully  justified under the President's article II constitutional…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…immigrant criminals.  Amendments from Senator Joni Ernst and Senator John Cornyn made it even  stronger.\n\nWe also passed the HALT Fentanyl Act. It cracks down on deadly  fentanyl trafficking. This is thanks to Senator Bill Cassidy of  Louisiana and Chuck Grassley of Iowa. They have done incredibly hard  work and important work.\n\nOn top of that, the working families…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…future of Venezuela, well, of course, it is ultimately up  to the Venezuelans. The interim authorities in charge in Venezuela  today know what we expect of them: Stop the drug trafficking and the  weapons trafficking. Accept the return of their refugees and migrants.  Release political prisoners. Expel the Iranians, the Cubans, the  Islamic terrorists, like…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…construction  of President Trump's border wall. Border Patrol agents have told us  again and again that a physical barrier on our southern border is a key  deterrent to the trafficking of humans and illicit drugs by the Mexican  cartels across our southern border. Yet, on day one of his Presidency,  President Biden stopped construction of the border wall.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}]