[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Nanette Barragan (D-CA), Lisa Blunt Rochester (D-DE), David Cicilline (D-RI), Diana DeGette (D-CO), Rosa DeLauro (D-CT), Joe Kennedy (D-MA), Peter King (R-NY), Annie Kuster (D-NH), John Larson (D-CT), Jimmy Panetta (D-CA), John Sarbanes (D-MD), Mary Gay Scanlon (D-PA), Brad Schneider (D-IL), Paul Tonko (D-NY), and Lori Trahan (D-MA)."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "Thompson (D-MS), Mike Thompson (D-CA), Dina Titus (D-NV), Rashida Tlaib (D-MI), Paul Tonko (D-NY), Norma Torres (D-CA), Lori Trahan (D-MA), David Trone (D-MD), Lauren Underwood (D-IL), Marc Veasey (D-TX), Filemon Vela (D-TX), Nydia Velázquez (D-NY), Debbie Wasserman Schultz (D-FL), Maxine Waters (D-CA), Bonnie Watson Coleman (D-NJ), Peter Welch (D-VT), Frederica Wilson (D-FL) and John Yarmuth (D-KY)."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Markey (D-MA), Representative Lori Trahan  (MA-03), and community leaders like Lawrence Mayor Daniel Rivera to hold Columbia Gas and NiSource accountable."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Kennedy III (D-MA-04), Katherine Clark (D-MA-05), Seth Moulton (D-MA-06), Ayanna Pressley (D-MA-07) and Lori Trahan (D-MA-03) signed the letter."}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "TRAHAN."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Kennedy III (D-MA-04), Katherine Clark (D-MA-05), Seth Moulton (D-MA-06), Ayanna Pressley (D-MA-07) and Lori Trahan (D-MA-03), in a letter to the U.S."}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "TRAHAN."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Kennedy III (D-MA-04), Katherine Clark (D-MA-05), Seth Moulton (D-MA-06), Ayanna Pressley (D-MA-07) and Lori Trahan (D-MA-03), announced that Massachusetts airports have been awarded over $171 million in federal grants under the Coronavirus Aid, Relief, and Economic Security (CARES) Act."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Other original Cosponsors of the bill include: Beyer (D-VA), Doyle (D-PA),Fudge (D-OH), Garcia (D-IL), Gallego (D-AZ), Himes (D-CT), Kaptur (D-OH), Khanna (D-CA), Kuster (D-NH), Lamb (D-PA), Lynch (D-MA), Luján (D-NM), Neguse (D-CO), Norton (D-DC), Malinowski (D-NJ), Payne (D-NJ), Phillips (D-MN), Pingree (D-ME), Pressley (D-MA), Rose (NY), Rush (IL), Ruppersberger (D-MD), Scanlon (D-PA), Schneider (D-IL), Scott (D-GA), Soto (FL), Trahan (D-MA), Torres (CA)."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "I am grateful to Congressman Johnson and Senator Warren for their leadership and bold action to end the gun violence that has devastated too many neighborhoods across America.\"\n\nCongresswoman Lori Trahan, MA\n\n\"For too long, Congress has remained on the sidelines as families and communities across the United States are torn apart by preventable gun violence."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Kennedy III (D-MA-04), Katherine Clark (D-MA-05), Seth Moulton (D-MA-06), Ayanna Pressley (D-MA-07) and Lori Trahan (D-MA-04) to announce that the Federal Transit Administration (FTA) has awarded Massachusetts state and regional transit authorities a total of $863,556,013 in federal grants under the Coronavirus Aid, Relief, and Economic Security (CARES) Act."}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "1442, the Youth Poisoning  Protection Act, led by Representative Trahan."}]