[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…by the opioid crisis.\n\nThe Department of Health and Human Services also eliminated the  workforce training programs, including the Integrated Substance Use  Disorder Training Program, which trains professionals to provide opioid  use disorder prevention, treatment, and recovery services.\n\nMr. Speaker, we went to court over a lot of these things, and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…dedication, leadership,  and excellence in service. Commissioned from the United States Air  Force Academy in 1998, he went on to graduate from the Euro-NATO Joint  Jet Pilot Training program in 2000. Over the course of his career, he  has accumulated more than 3,150 flight hours in the F-15 Eagle and  other aircraft, and has participated in combat and support…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…were college players. They were, on average, 22 years old.  They had played together only a few months.\n\nLeading up to the game, the U.S. players took part in a 7-month  training program designed to confront a Soviet team that many  considered to be the best conditioned hockey team in the world.  However, through steadfast commitment, grit, hope, and determination,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…logistics project in Norfolk, a project dealing with  electric vehicles in southwest Virginia, an electric vehicle  infrastructure apprenticeship program and workforce training program in  Northern Virginia--20 projects.\n\nHere is one in Appalachia, VA: a project that would be implemented by  the Virginia Department of Energy, which is part of the Virginia…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…following programs. First responder training--there are  so many. I don't want to read them all. The chairman mentions helping  first responders. That first responder training  program is eliminated under the budget, right? A pregnant and  postpartum women program; building communities of recovery; treatment,  recovery, and workforce support; comprehensive…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…diversity, equity, and  inclusion programs, including historical education on renowned figures  including the Tuskegee Airmen and the Women Air Force Service Pilots.\n\nA training program that honored these heroes was halted. Their  history was nearly erased in the name of a stupid and mean-spirited  political agenda that sought to rewrite America's past…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…over to you  just to state the facts as to what is in this bill. Let's do the public  a service.\n\nMr. McGOVERN. Mr. Speaker, if you can't find a job, just enroll in a  training program. That is hard to do when Republicans are cutting and  gutting the training programs that exist in this country.\n\nJohnson).\n\nMr. McGOVERN.  Stevens).\n\nMr. McGOVERN. Mr.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER.  1034, the  DHS Cybersecuirty On-the-Job Training Program Act, a bill originally  introduced by Representative Turner of Texas, for the purpose of adding  cosponsors and requesting reprintings pursuant to clause 7 of rule XII.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697069/permission-for-member-to-be-considered-as-first-sponsor-of-hr-1034"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…276. Report on impacts of joint travel regulations on members of                Coast Guard who rely on ferry systems. Sec. 277. Report on Junior Reserve Officers' Training Corps program. Sec. 278. Report and briefings on implementing section 564 of title 14. Sec. 279. Report on role of Coast Guard. Sec. 280. Report on Coast Guard personnel skills.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize  a major milestone in Centre County: the graduation of the 500th first  responder from the Centre County Crisis Intervention Team Training  Program.\n\nSince 2011, this initiative has brought together law enforcement,  EMS, corrections officers, and mental health professionals for 40 hours  of specialized training.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693519/recognizing-centre-county-crisis-intervention-team"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…William Alex May and Sandra Dee Hargrave Asher. Deputy May  went above and beyond during his 11-year career in law enforcement. He  served in both Walton County's field training program as an instructor  and in the breathalyzer program, eventually earning the Life Saving  Award Certificate. On top of his impressive law enforcement career, he  was a dedicated…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Session transfer cases. Mac showed tremendous initiative in  this role by developing and implementing a successful DUI curriculum  for local law enforcement personnel. This training program was so  successful that it was later expanded to the South Carolina Criminal  Justice Academy and the Commission on Prosecution Coordination.\n\nMac continued his career…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…employees, teamwork,       leadership, and professional development; and\n\n``(ii) identify strengths and areas for development.\n\n``(c) Requirements for Training Design.--Training in the       program components established under subparagraphs (A) and       (B) of subsection (b)(2) shall--\n\n``(1) be designed using principles of adult learning and an       industry…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…gentleman from California (Mr. Takano) and our Democratic  colleagues for understanding the importance of this program.\n\nMr. Speaker, this is a good VA education and job training program. It  works, but we have to continue to improve it.\n\nVeterans currently have to wait up to 7 months to complete the VR&E  program intake and processing procedures. My bill,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…program to make this response possible.\n\nOne SUPPORT for Patients and Communities Reauthorization Act of 2025  program I am especially excited for is the first responder training  program, which helps ensure that first responders are prepared and  trained to administer Narcan.\n\nI also strongly believe in the residential treatment program for  pregnant…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…with the recipients of  Medicaid.\n\nIf you are an able-bodied, working adult, you should be able to go  out and find a job. If you can't find a job, you need to go to a  training program and try to find training so that you can get a job and  ultimately get off Medicaid.\n\nOne of the components about Medicaid, we all know, is that it was  formed in favor…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693220/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…for veterans,       including Veteran Business Outreach Centers, Boots to       Business, Boots to Business Reboot, Service-Disabled       Entrepreneurship Development Training Program, Veteran       Institute for Procurement, Women Veteran Entrepreneurship       Training Program, and Veteran Women Igniting the Spirit of       Entrepreneurship.''.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}]