[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…discrimination against the transgender  community.\n\nOn all five of these amendments--just put a little exclamation point  on that--it encourages the dehumanization of transgender people in a  way that is very, very dangerous. That is number one.\n\nNumber two is transgender people exist. That is just a fact. Gender  dysphoria is a medical fact. No serious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Chair, I rise today in strong opposition to this  amendment.\n\nIf passed, this amendment would immediately prohibit TRICARE coverage  of mental health counseling for transgender young people. Let me repeat  that. This amendment would take away mental health care services for  transgender kids of servicemembers. That is what we are talking about.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…few Members of this Chamber can't  seem to muster any maturity when they have a transgender colleague, but  members of the U.S. Armed Forces can and have.\n\nFor years, transgender people have been serving in our military.  There was no problem until Donald Trump decided to fire thousands of  qualified, capable servicemembers simply because of their gender…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and the State continue to argue the case and challenge the rulings  against them.\n\nMr. LaCour has argued for extreme restrictions on abortion rights and  the rights of transgender people. He has also aggressively advocated  for the death penalty. Last year, Mr. LaCour argued in support of  nitrogen suffocation--an untested and inhumane death penalty method--…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…needed proof that trans folks live rent free in the minds  of my GOP colleagues, then look no further than this amendment because  there are literally no known and out transgender people serving in our  academies right now because of the transgender military ban.\n\nSo what is this amendment all about?\n\nThe GOP obsession with bullying trans people is weird.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695234/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…servicemembers have served our country with  distinction and honor for almost a decade. They were able to do this  openly.\n\nYet, this amendment seeks to erase the existence of transgender  people, whether they are servicemembers or DOD employees, by  prohibiting the Secretary of Defense from collecting information about  gender identity on any form or survey.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and harassment.\n\nAthletic associations and the service academies are better prepared  to understand the sports that they regulate and how to provide both  respect for transgender people and fairness in sports. These  associations and academies should be addressing this issue, not  politicians, especially politicians who do not understand that trans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…teaching young children, get this, how to  make environmentally friendly reproductive health decisions. I scratch  my head on that one.\n\nThere is $833,000 for services for transgender people, sex workers  and their clients and sexual networks in Nepal.\n\nThe list goes on and on. I am sort of embarrassed to read it.\n\nAmericans know the Federal Government is…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…which has been  fraught with waste and abuse as evidenced by its abject failure to  contain Hezbollah;\n\n$3 million for an Iraqi Sesame Street;\n\n$833,000 for services for transgender people, sex workers, and their  clients and social networkers in Nepal; and\n\n$500,000 for electric buses in Rwanda.\n\nThese examples barely skim the surface, Mr. Speaker, and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…will just read you a few more that we took out that they are  demanding we put back in.\n\nThere was $6 million for media organizations for the Palestinians;  $833,000 for transgender people in Nepal; $300,000 for a pride parade  in Lesotho; $882,000 for social media mentorship in Serbia; $4.2  million--we took it out, and the Congresswoman and the socialist…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Iraqi ``Sesame  Street''; $2.5 million for teaching young children how to make  environmentally friendly reproductive health decisions; and $833,000  for services for transgender people, sex workers and their clients, and  sexual networks in Nepal.\n\nThe American people are begging Congress to get off its ass, codify  the DOGE cuts, and stop this taxpayer-funded…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}]