[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…sicker.\n\nI proposed two amendments this week, Mr. Chair, to protect our  communities, but they were rejected. They would have made sure that we  have full information and transparency on the disparate impacts and  cumulative impacts on minority, rural, disadvantaged, and Tribal  communities and would have added safeguards, safeguards that would have…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…would also control the information narrative about  the entire planet, from the environment to natural resources to human  conflict.''\n\nSo this bill provides Congress the transparency and insight we need  to oversee the licensing and regulation of private remote sensing  systems. It modifies the timeline for completing licenses to conform  with updated…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1373, as amended, bipartisan  legislation to promote additional transparency of board meetings of the  Tennessee Valley Authority.\n\nI thank Representatives Cohen and Burchett of Tennessee for their  leadership on this bill and their tireless work…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692214/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 1479, the Hotel Fees  Transparency Act.\n\nFar too often, when consumers go to check out of their hotel rooms,  they are hit with surprise fees. Hotels and online travel agencies have  many names for these…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…essential to bridging the gap between what current statistics show and  a more inclusive advertising landscape. This bill would help achieve  this goal while also promoting transparency and encouraging federal  agencies to strive to reach minorities, who often receive the news from  smaller media outlets that serve communities of color. The requirement…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…steer the United  States through the global financial crisis. Mr. Dodaro's work with  Congress and Presidential administrations helped shape the Digital  Accountability and Transparency Act of 2014, the Federal IT  Acquisitions Reform Act of 2014, the Fraud Reduction and Data Analytics  Act of 2015, and countless legislation that moved through the Committee…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…living  rooms, as it has done for every monumental development in the Senate  for the past 39 years. C-SPAN2 has also documented nearly 24,000  rollcall votes, providing the transparency and accountability our  democracy needs to thrive.\n\nThat is why, on its 39th birthday, Senator Grassley and I wanted to  highlight how important it is for all television…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…these migrants. Criminal organizations could then use this  information to adjust their operations and try to avoid enhanced CBP  inspections.\n\nHowever, Democrats are for transparency, as Mr. Correa has already  said, and there is nothing stopping DHS right now from publishing these  numbers.\n\nThe Trump administration also could publish this data right…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…around what benefits them financially, and they pour massive, massive  amounts of money into securing a specific outcome that benefits them.  They aren't subject to the same transparency or accountability of the  campaign that a candidate runs.\n\nIt created a system where power shifts away from everyday Americans  and towards the people who can write the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…workforce, including  many civilian employees at DOD who have long been protected by  collective bargaining. For decades, collective bargaining agreements at  DOD have enhanced transparency and allowed employees to perform their  work free from political interference. The Trump administration's move  to limit these protections undermines employee trust and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…all kinds of government programs that we rely on.  But Elon Musk and his minions have started unilaterally canceling  contracts at the Department of Education without any transparency or  accountability whatsoever, and Donald Trump has made no secret of his  desire to eliminate the Department of Education entirely, as part of  his quest to cut government…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…because of a failed and failing leadership.\n\nNow, the reason why the VA Secretary has abandoned this plan to fire  83,000 people is, essentially, unexplained. There is no transparency.  He has denied us information about who would have been fired. He has  refused to provide information about the 30,000 individual workers who  are leaving and what positions…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in opposition to H.R. 1049, the  Transparency in Reporting of Adversarial Contributions to Education  Act, the TRACE Act. This bill suffers from many of the same  shortcomings in the earlier bill we just discussed.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of California. Mr. Speaker, it is wonderful to hear  Republicans, and certainly the chairman of our committee, finally want  transparency on this issue. It is time to end this White House coverup  now.\n\nWe know that Donald Trump has tried everything to kill our Jeffrey  Epstein investigation. He has failed,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696810/epstein-files-transparency-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…consequences of getting it wrong would be enormous. My  approach would not have stopped this project. It would not have  dismantled anything. It simply would have required transparency, basic  disclosure of how Social Security data has been used or misused by the  Trump regime in the creation of this centralized database.\n\nYet, despite the gravity of these…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…more affordable, along with other policies that provide the Federal  assistance to the people, not insurance agencies, and give the private  market more competition and transparency so that people have more  choice. That is our plan, and it lowers costs for everybody.\n\nThe Democrats are trying to put forward an extension of a COVID-era,  fraud-ridden…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…including industry concentration, loan age,  and gross dollar amount.\n\nThese reports would be made available to the public within 7 days of  being provided to Congress. The transparency measures in this bill are  particularly important in light of the House passage of my bill, H.R.  3174, the Made in America Manufacturing Finance Act, which raised the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…extraordinary day in this Chamber.\n\nIf my colleagues will vote for this measure, then we will see justice  triumph over politics. Truth will triumph over deception and  obfuscation. Transparency will triumph over dark money. Partisanship  will fall away to bipartisanship, and grass-roots, the people, will  reclaim the people's House with this vote.\n\nIt is going…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Transparency In Charges for       Key Events Ticketing Act'' or the ``TICKET Act''.       SEC. 2. ALL INCLUSIVE TICKET PRICE DISCLOSURE.\n\nBeginning 180 days after the date of the enactment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…public school, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nMr. WALBERG.  1049.\n\nMr. Speaker, I rise in strong support of H.R. 1049.\n\nWe need greater transparency in American education. In recent years,  foreign governments have increasingly sought to influence our K-12  schools. It is not for their stated purpose of cultural exchanges…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``HUD Transparency Act of       2025''.       SEC. 2. CONGRESSIONAL TESTIMONY.\n\nNot later than October 1 of each year, the Inspector       General of the Department of Housing and Urban Development…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Commission under  former Chair Gary Gensler went far outside the agency's statutory  mandate in many ways, especially with cryptocurrencies.\n\nThe CLARITY Act will strengthen transparency and accountability for  consumers. It will require developers to provide accurate disclosures  with details about the asset project's operation, ownership, and  structure.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693772/digital-asset-market-clarity-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Transparency and       Predictability in Small Business Opportunities Act''.       SEC. 2. SMALL BUSINESS ADMINISTRATION RULES FOR CANCELLED                     COVERED SOLICITATIONS.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…committee has uncovered disastrous wait  times, fraud, waste, and abuse in the VA VR&E program. This bill would  move the program in the right direction by providing more transparency  on these failures.\n\nMr. Speaker, it is our duty to make sure that veterans who complete  this workforce program are earning more and are better off than they  were before…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people.\n\nIn this Congress so far, we have passed legislation to secure our  elections, H.R. 222, the SAVE Act; hold rogue activist judges  accountable, H.R. 1526; bring transparency to institutes of higher  education, H.R. 1048; make changes to our border with the Laken Riley  Act and the HALT Fentanyl Act; and to repeal the Biden-era harmful  environmental…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…of duty and pride in her  work. Her efforts have directly contributed to the effective operation  of county government and have helped maintain the financial health and  transparency so essential to public trust.\n\nAs Ms. Krzysiak prepares to embark on her well-deserved retirement,  we commend her many years of dedicated service. We thank her for her…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the source,  purpose, and terms of all foreign gifts; and it imposes real  consequences for noncompliance, including fines and loss of Federal  funding. It also ensures transparency in private university endowments,  preventing foreign adversaries from quietly shaping campuses' culture  and academic research behind closed doors.\n\nThe American people…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…only is a  former President, but the acclaimed ``Father of the Constitution.''\n\nOn its 20th anniversary, Sunshine Week continues to be a crucial  reminder of the need for transparency and open government. To control a  government as big as ours, it takes a lot of very bright light shining  on every Agency. As Justice Brandeis wrote in 1913, ``Sunlight…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…adversary foreign sources, no matter how  small.\n\nThat is why I am introducing an amendment to slash the reporting  threshold from $50,000 all the way down to $1; total transparency of  every cent. Any foreign gift, no matter how small, can influence our  democracy, and we must close any loophole that lets foreign actors  purchase access or sway our…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689034/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…codifying longstanding,  bipartisan exemptions from the definition of waters of the United  States; placing clear timelines on judicial review for permits; and  increasing transparency in the development of water quality standards.\n\nIt also directs the Corps to eliminate the backlog of outstanding  section 404 permit applications and jurisdictional determinations…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}]