[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…in 1989 by an       Irish nun, Sister Lena Deevy, and a group of volunteer       attorneys, to serve Boston's undocumented Irish community.       Over the years, Rian has transformed into a vibrant center       serving immigrants and refugees from over 125 countries       worldwide, and reflecting the rich diversity of the foreign-      born communities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Community  Board 7, Anita has been a tireless force for equitable development,  healthcare access, and community empowerment.\n\nAnita's visionary leadership at UJA-Federation transformed the  landscape of aging and disability services in New York. She was  instrumental in launching the state's first programs for Naturally  Occurring Retirement Communities,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…in recognition of the Minnesota  Assistance Council for Veterans (MACV) for their grand opening of the  newly renovated Robin property. Formerly the Robin Hotel, MACV has  transformed the century-old property into 14 units of safe, stable  housing for Veterans working to rebuild their lives.\n\nI am immensely proud to have secured $750,000 in Community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…empowerment  programs, crisis intervention, and support for survivors of domestic  violence.\n\nThrough its dedicated team of professionals and community  partnerships, FCS has transformed countless lives by ensuring that  everyone, regardless of background or financial status, has access to  the care and resources they need to thrive. Their century-long…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…access to education. As a  teacher for almost 30 years and the founding chairman of the New York  State Senate Disabilities Committee, I have seen firsthand how IDEA has  transformed lives and what it means to families.\n\nYet, for all of the progress that we have made, much work still  remains, and IDEA is still more at risk today than it has ever been.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…visitors, and the local and national       elected officials that MPD serves.\n\nThe law enforcement disciplinary reforms implemented by the       District were long overdue. They transformed a process where       the determination of whether or not an officer is       fit to wear the badge rests not with an unaccountable labor       arbitrator, but with the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Recognizing Dr. Shane Crotty\n\nMr. PETERS. Mr. Speaker, I rise today to recognize the remarkable  Shane Crotty, a San Diegan and world-renowned immunologist whose work  has transformed our understanding of the human immune system.\n\nDr. Crotty's groundbreaking research into the body's response to  virus was not only vital to the global fight against COVID-19…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…crucial medications abandoned in       warehouses, vital programs closed, workers laid off. The U.S.       government, once known for humanitarian assistance, quickly       transformed into something unrecognizable. It is estimated       that over 300,000 people, including children, have died       because of this decision. But that would not be their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…a  cornerstone of our community, dedicated to inspiring a love of  gardening, advancing civic beautification and championing environmental  stewardship.\n\nIts members have transformed public spaces--such as the gardens at  the Ramsay House Visitor Center and Gadsby's Tavern in Alexandria--into  vibrant, welcoming places for all to enjoy. They have educated…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…absolutely exploding. In  fact, about $1.5 trillion worth of private sector investment was put  into that broadband expansion in just a 5-year period. It was  incredible. It transformed our Nation.\n\nA 14-year-old girl today thinks that she has an entitlement to a 65- inch screen in her living room and a little digital device on her lap  at the same time.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…community.\n\nIn 1976, the Patel family purchased the original Peter Pan Motor  Lodge in Anaheim, right across from Disneyland. Almost 50 years later,  Mr. Patel's leadership has transformed this small hotel into the Castle  Inn and Suites in Anaheim.\n\nMr. Patel is a business leader and philanthropist. He sits on the  board of the California Lodging Industry…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Chief Strategy Officer is a true testament to her visionary  leadership, relentless innovation, and deep commitment to empowering  others. Over the past several years, she transformed multiple  departments, drove major revenue growth, expanded international  operations, and championed the use of AI to accelerate performance  across the company. Beyond…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…law by  President Obama, it was a proud day for our city and our entire State.\n\nThis designation unlocked a flood of new rehabilitation and expansion  projects that have transformed the Great Falls into a hub for tourism  and recreation.\n\nThis includes the expansion of the park's boundaries to encompass the  historic Hinchliffe Stadium. The Great Falls…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…rise today along with my  colleague, Congressman Mark DeSaulnier, to recognize and celebrate the  retirement and career of Stacey Mortensen, whose visionary leadership  has transformed public transportation across the Central Valley and  Northern California.\n\nFor more than three decades, Stacey has championed investments in  passenger rail that have connected…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Mrs. RAMIREZ. Mr. Speaker, I rise today to honor Mario Vega for his  work to create spaces that uplift our young people and build safe and  thriving communities.\n\nMario has transformed his own personal experiences, growing up in  Chicago, to realize safety in our communities by investing in our  city's young people.\n\nThrough the establishment of the Chicago…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…costs for families and  restoring American energy dominance.\n\nI am proud to represent parts of the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…human trafficking and to restore freedom and dignity  to those trapped in it. Since then, her leadership has been a catalyst  for change, and her vision for Selah Freedom has transformed the  organization into a national leader in anti-trafficking efforts. Laurie  has worked tirelessly to create programs that provide more than just  temporary relief; she's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…was first elected to the Celina City Council in 1999. In  2002, he was elected to serve as the Mayor of Celina and was reelected  twice. Under Corbett's leadership, Celina transformed economically  through increased job growth and critical business investments. As a  result of his advocacy for Celina residents, he was recognized as a top  influential…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…in charge of Venezuela does not  constitute such an interest.\n\nWe have seen chaos emerge from our misguided wars before. We  overthrew Saddam Hussein thinking Iraq will be transformed into this  great Jeffersonian democracy. Instead, what occurred was an insurgency  that led to some of the most brutal sectarian violence in living  memory. Washington's…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…has chosen the  very best. I have known him for 15 years, and he has helped shape my  work in the Senate. He ran three of my Senate leadership offices, and  in each one, he transformed how we served the Members of this body.\n\nPrior to that, Arjun worked for Senator Elizabeth Dole of the  Presiding Officer's home State of North Carolina and for Senator…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Department, where  he served in a variety of patrol and administrative positions before  retiring from a 20-year law enforcement career.\n\nDr. Johnson's leadership has not only transformed Lamar State College  Orange but has paved the way for future generations to pursue the  American Dream right here in Texas.\n\nOn behalf of Texas' 14th Congressional District…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and Lancaster County.\n\nAs President and CEO for the YMCA of the Roses, Mr. Larry Richardson  has provided an invaluable service to the community. The YMCA of the  Roses has transformed lives under his leadership, and I am proud and  thankful to have such a strong community-minded organization in  Pennsylvania's 11th Congressional District. I wish the best…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692512/congratulating-ymca-of-the-roses-ceo-and-president-larry-richardson-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…pull our gaze away from  what really matters.\n\nHere is what matters: Blockchain technology, Web3, will transform  every single industry in the same way that the internet has transformed  every single industry over the last 30 years. That transformation will  happen much faster than people realize if we can keep government from  continuing to screw this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…hospitality. The adjacent Floridian Country Club and  golf course capitalized on the growing popularity of the sport and were  later revitalized by the Beucher family, who transformed the property  into the acclaimed Mission Resort & Club. In 2022, the Beucher family  passed the torch to MMI Hospitality Group, ensuring the resort's  continued excellence.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Entrepreneurship Award.\n\nAfter completing his service in the U.S. Marine Corps, George took  the responsibility of owning the Thistle Creek Farms in Warriors Mark.\n\nGeorge has transformed his family's 600-acre farm into a nationally  recognized regenerative livestock operation which produces a premium  beef brand.\n\nMotivated to help owners of small farms…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…from 100  Black Men of Omaha to regain his academic standing. He is a dedicated  member of the chorus, drill team, and marching band. Mr. Banks is an  unstoppable force who transformed health challenges into an opportunity  for personal and academic growth.\n\nMara Johnson Anthony is a high-achieving high school student who  maintains a 4.0 GPA with AP courses.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…violence. Charlie Kirk was an  example of this. He did things the right way, having healthy debates  with people who saw differently than him and sparking a movement that  transformed an entire generation. Charlie believed in the promise of  America, and his life's work  was making sure we lived up to that promise.\n\nAudrey and I continue to pray for Charlie's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…veterans, first responders, and rescue animals, offering a sanctuary  where pain met purpose and isolation gave way to hope.\n\nThrough Lois' tireless dedication, lives were transformed and bonds  were forged between heroes and horses. As the farm prepares to close on  July 31, we reflect not with sorrow but with deep gratitude. The legacy  of New Freedom…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Central American. Rather than a law  enforcement professional body, they drew these illegals into our  country where they were waived in by a Federal law enforcement body  transformed into a reception and processing force. The negative impact  was 100 percent the result of policy.\n\nOur colleagues across the aisle told us for years, Mr. Speaker: We  need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of the Supreme Court's Seven County       Coalition ruling and enact judicial reforms to reduce NEPA       litigation, which, according to the Supreme Court, has       ``transformed NEPA from a modest procedural requirement into       a blunt and haphazard tool employed by project opponents.''\n\nCongress should also enact Rep. Pete Stauber's (R., MN),…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]