[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…betrayed her, and she was arrested. She was then sent to       Drancy, an infamous rail juncture and holding town just north       of Paris. From there, its prisoners were transported to       concentration or death camps.\n\nGrandmother and I stayed hidden in my mother's apartment       for a year, never leaving for fear of being arrested or       worse.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…our Canadian allies instead of  putting a tariff on them?\n\nThe second fact that bears mentioning is that the vast majority of  the fentanyl crossing the southwest border is transported by Americans,  hidden in their cars and trucks. That is why I have supported--like  most of my colleagues in this body have supported--more money for  technology and personnel…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…last month, Mr. Speaker, in Oakland County, a 9-year-old was  seriously injured after he was accidentally shot. First responders  found the boy bleeding from the head and transported him to the local  hospital.\n\nThis Gun Violence Awareness Month, let's do something to save lives.  I am introducing the Safe Storage Saves Lives Act with Representatives…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…on  communities, especially in communities like mine in the San Fernando  Valley.\n\nMy district is housing several disposal sites for wildfire debris. As  debris is being transported and stored throughout the valley, I have  been adamant about making sure that my constituents are not subjected  to the long-term health effects that they have traditionally…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…nearly 10 months after being arrested at the age of 15 in his home  at 3 in the morning by heavily armed Israeli soldiers. He described  being bound and beaten while being transported and threatened while  being interrogated without the presence of a family member or an  attorney. U.S. Embassy officials who visited him most recently in  November described…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Varick Street. Over eight       hours one late-spring Saturday, its entire collection,       cocooned in bubble wrap and packed in more than 400 plastic       crates, was transported to the new location as quietly as can       be done with a police escort.\n\nBoth the appeals and challenges of the society's current       home were evident during a recent…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…important legislation.\n\nMy bill strengthens the American merchant marine by guaranteeing that  100 percent of U.S. cargo generated by the Department of Transportation  will be transported on U.S.-flagged ships. It is that simple.\n\nThis bill is the maritime industry's version of Buy American. If the  government is shipping cargo, it should be on American vessels.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…access the energy they need on a daily  basis.\n\nMr. Speaker, the build-out of interstate natural gas pipeline  infrastructure is essential to ensuring domestic energy can be  transported efficiently and meet growing electricity demands. H.R. 3668  should be an easy ``yes'' vote for Members on both sides of the aisle.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…communities in  need.\n\nThe Clay County Sheriff's Office and Emergency Medical Services were  flooded with donated supplies from area churches, local businesses, and  citizens. Once transported to the affected areas, these supplies were  received by first responders with great relief and deep appreciation.  Let it be recognized and remembered that, in a time of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "James Risch", "party": "Republican", "sentence": "…staff director, may appoint an       alternate security manager as circumstances warrant.\n\n(c) Transportation of Classified Material.--Classified       material may only be transported between Senate offices by       appropriately cleared staff members who have been       specifically authorized to do so by the security manager.\n\n(d) Access to Classified…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…recruited to play soccer at Cal State Fullerton. This past  September, on her way to another sporting event, she and her teammate  Lauren were struck by a truck. Both were transported to the hospital,  but Lauren tragically passed away after 6 weeks of intensive care. Her  family's words were: ``Lauren fell asleep in the Lord.'' Lauren's  legacy of goodness…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699245/recognizing-ashlyn-gwynn"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…international law, to       address, disincentivize, and interdict illicit trafficking by       sea of controlled substances (and precursors of controlled       substances) being transported to produce illicit synthetic       drugs.\n\n(b) Elements.--The policy required under subsection (a)       shall--\n\n(1) include a requirement that, to the maximum extent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…opened in 2017, Tony revived the storied life of  Rowena, a once-bustling community located along the banks of the  Cumberland River. In the early 1900's, the Steamboat Rowena transported  goods and people from Nashville, Tennessee to Burnside, Kentucky,  making routine stops at Rowena Landing. It is here that the Army Corps  reserved a site for future recreational…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…of the accident; or\n\n(C) one or more motor vehicles incurring disabling damage       as a result of the accident, requiring at least one of the       motor vehicle to be transported away from the scene by a tow       truck or other motor vehicle; and\n\n(2) does not include--\n\n(A) an occurrence involving only boarding and alighting       from a stationary…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…patrol in securing the skier onto a toboggan for transport  down the trail.\n\nUpon arrival at the ski patrol room, Emmet County Emergency Medical  Services assumed care and transported the skier to McLaren Northern  Michigan Hospital, where he is expected to make a full recovery.  Medical staff later confirmed that the rapid response, early CPR, and  timely…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…title 46, United States Code, to direct the  Secretary of Transportation to ensure that all cargoes procured,  furnished, or financed by the Department of Transportation are  transported on privately-owned commercial vessels of the United States,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}]