[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…everybody who facilitated  and covered up these crimes like JPMorgan Chase, Bank of America,  Deutsche Bank, and Bank of New York Mellon, which executed billions of  dollars in transactions related to these offenses, as well as any bank  executives who participated in the sexual abuse of girls and young  women.\n\nWe must expose everyone who covered up these…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…be administered by  the Office of Foreign Assets Control.\n\nThis pilot project would grant private-sector firms a temporary  specific license to conduct nominal financial transactions with  sanctioned entities to assist with law enforcement investigations.  These private firms would be, for example, as you have heard, Mr.  Speaker, blockchain analytics…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…pictures and passing a woman to  Trump, and noted that Trump spent hours with one of the victims and was  the ``dog that hasn't barked.''\n\nThese files also include financial transactions between Epstein and  Trump. There are discussions of financial affairs, potential money  laundering, including in real estate deals. There was also an admission  by Jeffrey…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…other forms of digitizing the dollar that would truly cut  costs for people.\n\nFor example, J.P. Morgan Chase has estimated that $100 billion could  be saved in cross-border transactions every year if a wholesale CBDC is  adopted. Earlier this week in the Rules Committee, we heard Republicans  claim that we need to weaken oversight of private crypto because…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Agencies to be able to review the mergers.\n\nSecond, the updated rules also ensure that all applicants provide  regulators with the information they need to weed out harmful  transactions and to ensure that the OCC is more transparent about how  it weighs certain factors when making a determination for whether to  approve or deny a merger, and all that would…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…vote on legislation  regulating the stablecoin market.\n\nStablecoins are a type of crypto that claim to maintain a constant or  ``stable'' value and are used in most crypto transactions today.\n\nIn May, World Liberty Financial announced the firm will be making a  $2 billion business deal with a fund backed by Abu Dhabi, using the  Trump firm's stablecoins.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…the Chinese  yuan.\n\nThere is reason for both consumers and small retailers to be  supportive of this legislation. Stablecoins offer faster, more  affordable ways to settle transactions that will benefit everyone.\n\nEarlier this year, Senators Hagerty, Alsobrooks, Scott, Lummis, and I  introduced the bipartisan GENIUS Act, which is the strongest effort to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Administration has also created new roadblocks to  service in the name of efficiency and fraud prevention, requiring  seniors and people with disabilities to complete some transactions in  person or online, rather than by phone.\n\nYet, reduced staffing levels at field offices have made it more  difficult to schedule a timely appointment.\n\nIn my district,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699376/concerning-state-of-service-at-social-security-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…more  efficiently, victims will experience a quicker resolution and recovery  process, banks and financial institutions will have clearer guidelines  to prevent fraudulent transactions, and taxpayer dollars will be better  protected, reducing the losses due to fraud.\n\nEvery dollar, Mr. Speaker, lost to fraud is a dollar taken from  taxpayers. H.R. 1155…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…13th Congressional District's champions of the week.\n\nTheir app, Eagle Express, is an innovative system that allows  students and teachers to better track and complete transactions within  their school's token-based incentive program. The app will help  teachers better manage students and students better manage their  finances.\n\nNamed after STEM High…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…purposes of this       subsection, a foreign corporation shall be treated as an       inverted domestic corporation if, pursuant to a plan (or a       series of related transactions)--\n\n``(A) the entity completes after May 8, 2014, the direct or       indirect acquisition of--\n\n``(i) substantially all of the properties held directly or       indirectly…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…billion, you as a consumer are out of luck, and Trump can say: It  wasn't my fault because Congress prohibited us from having prudential  regulations.\n\nIf an entity in the transactions business is going to hold $7 billion  of consumers' money, shouldn't we at least make sure that the money is  still there, and shouldn't we make sure that they don't engage…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…regarding your  disability benefits or your age and birth records? Who all knows what  can disappear or be modified? Banking records are possibly included if  you had banking transactions to pay your taxes. It could be incredible  amounts of stuff.\n\nWe have had fairly protective practices of these databases, which is  why, when DOGE went in with laptops,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…third- party firms accountable for their investments in Iran, as well.\n\nSince 1996, Congress has built upon this legislation multiple times  and has expanded the list of transactions that are considered  violations of the ISA.\n\nThese sanctions, combined with additional sanctions on Iran's  financial system and petroleum transactions, as well as aggressive…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…you can't have the full faith and credit of the United States.\n\nNow, we have talked about the role of the U.S. dollar, the critical  role that it plays in international transactions, and why that is a  major economic benefit to the United States.\n\nThe crypto bros occasionally tell you out loud what they are  thinking. That  is they want to minimize…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…trusted financial tools like overdraft  protection to help families manage their emergencies.\n\nOverdraft protection is a critical tool that helps families avoid  declined transactions, bounced checks, and costly disruptions. It does  so transparently with clear disclosure.\n\nA 2023 study from the Financial Health Network found consumers want  overdraft…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…innovation happening here rather than overseas, about more  liquid capital markets, about small businesses creating new services  and products, about removing friction from transactions for every  single American, and about protecting consumers so the debacles like  the FTX meltdown never happen again.\n\nWe tend to overstate the impact of what we do in this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…businesses.\n\nIt provides relief to gig workers by ending the Democrats' absurd  $600 1099-K reporting threshold and reverts back to the time-tested  standard of $20,000 and 200 transactions. It will provide economic  relief, secure our borders, and ensure American energy dominance.\n\nThis legislation will make the life of the average American better,  and I…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…accelerate project transition from       research, testing, evaluation, and prototype to production.\n\n(6) An assessment of the manner in which the authority to       enter into transactions other than contracts and grants       pursuant to sections 719 and 1158 of title 14, United States       Code, has been exercised by the Commandant, and a description…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…online or physical       store or marketplace operated prominently in the name or such       person or its affiliated company.'' While this exclusion       seems to cover transactions between consumers and merchants       using a merchant's own payment software, the proposal later       states the exemption for merchants would not apply, ``if a…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…government-controlled, programmable money  that, if designed without the privacy protections of cash, could give  the Federal Government the ability to surveil and restrict Americans'  transactions and monitor every aspect of our daily lives.\n\nIn other words, every dollar you spend, where you spend it, and who  you spend it with would all be visible to and tracked…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…stablecoins. That is the way we should do it. That is the way  we should lead in innovation.\n\nYes, personal privacy is at stake. Surveillance of Americans'  individual financial transactions through a CBDC does raise serious  privacy concerns and concerns about government control and  politicization of loans, online payments, credit scores, tax  compliance,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…1701 et seq.) (except that the       requirements of section 202 of such Act (50 U.S.C. 1701)       shall not apply) to the extent necessary to block and       prohibit all transactions in all property and interests in       property of the person if such property and interests in       property are in the United States, come within the United       States,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…functions.--The Assistant Secretary may       delegate to ITS any of the functions assigned to the       Assistant Secretary under section 103(b)(1).\n\n``(3) Agreements and transactions.--In carrying out the       functions described in paragraph (2), the Assistant       Secretary, acting through the head of ITS, may enter into       agreements as provided…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Supervision Michelle Bowman, who talked about the procompetition  benefits of healthy mergers, said: ``Reducing the efficiency of bank  M&A can be a deterrent to healthy bank transactions. It can reduce the  effectiveness of M&A activity that preserves the presence of community  banks in underserved areas, prevent institutions from pursuing prudent  growth…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…annually.\n\nSecond, the bill requires sanctions on the state-owned Myanma  Economic Bank, also known as the MEB, which is operated by junta  cronies and processes weapons transactions that are contrary to those  sanctions.\n\nThird, the bill requires sanctions on any person operating in the jet  fuel sector of the Burmese economy. The jet fuel industry…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…first administration to update CFIUS, the Committee on  Foreign Investment in the United States. This interagency committee  reviews foreign investments and real estate transactions to determine  whether they pose any security risks for the United States.\n\nThrough the Foreign Investment Risk Review Modernization Act, or what  was known as FIRRMA, we…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Powers       Act (50 U.S.C. 1701), the President may exercise of all       powers granted to the President by that Act to the extent       necessary to block and prohibit all transactions in all       property and interests in property of the foreign person if       such property and interests in property are in the United       States, come within the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…markup and our STABLE Act and improve the  GENIUS Act.\n\nWith this legislation today, on a bipartisan basis, we are  modernizing our financial infrastructure, streamlining transactions,  lowering costs, and expanding financial tools for everyday Americans.  This is about putting American innovation first. It is about creating a  future where innovation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…amend the Defense Production Act to add the Secretary  of Agriculture as a permanent member to the Committee on Foreign  Investment in the United States, or CFIUS, for any transactions related  to the purchase of farmland, biotechnology, or any other transaction  related to the agricultural industry.\n\nMy bill also includes the Safeguarding American Farms…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}]