[{"senator": "André Carson", "party": "Democrat", "sentence": "…groundbreaking medical research that directly  benefit our service members and veterans. Over the years, this program  has supported lifesaving innovations in areas such as traumatic brain  injury. PTSD, breast cancer, and other conditions that  disproportionately affect our military community. Many treatments and  therapies that were once experimental…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692417/introduction-of-medical-research-for-our-troops-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today to recognize the traumatic  loss of life around the world and to reaffirm a simple truth: Our  destinies are tied.\n\nToo often, in moments of crisis, we are bombarded with abstract  numbers and detached…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…wounded and brutalized and injured, and many  still have the physical injuries and scars that they are dealing with,  as well as the mental scars, because there is a lot of post-traumatic  stress disorder.\n\nSeveral of the officers who were there had been in the Iraq war, and  they had been in the Afghan war. They testified before the January 6th  Select Committee,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…food on their family's table next week  or keep a roof over their heads next month.\n\nThe biggest predictor of veterans homelessness is not that they are  suffering from post-traumatic stress. It is not substance abuse. It is  loss of a job. Homelessness is directly linked to joblessness.\n\nThese folks that Trump fired, these are folks who did one, two,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…sacrificed so much of my  livelihood for the betterment of our planet, only to see it all burn  down in less than half a year.''\n\nMyiesha, a researcher at UCSD, overcame her own traumatic brain  injuries and chronic illnesses so she could study the effects of  infectious diseases on vulnerable patients. Now, Myiesha faces a new  challenge: overcoming an administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…survivability of the cease-fire.\n\nSo we should be calling on the Netanyahu government to reopen the  medical evacuation corridor so that those Palestinian kids in Gaza with  traumatic war wounds--bullets in their bodies and missing limbs--can be  evacuated to Palestinian church hospitals in Jerusalem.\n\nThe violence and settler attacks on the West Bank…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…are a lot of questions around the status of these trials.\n\nMore than 1,000 veterans are at risk of losing access to treatments  for head and neck cancer, kidney disease, and traumatic brain injuries.  Some of these trials have not been restarted.\n\nIn Pittsburgh, a study for veterans struggling with opioid addiction  stalled out when a hiring freeze hit.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…serve on speedboats and have been exposed to intense vibrations may  have medical consequences that merit our attention. We know that  exposure to overblast may cause serious traumatic brain injury.\n\nMr. Speaker, in the spirit of this legislation, which I can wholly  support, I believe that we must do more. I ask the chairman if we might  schedule a hearing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…forced to live       undocumented in the US, the stress of living with fear of       detention and deportation is known to increase risks for       anxiety, depression, post-traumatic stress disorder, and       physical health symptoms. These health impacts extend to       family members and citizen children, and can be exacerbated       if families avoid…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…proactive approach to their health not just  during June but every month of the year.\n\nThe caucus focuses on key areas like mental health care, prostate  cancer screening, traumatic brain injury, and urological health. These  are not fringe issues; they are central to the well-being of men across  America, and yet they often go unaddressed until it is…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…civil or       criminal liability under Federal or State law.       SEC. 4. DEFINITIONS.\n\nIn this Act:\n\n(1) Concussion.--The term ``concussion'' means a type of       mild traumatic brain injury that--\n\n(A) is caused by a blow, jolt, or motion to the head or       body that causes the brain to move rapidly in the skull;\n\n(B) disrupts normal brain functioning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the assassin.\n\nBig unanswered questions for the President: What specific vetting was  done with regard to the 3 years that this assassin lived here in  America? Was his post-traumatic stress from his prior violent work  considered? Was the caseworker who reported his possible radicalization  interviewed and reviewed? Was his inability to even get a job…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697312/attack-on-two-national-guard-members"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…care of them. This means a fully staffed and funded  Department of Veterans Affairs. This means mental health professionals  are in place to assist these veterans through traumatic and life- changing diagnoses. This means updated infrastructure in place to care  for these veterans. For those who succumb to their diagnoses, this  means a fully functioning…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…doctors. My single daughter and myself both rely on SNAP to eat and  Medicaid to see our doctors.\n\n``It is very clear those voting for these cuts have never experienced  the traumatic effects of living in poverty and the threat of taking the  only help we have away. Please don't let them do this.''", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691522/medicaid"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…chilling,  and it is a warning for all of us.\n\nAliya is a U.S. citizen. She is a software engineer. She identifies  as disabled, autistic, and as someone suffering from a traumatic brain  injury.\n\nOn her way to a doctor's appointment, she was stopped by ICE. They  screamed conflicting orders at her, dragged her from her car, and  carried her while she…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699631/what-happened-to-aliya-rahman"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…developed a 12-week program focused on the critical link between  physical fitness and cognitive health. The impact has been  extraordinary: veterans struggling with Post-Traumatic Stress Injury  (PTSI) have not only regained their strength but have rebuilt their  lives--finding employment, reconnecting with their families, and  reclaiming their sense…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…at all. This  was the case last year when multiple college women's volleyball teams  forfeited rather than face a team with a biological male athlete,  rather than face a traumatic brain injury when the next man hit them in  the face with a volleyball.\n\nThere is nothing honorable about robbing women of opportunities,  invading their privacy, and jeopardizing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200 servicemembers still missing in action from Vietnam.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…how to perform CPR.\n\nBrenda was able to walk Josie through the proper CPR technique while  they waited for EMTs to arrive. When asked about who was in her mind  during this traumatic experience, she responded: Jesus.\n\nMr. Speaker, I ask my colleagues to join me in honoring this  remarkable young woman. Because of her decisive actions, her mother is  alive…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I rise today in belated recognition of  Post-Traumatic Growth Day--I repeat, post-traumatic growth.\n\nObserved annually on June 13 as part of National PTSD Awareness  Month, this effort was initiated by Boulder Crest Foundation,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…``22 a day,'' the number of  veterans who take their own lives each and every day. Uncle Ry,  Kendra's husband's younger brother, was just 26 when he lost his battle  to post-traumatic stress on U.S. soil. Ryan was a son, a brother, a  best friend, and an uncle.\n\nThis is why 100 percent of their shop's net proceeds of coffee,  awareness bracelets, and awareness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…They recently launched the Hyperbaric Wellness Foundation and have  partnered with the HOW Foundation to provide hyperbaric oxygen therapy  to veterans battling PTSD or other traumatic brain injury.\n\nAdditionally, generous grants from the Department of Veterans Affairs  have allowed them to successfully treat over 59 veterans so far this  year.\n\nAs a Navy…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…misconduct. Sec. 516. Establishment of special victim capabilities to respond to                allegations of certain special victim offenses. Sec. 517. Members asserting post-traumatic stress disorder, sexual                assault, or traumatic brain injury. Sec. 518. Participation in CATCH a Serial Offender program. Sec. 519. Accountability and transparency…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]