[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…resolutely committed to freeing the Colonies from British  rule.\n\nHe helped draft both the Declaration of Independence and the United  States Constitution, and he negotiated the treaty that ended the  Revolutionary War. His genius has shaped our Nation in innumerable  ways, and he deserves to be prominently displayed and honored in the  United States Capitol.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to work toward international agreements, Mr.  Speaker, with all nine countries that possess nuclear weapons through  comprehensive nuclear test ban treaties, as well as the treaty on  prohibiting a nuclear weapon.\n\nAgain, we must come together. I cannot say this enough: The  devastation and the consequences of any nuclear launch could be, again,  life-changing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…protecting not only their own population but the rest of Europe.\n\nIf this amendment were to pass, it would cripple not only Ukraine's  legal right to defend itself but also our NATO Treaty allies.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…his actions.  Donald John Trump's tariffs contradicted trade agreements established  by his administration and other administrations, including the duly  ratified and binding treaty obligations of the United States, thereby  breaking international laws and norms, leading to countries around the  world to enact damaging tariffs on goods and services originating…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…our urgent attention. We cannot afford to throw our hands up  and say there is nothing to be done.\n\nThe United States can take concrete action today: Extend the New  START treaty. The arc of arms control is one of success led by  Presidents of both parties.\n\nForty years ago, there were 70,000 nuclear warheads in inventories  around the world. Today,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…calling on them  to halt and reverse these harmful cuts to Tribal programs.\n\nThese programs are vital to Indian Country and part of the United  States' solemn Tribal trust and treaty responsibilities. Our sovereign  Tribal nations depend on these programs, and we must protect them.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…nuclear  weapons. It would also provide scientific and technical support for the  peaceful use of atomic energy.\n\nIn 1992, Kazakhstan ratified the Strategic Arms Reduction Treaty  (START 1) and a few years later, all of Kazakhstan's 104 ICBMs were  safely removed and destroyed. The Kazakh government doubled-down on its  commitment to global peace, security,…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…am pleased we were able to work out a bipartisan solution that  maintains environmental safeguards under bedrock environmental  protections like NEPA and the Migratory Bird Treaty Act. This approach  will provide a reasonable regulatory framework with proper oversight  and require renewal every 5 years to ensure that it is working as  intended and that,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise today to open the Special Order hour  to discuss the expiration of the New START treaty, the importance of  arms control, and the urgent need to strengthen global nuclear  security.\n\nI thank the Members who will be joining me this evening for their  leadership…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…contamination.\n\nHowever, our challenge is made harder by the fact that there is only  one arms control agreement remaining in force between the United States  and Russia. The New START Treaty limits the number of deployed  strategic nuclear warheads for each party to 1,550. The treaty expires  in February 2026. There are scant signs that either government is  interested…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Franklin's most important accolade is that he is the  only person to have signed formally all three foundational documents  separating our new Nation from the British monarchy.\n\nThe Treaty of Paris, the Declaration of Independence, and the Bill of  Rights, together known as the Charters of Freedom, boast the signatures  of some of our Nation's most revered figures.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Congress' Article  I power of the purse and provide clear funding direction to this  administration.\n\nI want to highlight how this bill maintains funding to our trust and  treaty responsibilities to Indian Country. It continues to support  education, healthcare, public safety, and human services for our Native  American brothers and sisters.\n\nThis bill…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698755/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…within a few months or even a few weeks. The worry, after the IAEA  report issued 2 weeks ago declaring Iran was no longer in compliance  with the Nuclear Nonproliferation Treaty, was that the regime may have  decided to do exactly that.\n\nI just returned from visiting Saudi Arabia, Bahrain, and the United  Arab Emirates with colleagues, both Democrat…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Speaker, I rise today to celebrate the  christening of the USNS Billy Frank Jr.\n\nBilly Frank Jr. was a proud member of the Nisqually Tribe and a  dedicated leader on tribal treaty rights and environmental stewardship.  He served as chair of the Northwest Indian Fisheries Commission for  over 30 years, paved the way for the Boldt decision and was honored…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…1,000 by the year 2030.\n\nThis growth adds to global instability and makes the case for urgent  diplomacy and arms control even stronger. Yet, the most important arms  control treaty still in force between the United States and Russia is  set to expire in less than 200 days.\n\nIf we let the New START Treaty expire, we will be left with no legal  limits on…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…House of       Representatives; and\n\n(D) the Committee on Appropriations of the House of       Representatives.\n\n(2) NATO.--The term ``NATO'' means the North Atlantic       Treaty Organization.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of State.       SEC. 3. SENSE OF CONGRESS.\n\nIt is the sense of Congress that--\n\n(1) the progress…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…on conquest.\n\nIn 1948, two-thirds of Americans said America and Western European  friends should join together for a mutual defense pact. By 1949, with  the North Atlantic Treaty in the works, the question actually got more  specific: Would the American people support ``a promise of mutual aid  from all the members of the alliance if any single member…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…ourselves against China and Russia, which  are not standing still. They are major competitors, and they are making  important investments in trying to militarize space, despite the treaty  from 1967. We must innovate. We must invest. We must push forward to  keep our strong position today.\n\nSadly, China especially does not play by the rules. Just a few years…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…United States of America in Congress assembled,       SECTION 1. SHORT TITLE; TABLE OF CONTENTS.\n\n(a) Short Title.--This Act may be cited as the ``South       Pacific Tuna Treaty Act of 2025''.\n\n(b) Table of Contents.--The table of contents of this Act       is as follows: Sec. 1. Short title; table of contents. Sec. 2. Amendment of South Pacific Tuna…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…on the border of New York and  Canada along the St. Lawrence River. Following the Revolutionary War,  the Seven Nations of Canada and the State of New York signed the 1796  Treaty, which gave the Tribe its reservation.\n\nIn 1824 and 1825, New York acquired land from the Tribe without the  Federal Government's approval, violating the Non-Intercourse Act,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…front-of-mind for all  Americans, but especially those in my home State of Oklahoma.\n\nCommercial remote sensing can also be helpful in humanitarian relief  efforts and monitoring treaty compliance, among other national security  and foreign affairs applications.\n\nThis technology provides us with critical information for a number of  fields. As the industry…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…construed to waive the obligation of the Secretary to comply       with the--\n\n(1) National Environmental Policy Act of 1969 (42 U.S.C.       4321 et seq.); or\n\n(2) Migratory Bird Treaty Act (16 U.S.C. 703 et seq.).\n\n(e) Definitions.--In this section:\n\n(1) Lake manager.--The term ``lake manager'' means a person       that is licensed by a State regulatory agency…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…why integrated deterrence is essential. The world is safer  when America leads. And it is not just Taiwan that feels pressure from  China; the Philippines, one of America's treaty allies, is locked in a  contentious territorial dispute with China. Beijing wrongly claims  islands and shoals that have been internationally recognized as  belonging to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…following:       ``Sec. 312. Special Advisor to Commandant for Tribal and\n\nNative Hawaiian Affairs\n\n``(a) In General.--In accordance with Federal trust       responsibilities and treaty obligations, laws, and policies       relevant to Indian Tribes and in support of the principles of       self-determination, self-governance, and co-management with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…protects our communities, fully funding firefighter pay to support  wildland firefighters and prevent catastrophic wildfires.\n\nThe bill prioritizes upholding our trust and treaty responsibilities  with Tribal nations. I continue to say that I refuse to balance this  budget on the backs of our Tribes, and I am proud that this bill does  not do that.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Greenlanders but who live in  Denmark are justifiably disturbed and unsettled.\n\nIt is deeply unsettling, if you understand the immense value of  NATO--of the North Atlantic Treaty Organization--and how one cofounding  member taking land from another shatters this crucial alliance forever.  We have seen that in statements coming from our NATO allies.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…formulaic. When we work so  many quarters, we get our benefits. When we serve in the military, we  get our benefits. For those who are part of a Tribal group or part of  our treaty obligations, certain things are coming to them.\n\nThen there are the things we vote on and the things we try to balance  the budget over. We need more money for defense, and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Tribe under this section shall       be considered Indian lands for the purpose of the Indian       Gaming Regulatory Act (25 U.S.C. 2701 et seq.).       SEC. 3. NO IMPACT ON TREATY RIGHTS.\n\nNothing in this Act affects treaty rights under the Treaty       between the United States of America and the S'Klallams       Indians, concluded at Point no Point,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…applied to legal  immigrants who had accepted the jurisdiction of the United States by  obeying its immigration laws and who had taken up legal, permanent  residence subject to a treaty ratified by the Senate.\n\nDoes the President have the authority by executive order to clear up  this matter as part of his organic constitutional responsibility to  take care…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…has  seen very focused efforts between the Tribe, local, and county  officials, and our congressional office to realize this long-sought  agreement dating back to the 1796 Treaty with the Seven Nations of  Canada.\n\nThis historic settlement provides long-term certainty and remedies in  terms of lands, land acquisition, payment of past property taxes,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}]