[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "Ms. PINGREE. Mr. Speaker, I rise today because of something deeply  troubling that is happening to one of the most treasured cultural  institutions in our country, the John F. Kennedy Center for the  Performing Arts. Yes, it is the John F. Kennedy Center.\n\nOver the weekend, the President announced…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Addresses, you have a Republican partner and Democrat--we would  go as couples, basically.\n\nMr. BOOKER. It was something about this man where the dignity that he  had that we all treasured, in a moment like that, he began to elevate.\n\nI had my partner Senator here say to me when I got here: You are not  a full Senator until you get ripped by John McCain's anger.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…this CRA succeeds, it won't just open the Boundary Waters to  pollution but would set a terrible and dangerous precedent for Congress  to roll back protections for any of our treasured public lands with  little oversight or notice, just because Republicans have decided they  would rather pillage them for profit.\n\nSome places are just worth protecting, and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…entire western  Massachusetts community for honoring the past and enriching the  present. Here's to another fifty years of education, inspiration, and  connection through this treasured historic landmark.", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…polluted air. That should alarm us all.\n\nThe Washington Post recently reported on what too many of us already  know: Air pollution and climate change are choking even the most  treasured corners of our country.\n\nWildfire smoke now blankets our parks each summer. Haze clouds once- clear views. The places we go to breathe deep and reconnect with nature  are…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693644/clean-air-and-healthy-parks-go-hand-in-hand"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…television program in Massachusetts, and quite possibly in all of New  England.\n\nFounded in 1961 by Leonard J. Collamore and first aired on WWLP-TV,  ASMW quickly became a treasured institution in western Massachusetts.  For 46 seasons, it provided a platform for students to showcase their  academic talents and brought communities together around a shared…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…the Trump administration's reckless cuts to our Forest  Service.\n\nThe workforce that takes care of our forests, harvests timber, and  makes them resilient to wildfires is treasured in my State of  Washington and, I would say, in the entire Western United States. Cuts  to this workforce endanger my constituents, endanger millions of  Americans, and put…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…to patrons across the capital  region and beyond.\n\nSince 1995, Maggie has directed more than 125 productions, workshops,  and readings, helping to cement the repertory as a treasured  cornerstone of both the city of Albany and the wider theater community.  The warmth of her personality would always shine through as she  enthusiastically welcomed audiences…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cheeseburgers  may be gone, the economic contributions and storied history of  McDonald's continues to strengthen Illinois and our Nation. I am  grateful Chicago is home to such a treasured American franchise that  reminds us of the promise of America.\n\nCongratulations to McDonald's on 70 years of leaving a lasting  impact.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…countless stories and fears we hear. There are hundreds and thousands  more reaching out to Members of Congress in fear for themselves, their  families, their loved ones, and treasured members of their community.\n\nAmerica does not live in fear. That isn't why our country was  founded. We have been a refuge for our entire history, and we need to  continue…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…birthday, we recognize  Paul David Lopez not just for the longevity of his years, but for the  richness of his legacy. He is a war hero, a public servant, a family  man, and a treasured friend to so many. It is an honor to celebrate his  century of life, sacrifice, and service.\n\nHappy 100th birthday to Paul. I thank him for everything he has  given--to his…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…hard to ignore  how hollow this gesture feels when it comes alongside the ongoing  Republican effort to undermine access to these very places.\n\nWhile we may be hearing how treasured our public lands are from my  colleagues today, some of their actions paint a different picture.\n\nRepublicans are slashing the already underfunded land management  agencies'…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…this blunt instrument, but all you will  be left with, Mr. Speaker, are smashed pieces, and you will forever  close the ability of these agencies to protect some of the most  treasured lands in our country, lands that belong to the citizens of  this country, to you, Mr. Speaker, your children, your grandchildren,  and the future generations.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to talk about a treasured  northwest Ohio tradition in Ohio's Ninth District, the Fulton County  Fair.\n\nIt is the second largest fair in the State of Ohio, which has 88  counties, surpassed only by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694992/fulton-county-fair"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…across this Nation, these parks provide an affordable  way to explore, learn, and build lifelong memories.\n\nJust as Oregonians are gearing up for a summer of enjoying our most  treasured places, Trump is driving out the public servants who protect  them. Kevin Heatley, Crater Lake National Park's superintendent, has  resigned.\n\nTrump cut off one-half of his…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691957/hands-off-crater-lake-national-park"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Federal Government.\n\nThis meaningful legislation will ensure that the men and women who  risk their lives to protect our communities can enjoy free access to  our Nation's most treasured public lands.\n\nLaw enforcement officers and firefighters also play a critical role  in protecting our public lands by responding to wildland fires,  conducting search and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…stretches some 220 miles west into eastern Oklahoma  through my good friend, Mr. Westerman's district.\n\nIt encompasses nearly 10,000 acres of rugged terrain, and the most  treasured views in the Ouachita region are in Flatside Wilderness. For  those visitors that Congressman Westerman referenced, the area also  includes the challenging and very popular…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…commitment to public service,  transparency, and civic engagement. They now join cable and satellite  providers like Comcast, Charter, Cox, DirecTV, and Dish in supporting a  treasured service that strengthens accountability and confidence in our  democratic systems.\n\nThis is a big win for the American people. Full access will help  inform the public, no…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697293/c-span-goes-streaming"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…away  the key.\n\nIn keeping with that, I strongly urge my colleagues to vote ``yes''  on this important joint resolution, which will restore off-highway  vehicle access to treasured public lands. I again thank Congresswoman  Maloy for her excellent work and leadership on this effort.\n\nMr. Speaker, I will point out that the idea that passing this  Congressional…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Ocean City.\n\nThe iconic Flagler Beach Pier quickly became a gathering place for  residents and visitors alike, and the existing A-frame carrying the  city's name remains a treasured piece of that early history. My office  will continue working with FEMA and our State, county, and local  partners to assist with the pier's restoration, ensuring this landmark…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Coudersport's historical downtown and charming shops make it a small- town community that has it all. Thank you to the PA Route 6 Alliance  for its efforts to preserve and promote our treasured communities like  Coudersport.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695113/coudersport-2025-heritage-community-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…teachers and collaborating with  his colleagues.\n\nMr. Albano is known by others for being a Union Hill legend, a  builder of traditions, and a cultivator of character. He is treasured  by his school and community for his reliability, kindness, positivity,  and generosity.\n\nI am confident the impact of his contribution will be felt for  generations to come.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…learn from  the past. For many years, Andrea has been a champion of historic  preservation, tirelessly advocating for the restoration and  conservation of our town's most treasured landmarks. She has played a  crucial role in securing grants and funding for preservation projects,  working closely with local government and historical societies to  ensure…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…formation in 1876, S.W. Johnson has been 100 percent  volunteer, embodying selflessness, courage, and a commitment to  protecting our neighbors.\n\nOne of the department's most treasured pieces of history is its  steamer, a Button manufactured in 1896 by the company that would become  American LaFrance. This remarkable piece of equipment reflects the rich…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}]