[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…addition, GAO's authorizing statute and the D.C. Home Rule Act  require GAO to engage in specific types of oversight of D.C.\n\nD.C. is not a federal agency, and it should never be treated as such.  D.C. already has a locally appointed auditor and inspector general, so  GAO's authority over D.C. is both redundant and offensive. GAO does not  have general authority…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696213/introduction-of-the-government-accountability-office-district-of-columbia-home-rule-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…businesses buy buildings, buy property, expand  operations, and employ Main Street neighbors throughout our community.\n\nUnder the current law, not all small businesses are treated the same.  Owners of so-called small purpose properties are required to put up  significantly more cash up front, often 5 to 10 percent more than  standard property owners.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…you wouldn't know it because she  was so humble. She was a generous friend, a good neighbor, and a mentor  to me and to so many others. She saw the dignity in all people and  treated everyone with respect. She led with humility, humor, and  compassion.\n\nHer Catholic faith informed her work and she kept the beautiful  prayer of St.  Francis of Assisi tucked…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692786/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…slide into this authoritarian state, then we  have failed our oath to the Constitution.\n\nIt is absolutely wrong that any U.S. Senator, for attempting to ask a  question, be treated in this fashion.\n\nI double down on the call of Leader Schumer. This merits a full  bipartisan investigation--bipartisan because all of us are Members of  the legislative branch.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for the work that  they do on behalf of the American people each and every day. It is our  promise to all of them that we will continue to work hard to make sure  they are treated with the dignity and respect that they deserve in a  year in which the Trump administration has gone after hardworking  Federal employees relentlessly, including firing more…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, Pope Francis led by example. He showed  compassion and empathy to all. He reminded us of our shared humanity,  and he treated everyone with dignity and respect. Pope Francis  understood what it meant to care for one another.\n\nMany of my Republican colleagues often talk about their Christian  values.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690602/pope-francis-led-by-example"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…so  many immigrant families who have their loved ones missing and who are  hurt. These conditions at the ICE facilities are inhumane and  unsanitary.\n\nImmigrants are being treated without basic dignity and being denied  medical care. I am calling for a full and transparent investigation  into Marie's death, and I will be visiting the Broward Transitional…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690462/immigrants-are-being-treated-without-basic-dignity-and-being-denied-medical-care"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…bonanza provision in the most recent  Republican spending bill.\n\nThey put that in there because their phone records had been  subpoenaed lawfully by a grand jury. They were treated like every other  American citizen because their names came up as potentially being  involved in that conspiracy to somehow shut down proceedings in the  House and the Senate.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…their daughter and lay her to rest peacefully.\n\nHer parents are by her bedside. Her 5-year-old asked: When will Mommy  wake up?\n\nAdriana should be here today, her blood clots treated, her voice  trusted, and her pain believed. She should be decorating a nursery for  her little son with her family and celebrating her son's last day of  kindergarten, but…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…especially those without financial or legal resources, will  pay the highest price.\n\nThe measure of our commitment to public education is how the students  who need us the most are treated, and today, those students are  watching.\n\nI urge my colleagues to reject the efforts to weaken IDEA or  dismantle the Department of Education. Congress has a legal obligation,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Health Program reintroduction, 2 months after Elon Musk killed this  program when he tanked the bipartisan funding bill in December.\n\nMr. President, 9/11 families deserve to be treated with dignity, with  respect, not with the contempt we see from DOGE. And no good business  operator would take this slash-and-burn approach DOGE is taking.\n\nPeople's Social…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Brian L. Schwalb,                     Attorney General for the District of Columbia.\n\nMs. NORTON. Mr. Speaker, D.C. residents are treated as second-class  citizens by Congress. They are required to pay Federal taxes, serve on  Federal juries, and register with Selective Service in the same manner  as residents…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…by  eliminating policies which place law enforcement personnel of the  District of Columbia at risk and discourage them from serving, ensuring  that such personnel will be treated equitably and fairly and the  recruitment and retention of such personnel shall be increased.'' We  are not surprised that the version of H.R. 2096 on the floor today does…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, the American people have been treated  to an extraordinary spectacle. It is the spectacle of a President of  the United States trying to stonewall and stall the disclosure of a  file from the U.S. Department of…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to El  Salvador last week. I know that she traveled at her own expense. I am  very proud that we have members of this caucus who care so deeply about  people who have been treated so unjustly. Nobody should be disappeared  out of our country without habeas corpus hearings.\n\nI also thank Representative Carter for his efforts, along with, I  believe,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…component of the covered device.       SEC. 3. ENFORCEMENT BY THE FEDERAL TRADE COMMISSION.\n\n(a) Unfair or Deceptive Acts or Practices.--A violation of       section 2 shall be treated as a violation of a rule defining       an unfair or deceptive act or practice prescribed under       section 18(a)(1)(B) of the Federal Trade Commission Act (15       U.S.C.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the line of duty.\n\nI am proud to champion the Leo K9 Protection Act alongside the  dedicated team at K9s United, whose tireless advocacy ensures that our  service animals are treated not just as tools but as heroes.\n\nUnder my legislation, the Federal penalty will be up to 15 years when  someone uses a deadly weapon to harm a Federal police animal. In…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "French Hill", "party": "Republican", "sentence": "…States, and making the  U.S. a fintech leader in payments and digital assets.\n\nConsumers are protected. The rules are straightforward. All issuers  of a payment stablecoin are treated the same, with high standards and  high regulatory oversight. I want to make sure that those at home  following on C-SPAN get the record straight.\n\nMr. HILL of Arkansas. Mr.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recommendations on how to improve enforcement and industry       compliance.       SEC. 7. ENFORCEMENT.\n\n(a) Unfair or Deceptive Act or Practice.--A violation of       this Act shall be treated as a violation of a rule defining       an unfair or deceptive act or practice under section       18(a)(1)(B) of the Federal Trade Commission Act (15 U.S.C.       57a(a)(1)(B)).…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…commercial  clean vehicles credit in the One Big Beautiful Bill Act.\n\nIs it your understanding and intent, Chairman Smith, for the purposes  of this provision, vehicles shall be treated as ``acquired'' as of the  date on which a written binding contract is entered into for their  acquisition and a payment has been made?\n\nMr. LaHOOD. Mr. Speaker, I associate…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693196/one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Enforcement by the commission.--\n\n(A) Unfair or deceptive acts or practices.--A violation of       this section or a regulation promulgated under this section       shall be treated as a violation of a rule defining an unfair       or deceptive act or practice under section 18(a)(1)(B) of the       Federal Trade Commission Act (15 U.S.C. 57a(a)(1)(B)).…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are going to give people this option, so employers can  put it in there.\n\nIf you are self-employed, you can get the same tax break. It is all  equal tax treatment. Nobody is treated differently. We would have a  product over here that would allow for true catastrophic insurance,  right--not regulated, not all sorts of complications, not telling you  what…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…within the purview of the National Taxpayer  Advocate to hire attorneys that report specifically to her. These  attorneys help conduct oversight, ensure taxpayers are being treated  fairly, and inform Congress of taxpayer challenges at the IRS.\n\nThis measure ensures we keep politics out of the IRS and solely focus  on outcomes for the taxpayer.\n\nWith…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…Higher education institutions and universities have a responsibility  to empower all their students, all of them, to succeed, including  pregnant students. They deserve to be treated with respect and  surrounded with care and love. That is what this piece of legislation  is designed to do.\n\nI have visited pregnancy resource centers in Iowa and met with…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…saw--gets handled this way, gets  thrown to the ground and handcuffed, what is happening to those who  have no such title or voice? If this gentle and decent and caring man  is treated this way, what is happening along the margins in the dark  spaces in the places we cannot see?\n\nSo I call on my Republican friends and colleagues to look hard at  this moment…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…were invited to share with then President Biden when he       arrived in Israel on October 17. Both father and son firmly       requested the release of barbarically treated 251 hostages,       including American citizens. Captives' redemption is a top       Jewish commandment and an honored Israeli tradition. Saving       the remaining hostages…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…safety standard.\n\n(d) Treatment of Standard.--A standard promulgated under       this section, including a revision of such standard adopted       by the Commission, shall be treated as a consumer product       safety rule promulgated under section 9 of the Consumer       Product Safety Act (15 U.S.C. 2058).\n\n(e) Report to Congress.--\n\n(1) In general.--Not…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690261/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…protect themselves, and save the public's lives.\n\nYet standing in their way is outdated Federal law. Under current  statute, less-than-lethal devices like tasers are still treated like  firearms. That classification no longer reflects modern technology,  modern training, or modern policing. It creates unnecessary barriers  for law enforcement agencies…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Commission.--\n\n(1) Unfair or deceptive acts or practices.--A failure to       reasonably comply with the notice and takedown obligations       under subsection (a) shall be treated as a violation of a       rule defining an unfair or a deceptive act or practice under       section 18(a)(1)(B) of the Federal Trade Commission Act (15       U.S.C. 57a(a)(1)(B)).…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…Army and Navy during World War II, the ``Hidden Figures''  of NASA who helped launch John Glenn into space, or the Black Angels  from my district, Staten Island, New York, who treated sick  tuberculosis patients when no one wanted to and helped find the cure  for this disease, American women have been instrumental in shaping our  Nation's progress and success.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}]