[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "…has hosted numerous congressional outreach meetings to bring  together staffers and federal agency representatives, to keep our  government engaged at the local level with trends in immigration cases.  Throughout the course of his career, David consistently ensured Granite  Staters received the support  they deserved and was able to help with any inquiries…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…warehouses are disproportionately  exposed to high concentrations of this pollution.\n\nNow, the California standard aims to address this pollution and  reverse course on these deadly trends. This is based on California's  unique circumstances. They have an air pollution problem that is a lot  worse than many of the other States.\n\nDespite Republicans' false claims,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Stabilization Act is a  declaration of our own common values.\n\nThis bill says that our commitment to this Nation's victims is not  just a line in a budget subject to prosecutorial trends.\n\nI would like to say when my family and I spent the 2\\1/2\\ years in  court that we did in Jacksonville, Florida, when my son was murdered in  November of 2012, the Crime Victims…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…Technology Act. The bill directs the Consumer Product  Safety Commission to launch a pilot program exploring the use of  artificial intelligence so that we can track injury trends, identify  hazards, monitor recalls, and identify products not meeting importation  requirements.\n\nThe reality is that the crooks are already using AI. The cops on the  beat…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and Prevention Fund with Delegate Marcia Price from  Newport News when I was in the State senate. This program and fund  would provide a pathway to research demographics and trends and  implement evidence-based solutions to address the root causes of gun  violence.\n\nThat is because gun violence in Richmond, Virginia, is different from  gun violence in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…are countering the impact of these programs.  As a result, the government has over 40 percent fewer small businesses  in its ecosystem than it did just a decade ago.\n\nThese trends mean that fewer small businesses are getting larger  contracts and that contracts are becoming out of reach for many small  businesses, especially those that are not already…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the last 20 years by  more than $200 billion. In that same two-decade period, our domestic  manufacturing base has shed more than 4 million jobs.\n\nIt is time to reverse these trends by revitalizing our Nation's  manufacturing industry and bringing jobs back home. The work we did  under the Biden administration, passing the bipartisan infrastructure  law,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…seeks to bolster the VA's data collection.  Currently, the VA does not collect cause-of-death data on veterans.  This is problematic, and it creates a challenge when assessing trends  in veteran deaths.\n\nThe collection of cause-of-death data would allow the VA to begin to  build datasets that can be tracked and assessed, a promising thing in  this era of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…information is used to ensure that these crucial  ecosystems stay healthy and productive.\n\nOther researchers across the region rely on data collected over  decades to analyze trends in the Great Lakes and help keep them  healthy. Reauthorizing this program now will allow the Great Lakes  Science Center to continue its research and provide datasets that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…board to have  to declare whether we own the policies of the President, this Trump  madness, or whether we disown it and urge him to take a different path.\n\nAll the economic trends are pointing in the same direction. We should  take a different path on the economy before this gets worse. The vote  we will have later today gives the Senate, the greatest…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…statements and the number of pages of  those analyses. The Council on Environmental Quality will then report  annually on average lengths of time, page counts, and any directional  trends.\n\nI appreciate the majority working with us to also include  requirements for disaggregating reporting to show page limits and  timelines pre- and post-passage of the Fiscal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697710/studying-nepas-impact-on-projects-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…In Connecticut, we have already seen what the numbers mean in terms  of this bill. The Kaiser Family Foundation is not a partisan group.  They have been studying healthcare trends and finance for decades. They  determined that 140,000 citizens in the State of Connecticut will lose  their health coverage as a result of this bill.\n\nAs the dust has settled,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…sand. We stay in bed all day. We have an extra drink. We don't go to  work. We don't play golf like we used to. We don't stay with our  friends like we used to. Those are the trends.\n\nStaying on the sofa all day is not the answer. Although you think for  the moment it makes you feel better, Mr. Speaker. You have to get up,  you have to get out, and you…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…training,       toolkits and resources; administering grants; and providing       technical assistance informed by specialized expertise and       data, SAMHSA is able to identify trends, implement       efficiencies informed by current needs, and support states in       providing community-based services for mental health       conditions and substance use…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…on officers, injuries that they suffer, their mental health  challenges, and wellness program effectiveness. Without accurate data,  we are fighting blind.\n\nBy identifying trends, such as the frequency of attacks on officers  or gaps in mental health support, we can implement targeted solutions  to keep our officers safe and to keep them healthy.\n\nMany…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…foreign direct       investment in the United States, with particular focus on       manufacturing, services, trade (with an emphasis on digital       trade), and U.S. jobs.\n\n(2) Trends in global cross-border investment and data flows       and the underlying factors for such trends.\n\n(3) Federal Government policies that facilitate foreign       direct investment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…impact       statements;\n\n``(C) the number of such environmental impact statements,       disaggregated by lead agency and subagency as applicable;\n\n``(D) a description of trends in average and median page       count of such environmental impact statements and any       citations and appendices included in such environmental       impact statements…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…willing and able to  fill these important economic roles. In Maine, for example,  municipalities have struggled to find accountants to conduct their  annual audits.\n\nRecent trends suggest this shortage will continue. According to the  Bureau of Labor Statistics, about 124,000 job openings for accountants  and auditors are projected each year, on average,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…separately for each type of covered       misconduct offense, and shall not aggregate the information       and data for multiple types of covered misconduct offenses.\n\n``(3) Trends.--Subject to subsection (f), beginning on the       date of enactment of the Coast Guard Authorization Act of       2025, each report required under paragraph (1) shall include…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…components of our markets. A proactive and effective use of  the authorities in CLARITY to encourage liquidity and market health  will help to ensure adaptability to future trends and restore U.S.  leadership in global digital asset markets.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694155/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…members meet their  needs.\n\nThe report would also require the VA to publish the total number of  prevalent causes and manners of death among these veterans to better  identify trends.\n\nMr. Speaker, I thank my colleagues for their work to ensure that the  VA continues to develop the tools it needs to effectively deliver  benefits. I urge all of my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country are not  getting the education that they deserve. As chair of the Early  Childhood, Elementary, and Secondary Education Subcommittee, I am  committed to reversing these trends.\n\nThe good news is that I am sponsoring the Educational Choice for  Children Act. The basic concept of that bill is to enable school choice  for millions of kids across the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hold  the position in the Blue Band's 126-year history.\n\nEllie hails from Hollidaysburg, Pennsylvania, and is pursuing a  degree in marketing with a minor in digital media trends and analytics.  She brings years of experience within the Blue Band, most recently as a  leader of the piccolos. The Blue Band's drum major leads the band  through warm-ups…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…startup       entities in which qualifying venture capital funds invest,       specifically including, with respect to such businesses and       startup entities, changes or trends relating to--          (A) the geographic distribution of capital to portfolio       companies;          (B) the socio-economic characteristics of founders or       controlling…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…formation;\n\n(4) analyze the impact of these costs on the availability       of public securities of small- and medium-sized companies to       retail investors; and\n\n(5) analyze trends in IPOs over a time period the       Comptroller General determines is appropriate to analyze IPO       pricing practices, considering--\n\n(A) the number of IPOs;\n\n(B) how costs…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…killing of a 21-year-old  Capitol Hill intern. That was an incredible tragedy. Of course, any  homicide is an incredible tragedy, but that one really was.\n\nDespite these alarming trends, the radical D.C. Council has chosen to  undermine the very department responsible for protecting the city. Its  antipolice law strips the Metropolitan Police Department officers…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…from financial fraud and abuse.\n\nH.R. 1469 creates the senior investor task force within the  Securities and Exchange Commission which is tasked with reporting on  industry trends and challenges impacting investors over the age of 65.  The task force will also make recommendations for changes to existing  legislation and regulations to address the unique…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…coordinated relief supplies  inventory at our Family Resource Center (FRC) daily for 2 weeks, she  was a lead volunteer when it came to identifying unmet needs and  residential trends as individuals impacted began to open up regarding  their level of destruction. She prepped supply bags, organized  inventory, communicated with other volunteers, and showed…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…related       to deaths and injuries from traffic crashes involving       vehicles transporting mail.\n\n(2) Contents.--The report shall include aggregated       statistics, trends, and analysis to enhance transparency and       accountability.\n\n(3) Privacy.--Information in the report shall be made       available to the public in a manner that does not…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…satellite broadband capabilities  that improve precision agriculture. Earth-imaging satellites also  provide important information which helps farmers and ranchers identify  visual trends that may require immediate attention.\n\nIn order to ensure our regulations maximize these opportunities, our  bill would require the FCC to look at its current satellite rules…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}]