[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…to  continue their studies.\n\nI have also received heartbreaking updates from patients, like a mom  in my State fighting colon cancer who had her shot at a critical  clinical trial taken away by Trump's chaotic, illegal funding cuts. And  now, R.F.K., Jr., has cut off all Federal funding for mRNA research,  one of the most promising new technologies for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…gospel  recording Zion Is Calling, and hosting the podcast Plug In With  Bishop--platforms through which he taught, encouraged, and lifted up  his community during seasons of trial and renewal.\n\nIn 2009, following the tragic loss of his sister, Bishop Williams  convened leaders at Albany State University and asked, ``What can we  do?'' Out of that conversation…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…strictures to create coalition       districts, the basis for such decisions--as you say--``no       longer exists.'' However, my office has just completed a       four-week trial against various plaintiff groups concerning       the constitutionality of Texas's congressional districts, as       well as its State House and State Senate maps. The evidence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…exists and whether government can  operate on the basis of mutually agreed facts, such as who won an  election.\n\nGregory Mize--a Georgetown University law professor and retired trial  judge--offers a compelling perspective: we can use jury trials as  models for attaining higher levels of truthfulness and reliable  outcomes in government. After all, our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Members of the judiciary, threatening Members of the House  of Representatives, and threatening Members of the Senate.\n\nDonald John Trump, by his conduct, merits impeachment, trial, and  conviction in the Senate of the United States of America and should  never hold any office of public trust ever again.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697871/and-still-i-rise"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…clinical trials that you need to remember, Mr.  Speaker, it is not like an off switch. You don't just flick it on and  off and it comes right back. If you shut down a clinical trial, Mr.  Speaker, you might have to start that all the way from scratch. In some  instances, the research and the projects that have been going forward  under that have taken…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…democracy.\n\nPresident Trump has defied a unanimous Supreme Court order blocking  the return of Kilmar Abrego Garcia and, instead, vanishing him to a  prison in El Salvador without a trial, without a hearing, and without a  shred of justice.\n\nThis isn't just cruelty, but it is lawlessness. It is a direct  assault on our values and the rule of law. He was abducted…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…of Law, earning his Juris Doctor degree in 2012. During  his time in law school, he was awarded the Best Paper Award in the  Constitutional Law Seminar, the John B. Fareese Trial Advocacy  Scholarship, and the prestigious R. Jess Brown Award. He also held  leadership roles as Vice President of the Black Law Students  Association, Editor of The African…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in D.C. and replace it with a wealth       based system that fuels mass incarceration, racial       disparities, and benefits the 2 billion dollar bail industry.\n\nD.C.'s pre-trial system is grounded in individual       assessment, not based on wealth. The federal Pretrial       Services Agency for the District of Columbia evaluates each       person's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…commence discipline against police officers.\n\nThird, H.R. 2096 would repeal a provision that gave the police chief  the authority to increase the discipline proposed by a police trial  board, which consists of police officers. Before the 2023 D.C. law, the  police chief could only impose or reduce the proposed discipline or  order a new trial. The D.C. law…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…judicial nominee to  come before this body in my 15 years here. And I say that with sadness  as well as anger, as someone who still proudly would call myself a  litigator, a trial lawyer, and a member of the Judiciary Committee,  where I am proud to serve with my great colleague, the ranking member  now, Senator Durbin.\n\nAnd he and others from that committee…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…asserting our power. You are not going to be  able to just put a 40-percent tariff on Brazil, a country with which we  have a trade surplus, simply because the guy is facing a trial there,  and the President doesn't like it. No, this is not how this works. It  is not how it works under the Constitution. It is not how it works  under the law.\n\nThis resolution…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…We of this Congress and  this administration will be remembered in spite of ourselves. No  personal significance or insignificance can spare one or another of us.  The fiery trial through which we pass, will light us down, in honor or  dishonor, to the latest generation.\n\n``We say we are for the Union. The world will not forget that we say  this. We…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…stop the thievery  and the illegality. Lawyers are compelled by their oath to stand up for  the Constitution.\n\nPutin arrested Navalny's lawyers right on the eve of Navalny's trial.\n\nIn Venezuela, Maduro routinely harasses and detains lawyers--human  rights lawyers--because he knows those are the ones who will hold him  accountable.\n\nIn Tunisia, the regime…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…honors just three prosecutors across the  Commonwealth. Alexandra was selected from approximately 1,000  prosecutors who were qualified. She stood out because of her  outstanding trial accomplishments and contributions to the Virginia  Association of Commonwealth's Attorneys.\n\nShe played a pivotal role in establishing a regional behavioral  health docket…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699136/constituent-of-the-week-alexandra-vakos"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…that this legislation is even more  necessary now than ever.\n\nWhen you had a Colombian woman unlawfully residing in Boston who was  convicted 2 days ago, following a 5-day jury trial in Federal court, of  identity theft offenses, including receiving rental assistance, Social  Security, and SNAP benefits, as well as voter fraud under stolen  identity, voting…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…detained.'' The Democrats simply ignore it.\n\nThey have a right to challenge their detention through a writ of  habeas corpus. If they are charged with a crime, they have a right to a  trial by jury, but at no time do they have the right to be released  back into our communities. Under the law, they ``shall be detained.''\n\nUnless they are charged with a crime,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…determines that a reported offense is a       covered offense, the Chief Prosecutor of the Coast Guard may       also exercise authority over any offense that the special       trial counsel determines to be related to the covered offense       and any other offense alleged to have been committed by a       person alleged to have committed the covered offense.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President, I want to compliment Erika Kirk, wife of  the assassinated conservative leader Charlie Kirk. She has made the  emotional appeal to have cameras in the courtroom at the trial of her  husband's murderer. I commend her for this brave plea because it fits  in with a stand I have been taking for the last couple of decades.\n\nCourts at both the State…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…while attending       Tel Aviv University as a Fulbright scholar and encountering       the enormity of the Holocaust for the first time.\n\nReferring to the famous Adolf Eichmann trial of the       notorious SS officer in Jerusalem, with profound impact on an       entire mesmerized nation. I vividly recall as a teenager       living then in Israel and myself…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "James Risch", "party": "Republican", "sentence": "…threats  in our own backyard.\n\nPresident George H. W. Bush authorized limited military operations to  arrest Panama's Manuel Noriega and bring him to the United States to  stand trial for drug-related charges, just as President Trump has done  with Maduro. In that case, President Bush deployed more than 9,000  troops, and they fought for 2 weeks on the ground…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…two men outside Chicago  who submitted nearly $300 million in fraudulent claims to Medicare and  Medicaid as well as to private insurers.\n\nThen, this week, in Mississippi, a trial started for a man who faces  charges from the Justice Department for allegedly participating in a  scheme to steal $77 million in Federal aid intended for needy families.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Progressive, activist judges are currently allowed to release  criminals to D.C.'s streets with only a promise that they will not  reoffend and will return to court for their trial date.\n\nThe District of Columbia Cash Bail Reform Act would take away a  judge's ability to release these violent criminals. It would require  judges to hold anyone charged…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…gentleman for  yielding to me.\n\nMr. Speaker, America is safer today. A narcoterrorist and an  illegitimate government leader, Nicolas Maduro, is removed from office  and is awaiting trial in the United States of America.\n\nOne of the clearest responsibilities of the President is ensuring  that those who endanger American lives are brought to face justice. He…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and  extradition to the United States. He was indicted twice in Federal  court and should stand trial in the United States.\n\nWith Maduro rightfully captured, the circumstances have now changed.  While I support the operation to seize Nicolas Maduro, which was  extraordinary…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…allowing judges to decide when someone truly  needs to appear in person.\n\nSecond, the bill helps the court address its growing case backlog. It  does this by allowing special trial judges, who are experienced legal  professionals who already handle much of the court's work, to take on  additional responsibilities with the consent of the taxpayer. If the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…brother-in-law, this endowed program will  help prepare Hendrix students for a legal career.\n\nAs a former president of the Arkansas Bar Association and member of  the  American College of Trial Lawyers, John Gill has left an indelible mark  on our State's legal landscape over his six-decade career.\n\nFrom serving as a delegate to the 1969 Arkansas Constitutional  Convention…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…course, you should  continue to wear a seat belt as well.\n\nThere was an article in The New York Times a couple of days ago from  a doctor who actually likened this to a clinical trial, where you  actually have to stop the trial because the drug performed so well and  it becomes unethical to continue to give people the placebo and not  give them access to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…organizations. From his role  as a member of the State of Iowa's Youth Advisory Council and Lead  DSM's Youth Leadership Initiative, to his active engagement as an Eagle  Scout, mock trial participant, and church leader, Carrington's record  is defined by energy, humility, and resolve.\n\nI have had the pleasure of getting to know SirMichael and have been  continually…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691587/recognizing-sirmichael-carrington-williams-thomas-on-receiving-the-2025-billy-michal-student-leadership-award"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Commander in Chief.\n\nSimilarly, President George H.W. Bush authorized limited military  operations to arrest and bring Panama's Manuel Noriega to the United  States to stand trial for drug-related charges. Interestingly, that  lasted 2 weeks, and there were thousands of troops involved--not done  in a very short period of time with only a handful of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]