[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…any time yield.\n\nOf all the dispositions and habits which lead to political  prosperity, religion and morality are indispensable supports. In vain  would that man claim the tribute of patriotism who should labor to  subvert these great pillars of human happiness, these firmest props of  the duties of men and citizens. The mere politician, equally with…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, we gather on the floor of the House of  Representatives to pay tribute to two United States marines who died in  service to our Nation. Lance Corporal Albert A. Aguilera of Riverside  and Lance Corporal Marcelino M. Gamino of Fresno were both…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Brad participated in the arsenal of democracy flyover to  mark the 70th anniversary of victory in Europe. He flew a P-51C Mustang  ``Tuskegee Airmen'' over the Capitol in a tribute to our Nation's first  Black military pilots.\n\nHe once said about his father: ``His experience at Tuskegee was a  paramount experience for him in terms of directing his life…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…along Texas' Gulf Coast, this refuge is a vital  sanctuary for migratory waterfowl, endangered species, and countless  other wildlife. Now, it will also stand as a lasting tribute to  Jocelyn's spirit and the values she held dear.\n\nMr. Speaker, I urge my colleagues to join me in supporting S. 1596  and help preserve Jocelyn's legacy in a place that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693447/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today with profound sorrow but also  with deep gratitude to pay tribute to a man whose life was a testament  to faith, service, and love--Sheriff John Bowens of Terrell County,  Georgia. A funeral service to celebrate his remarkable and purposeful…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…1938.\n\nToday's bill would restore the use of the term ``battlefield'' in the  park's name to reflect the site's significance in the American  Revolution. This is a fitting tribute as we prepare for next year's  250th anniversary of the signing of the Declaration of Independence.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Senate stands ready with a bipartisan resolution-- led by Senator Kaine, myself, Senators Paul and Schiff--preventing the  unauthorized use of force.                          Tribute to German Vazquez\n\nMr. President, finally, let's say good-bye to German Vazquez--a very  special good-bye to one of the Senate's unsung heroes, German Vazquez,  who will retire…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…on Mother's Day\n\nMr. COSTA. Mr. Speaker, on Sunday, we will celebrate Mother's Day.  Throughout our country, families and friends will gather together to  recognize and pay tribute to this important day. I think for all of us  the reality is every day should be Mother's Day.\n\nOn Sunday, let us say thank you in the most meaningful way we know  how, and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…government  provides a burial benefit for veterans who meet certain criteria. This  benefit is a solemn national recognition of our veterans' service and a  dignified final tribute.\n\nVeterans who qualify for burial benefits have a choice about their  final resting place, including burial in a national cemetery. The  national cemetery in Hawaii is the…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…used those powers both to  control dissents and protests domestically, but he also used those  powers in order to compel other nations and actors inside the empire to  pay him tribute.\n\nPresident Trump has decided that he is going to use the powers that  we have given him to demand the same kind of tribute that Kings and  monarchs demanded.\n\nThe reason…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…history as the first  Spanish-language album nominated for the Grammy Award Album of the  Year. His recent album ``Debi Tirar Mas Fotos'' has inspired millions  as a powerful tribute to Puerto Rico and his hope for its freedom,  while reminding us of our shared struggle against imperialism,  colonialism, and displacement.\n\nIn addition to his music, Benito,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Skating Championships, he delivered a powerful  short program for 85.72 points, fourth place, and a spot on the U.S.  Olympic team. He then spoke with humility and love, paying tribute to  his beloved parents who shaped his life.\n\nPresident John F. Kennedy defined true grit as courage, grace under  pressure, perseverance in the face of adversity. Maxim personifies…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698839/uplifting-spirit-of-olympic-skater-maxim-naumov"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…his final flight  in the F-15C Eagle, marking both the end of his own flying career and  the conclusion of the F-15 mission at Barnes Air National Guard Base.  In a fitting tribute, he led a four-ship formation on a two-hour  mission over the Atlantic, a ``Lunar Flight'' named in honor of his  call sign, ``Moon.'' Upon his return, he was greeted by family,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to honor the Honorable Judge  Maryellen Hicks and to recognize the renaming ceremony held in her  name, a tribute to a trailblazing jurist whose legacy has profoundly  shaped Tarrant County and the State of Texas. This historic occasion,  led by the Black Women Lawyers Association, reflects…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Celebration of Young Leaders banquet.\n\nThe Asian Pacific Islander American Public Affairs Solano County's  10th Anniversary and Celebration of Young Leaders banquet is a  wonderful tribute to our community, and I am proud to represent the  organization and the young leaders being honored at this event.                                                     John…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Mr. Thomas L.  Pelissero for his heartfelt tribute to his hometown of Bessemer,  Michigan in his new book: Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown Spirit. His memoir serves as a salute to the  town of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699253/recognizing-mr-thomas-l-pelissero-for-authoring-bring-one-home"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the Avon  High School girls volleyball team have represented their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Bellevue High School girls' basketball team have represented…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Ariannah Floyd, a senior at  Firelands High School, has represented her school ably on her…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693403/special-recognition-of-ariannah-floyd-for-winning-the-division-ii-state-track-and-field-title-for-the-300-meter-hurdles"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Hunter Spangler, a junior at  Liberty Center High School, has represented his school ably…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693384/special-recognition-of-hunter-spangler-for-winning-the-division-iii-state-track-and-field-title-for-shot-put"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…heroism and selflessness  of those who have received our country's highest military award for  valor, the Medal of Honor.\n\nNational Medal of Honor Day is an opportunity to pay tribute not only  to their acts of courage but also to the profound sacrifices made in  the defense of our freedoms.\n\nOver 150 years ago, on March 25, 1863, the very first Medals…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…the world.\n\nThe United States must always stand with Israel and the Jewish  people, and today we join together to remember the innocent lives taken  in an act of hate and pay tribute to their lives and the contributions  of the Jewish people to our Nation.\n\nMadam President, the fight against anti-Semitism is a bipartisan one.  I am grateful for my colleague…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Oakwood, and Judith Wieging of Willshire.  The family has grown to include grandchildren and great-grandchildren.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to the life and service of Orval Mullen. On behalf of the Fifth  Congressional District of Ohio, it is my honor to recognize his  contributions to our Nation, community,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…pride of our Nation, American citizens rose to the challenge  with grit and determination. With millions of men overseas, American  women--popularly known as ``Rosies'' in tribute to Rosie the Riveter-- stepped into roles traditionally held by men. These women answered the  call to service by holding down the home front, working as pilots,  engineers,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697728/world-war-ii-womens-memorial-location-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Owen Scott, a senior at Van  Wert High School, has represented his school ably on his way…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693332/special-recognition-of-owen-scott-for-winning-the-division-ii-state-track-and-field-title-for-the-1600-meter-run"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Rania Brown, a senior at Avon  High School, has represented her school ably on her way to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693391/special-recognition-of-rania-brown-for-winning-the-division-i-state-track-and-field-title-for-the-discus-throw"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Elementary School being named a National Blue Ribbon  School.\n\nFrom the American Revolution to our time, Strong has always been a  town of patriots, with a veterans memorial paying tribute to those who  defend freedom. Among the most illustrious veterans is Lt. James  Porter. After graduating from West Point in 1869, he served with the  7th Cavalry in the Reconstruction…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Mr. Thomas  Pelissero for his heartfelt tribute to his hometown of Bessemer,  Michigan, in his book: ``Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown Spirit.''\n\nThis book is not only a salute to Bessemer,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Florida, and to honor the brave men  and women who made the ultimate sacrifice in the line of duty.\n\nClay County Police Memorial Day is more than a ceremony--it is a  solemn tribute, a reminder of their courage, and a commitment to never  forget their service.\n\nThese officers answered the call to protect and serve, putting their  lives on the line every…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Charlotte is still  able to see this bill being offered in honor of her husband.\n\nLeonard G. ``Bud'' Lomell served as a great example of the Greatest  Generation. It is a fitting tribute to name the VA clinic after him to  tell the story of his service.\n\nI thank the sponsor of this bill, Representative Smith, as well as  the entire New Jersey delegation for…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}]