[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…stations across the country, including over 50 in  Colorado. Colorado outlets stand to lose over $7.6 million in funding-- with a disproportionate effect for rural and Tribal communities across  the State. News organizations like Colorado Public Radio, Rocky  Mountains PBS, and smaller stations like KRZA in Alamosa and KVNF in  Paonia are at risk. Not…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…water-related  economy depend upon a strong partnership with the Federal Government  and a level playing field among its upstream users and downstream  neighbors, including local Tribal communities.\n\nDuring the consideration of this bill in the committee, my Democratic  colleagues offered several amendments to fix the loopholes, liability  shields, and limited oversight…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Twin Cities by  rejecting cuts to Community Development Financial Institutions (CDFI)  Fund. The CDFI Fund promotes economic development in distressed urban,  rural, and tribal communities. CDFIs leverage capital from the CDFI  Fund to catalyze investment in the Twin Cities that grows our small  businesses, develops housing units, increases access to financial…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…importance of this issue.\n\nThis bill directs the Government Accountability Office to review the  technical assistance programs created to help underserved, rural, and  Tribal communities obtain critical investment for their water  infrastructure needs.\n\nIn March, the Subcommittee on Water Resources and Environment heard  testimony from witnesses across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695403/water-resources-technical-assistance-review-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…created 3.6 million acres of  areas of critical environmental concern.\n\nI will also mention here that the one voice we haven't heard from on  the House floor is from the Tribal communities impacted by both the  resource management plan and this particular resolution to reverse the  resource management plan. These lands promote community health, support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…we are showing up every day across our communities:  15 townhalls touching 15,000 New Mexicans across every county that we  represent in 12 towns and communities and Tribal communities across our  State.\n\nLet me say this: Our people are afraid. Everywhere we go, across the  aisle, we saw people who are afraid they are going to lose their Social  Security,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…support of my Energy  Transitions Initiative Authorization Act to expand resilient and  reliable energy for some of our nation's most vulnerable regions-- isolated and Tribal communities.\n\nIsolated and Tribal communities often share common energy obstacles,  such as limited energy infrastructure, high costs of imported energy  and vulnerability to natural…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…hadn't put in this work.\n\nI am pleased we were able to reach a bipartisan agreement to produce  a bill that protects Tribal lands and the environment, invests in our  Tribal communities, supports the arts, and rejects billions in extreme  cuts proposed by the administration.\n\nRather than handing the Trump administration a blank check through  another…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…sovereignty, addressing ongoing governance concerns and environmental  challenges.\n\nThis bill underscores the importance of righting historical wrongs  and supporting Tribal communities.\n\nMs. HOYLE of Oregon. Mr. Speaker, I urge my colleagues to support the  legislation, and I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…with Elon Musk, DOGE, and an unhinged President.\n\nWhat do we hear from our colleagues across the aisle? Nothing. We get  bills like this to rename the Gulf of Mexico.\n\nTribal communities are being hammered around the country. Food  insecurity programs are being defunded. Education programs are being  frozen. Healthcare resources are being slashed. All…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Last week, we met with the Secretary of Education and hand delivered  a letter calling on the administration to end these attacks on our  schools, on our communities, on Tribal communities, and our education  system.\n\nWe will continue to fight back because we cannot stand with a country  that is attacking our students.\n\nMr. Speaker, I say to our President:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689604/hands-off-our-education"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…rejected. They would have made sure that we  have full information and transparency on the disparate impacts and  cumulative impacts on minority, rural, disadvantaged, and Tribal  communities and would have added safeguards, safeguards that would have  been able to define what real reliable generation facilities are.\n\nAgain, they were not interested. Why?…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Public Broadcasting to exclude       amounts designated to support public radio or television       stations that are licensed to or primarily serve rural areas       or Tribal communities.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693638/hr-4"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Indian Country. While we don't always agree on everything, we have a  long history of bipartisan work and a shared commitment to advancing  legislation that benefits Tribal communities. H.R. 504 is one clear  example of this. It addresses longstanding challenges caused by past  Federal policies, and it is an opportunity--I would argue, an  obligation--to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…created because of our trust and treaty responsibilities, trying to  turn them into a voucher program and school choice. There are no  choices in many of our rural and Tribal communities. The choice is to  keep our Tribal schools open, which provide multicultural programs,  language, and other programs that are the root of these communities.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you hear almost protests from the left. Here is a $2.5 billion  fraud in Medicaid in Arizona, where they exploited Tribal members,  abused them, recruited them from our Tribal communities, put them in  sober living homes, and bled the system for money. It took years  because in a system that has the incentive where you are doing provider  taxes and more…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…builders by  dictating how they source materials, driving up the cost of  construction, and increasing the time to market.\n\nWe also cannot afford to forget about our Tribal communities. Montana  is home to 12 distinct Tribal Nations, and NAHASDA reauthorization and  modernization would be a game changer for them.\n\nNAHASDA is a lifeline for Indian Country,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…behavioral health facility.\n\nI urge my colleagues to support H.R. 3620 and help us take a small  but significant step forward in improving behavioral health outcomes  for our Tribal communities.\n\nMr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3176) to amend the John D. Dingell, Jr. Conservation,  Management, and Recreation Act…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…respect.\n\nThat is why, under Democratic leadership, we increased funding for  local and Federal law enforcement, including the very FBI that solves  crimes in our rural and Tribal communities.\n\nWe don't just say these things. We show up for law enforcement. We  stand with the Capitol Police who defended our democracy and our lives  on January 6. We honor their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Federal coal while providing  the Crow Tribe with a piece of the revenue. With bicameral support, I  am confident we will get this bill across the finish line for our  Tribal communities and our State economy. More importantly, this is  another step in ensuring American energy dominance.\n\nIn closing, let me make one thing abundantly clear: There is a…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}]