[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…mockery of that legacy.\n\nSince his defeat in the 2020 election, President Donald Trump and his  Republican allies have pushed the big lie of a stolen election. The  majority has tried to convince the American people of the lie that  noncitizens are a threat to our elections and are using that lie as an  excuse to pass a new law, such as the SAVE Act, which…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…providing $1 billion in single family  direct home loans, $120 million over the House level, and funding water  and wastewater programs at $446 million, both issues that Democrats  tried to address in full committee.\n\nThe bill provides $1.85 billion for the Agricultural Research Service  and $1.67 billion for NIFA, protecting farmers, small businesses, and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Mr. Stauber received one. The  chair of the committee received one. Everybody got a letter.\n\nThen Congress had 90 days to adopt a resolution of disapproval.  Republicans have tried to disapprove of the withdrawal, but they  weren't able to bring it to the floor. Congress didn't ask, and the  window of disapproval closed.\n\nNow they are trying to use the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…million when our country  is facing the debt it has, when you have got the needs for people in  nursing homes and the needs for people with childcare and the like.\n\nSo then they tried one more time. Senator Angus King, Independent of  Maine, said: OK. How about for people making over $500 million? Then,  at least, you can agree with us--right?--that we shouldn't…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…the country to get back on track.\n\nBut instead of having the means to pay for this essential support, we  had to incur additional debt. So fast forward now to 2023. Democrats  tried to right the ship by passing the Inflation Reduction Act, which  made a nearly $250 billion downpayment on our national debt while  improving energy security, lowering prescription…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…blocks accountability even when an officer violates  someone's constitutional rights or uses excessive force when none was  needed. I know this because, as an attorney, I have tried these exact  cases in court.\n\nMy bill changes that. The Qualified Immunity Accountability Act  lowers the standard for prosecution so Federal law enforcement officers  can…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…insurance policies while the kids start their careers, and  guaranteeing that every plan covers basic essential care.\n\nThe majority, since that time in the last 15 years, has tried to  destroy it. They have voted more than 70 times to repeal the Affordable  Care Act and always with no replacement. They subjected the ACA to  death by a thousand cuts, offering…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…down to its bare bones.\n\nI would like the member of the Committee on Education and Workforce  to help me walk through it.\n\nAm I right about this, that the administration has tried to illegally  move the IDEA office and funding from the Department of Education to  the Department of Health and Human Services?\n\nI yield to the gentlewoman for a colloquy.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…are already paying. Over 4.5 million  Americans will lose their care, including many in New Jersey. That is a  catastrophe that we see coming. We knew it was coming, and we tried to  take action to be able to address that. What happened? Kicking the can  down the road. When does open enrollment start when it comes to  healthcare? It starts in November.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…percent equity stake in  Lithium America, a 10 percent equity stake in Trilogy Metals, and a  ``golden share'' in U.S. Steel Corporation? What is that?\n\nNow, the Republicans have tried to confuse you on what socialism is  and even called it communism-lite. That is an absolute distraction from  what we are discussing here today.\n\nCommunism is communism. Socialism…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…victory for Abu Dhabi and the Spy Sheikh, who had been  unsuccessfully trying for years to get their hands on those chips.\n\nInside our own government, national security officials tried hard to  stop this deal. They warned that handing advanced AI chips to the UAE  would have serious national security consequences. Look, some of these  chips would go to G42,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…not even being  prescriptive. We just say, ``We want to see universal coverage.'' We  want everybody to have health insurance. Not only do they not agree  with that, they have tried to repeal or weaken the Affordable Care Act  50 times in the past decade--50 times they have gone after the  Affordable Care Act, and they have failed.\n\nOne time, thanks to…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…to continue back to Elon Musk. Whatever side is  taken in this debate, we cannot forget that Elon Musk, again,  repeatedly violated the law. He made illegal spending cuts. He tried to  eliminate agencies created by Congress. This was not jaywalking. We are  talking about serious crimes against the Constitution of the United  States.\n\nHis actions were…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Ukraine gave up its nuclear weapons on the assurance that the free  world would come to its aid if its security was ever threatened.\n\nIt is that history that Volodymyr Zelenskyy tried to remind President  Trump and Vice President Vance about last Friday--betrayal of  agreements by Vladimir Putin. He is a thug. He understands force. He  will assure the security…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…their billionaire buddies, because all the money  is just going to be shuffled off to billionaires.\n\nSo this is without question just a continuation of their efforts.  They tried to stop Medicare. They tried to stop Social Security. They  tried and they failed to kill the Affordable Care Act. Now they are  trying to eliminate the tax credits that help…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…for independence.\n\nThe Battles of Saratoga were the most significant turning points and  one of the most decisive American battles of the Revolution. British  General Burgoyne tried to seize control of the strategically important  Hudson River Valley, but his campaign ended in defeat at the Battles of  Saratoga, where he surrendered to General Horatio…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…talking about the illegal immigrants in light of the  CBO score that 1.4 million illegal immigrants are, indeed, on the rolls  of State healthcare systems.\n\nNow, our colleague tried to take us down a rabbit hole, and she ended  up twisting herself in knots to find the terminology to aid her in the  talking points. The latest argument, apparently, to hide…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…War II, the Nazi regime. One of the  centerpieces of the Nazi regime was to kill the Jewish people. They put  the Jewish people in concentration camps, gas chambers, and they tried  to extinguish an entire race of people--our Jewish brothers and  sisters--killing 6 million.\n\nJust a few years ago, the Jewish people got back to the numbers  before the war.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…with the word ``hole.'' I did. I swallowed it. I took it. I just said:  That is the legislative process. I took it full in the face, went home,  had a beer, petted my dog, tried to get over it, and lived to fight  another day. It was stupid, but they did it. But we live to fight  another day.\n\nNow, when moms and dads lie down to sleep at night and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Schatz and I to speak for up to  10 minutes of time, equally divided.\n\nMr. LANKFORD. Mr. President, the Senate is stuck. We have had an  enormous number of nominations that have tried to be able to work  through this body. Quite frankly, it is the same number that we have  every time when it is the first term for a new President to be able to  work its way…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…worked tirelessly to negotiate a multi-bill package  that  is part of this bill to reopen the government. We never should have  been here, Mr. Speaker. Over a month ago, we tried, as Republicans, to  prevent a government shutdown. We had a vote here on the House floor.  Mr. Speaker, 99 percent of Republicans voted to keep the government  open, and 99…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…after 15 years.\n\nJack started out in my office as an intern. He liked it so much he  decided to come back as an intern four more times. No matter what we  did or how hard we tried, we just could not get rid of him. I am  incredibly thankful that he stuck it out because this entire body has  benefited from his public service and his expertise.\n\nJack has…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…tirelessly through the night and into the coming days. Strangers  offered comfort, and people checked in on their neighbors.\n\nSince January 29, the families of the victims have tried to find  meaning and purpose after the death of their loved ones and have worked  to eliminate the likelihood of an accident like this ever happening  again.\n\nA family, in…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that was put in place by the Biden administration is totally  unnecessary.\n\nWe made the point that it is targeted specifically for oil and gas  and that wind is exempted. They tried to say that wind is exempted  because they are already doing the analysis under the National Historic  Preservation Act, section 106.\n\nGuess what? Oil and gas is doing the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…walk through, big picture, what we  are accomplishing with this reconciliation bill titled the One Big  Beautiful Bill Act, and walk through some of the provisions.\n\nI actually tried my hardest back in my district to let facts rule the  day and not be governed and manipulated by a lot of rhetoric about this  particular type of work.\n\nI am going to take…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Kerry during the Obama  administration. For example, at that time, I released a majority staff  report just last year. That report made public FBI emails that showed  agents tried to arrest high-level Iranians but were stopped from making  those arrests. Those agents were stopped then from doing their jobs  because of political considerations relating…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…in Georgia who was  brutally murdered while out for a jog nearly 2 years ago this day,  beaten and strangled to death by a Venezuelan illegal because she  fought back when he tried to rape her.\n\nThe two illegal aliens who murdered Jocelyn had been stopped at the  border, processed, and then simply released into the interior just  weeks before. The illegal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…legal system, consistent with  international standards based on a presumption of innocence, Mr.  Speaker: the right to defense counsel, the right of appeal, the right  to be tried in a public court, full independence of judges, abolishment  of the mullahs' sharia law, and dissolution of the Islamic  Revolutionary Courts.\n\nSeven, autonomy for and removal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…convinced the President to embrace your policy.\n\nThen, finally, there is the Credit Card Competition Act, which is  another example, ladies and gentlemen, that other countries have tried,  and it has failed. The industry is trying to come up with a compromise  that works, but once again, somebody in the President's orbit thought  capping interest rates was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…potent than morphine and 50 times more  potent than heroin. The lethal dose of fentanyl is just 2 milligrams or  about four grains of sand.\n\nA loophole that the cartels have tried to use to traffic their  illicit fentanyl into our country is by changing one part of fentanyl's  chemical structure to create fentanyl analogues. The cartels did this  in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}]