[{"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "Ms. LOFGREN. Mr. Speaker, I have spoken publicly against this bill  and its serious health care cuts. You can't pull a trillion dollars out  of the health care system and expect health care providers to survive.  Clinics, hospitals and nursing homes won't survive the massive pull out  of funds. That kind…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693156/one-big-beautiful-bill-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…Beautiful Bill Act that spent trillions and trillions of  dollars on tax cuts for the superwealthy at the expense of millions and  millions of Americans and that cut over a trillion dollars in  healthcare. Fifteen million Americans are going to lose their  healthcare to pay for tax cuts for the superwealthy. So that  concentration of wealth and power got…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…billion military budget. It is not helping our veterans.  That is not where they get, literally, healthcare, mental health  support, and the things they need. That is over a trillion dollars to  Trump's so-called Department of War, even after the Pentagon failed  seven audits in a row.\n\nAs recently as 2023, the Pentagon could not even account for 62  percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…House Republicans are not laser focused on the cost-of- living crisis. They are making it worse.\n\nInstead of lowering prices, Republicans passed a bill to cut nearly a  trillion dollars from Medicaid and the Affordable Care Act, which will  strip healthcare coverage for more than 15 million people. Over $500  billion in cuts to Medicare will be triggered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…space.\n\nNOAA works to protect our fishing industry and bring American seafood  to kitchen tables around the world, supporting 1.7 million fishing  jobs, a quarter of a trillion dollars in seafood industry sales, and  $117 billion in value-added impacts.\n\nAnd the list goes on and on and on.\n\nA study by the American Meteorological Society found that every…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…next year's insurance  rates with double digit increases. We know why this is happening. It is  happening because Republicans and the Trump administration just cut a  trillion dollars from Medicaid, and now they are also trying to let the  Affordable Care Act tax premiums expire.\n\nWhen you do that, when you take trillions of dollars out of the  healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…lifesaving healthcare to Americans from all walks of life  to be a problem.\n\nNow, beyond the huge pricetag of this budget plan--a plan that  explodes the deficit by 37 trillion more dollars over 30 years--and  let's be clear: The Republican budget writers are going to use  accounting gimmicks to try to hide this cost. And let's be clear too  that the $37…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that help lower costs and help reduce  demand.\n\nThe previous administration's efficiency standards are estimated to  save consumers $1 trillion over 30 years. That is a trillion dollars.  The water heater standards alone would save $3.1 billion--that is, if  Republicans don't kill the standards right here today, which is what  they are doing.\n\nRepublicans…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…trillion a year for the next 10 years every year--$10 trillion--and the  same thing is true for Japan. They have already made an announcement  that they are going to invest a trillion dollars over the next 10  years.\n\nSo we might as well just be gift wrapping the clean energy industry,  gift wrapping it for China and other countries to be the global leader.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…said: You know what, they convinced me.\n\nThey convinced me that he is a ``no.'' The reason he is a ``no,'' he  said, over the next 3 years, it is going to add almost a trillion  dollars to the debt, and that is in the best case, the most rosy  scenario. Then he said: That is a lie.\n\nThis clock that we have that has the debt, it is still going up. DOGE…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…drug trade and the impact it has on American people, let  us not forget how people get drug treatment. It is from the Medicaid  program that has already been cut by a trillion dollars and the ACA  marketplace health plans.\n\nThe Republicans' failure to act is literally going to kill people  across this country. They let deadlines pass, premiums rise,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and negatively affects rural communities and can  violate the separation of religion and government.\n\nFinally, this financially irresponsible bill adds between 3 to 5  trillion dollars in new debt. It's puzzling why any fiscal hawk voted  for it.\n\nAnd for what? To pay for tax breaks for billionaires and large  corporations; tax breaks they don't need.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Social Security.  This was at a joint session of Congress. This dastard said that they  weren't going to do it, and, lo and behold, the dastard did it. They  cut about a trillion dollars out of healthcare. This is the dastard who  perpetrated the deed. He ought to be recognized in history as the  person who did the greatest injustice to healthcare the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…research, what are Republicans in Congress spending their time on? They  want to cut taxes for billionaires and make working people pay for it.  They want to add over $52 trillion--trillion dollars--to the national  debt. I think of my grandson when I think of that. They want to make  the biggest cuts to Medicaid ever. This is the Republican agenda:  Billionaires…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…being done  when millions are already reeling from the cuts that we saw to Medicaid  and the Affordable Care Act in the last bill.\n\nThe new draft plan contains yet another trillion dollars in cuts to  healthcare which, if passed, would represent a knockout blow to the  American healthcare system. It is, once again, another hacksaw to  Medicaid, targeting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…much I regret it. Sometimes, I really regret it. Some moments, I am  hoping that the leadership team that said they would work with me-- because I believe we can find a trillion dollars in savings in just  modernization. Remember, those inefficiencies are the people's business  models, so you already see the hallways full of lobbyists trying to  stop…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we do some of the things that we were  going to do, the Senate's reconciliation budget, with almost no money  to pay for it, in 10 years, interest could be a couple of trillion  dollars a year. The annual deficit will be three-plus trillion a year.  It will probably be $2.3 trillion this year.\n\nLast year, for every dollar we took in in tax collections,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this,  but we can't have that because we are $37 trillion in debt.\n\nI go back to this chart. There is a big yellow bar over here with  flames on top. It shows almost a trillion dollars of additional deficit  that the Senate bill would add if the policies they are currently  debating in the Senate are adhered to. That means they got rid of a lot  of our…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…funds to secure our borders, and provide for our defense in  a dangerous world.\n\nI am frustrated with the Senate numbers, but in DOGE we trust. I  think we can achieve a trillion dollars of savings as a result of its  work. The mass repatriation of millions of illegal aliens should save  another $150 billion. Restoring the work requirement for able-bodied…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…supercomputer in  your pocket, and carry it around with you. There it is. Did that cut  anyone's service? Mr. Speaker, $25 billion this year times 10? It is a  quarter trillion dollars with one little reform.\n\nThe perversity of this place when I do that piece of legislation is  that I will get attacks saying I am trying to cut benefits. No, I am  trying…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I want to make by reading that  headline to everyone is: Japan now is our largest individual creditor  country. When you have a country that has $900 billion, maybe a  trillion dollars of U.S. sovereign debt, and you walk in the door and  say: We want to renegotiate some of our trade pact with you or we want  to build an actual trade pact with you, they…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…The money is still sitting there, since 2015. Maybe we should  reexamine it, reappropriate it, or pull it back.\n\nInstead, Mr. Chair, we actually estimate there is over a trillion  dollars sitting in accounts.\n\nMr. Chairman, much of it are things that I like. It is not about  liking the appropriation. It is about budgetary discipline of going up  and down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…question I have for the gentleman: When I  graduated from law school at the University of Texas in 2003, the  national debt was somewhere in the $6 trillion range, $6.5 trillion  dollars. When I came to Congress, when I was campaigning to come to  Congress, it was just over $20 trillion. That was 2018. Today, we are  pushing $37 trillion. Is that roughly…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…exact same  levels as the Biden spending levels. What are we going to vote for in a  couple of days here? The Biden spending levels again. What does that  lead to? Two trillion dollars in deficit.\n\nSo every time we vote for a continuing resolution, for continuing the  spending at the same level, we are voting for a level of spending that  is $2 trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…since  October 1 $926,724,000. Meaning in the next couple of weeks, depending  on how much cash the Treasury decides to keep on the balance sheets, we  are going to hit a trillion dollars. This was supposed to be a year  where we would start seeing the debt starting to go down.\n\nI blessed. I chair the Joint Economic Committee, I am number four on  Ways…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…cutting  Medicaid when we are increasing Medicaid spending? I mean, it is mind- boggling that we allow that narrative to set in on a program that is  broken, that has a trillion dollars of improper payments, that is rife  with abuse.\n\nWhat are we here for? I mean, that would be my question for my  Republican colleagues. Why did you run for office? Because…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, it turns out that if you actually read those MedPAC  reports--these are the auditors who do the modeling, and we are talking  something that is almost a trillion dollars in spending last year, so  we are talking about something that is stunning amounts of money--last  year, Medicare Advantage came in at 120 percent of fee-for-service.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…populations are healthier, the plans can make  more money.\n\nBut inside here is also a great data point, Mr. Speaker. This year,  we are going to spend, let's call it, a trillion dollars on Medicare.\n\nHow many of you would guess what we are going to spend in 7 years?  The model in here says in 7 years, we go from $1 trillion a year on  Medicare to $2 trillion.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…questions about the  inefficiency, the ineffectiveness, the waste, the fraud of a government  healthcare solution, that somehow that is taking away benefits.\n\nWhen you have a trillion dollars of improper payments, when you have  the State of California openly and publicly stating that they are  gaming the Medicaid system and the provider tax and the Federal…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Medicare Advantage overpayments, we believe, this last year, just the  overpayment portion, was $84 billion. You start to see a chart like  this. Add it up, I actually have a trillion dollars here for you. Align  the incentives, and I can get you another few hundred billion dollars  of alignment incentives by changing utilization, by helping our  brothers and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}]