[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Head Start  for childcare.\n\nThis Republican majority said they would spend the next 2 years  cutting costs for the middle class, but the only thing they are cutting  is trillions of dollars from lifesaving programs our communities depend  on to make ends meet.\n\nMr. Chair, this has never been about efficiency. Tell me how it is  efficient to make people…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Virginia.  First, I suggest that that big, ugly bill gave tax cuts  primarily to the wealthy, but, meanwhile, it cut healthcare, Medicaid,  SNAP benefits, and ran up trillions of dollars in additional debt.\n\nMr. Speaker, I include in the Record a letter from over 50  organizations representing civil rights, labor organizations, youth  advocates, women's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…greedy that even $1 trillion in cuts to  healthcare wasn't enough to pay for everything that they demanded. The  total receipt from Republicans' legislation means that trillions of  dollars are being added to our national debt, even after these  draconian cuts to healthcare. Those additions to the national debt will  endanger the long-term promise of Social…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…passed during the Bush era did just the opposite,  largely benefiting the highest income earners in our country, and in  the process increased the Federal debt by trillions--trillions--of  dollars. In fact, in just 3 years, these tax laws caused our country to  double the amount of debt that it had accumulated since our Nation was  founded, putting us on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Medicaid for health services, treatment, and medication that they  simply cannot afford due to our broken healthcare system.\n\nMake no mistake. Republicans want to give away trillions of dollars,  Mr. Speaker, let's be honest, to the richest people in our Nation, like  Elon Musk and all of President Trump's friends, and let children and  seniors die from the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…percent of the American people oppose--is because they  want to distract us from what else they are trying to do. They are  working on a bill right now that would give trillions of dollars of tax  cuts to billionaires like Elon Musk by cutting healthcare for working  people. They don't want to talk about that. That part they only talk  about behind closed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690931/gulf-of-america-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…had the  House, Senate, and White House. When they passed the Inflation  Reduction Act and the American Rescue Plan, as they call it, it cost  trillions upon trillions upon trillions of dollars.\n\nBy the way, it was the Democrats who chose not to extend the  subsidies beyond this year when they had the House, Senate, and White  House, not the Republicans.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…literally take food out of the  mouths of kids, and take nutritious food from senior citizens and  veterans. For what? To give massive tax breaks to billionaires and to  add trillions of dollars to our national debt.\n\nMr. Speaker, their ugly, big bill is a disgrace, and it does not  serve working people. It serves the GOP's donors. It is a scam, a  handout to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I thank Ranking Member Smith for yielding  time.\n\nMr. Speaker, as our country wastes trillions of dollars in wars  overseas, the American people are frustrated and saying: Why is it that  we are doing that, while China, with its Belt and Road Initiative, is  building its…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…unbelievable.\n\nRepublicans have spent years getting mad about the deficit, but as we  saw yesterday, the first chance they got, they plan to increase the  deficit by trillions of dollars in their budget resolution to give tax  breaks to billionaires.\n\nThis bill is more of the same. They are encouraging oil and gas  companies to let their products go…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…spending to  support billionaires and make everyday Americans foot the bill.\n\nIt cuts over $1 trillion, including $880 billion from Medicaid, in  order to partially pay for trillions of dollars in tax cuts for the  wealthiest people.\n\nThese tax cuts would not go to help everyday Americans. Instead, they  would go to the richest 1 percent.\n\nApart from that,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…offset their tax breaks for giant corporations and billionaires like  Elon Musk. And even after all these cruel cuts, their budget will still  burden Americans with trillions of dollars in new debt.\n\nPresident Trump's `Big Beautiful Bill' doesn't do anything to address  the high cost of living or fix the economic mess created by the  President's trade…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…consumers and investors at risk  in the name of innovation.\n\nThese bills would increase the chance of another costly financial  crisis like the one in 2008 that led to trillions of dollars of wealth  being wiped out in the name of innovation.\n\nIt comes as a surprise to me that the last bill we will debate would  block any research, pilots, or consideration…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…want  to put forward and carry forward the 2017 tax program that the majority  rammed through this House without a single hearing. It was a program  that created trillions and trillions of dollars of deficit and did  little to enhance the American economy.\n\nWe see the Trump trifecta in action. Trump and Musk, with the backing  of timid Republicans, have…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…slashes SNAP, taking food off the plates for seniors,  veterans, and kids all to fund tax breaks for billionaires like Elon  Musk while increasing our national deficit by trillions of dollars.\n\nHow can anyone show their face in their district after voting ``yes''  for this?", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688112/disastrous-republican-budget"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the backbone of  the modern world.\n\nIn fact, undersea cables carry more than 95 percent of global  internet traffic. They support military communications. They move  trillions of dollars in financial transactions and keep the global  economy functioning.\n\nProtecting this infrastructure is not just about speed or  convenience. It is about national security.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…they want more than $1 trillion in new  spending in a CR that--the CR has no Republican priorities in it; it is  just a clean CR.\n\nSo how is it we are supposed to put trillions of dollars of Democrat  priorities in a CR that goes until November 21? That is what Leader  Schumer has said, and that is exactly why this is the Schumer shutdown.\n\nThey have…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…address the  skyrocketing cost of healthcare. When President Obama signed the  Affordable Care Act, he promised affordable coverage for all.\n\nMr. Speaker, 15 years and trillions of dollars later, all we have  gotten is higher costs and less coverage.\n\nBasic economics tells us that when government subsidizes the price,  demand surges and prices soar. We…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Chair, 4 years ago, President Trump left Joe Biden a blueprint  for success, and then Democrats proceeded to open our borders,  undermine American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the highest inflation in 40 years that made it  impossible for working families to survive. That is why the American  people…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…same chicken-hawk bs  for 27 months in combat in Iraq, and I don't need to be lectured by my  colleagues. We all know how that went: thousands of American lives  lost; trillions of dollars spent not on one, but two forever wars over  the last 20-plus years that we should not have started in the first  place; and, most importantly, no honest conversation…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Speaker, $1 trillion  goes towards our interest each year. That means $1 trillion doesn't go  towards helping the American people.\n\nAlso, we are in deficit spending. Trillions of dollars are going to  the national debt. I was first elected to Congress in 2010. The debt  was $9 trillion. In 2017, I left for a period of time, it  was $18 trillion. Now…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…economy. These  cables are roughly 1 to 2 inches in diameter. Yet they crisscross the  globe and carry approximately 95 percent of global internet traffic,  facilitating trillions of dollars in global financial transactions.\n\nThe Undersea Cable Protection Act of 2025 eliminates the requirement  for undersea cables to obtain a special use permit under the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Biden, it was at a 40-year  high. And now that has come down 67 percent, and it will continue to  come down.\n\nThe trade deficit is shrinking. Our Nation is bringing in trillions  of dollars in new investments, and this is going to create new  factories, jobs, and opportunities.\n\nMr. President, we are so pleased that some of those jobs are coming  into…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reserve currency.\n\nWe are squandering our place in the world. People run around saying:  Well, we need to push down the value of the dollar.\n\nYou have trillions and trillions and trillions of dollars around the  world that are held by people, and you are going to push down the value  of their holdings. Just understand every time someone says something  like…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Protection Act of 2025.\n\nUndersea fiber optic cables carry roughly 95 percent of all  intercontinental internet traffic and nearly all transoceanic digital  communications.\n\nTrillions of dollars in financial transactions--trillions--global  trade data, cloud computing, and secure government communications  depend on these cables every single day. They are critical…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…world. In our country, when you  are hungry, we feed you; when you are homeless, we house you; when you  are too poor to be sick, we will pay for your doctor. We spend  trillions of dollars a year helping our friends and neighbors who are  less fortunate than we are, and that is rare in this world.\n\nI have been all over our wonderful world. You have, too,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…as  simple and as easy as you would think--$6 million to fund media in  Gaza, funding PBS and NPR--even if it was a good idea, you can't do it  when you are borrowing trillions of dollars a year.\n\nIf we can't make these cuts, which should be the easiest imaginable  cuts, then there is no hope for us. I am grateful to my leadership for  bringing this forward.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692521/rescissions-act-of-2025"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…land and  water.''\n\nYet, the key thing is that Congress shall have power, not abdicating  our roles and responsibilities and not continuing endless wars that  spend trillions of dollars and thousands of American lives. We need to  bring the power back to Congress to ensure that it is not being abused  by anyone within the executive authority, regardless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…civil; criminal--coming.\n\nIs it time for us as Members of Congress to talk about something  which is often dangerous because when you are taking on a system that  has trillions of dollars flowing through it, you have to understand  that there will be ads in my district that are going to beat the ever- living crap out of me. It is the job. You have to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…warranted.\n\nWashington's record of involvement in the Greater Middle East is  particularly abysmal, with dozens of campaigns costing thousands of  American lives and trillions of dollars. Afghanistan, Iraq, Syria,  Lebanon, Pakistan, Yemen, Sudan, Somalia, and now Iran--all countries  in the region that the United States has bombed or is bombing. In…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}]