[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…want to share a few such lessons I believe all of us would do well  to remember and heed.\n\nOver the Christmas holiday's, I held a viewing of the historical  drama, The Six Triple Eight. The subject of the film is success of a  regiment of Black female soldiers who overcame extra ordinary obstacles  to eradicate a backlog in mail correspondence to American…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…people are trying to figure out  how they are going to keep their healthcare.\n\nIn about a month, folks will see their healthcare premiums double, on  average. For some, it will triple. For others, it will quadruple.  People will lose their healthcare, and some people will die as a result  of that.\n\nA healthcare policy in general is a matter of life and death.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697898/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Speaker, we have 4 legislative days left in 2025,  17 days total.\n\nThis is our last chance to prevent 22 million people from seeing  their insurance premiums double or even triple and for some to see  their health insurance premium spike beyond their ability to pay when  the enhanced premium tax credits expire on December 31.\n\nAn estimated 5 million…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…buddy, they moved quickly to make it happen at the White House.\n\nWhen working people need help, when millions of Americans are seeing  their health insurance costs double and triple and Americans all across  this country are feeling like they are going to have to go without  health insurance for the first time in their lives because they can't  afford…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696676/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…insurance.\n\nFor the past 3 weeks, the Congressional Black Caucus has brought  stories of the 22 million people who will see their health insurance  premiums double or even triple and, for some, spike beyond their  ability to pay when enhanced premium tax credits expire in 22 days. An  estimated 5 million people will lose their health insurance because…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…credits.\n\nI am going to share some of those stores today.\n\nThere is Kathleen. She lives in Bellingham. Now, if Republicans  refuse to act, she is going to see her monthly premium triple.\n\nSharon, in Thurston County, in my State--if Republicans refuse to  act, her premium is going to double, increasing by over $100 a month.\n\nAnd we are just getting started,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Speaker, I rise to urge passage of my FAIR BET Act.  The Republican's Triple B overturned a half-century tax provision that  allowed gamblers to deduct 100 percent of their losses from their  winnings. Accordingly, because that has been eliminated,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…of life. As heat waves get worse, roadways will crack, energy  grids will falter, and crops will dry out. Insurance rates and electric  bills will spike.\n\nSome Arizonans saw triple-digit increases on their electric bills  this summer. More evictions will follow. Frontline workers will stay  home or end up hospitalized. Our local economies will lose millions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…infrastructure--all in the name of building a better life for his wife  and two children.\n\nMaynor had dreams of one day owning a small business. He would say:  You had to triple your efforts to get ahead.\n\nHe said: It didn't matter what time or where the job was; you had to  be where the work was.\n\nMaynor's outlook reminds me of my own father, who…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…everyday Americans, families, seniors, young adults, and workers who  now face the devastating reality that their healthcare premiums are  about to double--in some cases, triple and quadruple--when critical tax  credits expire at year's end.\n\nIn New York's Ninth Congressional District, this crisis is not  theoretical. It is happening to the single…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…That is what is at stake  when the Senate votes tomorrow.\n\nWe have 21 days until January 1. After that, people's healthcare  bills will start going through the roof--double, triple, even more.  People will not be able to afford their healthcare. Millions will lose  it altogether. Tens of millions will pay much more than they can afford  as deductibles…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…way, but in a  metro area, where they outnumber the number of sworn police officers in  our 10 biggest police departments, which includes Minneapolis and St.  Paul, they were triple the number of sworn police officers in  Minneapolis and St. Paul.\n\nBut for more than 2 months, Minnesotans stood together. They stared  down ICE, and they never blinked. They…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…conversations we are having  right now: How can we work as Democrats and Republicans and work with  the President to ensure that health insurance premiums will not double  or triple for the American people?\n\nOne of my constituents told me, Senator Merkley, that it is almost  like they are reaching into our pockets and just stealing money. What I  mean…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…extreme heat regions like mine,  to pay the price through higher monthly bills.\n\nFor the hardworking people of San Jacinto, Coachella, and Imperial  Valley, the pass area, where triple-digit heat is a life-threatening  reality, these rising energy costs are devastating. They represent  choices no family should ever be forced to make between cooling their…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…2023  alone, SBICs provided $7.2 billion in funding to 1,142 small businesses  and startups.\n\nBy raising the investment cap from 5 percent to 15 percent, we could  potentially triple those numbers in the years to come and drive  revitalization in communities across the country.\n\nI thank Representatives Finstad, McIver, and Garbarino for their  partnership…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…and manganese levels.\n\nThe Bureau of Reclamation has found that these contamination levels  are so severe that local communities could see the costs of their  drinking water triple without this legislation.\n\nContrary to what the veto message states, my bill does not authorize  any additional Federal funding. It simply modifies the repayment terms  for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…biggest track stars is a Conrad High  School senior there, a male-to-female athlete who holds the State's top  2023-2024 rankings in the girls outdoor high jump, long jump, and  triple jump according to athletic.net.\n\nThen you look at--there are two individuals, two boys who identify as  female, they competed on a Connecticut high school track team from 2017…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…computing and,  yes, because of artificial intelligence.\n\nMr. Speaker, it is predicted and projected that by 2030 power demands  resulting from datacenter construction will triple just at a time when  we have been taking all of this power supply off of our grid and out of  our system.\n\nWe now have a President who is reversing those disastrous choices…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…appliances.\n\nRepublicans refused to extend the health insurance tax cuts in time,  so now millions of Americans have health insurance premiums that are  double and sometimes even triple what they were 1 year ago. In their  big, beautiful bill, Republicans took a sledgehammer to our fragile  healthcare system to give permanent tax breaks to their political…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…rates have gone up since ObamaCare, since its inception  a little over a decade ago. That is double--double--the rate of  increase in the employer-provided marketplace and triple--triple--the  CPI, which is the cost we pay for everything else out there.\n\nSo the idea that this has made healthcare less costly and more  affordable for people in the Obama…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has been  included in the text of the reconciliation bill.\n\nHowever, the other one-half, the High-Quality Charter School Act, and  a tax provision contained therein, would triple the number of kids in  charter schools across the country remains missing still.\n\nI am encouraging my colleagues to ensure that we provide support for  charter school families…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually try something tonight, and some of what we  are going to do this evening is a little bit complex. It is going to be  a little bit thick, but we have double-checked and triple-checked the  math, which means that a number of our brothers and sisters will turn  their ears off almost immediately because, remember, Mr. Speaker, we  all work in a math-free…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…racehorse. He was a  Pennsylvania champion horse.\n\nIn 2004, he captivated the Nation, winning the Kentucky Derby and the  Preakness Stakes, and coming within a single length of the Triple Crown  at the Belmont Stakes.\n\nLast month, Smarty Jones was inducted into the National Museum of  Racing Hall of Fame.\n\nToday, thanks to Rodney and Sharon Eckenrode, he continues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694960/recognizing-smarty-jones"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…the voices of  American citizens, the very American citizens who elected them to  represent them?\n\nIt is incredibly frustrating to hear that they continue to double  down or triple down on giving rights to people who are not citizens of  this country at American taxpayers' and citizens' expense.\n\nThe lead debater on the other side of the aisle said that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692316/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to celebrate the  Lieb family of Barr Ridge Farms as the Farm Family of the Year in  Cambria County, Pennsylvania.\n\nBarr Ridge Farms is operated by Aaron and Bob Lieb, the triple-great- grandsons of Adam Lieb, who founded the dairy farm in 1861.\n\nThe Farm Family of the Year is awarded by the Cambria County Farm  Bureau to a multigenerational family…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…reserved to  provide Medi-Cal coverage for people who are in our State legally.\n\nWhen you think about this cost, $9.5 billion just in the first year,  is a cost that is basically triple what was originally projected. Think  what that is going to look like over the next 10 years. We are talking  about potentially hundreds of billions of dollars that could be…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…function of a critical CFTR protein and how it causes  cystic fibrosis, which has led to the creation of lifesaving therapies.  Aided by his medical team, Dr. Welsh created a triple drug combination  that treats up to 90 percent of those affected by cystic fibrosis.\n\nMr. Speaker, I thank Dr. Welsh for all of his body of research and  congratulations on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…years. In States like Colorado, where we are leading in the AI race  and the resurgence of manufacturing, it is even higher.\n\nMy local utility has projected energy demand will triple in the next  10 years. The three biggest cities in my district have cited power  shortages as the biggest inhibitors to growth.\n\nWhile my bill focuses on affordability, it…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Charter School Act, to be passed either as a standalone bill or,  perhaps more relevantly, as part of the same reconciliation bill, H.R.  1.\n\nWe believe this measure could triple the number of students attending  high-performing charter schools across the country, and it would be a  great help to California families who are being attacked by their own…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]