[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…we  threw off the yoke of monarchy 2\\1/2\\ centuries ago, the American  people still have the power to determine their own future. They still  have the courage to make ``good trouble,'' as John Lewis, the historic  voting champion, famously said. Most of all, the American people have  the will and fortitude to stand up to this assault.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reporting  by Associated Press, more than 80 children have died from malnutrition- related causes. And for every child who dies of malnutrition, there are  thousands more in deep trouble.\n\nUNICEF, in a July 25 report, said 320,000 children are at risk of  acute malnutrition with thousands already suffering from severe  malnutrition, the deadliest form.\n\nThis…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in America--the fossil fuel  industry--is all that matters. They are the puppet masters of my  Republican colleagues. They have pulled the strings, and now we are in  deep trouble to have an honest foundation for legislative action.\n\nThis one waiver was something that the fossil fuel industry really  hated because when cars became more efficient, they…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…that was what the government was supposed to do. How come  no one answers my calls? How come this President doesn't care about me?\n\nThis is not theater. We have farmers in trouble. We have young  children who are hungry. We have elders who are concerned if they are  going to be able to go to the doctor when they get sick. We have young  people who don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…time when you have to say something. You have to make a  little noise. You have to move your feet. This is the time.''\n\nTogether, we must make a little noise and create good trouble to  protect the progress we have fought so hard for. Together, we can  ensure that the stories and contributions of our community continue to  inspire and uplift future generations.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Their property values go  down. Florida led the country in property value reduction last year--I  think as a result of this.\n\nIf you can't get insurance at all, then you have trouble getting a  mortgage on your property, which means, if you are not selling to a  hedge fund or a billionaire, you have to mark your property down; you  have to sell it for…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…they are cutting vital funding like the  Nita M. Lowey 21st Century Community Learning Centers which provide  after-school funding that keeps kids off the streets and out of  trouble.\n\nWhile the National Guard is being deployed right here in D.C., they  are cutting these programs that will help young people stay off the  corner. They want America to have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694834/fy-2026-education-cuts"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…couple of companies sent secret  checks to his campaign and to other Republican campaigns, came to  Congress and said: We have got to ban corporate money from elections.\n\nHe had trouble getting Republicans to do it at first. So he reached  out across the aisle and worked with a particularly vile Democrat, a  guy by the name of Benjamin ``Pitchfork'' Tillman--just…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…But I understand the words that were  being used today to spin an argument as to why there should be  justification for 40 million people to go hungry.\n\nYou know, I get in trouble sometimes because I use language from the  little farm that I still call home, but I have learned the rules of  decorum on the Senate floor, so I won't use them today. But…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Washington, D.C.,  Los Angeles, and even the specter of the President threatening the city  of Chicago that he will invade them like a scene from ``Apocalypse  Now.'' That should trouble everybody. I don't care whether you are  conservative, Democrat, Independent, Republican, liberal, whatever. You  should be troubled, even if, by the way, as I do, you have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…publicity stunt.\n\nAs I think Senator Van Hollen began to explain to us, if Republicans  allow Donald Trump to make himself judge, jury, and executioner, then  we are all in trouble. This is the behavior of a foreign dictator, not  the President of the United States. A dictator wishes to do away with  due process and disappearing loved ones to foreign…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…we  shall do so. We shall continue to do so.\n\nI promise that I will be in the trenches fighting with you, We the  People.\n\nAs John Lewis used to say, let's go make some good trouble.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Department of Energy--but, of course, Elon Musk and the  Trump administration have pushed out more than 3,500 public servants  there. As a result, the Department of Energy is in trouble. The  Department has even had to ask external lawyers for things like  defending against challenges relating to their illegal cancelations of  projects across the country.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…anti- choice movement. Now, whether you are pro-choice or pro-life, you would  think that someone who is that blatant and open in declaring himself a  zealot on the issue would trouble you. This has been on full display in  his role as Missouri solicitor general.\n\nMr. Divine has challenged women's ability to access the abortion drug  mifepristone and has…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…John Lewis said. It is a quote  so many people know. He really spoke not to Members of the Senate or  the Congress; he was really speaking to Americans. He said:\n\nGet in good trouble, necessary trouble, and help redeem the       soul of America.\n\nJohn Lewis died in 2020, in July, at a time that--it was Donald  Trump's first term in office. He did what…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…executive  branch, no matter who is in power.\n\nI introduced the ARTICLE ONE Act to try to restrict Presidential  power under the Trump administration the first time and had trouble  getting it moved during the Biden administration. I am not really even  pointing fingers. I am acknowledging the politics. I had some  Democratic colleagues and friends of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…my  time.\n\nFor 4 years, Democrats gaslit the American people in a vain attempt  to convince them that costs weren't going up, inflation wasn't real,  our economy wasn't in trouble, and there wasn't a crisis at our  borders. The American people saw past that deception, and they voted  for a President and a Congress that promised to put our country back…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…vital modifications nearby.\n\nDelegate Moylan's bill would correct this issue by including shipping  costs in the $24,000 the VA provides to support veterans who are having  trouble accessing the resources they need for any adapted vehicle.\n\nIn a time when bureaucracy is getting in the way of doing what is  best for our veterans, Congress must intervene…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Instead, we are going to beat each other up around here. The  Democrats are going to try to make a political issue out of it. We are  going to basically fumble because we had trouble explaining that we  have turned healthcare into financing. They want to hand out billions  and billions of dollars more to insurance companies to buy down rates.\n\nLet's actually…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Minneapolis. What happened afterwards, though, as horrific as that is,  was even worse.\n\nFirst of all, you would think if you bit off somebody's finger, you  would be in a lot of trouble with the law. Minneapolis is in some place  called Hennepin County, and you would have felt the Hennepin County law  enforcement, the district attorney, would have dealt very…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrowing for the whole  year, yet I know I even have Members on my side who are all puckered  up, running around saying: ``How do I explain that?''\n\nDo you understand how much trouble we are in if we are borrowing  about $72,000 every second of every day? In 9 years, we are borrowing  over $100,000 every second of every day.\n\nI have shown before in the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "John James", "party": "Republican", "sentence": "…so-called Affordable Care Act. Eileen in  Shelby Township is as healthy as can be. Yet her premium just jumped  $10,000 this year. That is the ACA in a nutshell: You are in trouble if  you are healthy, and you are really in trouble if you get sick.\n\nThis is what affordable care looks like in their world. This isn't  what care is in the real word. Mr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talking 4  percent of their budget authority, and that is spread over a decade. If  we can't find 4 percent of modernization in these programs, we are  actually in much more trouble than even just the brain trust here as we  tell our stories.\n\nMr. SCHWEIKERT. Madam Chair, I yield myself such time as I may  consume.\n\nI love public policy by storytelling,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…people--they  started and got an idea. Now, again, this has all been proven. They  decided to infiltrate the crowd with antifa and intelligence community  members who would stir up trouble. The FBI has confirmed that there  were 274 FBI agents in plain clothes in the Capitol here that day.\n\nThen they set up Capitol Police by failing and refusing President  Trump's…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…temporary refuge among the kind members of the Omaha Tribe.\n\nThey made an agreement with the Omaha through their Chief, Big Elk,  who welcomed the pioneers, understanding the trouble they had recently  escaped. The pioneers would stay in residence, building houses,  planting gardens and fields, and then move on after 2 years to ensure  all of their number…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY. Mr. President, moms and dads across America are having a  little trouble sleeping these days. And when moms and dads in America  lie down to sleep at night and they can't, they are worried. They are  worried about things like the cost of living.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…projections is  more than we are talking about trying to reduce spending if you take it  over 10 years. It is like this place is incapable of understanding the  scale of the trouble we are in.\n\nI have tried to show this a couple of times. I am not beating up  anyone. I am just asking people. I desperately want to extend the 2017  tax reform. I was on…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…you have a factory in which the people are not  working very hard, because apparently some people are not working very  hard for the Department of Defense, you do not get in trouble for that.\n\nBecause it is a socialist economy, everybody becomes poorer because  there is no incentive to work that much harder. You can't lose your  job, Mr. Speaker, because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…what I am telling people across this country and what should  have happened in Europe years ago: Folks, wake up. They are here. The  enemy is inside the gate. We are in bad trouble. And if we don't stop  it, we will lose this country that has been built for 250 years.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…appetite for going on the long end  of the curve.\n\nThe United States sells very short-term debt. Then we have 2 years, 5  years, 20 years, and 30 years. We are having real trouble selling the  debt on the long end of the curve. Do not pay attention to some of the  debt markets over the last month or two. Mr. Speaker, do you want to  know why? We are…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}]