[{"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to acknowledge the celebration of  the Reverend Troy DeCohen, senior pastor of the Mount Vernon Heights  Congregational Church, in this year completing his 25th year of  pastoral leadership.\n\nReverend DeCohen has a distinguished…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…District,  a district represented by our colleague Representative Clay Higgins.\n\nLouisiana is a State, of course, also represented by my good friend  and colleague Congressman Troy Carter, who is with us here in the  Chamber, and also Cleo Fields, another good friend and colleague.\n\nLouisiana is a State that stands to suffer mightily as a result of  this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to honor and recognize an  extraordinary American patriot, Sergeant Major Troy E. Black, United  States Marine Corps, on the occasion of his retirement following a  distinguished 37-year career in faithful service to our Nation.\n\nSergeant Major Black's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…this bill when I was a freshman Member of  Congress, and it was the first piece of legislation that I passed as a  freshman 20 years ago. I thank my co-leads, Representative Troy Carter,  Congresswoman Miller-Meeks, and Congressman Fitzpatrick, for joining me  in co-leading this resolution. It is a resolution that highlights the  enduring contributions…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to recognize Sergeant Major  Troy Black as he retires from a distinguished 37-year career in defense  of our Nation.\n\nSergeant Major Black was born and raised in Louisville, Kentucky,  before joining the Marine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…themselves. We speak for them.\n\nClarke),  Chair of the Congressional Black Caucus.\n\nMs. CLARKE of New York. Mr. Speaker, I thank Congresswoman Jennifer  McClellan and Congressman Troy Carter for anchoring the Congressional  Black Caucus Special Order hour.\n\nI rise tonight with my colleagues of the CBC to recognize Gun  Violence Awareness Month and to bring…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…disproportionately hit the African-American  community. This is places that have contributed so much to this Nation,  places like Tuskegee, Alabama, that gave us so much, places like Troy,  Alabama, that gave us John Lewis, places like Montgomery, Alabama,  where their largest hospital is in bankruptcy right now.\n\nWe have to be cognizant of the impact that this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…JAMES B: NEXSTAR MEDIA GROUP;       Thompson, Ava: NEXSTAR MEDIA GROUP; Thompson, Anne: NBC NEWS;       Thomson, Sylvia: CBC (CANADIAN BROADCASTING CORPORATION);       Thornes, Troy: CBS NEWS; Thornton, Thomas: ABC NEWS; Thorp,       V., Frank: NBC NEWS; Thueringer, Tamara: C-SPAN; Thuman,       Scott: WJLA-TV/NEWSCHANNEL 8; Tienken, Kaitlyn: FOX BUSINESS…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…growth and  character of Cullman, Alabama, as well as the State.\n\nAt the age of 105, Mr. Drinkard remains active in his business. He  still serves on the board of trustees at Troy University, demonstrating  that age is no barrier to leadership, commitment, or purpose.\n\nMr. Speaker, Roy Drinkard is a living example of American grit and  grace. My wife,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693675/happy-105th-birthday-to-roy-drinkard"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…qualities in abundance, serving  with distinction as Executive Officer, guiding this squadron with a  steady hand and an unwavering focus on operational excellence.\n\nA native of Troy, North Carolina, Commander Russell is a graduate of  East Carolina University, where he earned a degree in the science of  biology. He began his military career by enlisting…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…at https://eplanning.blm.gov/eplanning-ui/project/  2021155/510 (last visited June 11, 2025).\n\n2. Letter from Senator Steve Daines, Senator Tim Sheehy,       Representative Troy Downing, and Representative Ryan K. Zinke       to Comptroller General (Feb. 14, 2025).\n\n3. GAO, GAO's Protocols for Legal Decisions and Opinions,       GAO-24-107329 (Washington,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…they serve.\n\nIf you have further questions, please contact Allie Esau,       Deputy Chief of Staff for Congressman Pete Stauber.            Sincerely,      Pete Stauber,      Troy Nehls,      John Rutherford,      Gabe Evans,      Clay Higgins,      Mike Ezell,\n\nMembers of Congress.                                   ____…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…situation. In January 2024, George County  Sheriff's Deputy Jeremy Malone was shot and killed during a traffic  stop on a rural highway. In August 2024, Summit Police Patrolman Troy  Floyd was shot and killed during a regular, routine traffic checkpoint.  Earlier this year, Hinds County Sheriff's Deputy Martin Shields, Jr.,  was shot and killed after responding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, we are gathered here today to  honor the lives of Staff Sergeants Jose Duenez, Jr., Edvin F. Franco,  Troy S. Knutson-Collins, and Private First Class Dante D. Taitano.\n\nThese men, these heroes, were part of the 3rd Infantry Division out  of Fort Stewart, Georgia, and members of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689658/moment-of-silence-in-remembrance-of-staff-sergeants-jose-duenez-jr-edvin-f-franco-troy-s-knutson-collins-and-private-first-class-dante-d-taitano"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  1047.\n\nMr. Speaker, I rise in support of H.R. 1047, the GRID Power Act,  sponsored by my colleague, Representative Troy Balderson of Ohio's 12th  District.\n\nThis legislation would ensure that grid operators have the tools they  need to secure the reliability of the electricity grid in the event…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Roskovich, EMT       Simon Klimov, Specialty Charge Paramedic Kevin Guido, Charge       Paramedic Anthony Tino, EMT Germaine Bolanos, EMT Robert       Anderson, District Chief Troy Dufrane, and District Chief       Keith Lock of Manatee County EMS, Lieutenant Casey Schue,       Engineer Wade Hoopingarner, Engineer Joe Jago, and       Firefighter Anzzonni…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…killed during a traffic stop in January 2024. He served in  law enforcement for 21 years and is survived by his wife, three  daughters, mother, and two brothers.\n\nWe remember: Troy Lamar Floyd, a Summit Police Department patrolman  who was shot and killed in August 2024 while conducting a checkpoint.  Patrolman Floyd had served in law enforcement for more…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to be joined by my fellow Pennsylvania Congressmen, Ron  Bresnahan and Dan Meuser. I was also proud to have Russell Redding,  Pennsylvania's Secretary of Agriculture, and Dr. Troy Ott, dean of Penn  State's College of Agricultural Science, on the panel.\n\nThis year, we celebrated passage of my bill, the Whole Milk for  Healthy Kids Act, which will be soon…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…such time as I may  consume.\n\nMadam Speaker, I rise in support of H.R. 3616, the Reliable Power  Act, sponsored by my colleague from Ohio's 12th Congressional District,  Mr. Troy Balderson.\n\nPut simply, this bill protects reliability that is critical to the  economy as well as public health.\n\nThe bill protects the public from future Federal rules that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Federal, State,  and local governments and the private sector to better safeguard public  gatherings, critical infrastructure, and high-density urban areas.\n\nI thank Congressman Troy Carter, who represents the community  devastated by the New Year's Day attack, for his partnership and  leadership on this effort.\n\nThis practical and bipartisan legislation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I rise today to recognize Marie and David  Troy of Greenwich, New York for their admirable patriotism.\n\nMarie Troy is a lifelong New Yorker and resident of Washington  County. For four years now, she and her husband David…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}]