[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…no longer alive and is pulling  that country closer to our adversaries.\n\nThe illegitimate Georgian Dream party led by Ivanishvili rigged the  October 2024 election, and they truly did rig it in that situation. It  has been facing mass protests ever since. Every Sunday, there are mass  protests in Georgia protesting deprivation of freedoms and liberties.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…community spirit and dedication to others, business  acumen, incredible generosity, friendship, and, of course, leadership.  He represented the best of Rhode Island, and he will be truly and  deeply missed.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…work will advance  evolving technologies in everything from drug discovery to agriculture  to cybersecurity and beyond. As UC President James Miliken has said,  their work has truly ``opened the door to the next generation of  quantum technologies.''\n\nFinally, Professor Omar M. Yaghi of the University of California,  Berkeley, was one of three researchers…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…impacted.  The ripple effect is coming to you. Even if you don't have an ACA plan,  even if you are paying some part of your employer's insurance cost,  this rising tide will truly lift everybody's boat in terms of costs.\n\nRepublicans are making Connecticut families and Americans across the  country choose between affordable healthcare or putting food…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Chair, I rise on behalf of the Massachusetts  Seventh Congressional District.\n\nAs the House prepares to vote on a truly horrifying Republican budget  resolution, one void of empathy or common sense, I am thinking of the  people in my district who stand to be harmed the most: families in  Mattapan…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…caring for a second generation, but simply do not earn  enough to qualify. Families with parents who work hard will be excluded  because their wages are too meager. Are you truly saying that  billionaires and corporations need tax breaks more than the youngest of  your constituents? This bill would make that problem worse, not better.\n\nThis bill pays…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…radical factions of their party.  It will bring deeper, harder, and even faster pain to the American  people.\n\nIt seems the hard right over there wanted even quicker pain. It is  truly jarring to watch House Republicans cheer and pat each other on  the back while bond markets spiral and working families are left to  worry about how they will make ends meet.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…heartfelt and imbued with wisdom,       pleas for abolition do not present a threat to the       unrestrained and voracious power of the military-industrial       complex.\n\nA truly horrific reality in 2025, and for the realistically       foreseeable future, is that nuclear weapons will remain on       this planet, brandished against the entire human…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…are dealing with in the  Trump administration and this Republican-controlled Congress that fails  to find its spine and do the right thing for the people of this  country.\n\nI truly cannot comprehend the heartlessness that is required to do  these things like this, and I am praying for all of the victims of this  administration's campaign of terror in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the lives of Melissa and Mark Hortman,  who were shot and killed in an unspeakable act of political violence  last week.\n\nMinnesota House Speaker Emerita Melissa Hortman was truly the best of  us. She was exactly the kind of person you would want to run for  office. She was a dedicated public servant who got up every day  determined to make life better…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692786/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Alabama delegation,  including one of our U.S. Senators and many others here on the House  floor, to pay respect to the end of an era. One of the most improbable,  inspiring, and truly remarkable chapters in American history quietly  closed during our most recent break.\n\nLieutenant Colonel George Hardy, a veteran of Vietnam, Korea, and  World War II, passed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…prohibit  children from working in particularly dangerous jobs.\n\nAll workers deserve to be paid fairly, earn good benefits, and come  home safely at the end of the day. If we truly want to prioritize  workers, then we  must strengthen the laws, including regulations that protect workers'  health and safety on the job and that empower workers' ability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…you took the time to have a hearing and have a little bit of  deliberation instead of jamming a CRA like this, a blunt instrument,  right on the House floor.\n\nIf the intent is truly about preserving access, there are better ways  to do it. There are certainly much better ways for Congress to uplift  and support our national parks; for example, standing…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…together to stop this  madness. Let's actually do something to meet this moment before it is  too late and we no longer have an agency focused on behavioral health.\n\nThis is truly a performative vote if Republicans are too scared to  say anything when the agency is being decimated and the mission is on  the line. My colleagues on the other side of the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…exists under  different shapes in all governments, more or less stifled, controlled,  or repressed; but in those of the popular form it is seen in its  greatest rankness and is truly their worst enemy.\n\nThe alternate domination of one faction over another, sharpened by  the spirit of revenge natural to party dissension, which in different  ages and countries…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "John Rose", "party": "Republican", "sentence": "…or working events. They are often required to testify  in court on their days off to ensure the conviction of a suspect they  have arrested. That time, overtime, is needed to truly serve their  communities. They do it without complaint.\n\nThey do receive extra pay, of course, for their overtime, yet that  often comes with the burden of extra income taxes.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…milestone when a majority  of the entire House of Representatives signed on as cosponsors of H.  Res. 166, supporting a democratic, secular, and nonnuclear Republic of  Iran.\n\nThis truly bipartisan and broad-based House majority of 224,  consisting of 139 Republicans and 85 Democrats, endorses the general  principles propounded by Iranian democracy groups,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Res. 77 is counterproductive to the progress  already made by the President and to new gains he can still achieve in  the ongoing negotiations with our trading partners. Let's truly get a  balanced, fair playing field in trade.\n\nOn April 30, the Senate rejected the joint resolution of disapproval  of IEEPA-based reciprocal tariffs for the same reasons.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696441/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Community First  Health Centers, a truly remarkable organization that has spent the last  50 years delivering accessible, high-quality, patient-centered health  care, driven by a team of respectful and compassionate…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694747/recognizing-community-first-health-centers-on-50-years-of-service-to-the-ninth-congressional-district"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…should not be something that  is in question.\n\nWe must rebuild the actual image of Congress. We must rebuild the  image of the Federal Government, where we are actually here to truly  serve the people. I think this is a paramount step in us making sure,  with friends and colleagues like Representative Magaziner, we are able  to move forward and rebuild…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…policy has long supported Taiwan's membership in international  organizations whenever possible. Excluding Taiwan undermines the  legitimacy and effectiveness of the IMF as a truly global institution  in an increasingly complex world economy.\n\nThe IMF's core mission involves advising governments on economic  reform. What better society can the IMF point…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…she meets. While many her age focus on  slowing down, Joan stays energized and youthful by serving others. Her  mind is always on how to help--then doing exactly that. Joan is truly a  Hero Among Us. As she puts it, ``I started volunteering to help others  but never realized it would help me too. It has given me more joy than  I could ever imagine. Volunteering…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "James Risch", "party": "Republican", "sentence": "…after Senator Kaine moves the  matter forward.\n\nI understand many of the sentiments people have about war powers and  the balance between Congress and the President. There is truly clear  tension between the branches and the Constitution on this matter, and,  of course, that has reared its head many, many times during the  existence of our country.\n\nPutting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…125 times.\n\nAll together, investigators, through the Government Accountability  Office, discovered $21 billion lost to ObamaCare fraud. That is  insulting.\n\nIf Democrats were truly concerned about affordable healthcare, you  would think that they would want to root out the waste and the fraud.  Even the Washington Post says ``ObamaCare subsidies make…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…lives because when they  are suffering with substance use disorder, it is just chaotic on  themselves, their families, in which they live and the friends that  they have.\n\nThis truly changes people's lives. It is a bipartisan bill.  Everything in it is bipartisan and has been discussed. I just encourage  my colleagues to vote for this bill, reauthorize…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the needs  of their consumers at the best price possible.\n\nWe don't want to eliminate that. We don't want to erode the deposit  base with a CBDC.\n\nI ask, Mr. Speaker, would we truly want to lose the benefits of a  diverse banking system that makes the U.S. the global leader in the  financial system? Do we want to take actions to be more like China or…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Ronnie Hutton has made…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…nights, and unwavering dedication.\n\nEveryone involved in that broadcast played a vital role. From  producers and anchors to editors, photographers, and  technical staff, it was truly a team effort and it showed. These  individuals displayed incredible skill in their respective professions,  but also in communication and collaboration with each other.\n\nWTOC's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…times,  and I am always thankful for his insight and commitment to the  community.\n\nJohn always looks to increase the hospital's ability to implement  innovative treatments, truly elevating the level of care at the  hospital. Additionally, under John's leadership, the WellSpan  Chambersburg Hospital has implemented state-of-the-art security  systems.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…our communities  through more affordable housing.                    Celebrating 100 Years of Bryan Health\n\nMr. FLOOD. Mr. Speaker, today, I rise to recognize and celebrate a  truly remarkable milestone for the city of Lincoln and the entire State  of Nebraska, the 100th Anniversary of Bryan Health.\n\nSince first opening its doors in 1925, Bryan Health…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}]