[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…preserving our environment, including our public parks and outdoor  spaces, as the efforts of the individuals and organizations recognized  tonight reflects. These are truly selfless actions done for the benefit  of all and merit our highest praise.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Tyra Youngblood has…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Arnold was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Kristina Arnold has made…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691077/recognizing-kristina-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Hoffland was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Kay Hoffland has made…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Tyrone was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Tyrone Young has made a profoundly…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Jami Frazier has made…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mr. Harry White has made a profoundly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Phillips was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Mike Phillips has made a profoundly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Porter was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Ashley Porter has made…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690135/recognizing-ashley-porter"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Verosic was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Eric Verosic has made a profoundly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Arnold was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Sean Arnold has made a profoundly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Lastra was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mike Lastra has made a profoundly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Ms. Mankotya was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Jennifer Mankotya has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Glen Youngblood has made…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, Casey helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Casey was a strong advocate for bringing in government and non- profit resources to aid in the recovery process.\n\nIt is clear that Casey ``KC'' Gabelli has made…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690275/recognizing-casey-kc-gabelli"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Gavish was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Ruth Gavish has made a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}]