[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, Donald Trump and Republicans control the  entire government. For 42 days, Republicans shut it down. Why? It was  because they refuse to extend tax credits to help millions of Americans  afford…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696728/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…make that hard choice to not go with  insurance at all and hope that they won't end up with an emergency room  bill that will bankrupt them.\n\nMeanwhile, President Trump and the Republicans are talking about  buying Greenland. They have the money to buy Greenland but not to help  fund healthcare for the American people. They have the money. Donald  Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698586/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…year increase in the premiums they have to pay for the  coverage for their families. It is going to be devastating to those  families.\n\nThe very fact that President Trump and the Republicans are only just  allowing a vote on continuing these critical tax credits just 2 weeks  before all these families have to make their decision--it is only 2  weeks to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…marker. We will stand strong against the rising tide of attacks on our  democracy. And I will keep leading the fight to stop this cynical and  dangerous bill and to stop Trump and Republicans' attempts to undermine  our voting rights.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Trump administration has gone after hardworking  Federal employees relentlessly, including firing more than 200,000  Federal employees prior to the start of the Trump Republican shutdown.\n\nRepublicans control the House, the Senate, and the Presidency. Donald  Trump and Republicans made the decision to shut the government down,  the longest shutdown in American…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Speaker, I thank my colleague for yielding.\n\nJust like the rest of America, we in Alabama are facing a health  crisis caused by the Republican Party. Thanks to President Trump and  Republicans in Congress, more than 58,000 of my constituents in  Alabama's Seventh Congressional District will see their health  insurance premiums skyrocket next year.\n\nOne of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…shameful--shameful.\n\nThe No. 1 thing I heard this year during my 62-county tour is that  people are worried about paying for the things they need--healthcare,  above all.\n\nDonald Trump and Republicans, meanwhile, have intentionally sent  people's costs up and up and up. The idea of reducing costs on day one,  which Donald Trump promised in the campaign and many people…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cover up how  they are raising energy prices for American families in the Energy and  Water appropriations bill. Renewable energy brings down the cost of  electricity. Trump and Republicans are destroying this clean and  affordable energy by cutting its funding in half. They are doing this  to benefit the fossil fuel companies that donated to their campaigns.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…living. That is why I  am going to stand here and explain to people what is going on and how  our healthcare programs are at risk and being undermined.\n\nThe Trump administration and Republicans in Congress are, right now,  discussing how to cut these programs in a way of putting those savings  either into tax cuts for the rich--I say ``either'' because…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…they caused this 45-day Republican shutdown, illegally refused to  pay SNAP benefits for the hungry, and illegally canceled flights,  throwing the country into chaos.\n\nTrump and Republicans want to make Americans poorer and sicker, while  Trump builds his gilded ballrooms, protects pedophiles, pardons those  who buy his memecoins, and lets Americans starve.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696690/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…fails to address the fundamental  needs of families across our country.\n\nAmericans have made it crystal clear that affordability is their  number one concern. President Trump and Republicans promised to lower  costs on day one, and that has been one big broken promise.\n\nHealthcare premiums are skyrocketing because Republicans refuse to  extend the ACA tax…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696726/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…grandmothers, food pantry leaders, and  local officials. Each and every person who participated in the  roundtables spoke about how the big, ugly bill will increase hunger. If  Trump and Republicans in Congress would spend 5 minutes listening to  anyone living paycheck to paycheck, they would know how devastating  these cuts are.\n\nIn Massachusetts, we are crafting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694156/impacts-of-the-big-ugly-bill-on-massachusetts"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…important issue, we are also  focusing on costs as they relate to housing and groceries and energy  and childcare and so much more.\n\nWe show the contrast that, while Donald Trump and Republicans are  spending all of their time on foreign wars, on ballrooms, on private  jets, Democrats are the ones focused on helping people pay the bills  for the things they…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…and perhaps the  most egregious one is to make the largest cuts to healthcare in our  country's history in order to give billionaires more tax breaks.\n\nThe fact that Trump and Republicans are prioritizing these bills over  lowering the cost of living is insulting to our constituents. I fail to  see how renaming the Gulf of Mexico, redefining the definition…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…from now until mid- November, and they are going to pay. Now, 24 million Americans are  going to be told that because of the last tax bill that was just  enacted by Trump and the Republicans, people are going to be paying an  average of 114 percent more per person per month.\n\nIt is not like we just went into a lab and cooked up an issue to try  to hijack…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…means affordable living, just like it is common sense that  trillions spent on so-called Green New Deal projects caused runaway  inflation at over 9 percent.\n\nPresident Trump and Republicans are reviving the American Dream by  advancing progrowth, proworker, America First policies that help young  people build a future, provide relief for our elderly, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…America.\n\nWhen they destroy Medicaid, they destroy rural hospitals, and they  destroy healthcare centers that everyone in the community uses, not  just those on Medicaid.\n\nTrump and Republicans want to give tax cuts to the biggest  corporations, as well, so they have to cut funding from low-income  college students trying to get ahead and steal food from the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, the fallout from Joe Biden's disastrous  decision hurt Americans then, and it continues to hurt Americans today.  President Trump and Republicans are working to reverse these failures.  The President is strengthening law enforcement. He is deporting  criminals who are here in our country illegally, and he is…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…was called within minutes of polls closing.\n\nMy colleagues are only bringing this to the floor as an excuse to  score political points by attacking President Trump. President Trump  and Republicans are working to deliver on our promises to the American  people: securing our border, protecting communities and elections, and  bringing down the cost of living…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…work done that Washington,  D.C. needs, and this commission process that we go through does not  work.\n\nI know we wanted to hear that this is all related to Donald Trump and  Republicans wanting to control the process that goes on so that we can  control Washington, D.C.\n\nMr. Speaker, it is not working is the reason why I am on the floor  today.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…face of historic Democrat obstruction. And  we are right back at it this year, confirming four nominees the first  week of 2026.\n\nThe American people elected President Trump, and Republicans remain  committed to ensuring that he has his team in place so that he can do  the work the American people elected him to do.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…supersized IRS funding is something we have  been battling over for a couple of years now. It is a textbook example  of the type of out-of-control spending that President Trump and  Republicans have rightly opposed.\n\nRather than working together to help the IRS solve its massive  taxpayer service and IT shortcomings, the misnamed Inflation Reduction  Act went…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688897/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…life easier for the working people of our country and  their families. And, instead, what we have seen is decision after  decision, action after action by President Trump and the Republicans in  Congress that raise prices--raise prices on healthcare, on insurance,  on drugs, on medications. Whether it is the tariffs being imposed on  prescription medications…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "John Thune", "party": "Republican", "sentence": "…is ending an emergency related to  fentanyl.\n\nThe American people recognize that these are legitimate crises and  that they warrant an aggressive response. President Trump and  Republicans promised that we would unleash American energy and end the  lawlessness at our borders, and we intend to keep those promises.\n\nMr. THUNE.  Res. 37, the motion to reconsider…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…work tirelessly to help keep us all safe. But they  were set up to fail by the Democrats that day. And then, of course,  Democrats placed all the blame on President Trump and the Republicans  for everything that happened that day and afterwards. They had the  majority.\n\nNancy Pelosi spearheaded the true insurrection that day. This has all  been proven…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…syndrome, this mindset that says, we have to  go after President Trump no matter what that they have.\n\nActually, when I think about it, I think it is because President  Trump and Republicans have accomplished so much that they told the  voters they were going to accomplish in the 2024 election. We are  actually doing what we said we are going to do.\n\nPresident…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Committee was definitely bipartisan--which leads  you to wonder, of course, if this was really about the bill at all or  if this was about wanting to deny President Trump or Republicans, more  generally, a legislative victory, which might be nice for Democrats but  leaves stablecoin issuers and Americans who use stablecoins in the same  difficult spot…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…our Nation's  safety again. America deserves a leader who enforces the law, defends  our borders, and stands up for its citizens, and that leader is Donald  Trump.                   Republicans Stand Up for Women and Girls\n\nMrs. MILLER-MEEKS. Mr. Speaker, I should be standing here today  celebrating the Senate's passage of the Protection of Women and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…easier to build in  America again; a generational investment in our military; and I could  go on and on.\n\nAnd in the last year, this administration, with President Trump and  Republicans, has been hard at work to make certain that we address the  cost of living, that we address safety in our Nation and around the  globe, and to improve the quality of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}]