[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…making them extremely vulnerable to price increases  from Trump's tariffs on steel, which are already in place.\n\nIn the aftermath of steel and aluminum tariffs during Trump's first  term, talking about the first term now, not the new one, major  appliances showed price increases of between 5 and 10 percent.\n\nIf my colleagues are concerned about the prices,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…National  Wildlife Refuge, which I want to emphasize is a wildlife refuge, and  still no legitimate oil and gas company currently holds a lease there.\n\nEven during President Trump's first term, no oil and gas company kept  their leases. In fact, a recent report from Taxpayers for Common Sense  outlined the lack of economic viability for any oil and gas development…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…power  grid. These historic price hikes are on top of the $29 billion in  electricity bill rate hikes that utility companies have requested since  the start of President Trump's term.\n\nMr. Speaker, I don't want to just talk about prices because the  bottom line is we are also talking with this bill about a cost to  Americans' health and safety.\n\nThis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…years to complete. And the estimate to  taxpayers--all of us American taxpayers--is about $1 billion.\n\nThat plane probably won't even be ready before the end of President  Trump's term when the foundation--his foundation--takes ownership of  it. It is a gift, in effect, to him from Qatar.\n\nThe Air Force is a passthrough entity. That is the arrogance of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…for the United States at the time for Donald  Trump, Bill Barr, echoed his words and said it was safe. Then the  President just decided at the time--President Donald Trump, in his  first term--to fire Chris Krebs.\n\nBut that wasn't even enough for this President. He comes back just a  few weeks ago and says he is going to investigate Chris Krebs. Why?…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…various tools, including the power to designate a  large nonbank company as a systemically important financial institution  for enhanced oversight and regulation. In Trump's first term, they  severely weakened the nonbank designation process. In a letter, former  Treasury Secretaries Geithner, Lew, and Yellen, along with former Fed  Chair Bernanke,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…that exists on the other end of this terrible tunnel. But  we can only get there if we keep up the fight.\n\nThe SUPPORT Act of 2018, signed into law by President Trump during  his first term, established vital addiction treatment infrastructure.  Reauthorizing this bipartisan law is essential to our addiction  prevention, treatment, and recovery efforts.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…math to  claim that these tax cuts will not cost us anything.\n\nIn truth, they cost the American people $7 trillion in total. All of  this is being done to pave the way for a Trump term built on fear,  lawlessness, and vengeance.\n\nPresident Trump is firing public servants, slashing critical  programs, and enacting chaotic tariffs that will raise costs. This…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689893/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, in President Trump's first term, facing a  crowd of protesters, he asked our military: Can't you just shoot them?  Just shoot them in the legs or something?\n\nThankfully, his former Secretary of Defense…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688243/removing-roadblocks"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…use for this  purpose.\n\nAs a matter of fact, never in the history of the United States has  SNAP been allowed to lapse like this. As a matter a fact, during  President Trump's first term, Secretary Purdue, President Trump, they  tapped the same fund to allow SNAP benefits to continue to roll.\n\nNow, President Trump says that the use of SNAP contingency…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…this,  which is undermining the will of Congress. This is really  unprecedented. It has never happened--Republican President, Democratic  President--including Donald Trump's first term, where he suddenly said:  I am going to turn off the spigot of support to local law enforcement  agencies because I don't agree with your policies.\n\nI think that is a…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Americans. He said:\n\nGet in good trouble, necessary trouble, and help redeem the       soul of America.\n\nJohn Lewis died in 2020, in July, at a time that--it was Donald  Trump's first term in office. He did what Congresspeople did, but he  also did some really extraordinary things to fight for healthcare.\n\nMy friend Chris Murphy knows about that. He was…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…President and, once again, a budget that would explode the deficit and  national debt, just like clockwork, with their tax cuts for  corporations and the top 1 percent.\n\nTrump's first term added over $7 trillion to the national debt, and  he wants to double down and do it all over again.\n\nAs the ranking member of the Committee on Education and Workforce,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689903/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…they  plan to return those they want to deport? Do they think they can hold  Cubans in detention indefinitely?\n\nConditions in Cuba are far more desperate than during Trump's first  term. To be frank, President Biden disappointed me. He didn't do enough  to help. Food and medicine shortages and power blackouts are causing  more suffering. Mr. Speaker,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a course correction as  desperately needed following 4 years of policy that placed America in a  position of excess and decline.\n\nSpeaking of excess, since President Trump's first term, increased  enrollment and exploitation of the 2018 farm bill by the Biden  administration ballooned the annual spending on the Supplemental  Nutrition Assistance Program…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the past 78 years.\n\nWhat do we have to show for all of that? More than 400 Presidential  nominees confirmed, far exceeding the totals of the first year of  President Trump's first term and of President Biden's; repeal of a  number of burdensome Biden rules and regulations, including multiple  rules that would have driven up prices for American families…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…firearms, firearms owners, or firearms transactions  or dispositions be established.''\n\nIn addition, when Congress reduced the ObamaCare penalty to zero  during President Trump's first term, the Department of Justice refused  to defend the underlying flawed law. Clearly, the DOJ is fully  empowered to decline to defend statutory provisions that no longer…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Main Street  America, and they deserve leaders who will fight for them.\n\nIn Iowa, small businesses represent 99 percent of all businesses in  the State. In President Trump's first term, Congress passed the Tax  Cuts and Jobs Act, giving small businesses the relief that they needed  to grow and hire.\n\nI will also say that there are no Fortune 500 businesses…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…were 277 nominees who moved en bloc. Do you know why?  Because Republicans allowed them to be able to move en bloc.\n\nDo you know what is interesting? During President Trump's first term,  more than 500 nominees moved en bloc. Do you know why? Because  Democrats allowed them to move en bloc because this was normal to be  able to do. But now we are in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Senate  with 50 votes or 51 votes with the Vice President. There are  Republicans here who do not want to put us in that position.\n\nMr. Speaker, 8 years ago in Donald Trump's first term, some of these  same Republicans, when we also had three votes--we used one vote for  the tax cut, one vote to try and failed to do something on healthcare  reform, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694987/calling-for-use-of-reconciliation-process"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and enforce the laws that are on the books. These brave officers  are producing historic results at our border and in our communities.\n\nIn the first 6 months of President Trump's term in office, his  administration has removed more than 70,000 convicted criminals, many  of whom are convicted of assault, sexual crimes, kidnapping, and even  homicide.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…National Flood  Insurance Program claim filed.\n\nThe family saves; the taxpayer saves. Investing now saves money down  the line.\n\nThat is why back in 2018, during President Trump's first term,  Congress established the BRIC Program to invest in those flood  protections needed to prevent future flooding. And through the  Infrastructure Investment and Jobs Act,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…without one, Mr. Speaker?\n\nThis legislation codifies President Trump's executive action to  secure our voter registration process, which has been a key platform of  President Trump this term.\n\nDemocrats are lying, Mr. Speaker, saying this bill prevents  minorities from registering to vote. It protects their vote. It  protects every American citizen's vote.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…corporate CEOs, are very poor guardians of America's  national security and economic interests when it comes to China. The  U.S. Government finally, during President Trump's first term, started  to say: Whoa. Wait. Stop. We can't outsource our national security to  corporate America. We, the U.S. Government, need to safeguard our own  interests, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, I thank Chairwoman McClain for her  leadership.\n\nMr. Speaker, during President Trump's first term, we had progrowth  policies, a progrowth economy, and tax revenue growth. Even after  COVID, the Biden administration accelerated the deficit with unchecked  spending,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692539/rescissions-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…feed this great  Nation.\n\nIn November, the American people voted for a change in leadership and  a return to the prosperity that our Nation enjoyed during President  Trump's first term.\n\nI now urge my colleagues in the Senate to support this legislation  and deliver on the promises that we made to the American people.                             Supporting…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "John Thune", "party": "Republican", "sentence": "…addition to a packed legislative schedule, we  considered and confirmed 417 civilian Presidential nominations--more  than were confirmed in the first year of President Trump's first term  or President Biden's. And while 417 would be an impressive number all  on its own, it is particularly remarkable given the historic level of  obstruction the President's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…increase taxes on 160 million Americans.  As a matter of fact, Mr. Speaker, most of those billionaires--over 70  percent--are huge Democratic donors.\n\nDuring President Trump's first term, we had progrowth policies, a  booming economy, and revenues increased. Then the Biden administration  accelerated the deficit by those in the administration, by the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…environment and our way of life.\n\nHowever, following the 2020 election, President Biden announced plans  to immediately review all Agency actions taken during President Trump's  term, and the Department of the Interior identified the 2020 IAP/EIS as  warranting review, one of the 70 Executive actions the Biden  administration took targeting Alaska.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}]