[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…were hoping that it would, but it is  worse now than it was even then.\n\nIn fact, the Republicans knew this problem was coming all the way  back on January 20 when Mr. Trump first took office. To much fanfare,  they began moving forward with his legislative agenda, the big,  beautiful bill and other pieces of legislation. I don't even know how  many…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…same time, the stock market has tanked. Even after today's so- called pause, which is not a pause because it is still a 10 percent  tax--the S&P is down 10 percent since Trump took office, and trillions  of dollars of people's retirement savings are wiped out.\n\nMr. Speaker, what are our Republican colleagues doing to respond to  this insanity? The majority…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bills basically double down on failed Republican  energy policies that have already driven up energy bills on American  families and pollution in just the 10 months since Trump took office.\n\nThe President promised to cut Americans' power bills in half.  Instead, he and Republicans are causing them to soar with their  backward policies and their war on…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…physical attacks  on election infrastructure.\n\nThis dismantling of CISA is fundamental and deeply alarming, but at  the Department of Justice, things are no better. President Trump took  an ax to the Department of Justice's Voting Section within the Civil  Rights Division, that historic section established to protect and  uplift the vote.\n\nFirst, he decimated…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…studies were able to be completed,  and their mineral withdrawals happened in 2018, protecting their  waters, but the Rainy River Watershed was left unfinished.\n\nWhen President Trump took office, his administration initially  promised to complete the study. Instead, President Trump honored his  promise from a campaign rally and did not protect the watershed.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Nathan's courtroom. In 2022, Maxwell was sentenced to 20 years in  prison under the Biden administration for sex trafficking and sexual  abuse of minors.\n\nWhen President Trump took office in January of 2025, they killed the  investigation. They assembled all the materials, they got all the  prosecutors together, and they terminated the investigation.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…is in your electric bill.\n\nAccording to the Energy Information Administration, residential  electricity bills have already increased by almost 10 percent since  President Trump took office. Household energy costs are expected to  increase by another $170 annually by 2035 thanks to tax credit repeals  and tariffs.\n\nAnd when it comes to the impacts on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Speaker, House Republicans ended 2025 by failing to extend  Affordable Care Act tax credits causing healthcare costs to skyrocket  for millions of Americans.\n\nSince President Trump took office, electricity prices have gone up by  13 percent nationwide and 20 percent in New Jersey, leaving over 80  million Americans struggling to pay their utility bills.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…fighting  racial discrimination. The division has since been tasked with  upholding the rights of all persons in the United States, particularly  the most vulnerable.\n\nWhen Trump took office, there were almost 400 attorneys in the  division. Based on unofficial estimates, approximately 70 percent of  the Justice Department's Civil Rights Division is expected…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…more difficult as the Trump  administration works to dismantle the National Park Service. More than  12.5 percent of the entire workforce has left the agency since Donald  Trump took office. It has only been a little more than 100 days, and we  are already down 2,000 rangers and park employees.\n\nHouse Republicans have stood by and watched, and now they…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…healthcare, their health insurance, and this year especially,  on their utility bills. In fact, in Washington State, average  electricity rates are up nearly 17 percent since Trump took office less  than 1 year ago.\n\nWith energy demand skyrocketing in the region, prices have continued  to climb.\n\nLet me be clear. This is a direct result of the harmful and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Federal Transit Administration in safety assurance, where he was  hired to start a program that looked into transit safety hazards across  the Nation.\n\nBut after President Trump took office, he started to receive strange  emails about his job. He was still on probation, but his performance  was excellent, and even his managers did not know who was sending…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…stories.  And the stories came flooding in, and here are just a few:\n\nI'm on Social Security disability--it's about 95 percent of       my total income. Every month since Trump took office this       year, I've worried about whether or not my [Social Security]       payment will come as usual.\n\nYes, there are millions of people out there who are worried…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, President Trump took a strong American  economy and broke it in less than 100 days.\n\nRight now, Republican Senators are at a crossroads. Will they vote to  stop Trump's chaotic tariffs and save…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…representatives whom  they sent here to Washington have authorized and one that risks yet  another endless conflict that will drain our coffers and cost American  lives.\n\nPresident Trump took military action against Venezuela without the  express consent of Congress. The Constitution is clear: The power to  declare war belongs to the people through their elected…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, yesterday marked 100 days  since President Trump took office for the second time. It has been a  whirlwind 100 days, to say the least, as his administration has taken  swift action to reverse many of the Biden-era policies that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and ask for its immediate consideration in the  House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. GUTHRIE.  Res. 75.\n\nMr. GUTHRIE.\n\nMr. Speaker, as President Trump took office in January, the Biden- Harris Department of Energy finalized amended energy efficiency  standards for commercial refrigeration equipment.\n\nH.J. Res. 75, introduced…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, yesterday marked 6 months since President  Trump took office, and today is the 200th day of the Republican  majority here in the U.S. Senate.\n\nIn that time, the Trump administration and Senate Republicans have  been hard at…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…trafficking.\n\nAnd what are the numbers? Was it 80,000 American lives lost since  2020 as a result of the poison that Maduro has forced into this  country? On Saturday, President Trump took bold action, and he took  action to protect the citizens of this great country.\n\nWe should celebrate the success in Venezuela. We should take great  pride in the brave men…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…offices, reform the bureaucracy, and restore much-needed accountability  to the workforce. The American people chose to elect him to do just  that.\n\nEven before President Trump took office, Federal collective  bargaining legal authorities were weaponized to sabotage what Americans  had voted for. On their way out the door, lameduck Biden administration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…November 5, 2024. They lost the electoral vote, the  popular vote, and they lost every swing State on the table.\n\nDid Democrats learn from this smarting defeat since President Trump  took office? They clearly have not. Instead, they focus their time  again defending USAID slush funds, flat-out government waste, and  pretty much every problem, trying to lay…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…monsters took the lives of innocent Americans, like  Laken Riley and Jocelyn Nungaray. While President Biden barely  expressed empathy for the lives he put at risk, President Trump took  action, deporting these violent criminals and gang members from the  start of his Presidency.\n\nOn November 5, 2024, 77 million Americans, including myself, voted to  restore…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…rapists, child traffickers and       smugglers, drug dealers, and more--entering the United States       and further enriching foreign terrorist cartels. President       Trump took immediate action to seal and secure the border.       Now, to ensure long term border security and deter the most       heinous illegal criminal aliens from attempting to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…accurate across the United States.\n\nThe vast majority of Americans agree that only U.S. citizens should  have the right to vote in our elections. Just last month, President  Trump took a strong stance reaffirming his commitment to the integrity  of our elections. The President's executive order will help equip  election officials with better data and more…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…colleagues stand. You can look to  see where they stand in this photo. Let's talk a little bit about that  in a moment. I will touch on something else first.\n\nSince President Trump took office, we have seen our Democrat  colleagues fight to unmask agents, to dox Border Patrol officers. We  have seen them issue warnings ahead of immigration raids. They spent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Americans and contributing more than $200 billion  annually.\n\nThis rule is not economically justified. It is Washington at its  worst. It is no wonder that before President Trump took office, 75  percent of the country thought that we were headed in the wrong  direction. It is rules just like this that they know about.\n\nThis is a bad rule. It is bad for…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…consequence,  agreed to deals with Iran that the regime disregarded, and concerned  themselves more with appeasement than with protecting American  interests.\n\nPresident Trump took a different approach. For months, President  Trump has urged Iran to make a deal. He has been clear. There is no  world where Iran, whose leadership chants ``Death to Israel,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…captured.\n\nHow many of them were Iranian agents as well? How many of them are,  today, in sleeper cells? Well, the truth is, no one knows. What we do  know is this: President Trump took office, and since that time, illegal  border crossings are down by 95 percent.\n\nImmigration and Customs Enforcement agents are working fast. In the  last 7 days alone, ICE…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Soleimani? Because he was the leader of the more  radical elements of their military that had been targeting Americans  and he was planning to attack our forces in Iraq and Trump took him  out: in 1983, the Beirut barracks bombing, Hezbollah, supported by  Iran; Khobar Towers bombing in Saudi Arabia, a terrorist group  supported by Iran.\n\nThat is why they…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…this; this will curdle your lunch-- North Korea.\n\nMama Gump said that stupid is as stupid does. President Putin is not  interested in peace. President Putin thinks President Trump took the  bullet train to Chump Town.\n\nI mean, I can tell you how I look at this and, I think, how most  Americans look at this situation. I think to myself: You know, my mama…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]