[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Gulf of Mexico,'' saying, ``Mississippi is a great state to  launch from.'' Good for him.\n\nSo you can imagine my disappointment when, fast-forward to this past  March, Trump announced yet another anti-voter Executive order that  would empower DOGE to access sensitive voter data--very reminiscent of  the request from that first term but now on steroids.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…support of Ukraine. Our NATO and European allies are continuing to  provide billions of dollars for support themselves. That is in line  with the decision that President Trump announced the other day.\n\nLet's not abandon the EU or our NATO allies now, and let's not  abandon Ukraine. The Ukrainian people did not ask for this war. They  deserve our continued…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today President Trump announced that the  U.S. will provide NATO allies with weapons to send to Ukraine. Finally.  This is welcome news, but it comes 6 months late.\n\nWasn't it candidate Trump who promised…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693516/actions-speak-louder-than-words"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…testing could not be resurrected in  the United States.\n\nBut the more things change, the more they stay the same. Plus ca  change, plus c'est la meme chose.\n\nOn October 29, Trump announced that he is directing the Department of  Defense to resume nuclear testing in a disastrous policy reversal, but  not surprising as this is featured in Project 2025--the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans--Trump, the Republican Senate, the  Republican House--chose for it to happen.                                  Venezuela\n\nMr. President, on Venezuela, yesterday, President Trump announced ``a  total and complete'' blockade of all sanctioned oil tankers entering  and leaving Venezuela--another dangerous escalation with no clear plan  whatsoever. Donald Trump…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…than 17 million seniors  live on less than $30,000 a year. Yet, Republicans look to weaken or  sever lifelines like Medicaid, Medicare, and Social Security.\n\nPresident Trump announced a plan to fire 12 percent of Social  Security employees, close 26 offices, and slash phone services.  Commerce Secretary Howard Lutnick recently said his family wouldn't…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689232/seniors-need-social-security"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…rule that strengthened privacy  protections for information related to productive healthcare, such as  abortion and gender-affirming care.\n\nOn March 5, 2025, President Trump announced his administration would  no longer enforce a Federal law that requires hospitals to provide  women abortion care in an emergency when their lives are threatened.  When,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…trample on the Constitution and  Congress' powers and responsibilities. Every day brings a new crisis  with this White House, and they are all of its own making.\n\nSince Trump announced his tariffs, the U.S. has lost 42,000  manufacturing jobs, tourism is tanking, and unemployment is on the  rise. Costs for everything from electricity to groceries to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…America by getting rid of tens of thousands or hundreds  of thousands of people who work there and that they are disrupting the  entire agricultural economy.\n\nThen, Donald Trump announced that there were some very fine, good  workers within the agriculture sector, and they would not be enforcing  the law there. That lasted for several days, and then there…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…super-PAC than  any other industry by far, five times more than the combination of Big  Oil and Big Pharma.\n\nIt allows for the purchase of bitcoin and Trump coin, and Trump has  announced that he is going to do just that with our tax dollars going  into his crypto.\n\nMr. SHERMAN. Finally, this creates the perfect financial tool for  drug dealers and for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…treating public office like a personal business  opportunity.\n\nCrypto investments make up $2.9 billion of the Trump family's net  worth. Just days after the inauguration, Trump announced a Trump meme  coin used to funnel money into his and his family's pockets. Now, the  Trump family crypto mining scheme is going public as their payouts grow  larger.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…more wars and treating serious law enforcement problems as  challenges for the U.S. military.\n\nI strongly support the resolution my colleague has filed.\n\nWhen President Trump announced in August that he might undertake this  action, Senator Schiff and I conferred with other Senators. And when  the first strike was taken on the 4th of September, we wrote…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Pardon my bad French, but ``the more things change, the more they  stay the same''; ``plus ca change, plus c'est la meme chose.''\n\nOn October 29, 2025, just last year, Trump announced that he was  directing the Department of Defense to again resume nuclear testing in  a disastrous policy reversal. It is really not surprising because it is  in Project…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Canada, to lower  costs for Americans, and to help our small businesses. I hope all of my  colleagues will do the same.\n\nI just want to add that, in the last hour, President Trump announced  a new tax of 10 percent on everything Americans import, with far higher  taxes on many countries. Everything from the EU will now face a 20- percent tax--Japan and South…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, I urge the Senate to take up and pass S.  Res. 598.\n\nLast May, President Trump announced a deal to green-light several  billion dollars' worth of advanced AI chips to the United Arab  Emirates. The deal alarmed national security officials.\n\nWhy in the world…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…What he and Merrick Garland and  Joe Biden did was to weaponize the U.S. Federal Government to target  President Donald Trump and his allies.\n\nJust days after President Trump announced his 2024 campaign,  President Biden named Jack Smith as special counsel. And with the  approval of the Biden Justice Department, he issued 197 subpoenas to  over 430 conservative…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…partner without congressional consent.\n\nI will make that motion in just a moment, but let me, first, just  explain what this is and why I am doing it.\n\nNext week, President Trump has announced plans to impose 25-percent  tariffs on products coming into the United States from Mexico and  Canada, our No. 1 and No. 2 trading partners.\n\nThese tariffs will be disastrous…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and be signed into law.\n\nEncouraging Innovation Through Artificial Intelligence Base\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, at the beginning of this  term, President Trump announced an aggressive artificial intelligence  plan to keep the U.S. competitive with China.\n\nJust 3 months later, we are already seeing this plan in action  through the investment…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Yukon region in Alaska, which locked up an astonishing 13.3  million acres of land.\n\nAlaska is crucial to our national security and economic prosperity.  In 2020, President Trump announced a draft RMP for the central Yukon  that, among other provisions, revoked Public Land Order 5150 and  unleashed American energy.\n\nFor more than a decade, the State of Alaska…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…about, not trying to get rich  on trading stocks.\n\nMy bill is bicameral. It is bipartisan. As I said before, it is led  in the Senate by Senator Josh Hawley. President Trump has announced  that he will support this legislation to make this law. He will sign it  into law.\n\nToday, Speaker Johnson indicated his support for the underlying  policy and the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out of frustration about high  prices.\n\nWell, today, President Trump has announced he is going to impose  tariffs on virtually every trading partner we have, and I rise in  support of a piece of legislation we are about to vote on here in the  Senate…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…their  tariff barriers and their nontariff trade barriers to American  companies and American citizens.\n\nThe President's negotiations are bearing fruit. President Trump  already announced new trade deals with major trading partners,  including the United Kingdom, Japan, and the European Union. Other such  announcements we expect to be forthcoming.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696441/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…hosted an  inaugural Pennsylvania Energy and Innovation Summit in Pittsburgh to  highlight how Pennsylvania will lead in the AI revolution. During the  summit, President Trump announced more than $90 billion of investments  into the Commonwealth's energy industry and data centers.\n\nNow, with the unleashing of Pennsylvania's energy potential, each and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…at every hospital  outpatient department.\n\nThis package forms a key downpayment on delivering meaningful health  cost reduction for all Americans.\n\nLast week, President Trump announced the Great Healthcare Plan, which  focuses on lowering costs by increasing price transparency and holding  big insurance companies accountable.\n\nThese proposed reforms…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…inaugural address, he spoke of an aggressive artificial intelligence  agenda to keep America competitive with the Chinese Communist Party.\n\nJust a few months later, President Trump announced a historic $1.4  trillion investment into our economy from the United Arab Emirates.  This investment will support American artificial intelligence  infrastructure. It…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}]