[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to decrease energy costs? Do you want  to give constituents the ability to have energy that is less costly and  that is also cleaner or do you want to just do what Donald Trump says  and embrace a sham energy emergency to give an easy pass lane to oil  and gas to bypass environmental regulations?\n\nThis timing today is bad and good. It is propitious or…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…the history of this country.\n\nThe impact? Higher prices across the board. The average family is  expected to pay an extra $4,000 this year alone. They cannot afford  that.\n\nTrump says: ``I couldn't care less.''\n\nMr. Speaker, we need to end this chaos.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…trying to turn Canada  into an enemy is beyond belief. You know, I talked with the senior  Canadian leader just the other day.\n\nHe said: Mark, you know, even if, tomorrow, Trump says, ``Never  mind,'' as he has gone back and forth a dozen times, or says, ``No  harm, no foul,'' the damage we will have done to the relationship  between America and Canada…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Donald Trump says that he isn't sure if  he needs to uphold the Constitution. It is clear to all of us from his  attacks on the courts, the rule of law, our democratic institutions,  our civil…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690721/holding-this-administration-to-account"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the United States had previously said were a security risk.\n\nThen a company closely associated with the UAE buys $2 billion of  Trump's USD1 stablecoin. And then President Trump says: Oh, do you know  what? You can have these AI chips after all. We will help you establish  an advanced AI processing--artificial intelligence--center in Abu  Dhabi, one of…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…not vote to send U.S. troops on President  Trump's project to Venezuela, but I don't think they voted to dominate  the Western Hemisphere either, which is what President Trump says his  overall mission is.\n\nAnd as my colleague from Maryland said, he is willing to twist the  Monroe Doctrine. He is not even following it. He is twisting the Monroe  Doctrine,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the American people so they can help out the  billionaire donors who write them big checks.\n\nNow, let me ask: If this bill is so great, so big, and so beautiful  as Donald Trump says it is, then why the hell are we debating it in the  middle of the night?\n\nWhy not debate it in broad daylight where the American people can  tune in and hear what it is really…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that there is a tariff on Canadian exports.  The bottom line, I guess, is the only way that we could get Canada to  maybe send us more oil or gas is if we did what President Trump says  and annex them and make them the 51st State. I am not an advocate for  that. I don't think that is going to happen.\n\nIt is unrealistic right now to talk about any kind of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…example, it is 60,000 small businesses and  their owners who rely on these tax credits to afford health insurance  for themselves and their families.\n\nHere is what Trump says. Trump says affordability is a ``hoax.'' He  is saying to these families: What you are now saying is a hoax.\n\nHe has called affordability a ``con job.'' But the only hoax, the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…pure fantasy.\n\nHe says he wants to make America affordable again. Well, inflation  just hit a 7-month high, and his new trade war will cost families  $2,000 more a year.\n\nTrump says he wants to balance the budget. His plan would add $3  trillion to the deficit to give billionaires another tax cut--let me  repeat that again--to give billionaires a tax…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…energy. Even solar plus storage  is cheaper than running any coal-burning plant in the United States of  America. But you wouldn't know that from listening to Donald Trump,  when he says: I love coal. I love clean coal.\n\nWell, young people love clean solar, clean wind. It is cheaper, and  it doesn't lead to asthma, it doesn't lead to lung cancer, and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…not impossible, with the Trump  administration firing at least 240 employees in the Office for Civil  Rights and closing more than half of its regional offices.\n\nDonald Trump also says he wants to shut down the Department but keep  its  core functions. Get rid of the people with expertise and give the core  functions to other agencies without the expertise…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…moment. I would like to highlight this  language: `` . . . an individual''--one person--``who is a greater  threat to our Republic''--an important statement--``than Donald  Trump.'' He says in 248 years. I will come back to these in just a  moment.\n\n``He tried to steal the last election . . . '' Now, this was  September of 2024, so it is the election prior…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dictating what happens in our energy markets to our children.\n\nTo make matters even worse, of course, the bill also raises taxes on  some projects that are underway. Donald Trump says he wants America to  dominate energy, and then he does this--taxing energy projects, raising  costs for families?\n\nNope. Donald Trump, what you are doing is absolutely stupid…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…saying this for weeks, but obviously, things  really boiled over for Mr. Musk on Tuesday.\n\nThen, just a few minutes later, he followed up with another shot at  Donald Trump, where he says: ``It will massively increase the already  gigantic budget deficit to $2.5 trillion (!!!) and burden America  citizens with crushingly unsustainable debt.''\n\nHe went…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…to this. But I don't know  what is going to happen if Prime Minister Starmer, who is polling right  up there with fungal infections, decides to go forward and President  Trump says no. I don't know what will happen.\n\nIf Prime Minister Starmer, because he feels guilty because the good  people of Great Britain at one time owned other countries to which…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}]