[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…three election workers who has reported receiving threats,  harassment, and abuse. So, for Tina and so many others, that harassment  grew worse with every lie spread by the Trump campaign about a so- called stolen election, with threats against election officials  continuing in subsequent elections.\n\nThere was no stolen election. That is a farce. But for…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…registering voters and maintaining voter  processes are leaving their roles at an alarming rate. The turnover was  especially pronounced in large jurisdictions where the Trump campaign  focused its misinformation campaign around 2020 elections.\n\nNow, each of these individual actions of anti-election assault is  serious and significant, but each action…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…country, and starving 12 million families, including millions of  children.\n\nThese billionaires are the same individuals who proudly gave millions  of dollars to President Trump's campaign. They literally bought votes  during the last election and even sponsored Stalinist military parades  to celebrate the President's birthday.\n\nNo one should be surprised…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…partisan journalists who  simply parrot his party line. His FCC has begun to deliberately harass  media companies that are owned by political opponents of the President.\n\nBut Trump's campaign to destroy independent journalism has a darker  and more menacing side because Trump isn't just trying to intimidate  journalists so that they will be afraid to tell the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…living. Now  Republicans are making matters worse by pushing legislation that will  only drive up monthly power bills even further. It is quite the  departure from President Trump's campaign promise to cut American power  bills in half. He said that during the course of the campaign that in  the first year he would cut power bills in half. Instead, they keep…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…resolutions to the floor rather than working on really helping the  American people.\n\nThe only labels we should be talking about today are the lies  stickered across Trump's empty campaign promises. He continues these  misleading claims and lies to the American people, and Democrats are  not going to stand idly by while he loots the U.S. Government for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, Elon Musk spent $277 million supporting Donald  Trump's campaign last year. In return, Trump has done all he can to  support Musk's business ventures, awarding billions in potential  contracts to Tesla and SpaceX. Trump even turned…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689221/pure-bait-and-switch"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…and  other politicians of being pedophiles and then said and campaigned that  ``If you elect me, I will release the files.'' That was only one  campaign, and that was the Trump campaign.\n\nSo now, as he is in power, as he has gotten power, he has  specifically said he would release it in campaign. He had an Attorney  General that said: I have the files…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…World Liberty's crypto are based abroad in countries like Singapore,  South Korea, Hong Kong, and the United Arab Emirates. Because this  company was launched during Trump's campaign, it gave him an avenue to  possibly circumvent Federal laws that make it illegal for foreigners to  donate to Presidential campaigns or inaugural funds.\n\nAfter the election…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…supply  chain and the cost of those tariffs.\n\nThe American people want to see the administration tackle inflation  and the high cost of everything. When President Trump was on the  campaign trail, he talked about inflation. He said, ``Starting day one,  we will end inflation and make sure that America is affordable again  and bring down prices on all…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…start to a new administration in modern times.\n\nAmericans are already fed up. Americans are already beginning to see  that Donald Trump has betrayed them, that Donald Trump's campaign  promises before he won election and his actions as President are almost  in direct contradiction on issue after issue after issue. They are  seeing that Donald Trump…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…credibility of the messenger of news that he didn't like.\n\nThen, during Special Counsel Mueller's investigation on Russia's  interference in the 2016 election to benefit Donald Trump's campaign,  President Trump attacked the FBI relentlessly, trying to undermine its  credibility.\n\nRather than debate the facts or the evidence, which he knows he would  lose, isn't…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…role with very little experience in  education, but she has a wealth of experience in Trump world. She has  never been a teacher, but she did donate over $20 million to Trump's  campaign and organizations that are backing him. She has never been a  school administrator, but she does sit on the board of directors for  Trump Media & Technology Group.\n\nIn…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…more. We will see  blackouts and we will see bigger bills because Trump and the  Republicans want bigger profits for their fossil fuel buddies--buddies  who contributed to Trump's campaign and have gotten paid out big time  in return, with more than $4 billion in brandnew handouts from the  government this year alone.\n\nLet's call Trump's energy agenda what…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…the American people, pursuant to his Executive order on  January 20 of this year--the first day he took office--to make it a  priority. As we all know, during President Trump's campaign, he chose  to make exporting energy dominance and energy independence a hallmark  of his campaign.\n\nHe did it because he knows about the connection between energy  independence…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…helping low-income Americans return to work, and securing the future of  American agriculture in our rural communities.\n\nThe One Big Beautiful Bill Act delivers on President Trump's campaign  promises, and it is a win for the American people.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693176/one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…increase. Back  home in Texas, my constituents would see their taxes increase by $3,000  on average next year.\n\nNow, imagine this. If we failed to follow through on President  Trump's campaign promises and on our campaign promises, if we agreed  with the Democrats who were demagoguing this issue, can you imagine  what that would do to the standard of living…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}]