[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…The Congressional Review Act, or CRA, has been used to overturn rules  finalized by administrations of both parties since it was signed into  law in 1996.\n\nThis Congress, the Trump administration and Republicans in both  Chambers have been using the CRA to overturn public lands protections  that have never been considered rules in the past. In an entirely…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…or present, has fully stepped up  to bring the truth to light. The very agencies charged with protecting  the vulnerable, instead, protected the powerful.\n\nNow, under Donald Trump, that coverup has gone from negligence to  active obstruction. Trump promised to release the files. He promised  the American people transparency. Instead, he and his handpicked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…opposition to this  legislation because I cannot, in good conscience, vote to spend one  more cent on ICE. I will not fund an agency that acts like an American  gestapo.\n\nThe Trump administration has launched a brutal and reckless campaign  to strike fear in immigrant communities across the country, and ICE is  on the front lines, using aggressive and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…heard.\n\nBut, as we stand here, this cherished right is coming under attack  because, in 2026, we can expect a continuation of what is happening in  these last 9 months: that the Trump administration is doing everything  it can to undermine the confidence in elections and sow distrust in the  election process.\n\nIt is like a spider weaving a web. The Trump…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…large.\n\nAccording to a 2024 survey by the Trevor Project, 12 percent of LGBTQ  youth attempted suicide in the past year--12 percent of American youth  in this category.\n\nNow, the Trump administration is reportedly considering eliminating  these specialized support services, which would cut off the lifesaving  resources they provide.\n\nYoung people, young Americans,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…proposed to improve upon it. Sadly, the  Republicans didn't accept just one.\n\nHere we go again. The last time the Republicans had a majority in the  House and Senate and President Trump in the White House, they passed a  terrible bill that was a tax cut for the rich that gave 83 percent of  the benefits to the wealthiest people, the top 1 percent in our  country,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688094/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Ms. CLARK of Massachusetts. Mr. Speaker, Donald Trump said the cost- of-living crisis is fake news, ``a con job by the Democrats.''\n\nMr. Speaker, 60 percent of Americans can't afford a basic quality of  life, 45 percent have had…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise today to sound the alarm about  what is happening to our Nation's ability to advance lifesaving medical  research in the first month of the Trump administration.\n\nAs many of you know, I am a proud graduate of the University of  Wisconsin-Madison Law School. In many ways, I grew up at the  university, where both of my…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to share the story of a Federal  scientist who was fired by President Trump and Elon Musk.\n\nIn their own words, this researcher wrote:\n\nI was a biologist with USDA's Animal and Plant Health       Inspection Service. I worked to mitigate human-wildlife…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688173/fired-by-president-trump"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Speaker, I rise today to voice my opposition to  President Trump's announcement that the United States will resume  explosive nuclear testing.\n\nNevada was the focal point of nuclear development during the Cold  War. Over four decades, the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Order hour and the opportunity to really talk about a critical issue  for our constituents in California and really all across America.\n\nIf we go back to the beginning of the Trump administration and we  think about the various issues that he has put forth and the burdens  that he has placed on America, one of the most important is in the big,  ugly bill.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, first, I thank the gentlewoman from New  Jersey for having this session, for bringing us together to highlight  how the Trump administration is undermining hard-won protections for  workers. I really appreciate the comments and sort of the introduction  to my comments, a community that I have been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, as a Chicagoan, I know firsthand the  terror that Trump's mass deportation agenda and the Department of  Homeland Security's immigration raids are having on our communities.\n\nMy constituents have been surveilled, threatened, teargassed,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Ms. SLOTKIN. Mr. President, I rise today in support of Senators  Schiff and Kaine's resolution regarding war powers.\n\nThis resolution would just say very simply that if the Trump  administration wants to be at war against a terrorist organization,  they should come to Congress, notify us, and seek our approval.\n\nCurrently, the administration is waging…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…disproportionately on the Asian-American academic community.\n\nFrom the incarceration of Japanese Americans in World War II to the  racial profiling of Chinese-American scientists under Trump's failed  first term China Initiative, countless Asian Americans have had their  lives destroyed because our government falsely accused them of being  spies.\n\nAlready, 72 percent…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…interference, and  it reinforces the idea that retirement plans exist for one reason: to  help Americans retire with stability and security.\n\nH.R. 2988 codifies the principles in the Trump Department of Labor's  2020 rule on retirement plan ESG investing.\n\nUnder the bill, as with the 2020 Trump rule, if a fiduciary finds  that an ESG factor is a financial factor,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…our communities. These men and women  aren't just entrepreneurs. They are job creators, innovators, and the  embodiment of the American Dream.\n\nHouse Republicans and President Trump are fighting to make sure they  have the tools they need to thrive. That starts with making the 2017  Tax Cuts and Jobs Act permanent. Those tax cuts are critical for small…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Air Pollutants: Rubber Tire Manufacturing.''\n\nMy resolution will repeal this suspect rule that the Biden  administration pushed out after the election but before President  Trump's inauguration.\n\nThis rule was flawed to begin with. It was published on November 29,  2024, after the election of Mr. Trump but before his administration  could take office.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…of nine  must reach a majority in order to make something the law of the land,  and yet a single district judge believes they can make the law of the  land.\n\nSince President Trump has returned to office, left-leaning activists  have cooperated with ideological judges whom they have sought out to  take their cases and weaponized nationwide injunctions…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…national security and law enforcement to American innovation and  space exploration, the CJS bill before us puts the Nation on a path to  greatness while reinforcing President Trump's bold agenda on trade and  combating illicit drug trafficking.\n\nTo continue the fight against the drug cartels that are ravaging  American communities, the Drug Enforcement…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…opportunity to grow wealth.\n\nHowever, under President Biden, digital assets were attacked, which  crushed innovation and created uncertainty for businesses.\n\nFortunately, President Trump is working to make America the crypto  capital of the world. We want digital asset innovation to happen in  America and crypto jobs to be created in America without ceding…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…bleeding peptic ulcer disease causing a portion of your stomach to  be resected as something in the distant past.\n\nNow, by the way, I applaud my colleague. I applaud President Trump  for saying that other countries are not carrying their fair share of  the load for paying for this innovation. They should do it too. This is  not the way to get there. But…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Biden-era implementation of a natural gas tax that would harm our  Nation's energy producers and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting  everyday Americans. They ignore the rising…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I rise today to thank President Trump for  saving the world. For those who don't recognize it, we have been at war  with Iran for the last 46 years, or more likely and more accurately,  Iran has been at war with…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…commemorating the events of Black  January in Azerbaijan and honoring those who lost their lives in  pursuit of freedom. Further, please join me in thanking President  Donald J. Trump for his work to secure peace and prosperity with our  friend and partner. The United States continues to stand with the  people of Azerbaijan and their right to live free.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…years.\n\nTo preserve our influence abroad and our quality of life here at  home, we must unleash growth, starting with the largest tax cut in U.S.  history.\n\nJust like the first Trump tax cuts, we can expect record job growth,  investment, repatriation of capital back to the United States, record- low unemployment, record-high wage growth, and the lowest…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…projecting strength throughout the world, while bolstering  our naval fleet. The LCS supports America's maritime security, sea  control, and deterrence, and, importantly, President Trump's agenda.\n\nJust this past April, the USS Minneapolis-Saint Paul helped the U.S.  Coast Guard stop two alleged drug smuggling operations in the Caribbean  Sea. These ships assist…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…in strong support of this  resolution because it delivers on the promise that we made to the  American people by extending the Tax Cuts and Jobs Act and fulfilling  President Trump's agenda.\n\nThis is direly needed. For the past 4 years, the American people have  lived through the longest sustained period of debt and deficit in our  Nation's history. During…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688066/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Madam Speaker, since President Trump was sworn in, illegal  crossings have plummeted at our southern border.\n\nThis past February saw the lowest level of illegal crossings ever  recorded in our Nation's history,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…how it works.\n\nMr. Speaker, also, you can call what President Biden did a pause as  opposed to a ban, but I know from the time he implemented the pause or  ban until President Trump came into office, you couldn't ship natural  gas. Either pause it or ban it, I think that is saying the same thing.\n\nMr. Speaker, this is important. We do want to beat China.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}]