[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…throwing himself a birthday party with tanks and missiles  in the streets like it is North Korea.\n\nWhat the hell are we doing here, Mr. Speaker? This is why people  don't trust  government. If we want to be serious about budgeting, fine. Let's be  serious. Let's look at where the waste, fraud, and abuse runs rampant.\n\nLet's audit the Pentagon. Let's go…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…believe that we think we are above the  law; that we don't have to obey it; that we don't have to follow the  rules that other people do. And that is why they are losing trust in  this government.\n\nI can tell you, come midnight today, they have every bit of reason to  believe that because we have failed in our ability to be able to  deliver for so many people.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…carried out aggressive, indiscriminate, and often unjustified  operations across our country, actions that erode our freedom and  undermine our civil rights and public trust in government.\n\nICE claims they need to be aggressive to keep us safe, but how does  harassing law-abiding farmworkers, families, and children make anyone  safer?\n\nWhile I agree our…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…We cannot expect excellence from our Armed Forces if we do not  support the very people who make excellence possible.\n\nThis bill does not build trust. It erodes it. Trust in our  government, our institutions, and our promises is what holds the fabric  of this Nation together.\n\nThis legislation should be a reflection of our values. It should  speak to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Public Administration. Earlier this year, he was  inducted into the Government Hall of Fame for his lasting impact on  accountability, fiscal responsibility, and public trust in government.\n\nAs Gene's term as Comptroller General concludes, his legacy at GAO  and in public service is secure. The standards he set, the integrity he  brought to the job, and…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…visible ID, without any official markings on them,  and with masks are acting more like vigilantes than agents of our  government.\n\nMr. Speaker, how can we even trust that these are government  officials? It is nothing more than kidnapping, and it needs to stop.  There should be no more secret arrests and no more plainclothes agents  waiting outside…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…constituents voted. We had to serve them all equally. We  had to put our community above politics.\n\nMr. Speaker, here in Washington, the Hatch Act was written to keep  trust in our government strong. It helps to make sure public officials  stay focused on the job that we were elected or hired to do and not on  personal or political goals.\n\nYet, Donald Trump,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't get  points for playing PR games while the people who enabled Epstein's  abuse go unnamed and unpunished.\n\nThis is why people hate Congress. This is why they don't trust  government.\n\nRepublicans talk about supporting the victims. They talk about  holding  powerful people accountable, but it is lipservice. When the time comes  to do something, they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…are fighting to protect the Affordable Care Act and to  keep healthcare accessible for millions of Americans. We are fighting  to lower costs for families and restore trust in a government that  should be working for the people.\n\nMr. Speaker, I urge my colleagues in the Senate to reject this  corrupt bargain and pass our bill that takes away this unethical…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…exempted, the President and Vice President.\n\nThis is incredibly dangerous, and it undermines confidence in this  important industry. It also further degrades the public trust in our  government, especially at a time when that trust is already eroded by  the President's refusal to release the Epstein files.\n\nWe need to take important steps to establish a regulatory…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693837/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…for his vigorous  defense of our position and his encouragement that people vote against  the so-called SAVE America Act.\n\nMr. Speaker, the way to enhance Americans' trust in government is by  holding ourselves to a higher standard, not by disenfranchising  citizens seeking to participate in our democracy.\n\nThe vast majority of Americans believe that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699938/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…and just for the American taxpayer. They reflect these  values that guide our work in this Chamber: strong institutions, fair  treatment for taxpayers, and renewed trust in our government processes.\n\nThis is a measured, practical bill that passed unanimously in  committee, and it deserves the support of this House on both sides of  the aisle.\n\nI urge…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…are vulnerable during  hurricane season because they cannot renew existing policies, and that  raises a question the American people are asking every day: How can  they trust a government that isn't even open?\n\nNow, by the way, NFIP is not perfect. It faces financial challenges.  Some reforms are needed. But shutting it down makes the problem worse,  not…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…overwhelming majority of  Americans support. The notion that someone should be able to profit  from their government service or even the appearance of that undermines  trust in government, which is so essential to the representative form  of democracy that we have here in the United States.\n\nI am hopeful that this legislation will be brought to the floor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…checks.\n\nYear after year, gaps in our data system allow improper payments to  flow to individuals who are no longer living. It is wasteful,  avoidable, and undermines trust in government-run programs.\n\nAs founder and co-chair of the DOGE Caucus, I am proud to support the  Ending Improper Payments to Deceased People Act. It is a commonsense,  bipartisan…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Americans are being denied access to this  vital coverage because major TV streaming platforms like YouTube TV and  Hulu + Live TV refuse to carry C-SPAN. At a time when trust in  government is more important than ever, no company should stand in the  way of public access to democracy and the inner workings of our  constitutional republic.\n\nI urge YouTube…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…fails to do that job, the  consequences reach beyond Washington. The harmful impacts include  delayed services, uncertainties for families and businesses, and eroded  trust in government.\n\nOur recent progress stands in sharp contrast to where we were just a  few years ago. This body had not passed a single government funding  bill in this Chamber before…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, waste, fraud, and abuse fundamentally  undermine the American people's trust in the government. When well- intentioned Federal programs are defrauded by criminal bad actors,  taxpayer dollars are wasted, and funding for businesses and individuals  in need of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…begins in childhood that has continued to rise, the rates have, since  this ban on whole milk went into effect and now constitutes over 20  percent.\n\nThe second issue is trust in government. Our public health  establishment has given a lot of very bad advice in the past; for  example, downplaying the risk of sugar. Even more than that, when kids  are seeing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698180/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for tax years 2017, 2019, 2020, 2021 and 2022, omitting       millions of dollars in income fraudulently received through       CHYLD.\n\n``Janet Mello betrayed the trust of the government agency       she served and repeatedly lied in an effort to enrich       herself,'' said U.S. Attorney Jaime Esparza for the Western       District of Texas. ``Rather…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Businesses, job creators, and families deserve confidence that  Federal rules are grounded in reality and not bureaucracy. At its core,  this is about trust. It is about trust that government decisions are  fair, trust that agencies are transparent, and trust that the American  people come before politics.\n\nThe Information Quality Assurance Act reinforces…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700101/information-quality-assurance-act-of-2025"}]