[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…out of Texas. Access to high-quality information can  truly be the difference between life and death. Access to local news  from reporters and sources that community members trust is more  important than ever.\n\nStripping away this funding would also endanger local news that is  already disappearing in so many Wisconsin communities. In 2024--just  last…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…As a Representative of Ohio's 13th Congressional District, I  will keep standing up for our freedom, and I will keep working to  ensure our laws reflect our values.\n\nWe must trust women. We must protect our rights, and we must never  forget that democracy only works if we honor the will of the people.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…national ones.\n\nThat is ridiculous. We have made it clear: Let California take care  of Californians. If California had the power, the authority to set  those national standards, trust me, we would be doing this and a lot  more. But we don't.\n\nBut I think the good work that California has done that has  benefitted Californians--both our health and our economy,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…courts. There was  never evidence. There was the use of the Presidential power that he had  because he did have and does have many American citizens who believe in  him.\n\nWith the trust that he had with those everyday Americans, when they  heard their leader say that the election was stolen, understandably,  they believed him. When he said: Come to Washington;…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…conflict  that  could destabilize the Western Hemisphere and would put the lives of  American troops on the line.\n\nI rise because as we see this President abuse the fundamental trust  and purpose of our powerful military both abroad and here at home in  our own cities, it is imperative that we push back against his  relentless lawlessness.\n\nI have seen…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…is a testimony to the value of his  scientific contributions and to the curiosity, integrity, and  commitment to public service that define his work.\n\nAt a time when public trust in science is more important than ever,  Dr. Crotty stands as a beacon of integrity, innovation, and hope. His  tireless pursuit of knowledge continues to save lives and will…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…how he was going to  get North Korea. I support efforts to try to do that.\n\nIf we ever succeed in getting one of these deals, for sure we are  going to need to have experts we trust that can go in there and make  sure nobody is cheating. Unfortunately, what we are seeing is the  gutting of those budgets in that capacity. I guess it doesn't satisfy  the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…on all these crises, I have only a few minutes to  focus on one.\n\nMr. Speaker, from my very first conversations 9 years ago, when I  first asked my neighbors to place their trust in me to represent them,  to even just this weekend at the grocery store, I have heard from  parents, grandparents, and small businesses alike that the childcare  crisis is…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…is how democracies erode, and we will not allow  it.\n\nTrump wants America to believe that his cruelty makes us safer. It  does not. When communities live in fear, they cannot trust law  enforcement. When families are torn apart, our Nation grows weaker.  Real safety comes from stability, trust, and community, not fear and  force.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…and firefighters and police  officers, as well, who have been denied benefits. Now, while they are  eligible for them, they are not funded and so that money comes out of  the trust fund.\n\nPresident Trump has now proposed a tax cut for Social Security that  is unpaid for. That is over a $900 billion hit to Social Security and  all the constituents who…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…fiscal responsibility and say that there is no money for  healthcare, but somehow there is taxpayer money for Republican  Senators. This an ethics violation. This is a breach of trust, and it  calls into question the very legitimacy of this institution.\n\nMr. Speaker, I put forward an amendment to reject this corruption,  but  committee Republicans voted…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696698/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…emotional rupture: the       first time they have allowed themselves to name fear, grief,       trauma, and exhaustion out loud. We have worked       intentionally to build trust with Haitian families, often       in their own language, often through community       relationships, and always with deep respect for history,       culture, and faith. Over…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…officials.  While enforcing oaths of office is a big challenge, citizens must  demand truth from public officials in all that we do. And as public  officials, we must earn that trust by honoring our oaths.\n\nThe work of Judge Gregory Mize is exemplary in calling America back  to the bedrock quest for truth. We owe him a debt of gratitude.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…presenting them now with a reasonable compromise that the  majority leader can accept and our colleagues on the other side of the  aisle should embrace.\n\nThe problem here is one of trust. What we have seen from the  administration is a strategy of maximum pain to magnify political  pressure.\n\nIn just minutes from now, in the U.S. Court of Appeals for the First…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…healthcare. Sure, there are criticisms, and we need  to meet those criticisms. There are shortcomings, and we need to  improve VA healthcare to address those shortcomings. But VA trust has  increased to the point of 80.4 percent this year--an alltime record and  an increase of 25 percent since 2016.\n\nLet me just say about labor rights and union activities…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…return  on investment. I will always fight to provide certainty for the future  and to put more money back into your pockets as we step into the golden  age in America. In God we trust.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…constitutional and statutory  questions. She has also filed amicus briefs on behalf of Members of the  committee in very important cases. We trusted her judgment then, and we  can surely trust that judgment now.\n\nI am confident that Professor Mascott will make an outstanding judge,  and I know that she will serve the people of Delaware and the circuit  with distinction.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…Her efforts have directly contributed to the effective operation  of county government and have helped maintain the financial health and  transparency so essential to public trust.\n\nAs Ms. Krzysiak prepares to embark on her well-deserved retirement,  we commend her many years of dedicated service. We thank her for her  invaluable contributions to Crawford…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…support, including from  his law school, his coclerks, and his law firm colleagues.\n\nI am confident that Mr. Dunlap will make an outstanding judge on the  First Circuit. I also trust he will take great pride in serving his  State and our Nation.\n\nPresident Trump and Senator Collins made an outstanding choice in Mr.  Dunlap.\n\nEric Tung is another great selection.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…but she is pretty  comparable, giving me a run for my money on that banner.\n\nDebbie has also been a bridge builder and mentor. Even when factions  arise, Kansans continue to trust her leadership and count on her to  help bring people together. It is one of the reasons why she has made  such a phenomenal district director.\n\nThe staff in my office in Wichita…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…devastate our economy,  provide the funds to secure our borders, and provide for our defense in  a dangerous world.\n\nI am frustrated with the Senate numbers, but in DOGE we trust. I  think we can achieve a trillion dollars of savings as a result of its  work. The mass repatriation of millions of illegal aliens should save  another $150 billion. Restoring…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…ability to do this depends on the architecture. There is no  corporate headquarters, no CEO. It is really math and computer  programming.\n\nHow does this work? They establish trust in a different way. They  assume they trust no one. The transactions are approved in blocks. With  blockchain, that is the way it is done. It is done very securely.\n\nGovernments…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…weeks. I know we will all be just giddy to actually  read it and see what it says. If we look at last year's, it basically  said: In 2033, so 7 years, 8 years from now, the trust fund is gone. It  is empty. That is because every month Social Security gathers payroll  taxes and there is a shortage, so they take their special T-bills,  because they have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…to advance community-focused  initiatives such as the Police Social Worker Program, the Office of  Community Engagement, and expanded bike patrols, all of which  strengthened trust and collaboration between law enforcement and  residents.\n\nChief Mendez has devoted the past 25 years to keeping Lancaster safe.  I am extremely grateful for the positive impact…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Congress fails to do that job, the  consequences reach beyond Washington. The harmful impacts include  delayed services, uncertainties for families and businesses, and eroded  trust in government.\n\nOur recent progress stands in sharp contrast to where we were just a  few years ago. This body had not passed a single government funding  bill in this Chamber…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 2302) to take certain Federal land in the State of  California into trust for the benefit of the Shingle Springs Band of  Miwok Indians, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…mentioned in terms of forward-funding for Indian  healthcare. It has just been a pleasure in these areas where we have so  much in common and a common commitment to fulfill our trust  obligations.\n\nI, for one, am very proud of the community projects in this bill. It  allows the Members, not just on our committee, but across the entire  Congress, to do things…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…The American people  deserve to know that we are acting on their behalf, not for our own  portfolios.\n\nThat is why I have already begun placing all of my assets into a  blind trust, to align my conduct with the principles behind this  important reform.\n\nMr. Speaker, I thank Representatives Roy and Magaziner for their  bipartisan leadership on this issue.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sisters move into their earned benefit years, what it costs.\n\nThe fact of the matter is, this Congress refuses to do the hard  things because in 6\\1/2\\ years, the Social Security trust fund is empty  and you get a 24 percent cut in your check and we double senior  poverty. We double the number of baby boomers who will live on the  street.\n\nIn 6\\1/2\\, 7 years,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…materials and best practices and by conducting workshops and public  stakeholder sessions.\n\nUltimately, H.R. 1082 will increase public awareness, patient safety,  and public trust in these lifesaving medical products to help ensure  that preventable tragedies, like the unfortunate death of Ms. Eisenga,  do not ever occur again.\n\nThis bill passed the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}]