[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…rise today to express my support for the  Court-Appointed Special Advocates program, also known as the CASA  program, through the Department of Justice.\n\nAs a prior township trustee in northwest Indiana, I was involved in a  program that went into the schools to assist children who experienced  abuse and sexual harm. For survivors, having someone with…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690872/supporting-casa"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…professor of aerospace  medicine at the United States Air Force School of Aerospace Medicine.\n\nIn addition to this, he now serves as an active member of his  community, as a trustee for the John Randolph Foundation, and as a  member of the city of Hopewell's planning commission.\n\nHe helped establish a permanently endowed scholarship for  Chesterfield,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…career with the International Union  of Painters and Allied Trades (IUPAT) in 1982.\n\nIn 1992, Nelson began the first of numerous leadership roles, when he  was elected as a trustee for the Minneapolis Painters Health and  Welfare Fund and the Minneapolis Painters Pension Fund. He served in  several roles within IUPAT including as President of Local Union…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…admiration from those who know her.\n\nAs a faithful 73-year member of First African Baptist Church, Mrs.  Booker has held numerous leadership positions, including Deaconess,  Trustee, and Finance Committee Member, where she has demonstrated her  commitment to spiritual growth and community service. Her involvement  in various initiatives showcases her…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and  accomplishments of Omayra Andino, who this week completed two terms, or  and 4 years, as mayor of the village of Tuckahoe, with prior service on  the village board as trustee.\n\nMayor Andino, in her professional career, has shown executive skill  and leadership as CEO of the Institute for Applied Human Dynamics, an  organization that supports people…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Village of Skokie. Mayor Van Dusen has been a proud Skokie resident  since 1974, and it comes as no surprise that his engagement in the  community led him to serve as both a trustee and eventually mayor.\n\nMayor Van Dusen served as my predecessor, Congressman Sydney Yates'  Director of Suburban Operations from 1973 until Representative Yates'  retirement…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688871/recognizing-the-career-of-skokie-mayor-george-van-dusen"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…past decade.\n\nCorey was a devoted man of faith, a lifelong member of Rodman Street  Missionary Baptist Church in Pittsburgh, Pennsylvania, where he  faithfully served as a Trustee. His love for God and church was a  guiding force throughout his life. Family was at the heart of Corey's  world. He cherished his grandmother, the late Margaret Lucinda Sidney,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…Tanner worked closely with San Francisco leader, Harry  Bridges, to keep Black and White workers united during the strike so  employers could not break the union.\n\nHe was a trustee of Local 2897 from 1934 to 1936, where he pressured  leaders to pay Black dockworkers the same wages as their White  counterparts.\n\nErnest Charles Tanner passed away in 1956…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…serves as Volunteer Finance Chair, on the Pastoral Council and  as an Educator. Since 1985 he has been actively involved with Knights  of Columbus, Fourth Degree, and is a past Trustee. He lives the  Catholic Christian life of servitude. I am proud of Tom's lifelong  contributions to our community, and I wish him continued success for  many years to come.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Evaluator and later as Legislative Coordinator for  AFSCME District Council 47. She has held numerous AFSCME leadership  roles over decades--including Business Agent, Delegate, Trustee,  Steward, Legislative Coordinator, and Health & Welfare Fund Trustee and  has received substantial training in fiduciary responsibilities and  public employee benefit trusts.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Congratulating Jane Strain on Her Retirement\n\nMr. CISCOMANI. Mr. Speaker, I rise today to congratulate my dear  friend and Army veteran Jane Strain on a well-deserved retirement as a  trustee of Cochise College's governing board after an incredible 27  years.\n\nSince even before being elected, I have been lucky to have Jane as a  resource, and I have come to deeply…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…closely       monitored the funding needs of the bankruptcy system,       including by requiring periodic reporting by the Attorney       General regarding the United States Trustee System Fund.\n\n(3) Because the system governing bankruptcies of various       types is interconnected, Congress has established fees,       including filing fees, quarterly…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…recognize the need to succor. You said: Why are we  here? I am here because Anita said I needed to be here to recognize  Rabbi Berman. Anita is a fellow South Carolinian. She is a trustee at  Yeshiva University, and she has contributed to our State, to the values  that serve us in education, that bind us together. Anita called me  about you and she was dead…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…started even earlier--his family has proudly served in the  Newtown Fire Association since 1915. Service is in his blood.\n\nOver the years, Glenn has worn many hats--President, Trustee,  Battalion Chief, Safety Officer. At every level, he's brought steady  leadership, tireless work ethic, and a deep love for this community.\n\nBut Chief Forsyth's public service…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Agencies Appropriations Act, 1992 (43 U.S.C. 1474b).\n\n``(3) Outside account.--The term `outside account' means       any account outside the United States Treasury.\n\n``(4) Trustee.--The term `Trustee' means a Federal or State       natural resource trustee for the Exxon Valdez oil spill.\n\n``(b) Deposits.--\n\n``(1) In general.--Notwithstanding any other…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…or'' and       by inserting after clause (ii) the following new clause:\n\n``(iii) the entire amount received (including money and any       other property) is paid in a direct trustee-to-trustee       transfer to a designated Roth account (within the meaning of       section 402A)--\n\n``(I) from an eligible Roth IRA, or\n\n``(II) in an automatic portability…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…following, each acting in a formal       custodial or fiduciary capacity for the benefit of a third       party:\n\n``(i) An insured depository institution serving as agent,       trustee, or custodian.\n\n``(ii) A trust entity controlled by an insured depository       institution serving as agent, trustee, or custodian.\n\n``(iii) A State-chartered trust company…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…member, Kathryn Mandichak, for her years  of devoted service to the people of Mono County.\n\nKathryn has been a leader in the local community for over four  decades, serving trustee area 1 as a board member for 11 terms.\n\nKathy was born in Huntington Park, California, later moving to Mono  County with her husband and three children from Whittier.\n\nIn…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}]