[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "Some  stepped forward while hiding who they were, forced to choose between  their truth and their country.", "title": "Transgender Americans Serve with Honor", "date": "2025-07-21"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Here is another truth, Mr.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "The ACA tax credits exist because Congress recognized a simple truth.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Well, there is truth in that.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Madam Speaker, here is the truth.", "title": "Fiscal Year 2026 Ndaa", "date": null}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "The truth is, Madam  Speaker, our air is making us sick, and we have the power and  responsibility to do something about it.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "One place, though, that didn't get cut is ICE and Homeland Security  because this is an administration that wants his own personal militia  to go after folks who ask for the truth.", "title": "Better is Possible", "date": null}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The American  people deserve the truth.", "title": "American People Deserve the Truth", "date": null}, {"senator": "Al Green", "party": "Democrat", "sentence": "And by any name, I beg that You would understand and pray  that You would give me the courage to not only speak truth to power, to  speak it in a righteous way, to have the courage to do all that I can  to protect all of  Your creation.", "title": "Dark Days", "date": null}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Following her tragic death at the hands of law enforcement,  Republicans rushed to deny the truth and smear the victim, a playbook  that has been employed frequently, especially against the Black  community.", "title": "End Qualified Immunity for Ice Agents", "date": "2026-01-12"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "The truth is that the roadless rule protects us from wildfires; it  ensures clean drinking water for communities; and it sustains wildlife  habitat for wildlife and for sportsmen.", "title": "Cloture Motion", "date": null}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "This legislation affirms a simple truth: Foreign assistance is not a  charity.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "In court proceedings, where you actually need to tell the truth--as  opposed to in tweets and talk shows--the story that emerges is exactly  the opposite.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "They refused to tell the truth about January 6.", "title": "-9999", "date": "2026-01-06"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "It happens to be the truth.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Tim Sheehy", "party": "Republican", "sentence": "The truth is, this bill is pro-veteran.", "title": "Full-Year Continuing Appropriations and Extensions Act, 2025", "date": "2025-03-14"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "May we never forget the lives we lost, and may we  always honor them by standing for life, for truth, and for the  communities that we are blessed to represent.", "title": "Anniversary of Santa Fe Shooting", "date": "2025-05-15"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "I don't know who is telling the truth.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "We were taught: It takes a lot longer to build a lie than to  tell the simple truth.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "They are angry, in large part, because they realize one simple  truth: The Somali pirates are not in the Horn of Africa anymore.", "title": "Fraud in Minnesota", "date": "2026-01-08"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Judge Ginn's influence extended far beyond the courtroom, where he  not only delivered legal rulings but also mentored those around him,  always striving to instill truth and justice.", "title": "Recognizing Phil Ginn", "date": "2025-03-04"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "In its selection of Alternative D2, the Biden administration claimed  to be listening to the concerns of indigenous voices when this could  not be further from the truth.", "title": "-9999", "date": "2025-12-09"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Another national survey confirms the very same truth that 84 percent  of Americans want mandatory voter identification in Federal elections.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Every single day of the shutdown, we went out  and looked right into the camera with a press conference and told the  American people the simple truth.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "The growth of  debt, the drivers of debt, is the thing it is hard to tell the truth  about.", "title": "Stop Bathing in Folklore and Start Bathing in Math", "date": "2025-06-26"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "As to my colleague from Maryland's claim that this resolution is  somehow set up in a partisan way, nothing could be further from the  truth.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "It was a complete distortion field of the truth and what was going on  out there.", "title": "Turning Healthcare Into Financial Engineering", "date": "2025-12-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Is it just that we run into the problem of telling the truth to our  voters after maybe we have lied to them?", "title": "Facing Fiscal Reality", "date": "2025-11-20"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Are we going to tell  the truth about that?", "title": "Debt, Deficits, and Demographics", "date": "2026-01-21"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "That is the truth.", "title": "Fiscal Responsibility", "date": "2025-05-01"}]