[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "…are telling Main Street America: Take  us to court. They are choosing delay over relief and politics over  people.\n\nTonight, the President will stand in this very Chamber and try to  sell the American people on his economy. Working families don't need a  sales pitch; they need relief. They need honesty. They need their money  back--no more excuses, no…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…because  this really is not that complicated, and the American people aren't  stupid.\n\nThis Republican bill does not fix the healthcare crisis facing this  country. It doesn't even try. Instead, Republicans are going to raise  costs, weaken coverage, and deliberately allow the Affordable Care Act  tax credits to expire, knowing full well that millions of families…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…what happened to that person just  swept up off the street.\n\nThe family had to resort to pleading to the community and posting  these missing person posters on social media to try to find Mr.  Cisneros. This is the photograph that they were advertising, asking  people: Have they seen this man? Can you help us find our member of our  family?\n\nThey finally…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…was a bitter  lesson learned, particularly in time of war and strife, that there is a  need for countries, where there is peaceful situation, to step up and  do their part to try to help refugees, those seeking asylum.\n\nAfter World War II, the United States decided that the St. Louis was  a valuable lesson. We started leading the nations of the world…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Bent's Old Fort  National Historic Site in Colorado describing the forced removal of a  Native Tribe and a family's slave ownership.\n\nWhy? Why are they doing this? When people try to erase history, they  are often doing it because they want to shape the future. They want to  shape a future in which America does not honor the full diversity that  has made…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…gone, and I pray that they won't, it will be  another 2 years before we get an answer. These lines that have been put  in place will remain, and as a result, other States will try to respond  as best as they can to maintain some sort of equilibrium.\n\nCalifornia is responding to what Texas is doing. California did not  initiate; California is responding.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…circumference by its diameter. Many people approximate pi as 3.14 or  3.14159.\n\nBut the number is irrational and will continue infinitely without  repeating. If you were to try to write down the exact number for pi,  there would be infinite numbers to the right of the decimal point and  there would be no pattern. This means we're down to a mere infinity…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…education.  We have more than 80 colleagues on that resolution. I want everyone to  join us in signing that. Do not let them bulldoze our public education  system.\n\nThey are going to try to justify it by saying we have to return  authority to States and local school boards, but they already have the  authority. The Department of Education and the Federal Government…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…fighting to protect them because the CFPB  isn't just a watchdog. It is a lifeline.\n\nWe are not going to stand by while Donald Trump, Elon Musk, and their  billionaire buddies try to kill it.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689951/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…stand here as a Senator, yes, but also as  someone who has seen this movie in other places. I call upon the  administration to just be transparent. Just play it straight. Don't try  to distract us. Don't try to sucker punch us. Tell us what you are  doing in foreign countries, then get back to the work you said you were  going to do. Attack healthcare,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…last 6 weeks, I traveled around  not just my district but the entire Commonwealth of Virginia to talk  about the work that we are doing here in Washington as we headed back  to try to avoid a government shutdown in the next 28 days.\n\nFrankly, I didn't hear a lot about Jeffrey Epstein, although what  happened is very serious and the survivors do indeed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694882/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that they are keenly aware of the specific pitfalls related  to high-risk and illiquid securities, as well as the conflicts of  interest presented when financial professionals try to sell them these  products.\n\nLast year, committee Democrats worked with Former Chairman McHenry  and my colleague Mr. Flood to ensure that this test contained specific,  robust…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in other words, as a populist who promised to drain the swamp and  end inflation.\n\nBut Donald Trump is not a populist; he is a posturer. He throws out  these populist ideas to try to persuade people he is on their side, but  he never does anything to get them done. He never lifts a finger or a  phone. And the American people see that he talks a good game…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…reconciliation tax plan would have on Medicaid and  food assistance.\n\nWhy? To give permanent tax breaks to billionaires.\n\nWhat is the GOP's response this week? They are going to try and pass  a bill to rename the Gulf of Mexico to the Gulf of America on the week  that we recognize Cinco De Mayo.\n\nThis is the GOP's plan. This is the GOP's response, and this…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690663/skinny-budget-for-2026"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Flight 5342 were our neighbors, our coworkers, and our  loved ones.\n\nWe are forever grateful for the more than 300 first responders who  arrived almost immediately on the scene to try to rescue survivors.  Responding parties initially included Washington, D.C., Fire and  Emergency Medical Services, the Metropolitan Police Department,  Virginia State and municipal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…represent. We aren't elected to come up to Washington and get rich  while our constituents oftentimes struggle to make ends meet.\n\nI am here to serve the least amongst us and try my dadgum hardest to  make the lives of east Tennesseans better, Mr. Speaker. I don't sell  stocks. I have a mutual fund. I talked to my broker today, Tommy Siler,  and I am…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…about the truth.\n\nToday is a reminder that radical Democrats and the Deep State, they  don't like our country the way we run it too much, and they will do  whatever it takes to try to make the Republican Party and President  Trump look bad. Unfortunately, for them, the American people aren't  buying it. Mr. President, 77 million people came to the rescue…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…but  I will stop bombing infrastructure in Ukraine. He lied like he  breathed. He continued to destroy civilian infrastructure in Ukraine.\n\nThen President Trump said: OK. Let's try for a cease-fire in the  Black Sea.\n\nThat would benefit both Ukraine and Russia, both of which use the  Black Sea for maritime commerce. And, indeed, the world depends on a…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…guy.  I chair Oversight Subcommittee on Ways and Means, but I also chair the  Joint Economic Committee. I have a handful of Ph.D. economists that  work for the committee, and we try so hard to do intellectually honest  math.\n\nMr. Speaker, please don't tell anyone, but I am a dinosaur. I  actually believe in free markets. I actually believe in the elegance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…God knows what he has achieved is off the  charts. It is so good; it is unbelievable.\n\nToday what we see is, again, the Democrats grasping at straws, doing  stuff absolutely to try to make a scene. That is what this is all  about. For God's sake, President Trump was elected unbelievably-- unbelievably. Why in the world are we not moving on? Why in the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, we can't allow that to happen. Even though China  produces twice as much electricity as we do today, we shouldn't  discriminate against any energy source. We should try to produce as  much energy as we can so that we can win in that competition.\n\nBy passing this CRA, we are restoring the BLM's multiple use and  sustained yield mandate and preventing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…outlaw. This  job-killing regulation imposed by the Biden administration is yet  another painful example of the left's war on hydrocarbons.\n\nThe purpose of this regulation is to try to single out and eliminate  an American manufacturer of noncondensing tankless water heaters.  Effectively, the Biden administration and the government were trying to  alter…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…agreement that we are going to, as the  House, hip-check the Senate for having put a provision in there that we  disagree with, my colleagues on the other side of the aisle want to try  to make this a partisan issue when, in fact, Senate Democrats were  equally involved in making sure that this provision got inserted. In  fact, they were very specific about…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…responsibility. It was a targeted, ideological attack on  organizations that provide a real alternative to abortion.\n\nDemocrats say choice, choice, choice over and over, but they try to  deny women the choice to choose life.\n\nH.R. 6945 codifies the operations of TANF to ensure this funding  stream remains focused on its mission, helping needy families and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…are on their wait list. However, the teachers at  those schools are not automatically unionized as a matter of default.\n\nThat is what inspired Gavin Newsom and his enablers to try to enact  and, indeed, succeed in enacting an anti-charter school agenda. Because  TFA placed almost 50 percent of its teachers in charter schools, they  got caught up in it.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…it seems these days as if Democrats love to hate  anything that Republicans--and particularly President Trump--suggest or  propose or do, especially when it comes to ways to try to shrink the  size of our government and rightsize bloated Federal programs.\n\nThey have spent a lot of time and energy catastrophizing about all  the supposed dangers of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that in the  election. He is making very significant strides in that regard.\n\nAnd to my good friend Senator Sanders, this is not helpful to the  activities that are going on to try to get this resolved. You may think  you know what is going on, but I can guarantee with absolute certainty,  you do not know what is going on as far as the negotiations are…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our colleagues on the other side of  the aisle not want to stop it? Could it be for political reasons? Could  it be that they want non-Americans to be in the United States to try to  transform America and to politically motivate and to politically put  Democrats in power? Could that be?\n\nI don't want to be so cynical as to speculate here on the House…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…in. Meanwhile, natural gas demand has  increased by 49 percent. Do that math.\n\nThis trend will be compounded if there are not statutory reforms. It  is absolutely dishonest to try to blame LNG for this. America can't run  without energy, Mr. Speaker. Like it or not, a lot of that energy comes  from natural gas.\n\nListen to this. When we stopped building…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are not making as much money  as other Americans.\n\nThis woman did not seem to realize that one of the reasons that  people sometimes make less money is because they shouldn't try to  improve their lot in their employer's company because, if they improved  their lot, they would lose some of these 90 benefits.\n\nMr. Speaker, a question is: Is this a penalty…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}]