[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "It is in a beautiful building,  and it served the function of trying to bring people together.", "title": "United States Institute of Peace", "date": "2025-12-04"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "If Secretary Hegseth continues to conceal the truth, then what  exactly is he trying to hide?", "title": "All Senators Briefing", "date": "2025-12-15"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "That is what we have been trying to get over in  this country.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "We  were trying to help the people of Venezuela.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2025-12-17"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Every night, those families are sitting around their kitchen tables  trying to figure out how to pay for childcare so they can get to work.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "It is obvious to the American public  that someone is lying, and someone is trying to hide something.", "title": "Release the Epstein Files", "date": "2025-07-16"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Yet, Republicans are trying to ram through their disastrous budget  poised to gut Medicaid and threaten healthcare for one in four Rhode  Islanders.", "title": "I Stand with the Disability Community", "date": "2025-05-15"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "The descriptions of the survivors are worth spending a day just  listening to and trying to understand what is at risk here.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Grassley and  I are trying to do the same thing today by introducing the Trade Review  Act of 2025.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-04-03"}, {"senator": "Al Green", "party": "Democrat", "sentence": "There is a tragedy  associated with racism as it relates to trying to prove it.", "title": "Bloody Sunday and Voting Rights Act", "date": null}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Meanwhile, Russia has expressed an interest in maintaining New START  restrictions on its stockpile for another year while the terms of a new  treaty can be hashed out, but, unfortunately, the White House has not  responded to their offer, and it has shown no interest in engaging with  China either on nuclear arms reduction, this despite the danger China  is dramatically trying to build up its nuclear arsenal.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Compounding the problem, the Federal Election Commission has too often  failed to enforce the law, leaving voters vulnerable and unable to  discern who is trying to influence them and why.", "title": "Citizens United 16th Anniversary", "date": "2026-01-21"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Speaker, where are their investigations into the Director of the  Federal Housing Finance Agency, Bill Pulte, who is weaponizing the  housing finance giants Fannie Mae and Freddie Mac for politically  motivated witch hunts and trying to lock new home buyers into 50-year  mortgages?", "title": "Hud Transparency Act of 2025", "date": "2025-12-01"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Back then, Senate Armed Services Committee Chairman John McCain  and I were trying look at how we could encourage the most qualified  individuals of all backgrounds to volunteer for military service.", "title": "Act. Back Then, Senate Armed Services Committee Chairman John McCain", "date": "2025-03-25"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "They are cutting $1 trillion  out of Medicaid, and they are trying to fill that gap with $50 billion.", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Effectively, the Biden administration and the government were trying to  alter the market on their own by picking winners and losers, which is  something that consumers should do, not unelected nameless bureaucrats.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "He is a conservative county executive, and he is trying to hold down  the spending on the county level, and here the people in Washington are  talking about encouraging more State and local taxes.", "title": "Tax Cuts and Credits", "date": "2025-05-07"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I'm trying to help folks understand the reality  of what your Federal Government is.", "title": "United States' Fiscal Situation", "date": "2026-02-04"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "What the President is trying to do is make government more efficient.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "This is another of many attempts that have been made to stop the  efforts of President Trump and his Cabinet and the rest of the  administration in downsizing our bloated bureaucracy and trying to  bring a little bit of control to the amazing growth of our Federal  Government without causing the damage that is always alleged that is  being done.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "James Risch", "party": "Republican", "sentence": "I myself and others have long been trying to put a stop to  this.", "title": "-9999", "date": "2025-04-29"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Speaker, that was over a decade ago, but the Democrats on the  committee insisted that the witnesses were wrong and that Republicans  were merely trying to scare the American people.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The SWAT team was called in to help distract the  suspect, one being Officer Pastore, who was trying to rescue the  victims.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "I am not trying to put down anybody.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "3486 will help discourage the most dangerous criminals       from trying to enter, or re-enter, our country by increasing       severe criminal and financial penalties.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Speaker, I am going to say before I start, before I explain to  this body why I am introducing this resolution, when I was a journalist  covering stories for Univision Network, I interviewed many people who  had lost their legs or lost their brothers or sisters in the middle of  the ocean, trying to get to Miami, and the sharks ate them up.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "For  over 7 years, I have been trying to stop this.", "title": "Central Bank Digital Currency", "date": "2025-06-26"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "It is somewhat boggling to the mind that almost every Republican  Senator believed there was a war when a few soldiers were shot at in  Gaza trying to build a pier.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Speaker, one of the reasons I am sort of stressed out of my mind  right now is more than the chaos we see in some of the financial  markets and trying to understand the tariff issues and our leverage on  other countries and their leverage and what is going on there.", "title": "It's the Math", "date": "2025-04-07"}, {"senator": "John Thune", "party": "Republican", "sentence": "And it seems  to me, at least, if you want to address the concern that has been  raised by the Senator from New Mexico about Senators trying to get  hundreds of thousands of dollars out of the Justice Department and the  Federal Government--taxpayers--this would address that by simply saying  anything that is awarded--a settlement that is awarded under this  statute--would be forfeited to the U.S.", "title": "Unanimous Consent Requests", "date": "2025-11-20"}]