[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…States because we weren't there at all because  the three people we sent to assess the damage to see what we needed to  do to help were fired while they were in Myanmar trying to figure out  what we can do to help that situation.\n\nSo China's image is being bolstered at our expense.\n\nAcross Africa and Latin America, Chinese Ambassadors are giving  interviews…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…office as the most powerful human on planet Earth as the President of  the United States. Rather than thinking about balancing the budget,  addressing economic free-fall, trying to figure out what to do with our  foreign adversaries, how to help the American people, engaging in the  debate on how to save healthcare for millions of Americans, or making…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…today speaking on behalf of my constituents in southern  Arizona and those throughout the Nation. I am here for the parents that  are going through their monthly budget trying to figure out what they  can give up just to be able to pay for these premiums. I am speaking  for those who have the horrible feeling in the pit of their stomachs  because they…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…displacing Palestinians  from their land. You know, the leaders of Israel have explicitly stated  their vision for Gaza.\n\nSo this is not like a discussion or a debate trying to figure out  what is the story. Prime Minister Netanyahu said: I don't care about  the tactics and ordered military officials to ``destroy the homes, bomb  everything in Gaza.''…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…stretch into weeks and then stretch into months  when it comes to healthcare for hardworking families.\n\nEvery night, those families are sitting around their kitchen tables  trying to figure out how to pay for childcare so they can get to work.  They are trying to figure out how they can pay their rent so their kids  have a safe place to grow up. They are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…I was part of the sandwich generation, trying to  raise two children and deal with elderly parents nearing the end of  their lives. It was while I spent a lot of time trying to figure out  how we were going to close the insurance gap so that no one would face  a couple of scenarios that I was lucky enough to have health insurance  to cover, but a lot…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…washers, and  air-conditioners. This labeling fiasco, I just don't understand why you  think it is important for families to have less information just when  they are trying to figure out what appliance to buy.\n\nIn contrast, the Democrats, over the past few years, have really been  focused on lowering the cost of living and passed very significant cost…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and,  yes, managing the student loans and Pell grants that students need to  afford an education, just like I did when I was graduating from San  Fernando High School, trying to figure out how I was going to be able  to pay for college.\n\nYet Linda McMahon and Republicans in Congress will try to sell us on  the idea that education should be left to States…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…from the great State of Ohio,  Representative Shontel Brown, who hopefully will be joining us.\n\nAlong with some of our other colleagues, she is in her committee  hearing, trying to figure out if Republicans  will stand up with the American people and vote down so many of the  disastrous proposals that are being brought up in these various  committees as…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…to the people who don't.\n\nPeople who are just struggling to get by are having precious  resources taken away from them.\n\nRight now, across this country, Americans are trying to figure out  the math. Are they going to be able to afford groceries for their kids?  They are trying to decide whether they can afford to go to the doctor.\n\nWhile that is happening,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…are too expensive. Everything the Republicans and the  President have done has made life harder. It has made going to the  grocery store like a military exercise. We are trying to figure out  what we can buy.\n\nTo add insult to injury, we should be working together on legislation  that will help our neighbors back home. What bills do the Republicans  bring…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…not be able to help anyone if Trump and Musk  are successful in shutting them down.\n\nMs. WATERS.  Clark), the Democratic whip.\n\nMr. Speaker, I am having a hard time here trying to figure out what  is going on in this country. We are here taking up all of this time  talking about $5 and talking about trying to limit the fees that people  are being charged.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…food. It would be one thing if they were getting 25  bucks a day for food, but they are getting 6 bucks, and 5 million  people will now have an enormously difficult time trying to figure out  just how to survive the day--and I mean that quite literally, survive  the day--to find the calories within their $6 or $8 or $12 budget.\n\nFinally, people are going…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Massachusetts, it is December 23. That is the last day, and people  have to send in the check to cover. It is 2 days before Christmas. Can  you imagine 22 million families all trying to figure out how they are  going to write that check for a dramatic increase in their healthcare 2  days before Christmas? That is what the Republicans are setting up  across our…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…craziness you hear behind these microphones is anything  they can say to keep you from focusing on the fiscal reality of what is  going on in our country.\n\nWe have been trying to figure out how to express some of this, so I  am going to do it in a couple of different ways.\n\nOver the last 12 months, receipts have grown 10 percent. Spending is  up 4 percent.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people who get--the insurance  companies that get the subsidy that only as--our model is 38 percent of  that subsidy actually ends up going into healthcare. We are still  trying to figure out where the hell the rest of the money went.\n\nHave we lost our minds? Why is it so much easier to just keep  borrowing money and borrowing money and borrowing money…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…as opposed to the bait and switch.\n\nMr. Speaker, this is what American Government should be all about and  why I am proud to work with the President every single day, trying to  figure out how we actually reduce the size  and scope of the government and how we reduce costs so you have more of  your own money in your own pockets. You earned it, after…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…into the military to make sure that we are sustaining a lethal force  moving forward. That is our goal. That is as American as you get, and  it is not a partisan issue.\n\nTrying to figure out which news agency should be advertised on, based  on your idea of what the truth is, is really a side-note argument that  should be kept in this room, not on the political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about $82,000 a second next year. This is hard for people  to accept, but it is the math. Over the next 10 years, the baseline  borrowing was about $22 trillion. We are trying to figure out how to  extend the expiring tax provisions. We have the requests from the White  House. We have other disasters and things we are trying to cover.\n\nWe are basically…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in the  economic literature. Tell the truth about the math.\n\nNational health expenditures as a percentage of GDP--remember, a  couple of moments ago, I told you we are trying to figure it out. We  just got another report that we expect the growth of healthcare  spending to pop almost 3 percent more than modeled. That is a lot of  money. Here is the punch…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…know that we  can move these bills that are important in our communities and in our  regions and they don't get taken hostage, if you will, by the other  body as they are trying to figure out how they gain leverage over  something else here. That is not fair to the constituents that we  represent. That is not fair to the lawmakers who are working very hard…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…giving a little bit of  an excuse. Saying that makes it so it is not Democratic or Republican;  it is just math. At Home, I represent the Scottsdale-Phoenix area. I am  trying to figure out what is going on in our brothers and sisters on  the left's heads.\n\nI get it. They are cranky. As a former Senator that I sat next to  from my State was sharing with…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senators in the future--I think there is a  willingness to be able to address that.\n\nBut I think, again, the suggestion that this is a bunch of U.S.  Senators who are trying to figure out a way to enrich themselves at  taxpayers' expense just is completely, completely unfounded and is  inconsistent with the facts.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Madam Speaker, I have a fixation that we tell the truth and sort of  get an understanding of some of the math. One of the most difficult  things is that we have been trying to figure out how do we make sure we  preserve our promises.\n\nWe owe a promise for Medicare. We owe a promise for Social Security.  We have to deal with the reality that, in less…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…expire in just a  few weeks.\n\nNow, he knew that they would expire. As he told me in our  conversation we had this week, he said he knew they were temporary, but  now he is trying to figure out what to do to find affordable healthcare  options for himself because his healthcare is going to go up about $500  a month. That is an enormous amount.\n\nAnd his frustration…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}]