[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…millions to stop lifesaving reforms while my  friend Congresswoman Gabby Giffords continues to fight for commonsense  gun laws so that tragedies like that mass shooting in Tucson never  happen again.\n\nNowhere is this corruption more visible than in the White House,  where policy decisions are increasingly shaped by the interests of  wealthy donors and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…into play.\n\nMr. Speaker, Congresswoman Grijalva is a native Tucsonan, the  granddaughter of a bracero who came here from Mexico. She is the  youngest woman ever elected to the Tucson Unified School Board, serving  20 years, then a Pima County supervisor, fighting for working families,  affordable housing, and early childhood education. She brings that same…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…extraordinary southern Arizonan, Rose Taulton, recently named Volunteer  of the Year by Southern Arizona Volunteer Management Association.\n\nRose is truly the heart of volunteerism in Tucson. In 2025 alone, she  logged more than 1,000 hours of service, positively impacting over  5,000 people across our community.\n\nThere are few people I see more often at community…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699984/recognizing-rose-taulton-volunteer-of-the-year"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…veterans in need to get  answers?\n\nAnother Arizona family reached out to my office, afraid to speak out  publicly because of fear of retaliation. The husband is a doctor at the  Tucson VA. He treats patients with lung disease. But last week he got  an email--not a meeting, no conversation--just an email telling him to  resign. Is that who Secretary Collins…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…mark a solemn anniversary.\n\nFifteen years ago today, Congresswoman Gabrielle Giffords was doing  her job, holding a ``Congress on Your Corner'' event at a grocery store  in Tucson, standing outside in the January sunshine, listening to her  constituents, figuring out how she could help them.\n\nThen the unthinkable happened. In an instant, this moment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…justice  giant, Congressman Raul Grijalva.\n\nRaul's story is the American Dream. He was the proud son of a bracero  cowboy from Mexico who went on to become the president of the Tucson  Unified School District Governing Board, chairman of the Pima County  Board of Supervisors, an 11-term Member of the United States Congress,  and the dean of the Arizona delegation.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688943/in-memory-of-congressman-raul-grijalva"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…event  organizers expect up to 25,000 police officers from around the country  to be in attendance.\n\nAmong those honored and remembered will be Officer Adam R. Buckner of  the Tucson Police Department, Officer Joshua Briese of the Gila River  Police Department, Detective Ryan So of the Scottsdale Police  Department, and Officer Zane Tristan Coolidge of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Emerita, Senator Mark  Kelly, the Arizona delegation, and to all of my colleagues who are  present here today, I rise on the 15th anniversary of the tragic mass  shooting in Tucson, Arizona, that took 6 lives and injured 13 others,  including our former colleague, our good friend, Congresswoman Gabby  Giffords, an extraordinary American leader who I am…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be RTX Corporation, located       in Tucson, AZ. At this time, the U.S. government is not aware       of any offset agreement proposed in connection with this       potential sale. Any offset agreement will be defined…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692629/arms-sales-notification"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…school. Go Scorpions.                Congratulating Lawrence W. Cross Middle School\n\nMr. CISCOMANI. Mr. Speaker, I rise today to congratulate Lawrence W.  Cross Middle School in Tucson for receiving an A+ School of Excellence  Award by the Arizona Educational Foundation, the highest State-level  recognition given to a public school. Go Rams.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "James Risch", "party": "Republican", "sentence": "…support will not       alter the basic military balance in the region.\n\nThe principal contractors will be the Javelin Joint Venture       between RTX Corporation, located in Tucson, AZ, and Lockheed       Martin, located in Orlando, FL. At this time, the U.S.       Government is not aware of any offset agreement proposed in       connection with this…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…reassigned to Myrtle Beach AFB, South Carolina,  where she continued lab work and had her first child. After the base  closed in 1992, she transferred to Davis-Monthan AFB in Tucson,  Arizona. There, she served in leadership roles, completed a Community  College Air Force (CCAF) degree, and enhanced pathology specimen  operations. Following the birth of…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be RTX Corporation, located       in Tucson, AZ. At this time, the U.S. Government is not aware       of any offset agreement proposed in connection with this       potential sale. Any offset agreement will be defined…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690571/arms-sales-notification"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…communities best and targeted at the issues that matter to our  communities the most.\n\nThis bill supports, for example, community safety vehicle fleet  modernization so that Tucson's first responders have reliable vehicles  when every second counts in their line of work. It also includes  funding for the Sahuarita Police Department radio replacement,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…CISCOMANI. Mr. Speaker, I rise today with the unique opportunity  to say congratulations to the fifth and sixth grade Team Army flag  football team for winning the Northwest Tucson Under the Lights spring  championship, a team that I had the pleasure and the privilege of  coaching.\n\nThe spring season was our third undefeated season in a row and the  second…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…degree in management from Embry- Riddle University.\n\nWhen he retired from the military as a Colonel, Mark served as the  Director of Strategy for Raytheon Missile Systems in Tucson, Arizona.  In 2010, he and his family moved to Texas, where he became the Program  Director of Tactical Intelligence Systems for Raytheon. In this role,  Mark oversaw hundreds…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}]