[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of power beginning in 2026--that is next  year--powering 350,000 homes, a project well underway before the  Trumped-up energy emergency.\n\nForty-five of the planned 65 wind turbines were already installed  when the Trump administration, just months ago in late August, issued a  stop work order, grinding this project to nearly a complete halt--men  and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…There was a time where it was gas, but the cost of gas keeps going  up and up and up, for a couple of reasons--because we are exporting a  lot of our gas but also because the turbines needed to convert natural  gas into electrons--there is a huge backlog of them.\n\nSo we have an industrial renaissance happening in certain States, and  we have all of this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Department of War.  It is the war on the environment. Perhaps that is what this is all  about from my Republican colleagues: the war on the environment. No, we  shall not have wind turbines that actually are efficient, effective,  and competitive in providing electrical energy. My goodness, we  certainly shouldn't buy any vehicle that might be electric because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…a 6-year gap before any of those other technologies are  ready. So a lot of fossil advocates go: Well, why don't we do more gas?  There is a backlog of combined-cycle gas turbines, and that can't just  be fixed by saying: ``I will take more.'' Everybody wants more. There  is a backlog. You cannot get gas generation online in the next 5 years.  So what…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…but it is fastest to deploy. The average solar project can be  built in 15 to 17 months. A natural gas plant often takes 4 years or  longer. Gas turbine shortages mean new turbines may not be available  until the 2030s.\n\nSolar and wind growth outpaced global demand growth in the first half  of 2025, with solar alone meeting 83 percent of global electricity…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…on Revolution Wind, a nearly  complete offshore wind project off the coast of Rhode Island. This  project is 80 percent constructed, with over $5 billion invested and 45  turbines already installed in the Atlantic Ocean. It supports more than  1,000 local union jobs and is poised to deliver enough low-cost energy  to power 350,000 homes in Rhode Island…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…which came out of the blue from the administration. This was a  project then with about $4 billion of investment already expended and  north of 80 percent complete--a lot of turbines fully complete out  there.\n\nAnd that order was without any lawful basis. As a result, the order  was challenged in court. And in court, the Federal judge said: You can  put…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…During the televised gathering, he veered off topic and rambled on  one of his pet peeves, wind power. In addition to his usual complaints  about how aesthetically ugly wind turbines are, he added another new,  startling criticism to his repertoire, mainly that Europe and the U.S.  are suckers for allowing China to sell us wind turbine parts while at…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…that has been in the  works for 9 years.\n\nThe developers of this project have invested close to $4 billion,  employed thousands of workers, and installed 45 out of 65 wind turbines  that the Federal Government permitted in 2023.\n\nAs of August 22, 80 percent of the project is complete, and 100  percent of the turbine foundations have been placed on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…voted it down.\n\nHere is the dirty little secret that everyone in the energy industry  knows right now, but Republicans are glossing over: There is a critical  shortage of gas turbines. That means the cost of gas plants is already  facing inflationary pressures. Those inflationary pressures, who are  they passed on to? They are passed on to consumers back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…subsidies.\n\nAs if that isn't compelling enough, there are yet more reasons to  phase out these subsidies.\n\nNumber eight, their efficiency has increased substantially. Today's  wind turbines and solar panels are far more productive than they were  even a decade ago.\n\nWhen I first started permitting these projects 12 years ago, the  capacity factor for wind was…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and  bottlenecks for key grid components, such as distribution transformers  and natural gas turbines, can stifle infrastructure development.\n\nBy establishing periodic assessments under this legislation, the  Department will remain in a proactive posture to identify and address…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}]