[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…cosponsor and colleague, Mr. Moran of Texas,  for his leadership and for working with me on this important  legislation. I also thank the gentleman from Texas for the smoked  turkey he sent to several members of our committee.\n\nThe Tax Court has a very important impact on everyday Americans. It  provides individuals and businesses with an opportunity to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…who has  ``made an exceptional contribution to affirming life's spiritual  dimension, whether through insight, discovery, or practical works.''\n\nBorn in current day Gokceada, Turkey, His All-Holiness received his  undergraduate degree at the Theological School of Halki and completed  graduate studies at three universities in Italy, Switzerland, and  Germany.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Constantinople and Ecumenical Patriarch, as  he visits the United States to receive the Templeton Prize.\n\nBorn Demetrios Arhondonis on the island of Imvros, known today as  Gokceada, Turkey, Patriarch Bartholomew was elected the 270th  Archbishop of Constantinople and Ecumenical Patriarch in October 1991.  Today he leads a community of 300 million Orthodox Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Archbishop of  Constantinople-New Rome and Ecumenical Patriarch, His All-Holiness  Bartholomew.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness Bartholomew was elected in October  1991 as the 270th Archbishop of the 2000-year-old Church founded by the  Apostle Andrew. His formal office is Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Apostle Andrew.  He holds the historic title of Archbishop of Constantinople-New Rome  and Ecumenical Patriarch, a position that dates back to the sixth  century. A citizen of Turkey, he studied in Imvros, Istanbul, Rome,  Switzerland, Munich, and Athens, where he earned his doctorate in Canon  Law and helped found the Society of Canon Law of the Oriental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, on an unrelated issue, last week, families  gathered around the table to give thanks and enjoy a plate or two of  turkey, mashed potatoes, casserole, cranberry sauce, and more. Except,  this year, the Thanksgiving feast cost more than last year--because of  what? President Trump's economic policies…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…growing  congregation.\n\nIn the decades that followed, Reverends Ron Johnson and Glenn  Reynolds deepened the church's community engagement through programs  such as the Great Turkey Giveaway, Christmas Toy Giveaway, and weekly  Community Dinner. These initiatives have benefitted countless families  across Hampton Roads.\n\nToday, under the leadership of…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…this young man has documents to prove who he  is.\n\nIt is about a teenager in Willmar, MN. Willmar is a smaller regional  center in Minnesota. It is place where the Jennie-O turkey processing  plant is. It is an incredible community.\n\nHere is a teenager in Willmar who is stopped by ICE. She is beaten.  She gets a concussion, and she is detained for 2…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…holiday cost, on average,  7 percent more than last year.\n\nTake my favorite side, stuffing. A box of stuffing mix has soared by  double digits. The centerpiece of many tables, turkey, is up 7 percent.\n\nIt is not just Thanksgiving food. Grocery prices are up. Families of  four are spending more than $1,000 on groceries each month.\n\nAmericans simply cannot…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697059/increasing-costs-of-thanksgiving"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…question, then, was how Trump       would respond. Would an outsider president who considered       himself to be under unwarranted assault lash out, as happened       in Peru and Turkey?\n\nPresident Trump exhibited clear authoritarian instincts       during his first year in office. In Chapter 4, we presented       three strategies by which elected authoritarians…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…ultimately be influenced by the       whims of foreign powers, who have increasingly spread their       influence in Libya.\n\nFor the Government of National Unity, this includes Turkey,       which deployed personnel and drones among other assets to aid       the Tripoli-based administration against the Libyan National       Army's advances in 2020. Ankara's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…his commitment to peace, his see, and the  millions of Orthodox Christians in the United States.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness Bartholomew was elected in October  1991 as the 270th Archbishop of the 2000-year-old Church founded by the  Apostle Andrew. His formal office is Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…lethal attack on  civilians in Sudan. But more needs to be done.\n\nCease-fire after cease-fire has failed. Peace negotiations have  stalled, and outside countries--the UAE, Turkey, Iran, as well as  Russia and China--continue to send weapons to the factions. Why? Well,  because Russia doesn't want to give up its port access to the Red Sea,  China doesn't…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Andrew and his brother  Peter each established distinct spheres of Christian influence. The  Apostle Andrew established his ministry in the region that encompasses  present-day Turkey, and Ecumenical Patriarch Bartholomew stands as the  269th direct successor of the Apostle Andrew. Similarly, the Apostle  Andrew's brother the Apostle Peter traveled to what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Carter", "party": "Republican", "sentence": "…to service.\n\nOn active duty from 1973 to 1997, Lt. Col. Smith served in various  locations around the globe, including Quantico, London, Brussels, Hong  Kong, Australia, and Turkey. In 1990, Lt, Col. Smith was deployed to  Kuwait in support of Operation Desert Shield/Desert Storm He played a  critical role in contingency operations in Beirut, Lebanon,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…look  like? Well, we had whole milk for breakfast and for lunch and for  supper. We had bacon and eggs in the morning. For lunch, we would have  one of the other proteins: turkey or chicken or ham--but vegetables  from our garden. That was it. Fresh vegetables, and we had, I think,  four or five different fruit trees: a pear tree, a peach tree, several…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Once  deployed, he assumed the role of Chief of Staff for the Multi-National  Division (North), leading a diverse team of officers from over ten  nations, including Russia, Turkey, and Norway.\n\nCOL Patterson's distinguished military service earned him numerous  accolades, including the Legion of Merit with oak leaf cluster, the  Army Commendation Medal…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on an island in Turkey, His All- Holiness Ecumenical Patriarch Bartholomew pursued theological studies  in Rome, Switzerland, Germany, and Greece before joining leadership  within the Church. He…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Uyghurs and       Uyghur activists;\n\n(5) it is commendable for countries to provide shelter and       hospitality to Uyghurs and other minority group members in       exile, as Turkey, Albania, and Germany have done;\n\n(6) urges all countries, especially fellow democracies and       those with sizeable Muslim populations, to condemn and       address the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…members):\n\nUnited States: 2,461; United Kingdom: 457; Canada: 159;       France: 90; Germany: 62; Italy: 53; Poland: 44; Denmark: 43;       Spain: 35; Romania: 27; Netherlands: 25; Turkey: 15; Czech       Republic: 14; Norway: 10; Estonia: 9; Hungary: 7; Sweden: 5       (partner at the time); Latvia: 4; Slovakia: 3; Finland: 2       (partner at the time); Portugal:…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]