[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…he  needed. Through her network, someone suggested that she call DARTS, a  community-based organization serving caregivers and older adults in  Minnesota. That call was a turning point for Ann and her father. She  went on to join the Board of Directors and ultimately became President  of the organization in 2015.\n\nDuring her 10 years as President, Ann…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bill.\n\nMrs. WATSON COLEMAN. Madam Speaker, I thank my colleague for  yielding.\n\nMadam Speaker, the signing of the Declaration of Independence on July  4th, 1776, marked a turning point not just in our Nation's history but  in the global pursuit of democracy and self-governance. The work  remains unfinished, and each generation has been tasked with carrying…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…such thing, but  that was then.\n\nBut hide or not, the blame will lay squarely on my Republican  colleagues for the impact of what is done here tonight because tonight  is a turning point, a moment in which the majority gave up yet another  guardrail, where they chose to go nuclear, to violate the filibuster,  to overturn the Parliamentarian in order to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Saratoga  National Historical Park as the Saratoga National Battlefield Park.\n\nThe site in Stillwater, New York, marks the location of a critical  pair of battles known as the turning point of the American  Revolutionary War.\n\nAmerican forces defeated the British in the Battle of Saratoga in  October 1777, which the National Park Service notes renewed the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the most effective tools we have to reduce nuclear risk while  maintaining a credible deterrent.\n\nThe expiration of New START without a successor would mark a  dangerous turning point, signaling that restraint and verification no  longer matter.\n\nThis Special Order hour is about sounding the alarm, but it is also  about reaffirming that Congress has…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…in the city's history.\n\nLyman Parks holds a special place in our history as the first and  only Black mayor of Grand Rapids. His leadership throughout the 1970s  marked a turning point for the city, proving that Black leaders could  and should have a seat at the table in shaping the future of our  communities.\n\nIn 2003, Parks was awarded the GIANT Among…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…his own struggles with addiction. Together, these two men  founded Haymarket House, which would go on to become Haymarket Center.\n\nThe opening of Haymarket Center was a turning point in Chicago's  approach to addiction treatment. In thinking about the mission that  inspired these two men, I am reminded of something Father Mac would  say. ``The Master…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…I honor Alexander Drabik, from my own district. He was a great  soldier who was in the Army and was the first man to cross the Remagen  Bridge in Germany, which was the turning point of the war.\n\nFinally, I honor Roger Durbin, a veteran of our Army who gave me the  idea to create the World War II Memorial here where now over 100  million people have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Hamas fighters crossed into Israel by land, air, and sea, killing  around 1,200 people and taking more than 250 Israeli and foreign  hostages.\n\nOctober 7 will forever be a turning point in history.\n\nAs we reflect on the events of that day and the 500 days that have  followed, it is imperative that we also recognize the broader  implications of this attack.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Strengthening America's       Turning Point Act''.       SEC. 2. SARATOGA NATIONAL BATTLEFIELD PARK.\n\n(a) Redesignation.--Saratoga National Historical Park shall       hereafter be known and designated as ``Saratoga…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…troops capitulated--the largest surrender of German forces  at that point in the war. The following day, Adolf Hitler's death  marked the collapse of the Nazi regime--a turning point made possible  by the military operations comprising the Italian campaign.\n\nThis resolution acknowledges the tremendous and significant cost of  the Italian campaign, with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…effective teacher--I repeat, a  teacher--of young people. He helped educate millions of young Americans  about patriotism and conservative moral values.\n\nHis organization, Turning Point USA, is largely credited with  President Trump's unprecedented success with young voters in this past  election.\n\nBut he didn't just reach out to conservative students.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for ice hockey       in the United States. The game was named the greatest sports       moment of the 20th century by Sports Illustrated.\n\n(9) The historic win brought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…first year of sustained peace since gaining its independence. With  the assistance of the American President, the end of the Armenia- Azerbaijan conflict promises to be a turning point for the region.\n\nI ask my colleagues to join me in commemorating the events of Black  January in Azerbaijan and honoring those who lost their lives in  pursuit of freedom.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…professionals in order to try and keep their positions. Many didn't.''\n\nYou can read the rest of that article on the Florida Today website.\n\nI will continue by saying, we are at a turning point, a moment when  we must ask ourselves: Do we want a government to serve the people  efficiently, or do we want a bureaucracy for the sake of bureaucracy?\n\nThat is the question…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Appalachian  Virginia but felt across the globe.\n\nThe first FAA-approved drone delivery was not merely a feat of  aviation--it was a profound act of compassion. It marked a turning  point in how we approach health care access for those living in rural  communities. For areas long burdened by limited infrastructure and  geographic barriers, this moment offered…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I thank Chairman Westerman for yielding me  time.\n\nI rise today in support of my legislation, the Strengthening  America's Turning Point Act.\n\nI am always proud to share with my colleagues in Congress and with  the American people that upstate New York and the North Country are  known as the cradle of the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for American       hockey. The game was named the greatest sports moment of the       20th century by Sports Illustrated.\n\n(9) The historic win brought hockey to the front-page…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…impact and the heat of the impact was so strong, that it  literally turned the tree. The bark literally that usually has this  nice little stripe as it grows literally has a turning point in it and  around it, and everyone just assumed that tree is dead. No one paid  attention to it.\n\nIn the year of the cleanup and all of the recovery and what was  happening…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the country  who are mourning with his family and praying that justice will be  served.\n\nI am grateful to have known him personally, spending hours speaking  with him at Turning Point USA events and watching how Turning Point has  grown, not only into a nationwide but a global movement. He started it  when he was 18 years old.\n\nOne of the things that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…idea that the power of our ideas  cannot only win the day but start a movement. And that is exactly what  he did. As the founder and executive director of the nonprofit Turning  Point USA, he and his team worked to build thousands of chapters across  the Nation dedicated to educating students about the principles of  freedom, free markets, and limited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…her service to our Nation and to the America 250  Commission, in particular.\n\nMadam Speaker, the 250th anniversary of the signing of the  Declaration of Independence was a turning point in the history of the  United States and also the world, one that warrants national  recognition.\n\nI am honored to speak in support of a bill that recognizes this  landmark…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…America's 250th       Act''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) The 250th anniversary of the signing of the Declaration       of Independence was a turning point in the history of the       United States and the world that warrants national       recognition.\n\n(2) The 68th Congress celebrated this fact by authorizing       the United…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}]