[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…aspect of who you  are because you are an American, a patriot first.\n\nThis decision to remove proven patriots for no justification causes  serious weakness to our force. It turns away proven courage. It wastes  billions in taxpayer investment, decades of hard-earned experience, and  is a direct blow to readiness because this decision isn't about  readiness.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…proud to stand here as a member of the Congressional  Black Caucus and say we will fight to protect those policies that save  our people's lives.\n\nTomorrow, when my daughter turns 10 and I think back at how I almost  became that statistic but how we are also coming up on the 1-year  anniversary of when her uncle became the statistic of a Black man more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…more people, investigators, and auditors to  go after it. We are doing the exact opposite. Elon Musk and DOGE are  firing the people who go after waste, fraud, and abuse.\n\nIt turns out that people don't wear signs around their necks saying:  ``I am committing waste, fraud, and abuse.'' No, it is hard to identify  this stuff. It exists, but it does not…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…How can you sit idly by and watch as children starve across the  world, including in Gaza and Sudan?\n\nHow can you justify a man who cozies up to our foreign adversaries  and turns his back on our allies?\n\nIt does not have to be this way. You control this Chamber. You decide  what happens, and Donald Trump is not a king.\n\nI call on my Republican colleagues…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…criminals, but we all know it was one big lie. Hundreds of  the people being held in this internment camp have no criminal charges.\n\nI won't stay silent while our government turns the Everglades land-- protecting it used to be a bipartisan thing. The State is spending $450  million from our Division of Emergency Management to run this  internment camp,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…face the largest  healthcare insurance premium increase in history, which will make  healthcare unattainable for so many Americans.\n\nWhen healthcare becomes unattainable, it turns treatable illnesses  into a death sentence. Americans will be forced to figure out their  healthcare. For people with high blood pressure, diabetes, or heart  disease, figuring…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…community investment in our children. For  example, the bill would disqualify a school from receiving Federal  funds by simply accepting donations from a Chinese immigrant if it  turns out the immigrant is acting indirectly on behalf of the  Government of the People's Republic of China. That is if you can find  out.\n\nThe bill bestows upon the Secretary of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…all, and that dictator is the general secretary of the Chinese  Communist Party. This is the world he covets. This is the world that he  has worked for. This is the world that turns the lock and opens the  door on his ambitions. This is the world of a weakened, isolated  America that nobody trusts. This is a world in which this country walks  away from…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…colleagues for  joining us and meeting here tonight.\n\nThis evening, we heard about the damage that President Trump's  actions have done to our Nation's security. If our Nation turns its  back on Ukraine, we heard about what comes next: Our ally Taiwan left  in greater jeopardy to a Chinese invasion; our allies elsewhere left  looking for security and other…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…have to make an ER run in the  middle of the night. They whisper a prayer every parent of every faith  knows: I hope my baby is okay.\n\nBut for parents in Gaza as the weather turns, heavy rainfall and  freezing temperatures present new threats. Palestinian families have  endured a genocidal campaign for years. Their homes have been reduced  to rubble.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…anticorruption idea.\n\nLet's ban congressional stock trading. Wherever we see corruption, we  should be calling it out. We should be fighting it. We should take it  on. Our democracy turns on public trust and people having some faith in  their elected Representatives.\n\nWhat we are railing against here, Members trading stock based on  information we learn, that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Americans to lose their  healthcare and nutrition assistance in order the pay for tax breaks for  billionaires. Who does that?\n\nWhy are they meeting at 1 o'clock in the morning? It turns out their  big, beautiful bill is really a big, ugly bill.\n\nRepublicans don't want you, the American people, to know what they  are doing. Tune in tonight at 1 a.m. Call your…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691511/one-big-beautiful-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Governor  to know that this individual, who he disagrees with--doesn't support  this bill--has now snuck into the Governor's press conference.\n\nSo what does our Governor do? He turns around, and he looks at Mr.  Eyman, and he says, ``Oh, why are you here?''\n\nAnd he said, ``I'm here to protest this.''\n\nAnd the Governor turns around and delivers his remarks.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…lift as they climb. Now they are  committed to telling the next generations to pull themselves up by  their bootstraps.\n\nI will not sit quiet while a man who was saved by grace turns around  and tries to snatch grace away from others.\n\nMs. CROCKETT. If we are going to be real about crime, about  communities, about second chances and even third chances,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Trump's speech. We got outside. Then a car  plowed into the back of a parked police cruiser. The police descend on  this situation. The door opens up. The driver staggers out. It turns  out it is the chief of staff to Speaker   Mike Johnson.\n\nHe is then administered the Breathalyzer test. He got a DWI. He is  driving while drunk. Maybe it is a DUI, driving…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…cap of almost $6 trillion  for the year. So 5 months ago, Congress did actually pass a budget-- halfway through the year we were already in--to spend $6 trillion this  year. Turns out, though, we have spent $6.6 trillion. So we couldn't  even get it right 6 months ago when the vast majority of Republicans  voted for a budget that said they were going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…their own  people. They have arrested at least 700 people for ties to Israel.  Dozens of people been hanged. They were basically drug out of their  houses and hanged.\n\n``Iran turns to internal crackdown in wake of 12-day war.''\n\nI will be doing a resolution condemning this regime's action. What  they are doing is they are trying to maintain power over…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…requires targeted, corrective training  for guards who fail covert tests, which helps to close performance gaps  and improve public safety.\n\nThis is a commonsense reform that turns the tests that FPS is already  conducting into data that can drive actionable improvements, making  Federal buildings safer for employees and the American people who we  serve.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Social Security. Guess what the  number two expense in our country is now? It is interest. If you do the  total interest load, interest.\n\nThe next is Medicare.\n\nNumber four turns out to be the ObamaCare, or the ACA subsidies and  Medicaid. That is number four.\n\nGuess what is number five now in our spending? It is defense.\n\nSo often, I will talk to my…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…called the MedPAC reports. They are big orange reports  like this, hundreds and hundreds of pages. If we go through them, there  will be this section in there that says that it turns out Medicare  Advantage is coming in, according to the MedPAC report--and this is the  roomful of people that specialize in this and, I hate to say, my own  joint economic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…where more than half of the population qualifies as being  obese. We are not being mean, but the Joint Economic Committee a few  years ago did a major study saying, hey, it turns out obesity costs  about $9.1 trillion of additional healthcare spending over 10 years,  and there is the Milken study from a few years ago saying 47 percent of  all U.S. healthcare.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…money to come in with an idea, saying: Maybe we shouldn't be spending  billions and billions of dollars on duplicative MRI scans or the things  we just waste money on because it turns out that that waste--some  people who come behind these microphones call it fraud--turns out to be  the profit model of many of the bureaucracies and many of the business…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…funding and  coordinating these attacks, enabling us to revoke the nonprofit status  of organizations which incite or fund domestic violence against law  enforcement.\n\nThird, it turns illegal entry into a felony with mandatory  detention--no more catch-and-release--and it establishes a 10-year  mandatory minimum prison sentence for those who try to illegally…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…prevented  10,000 homes from being flooded in the last hurricane--talk about an  ounce of prevention because those programs, those families, they would  have received Federal help. Turns out no Federal help was needed  because we were able to build resilience. We were able to keep those  homes from flooding in the first place. This is the type of work that…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone willing  to listen right now, what is the single biggest cost in our society?  This is where Schweikert soaks himself in kerosene and plays with  matches, Mr. Chair.\n\nIt turns out it is obesity. For our brothers and sisters, we  calculate there will be over $9 trillion in additional healthcare costs  over the next decade. What would happen if the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years, we double senior poverty in America. Yet, if you  talk about how you want to try to save Social Security and all the  steps you have to do, all the inputs, because it turns out it is  complicated, that side over there is going to run attack ads beating  the crap out of you because you mentioned the words ``Social Security''  even though you are…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…courage for those young men to walk into a wall of bullets at Normandy?\n\nPeople always ask me what is wrong with our country. Why is there so  much division? When the Nation turns its back on God, when the Nation  walks away from that collective faith, then do we really even have a  Nation?\n\nA lot of people keep branding Charlie as a conservative activist.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…people like James Min in  it.\n\nMr. Speaker, I thank James for his many years of service to this  great institution and for his friendship. May God continue to bless him  as he turns the page and begins a new chapter in his life.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688721/recognizing-james-min-after-25-remarkable-years-of-service"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…like the CEO of NPR, Katherine Maher, to testify before the House  Oversight and Government Reform Committee.\n\nI got to ask her about a lot of her past public statements. It turns  out she has a prolific Twitter history. She has written extensively  about every single major woke buzzword that you can think of, Mr.  Speaker, including ``the ravages of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Biden.\n\nFor 4 years, President Biden and radical progressive activists tried  to blame President Trump and congressional Republicans for the crisis  at the Nation's border. It turns out the only thing we needed all along  was a President who doesn't run from common sense and isn't afraid to  enforce the law. Thankfully, President Trump is not afraid.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}]