[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…one  contacted the family, and they didn't know where he slept during this  time away from home.\n\nUnfortunately, Mr. Huerta Cisneros' case is not isolated. Donald  Trump has turned Federal law enforcement officers into his own personal  secret masked police force to engage in political theater at the  expense of real lives. In that process, the rights…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…honor them? Like the prosecutors,  the new Attorney General got in. The new Acting U.S. Attorney, Ed  Martin, got in. They were forced to withdraw that nomination after it  turned out he had appeared 150 different times on Russian propaganda  networks, like Russia Today and Sputnik, and after it turned out he had  all kinds of Neo-Nazi affiliations and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…little more       eco-friendly.\n\n``We're creating this food scrap to compost system where       the food scrap waste from the Bethlehem Inn kitchen gets       delivered here and turned into compost which is used for the       farm's agriculture,'' Guerrero said. Those food scraps       contain vital nutrients for vegetables that would otherwise       rot…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…citizens are  having their spouses ripped away. Even servicemembers are seeing their  families targeted. They are having their parents ripped away. They are  having their lives turned upside down.\n\nLet's not forget, U.S. citizens are even being detained by this  administration. We have several instances now where American citizens  have been caught up in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…offering Republicans another chance to reverse  the devastating cuts they just passed--cuts that will close rural  hospitals and decimate Medicaid because Republicans have turned  healthcare into a privilege reserved only for the most wealthy in the  country.\n\nThat is not the way it has always been. Sixty years ago, Democrats  and Republicans on this…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…university to earn  all-conference honors.\n\nNot long after, Amy was diagnosed with health conditions that  prevented her from continuing to play soccer competitively so she  turned to coaching. Yet, her commitment to expanding athletic  opportunities for women of color never wavered.\n\nHer perseverance and commitment to expanding opportunities for girls…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689662/recognizing-amy-cooper"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…insurance  coverage, and the impact on services, particularly in the hospital  sector, which they warned us about before the bill was passed. Yet, the  majority and the White House turned a deaf ear.\n\nWe have a lot of work to do when we get back into town, starting  tonight. Again, what would be nice is if all of the Members who had  townhalls--and I know Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…give us comfort. When marines were getting  hit, he didn't seem to care. One marine told a story of him showing up  on a stack of marines going into a room, and the marine turned around  and said: Father, you probably shouldn't be right here.\n\nFather Shaughnessy never met a marine who didn't respect him, just  like he never met an R he could pronounce.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692558/recognizing-father-paul-shaughnessy"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…When we  should be debating the administration deploying Active-Duty  servicemembers on U.S. citizens in our cities or managing the  destructive mess Hegseth and Trump have turned the Pentagon into, we  are dealing with this nonsense.\n\nMadam Chair, I urge my colleagues to vote ``no'' on this amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695250/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…deport himself back to South Korea after nearly 50 years.\n\nMr. Park served. He fought. He belonged. Yes, he made mistakes, as  many veterans struggling with PTSD do, but he turned his life around.  That is the reality for many veterans. They fight hard for this country  and still face battles back home and, too often, alone.\n\nRepublicans are now pushing…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Care Act was the first time that  I had assurance of affordable, good insurance. We must protect this  program. It is a matter of survival.''\n\nAt every turn, Republicans have turned their backs on the American  people. President Trump and congressional Republicans promised the  American people that they would take swift action on day one to address  our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…canceled by Donald Trump.\n\nSo the prediction--and I make predictions that turn out not to be  true. I do have to acknowledge that. I have often made predictions that  have turned out not to be true. But on the floor of this body 6 months  ago, I said, if this energy emergency is not terminated, we will see  energy prices spike, and we will see American…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…floods, fires, hurricanes, and  droughts are devastating communities across this country; when  countries all around the world are banning together to do something and  he turned his back?\n\nDid you speak up when outbreaks of dangerous, infectious diseases are  still  a global threat, yet we have stopped engaging in the efforts necessary  to meet those…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that continues to work to support every  student and give them the brightest possible future or one where we  don't--one where every kid is on their own, one where lights are turned  off and doors are shut and opportunities are closed, unless you happen  to have the right ZIP Code or the right money.\n\nI know which future I am going to vote for today: the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…groups have used the power of money in politics  to strangle this discussion.\n\nIn our new American petrostate, the power of petromoney and our  corrupted petropolitics have turned this supposedly greatest  deliberative body into a tomb of silence about this danger, a mortuary  of democracy.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…pitcher,  Alexis Michon, pitched the entire game despite an injury early on.\n\nEven with this adversity, the team rallied together and kept their  determination to win. Everything turned around for the Thunder in the  sixth inning when Emma Lee crushed a three-  run homer and this team sailed to a 3-1 victory.\n\nTrine University women's softball has continued…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693078/trine-university-2025-womens-softball-champions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and professional  job.\n\nThey also beat us in the Congressional Football Game for Charity that  we do each year. I am nursing an injury from the soccer charity game. I  have turned 45 this year, and I think I have finally realized that I am  no longer 18. This has been a very important lesson to learn. I am no  longer invincible, and I need to act my…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692595/recognizing-theodore-gomez"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…demonstration of the  capacity of this particular company and American ingenuity in general  to accomplish amazing feats should hopefully serve as a reminder that  we have now turned a page, that we are now encouraging innovation, and  that we must never return to the misguided policies and, frankly,  discriminatory treatment that prevailed during the administration…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…here in the Nation's Capital.\n\nOur great Nation's Capital has been plagued by violence, destruction,  disorder for far too long, and decades of weak, pro-crime leadership  has turned this once great city into a dystopia.\n\nI will remind my colleagues on the other side of the aisle that some  of their colleagues have been victimized by the crime here in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…beyond electricity; it represents  a bridge to connection, opportunity and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692647/recognizing-jamen-monbarren"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…against Governor Newsom's policies, I was not serving my constituents.\n\nI very strongly disagree with that statement.\n\nThe fact is that we have a Governor whose policies have turned the  greatest State in the country into the most popular State to leave.\n\nWe have a Governor who believes that because he has a supermajority  in the legislature, he can run…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…chuck wood?''\n\nIt always made me laugh. I also learned quickly that not only was he  fun but he was thoughtful, he was pragmatic, and he was a really,  really good thinker. I turned to him on issues that I found to be  difficult. I wanted to get his thoughts on them.\n\nHe was a strong conservative. He was warm, kind, and principled. In  my mind, he was…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692514/recognizing-kevin-vaughn"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…will to confront narcoterrorism  head-on and that we will never surrender to the very people who are  killing our children.\n\nToo many Americans have already died because we turned a blind eye to  this threat.\n\nFor the sake of our national security, our communities, and the men  and women in uniform who stand the line every single day, I urge a  ``no''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…like Nicolas Maduro.\n\nMake no mistake about it, Nicolas Maduro is a murderer, an autocrat,  a narcoterrorist, and a thug who has oppressed his people, stolen  elections, and turned a once prosperous and free country into a  desperate nation that millions have fled. We should all be celebrating  the actions of the Trump administration in attempting to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692592/recognizing-gary-steele"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Wa-Hi history. Yet, for more than four decades,  the 1984 champions have had no victory cup to mark their achievement.\n\nWhat began as a casual conversation last spring has turned into the  long-awaited correction of that injustice. This Saturday, after 42  years, the 1984 team will finally be recognized with a ceremony and the  presentation of a specially…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…In August 1993, a convicted marijuana grower walked into the Frank  Carlson Federal Building in Topeka, Kansas, for his sentencing. What  was a normal day in Topeka suddenly turned into gunfire and tragedy as  the convict's car and his person were covered with explosives and pipe  bombs.\n\nAs building staff hid in fear, Craig and his fellow law enforcement…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…bill to allow noncitizens  to vote in their elections. Our far-left leaning--and I think you can  argue that very easily--Court of Appeals, New York's highest court,  actually turned that down and said: No, only citizens can vote in our  elections. That is New York State law, and that is our national law.\n\nI just want to make sure that that was your response…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}]