[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…access to the health insurance they needed to  get treatment.\n\nEvery year, 68,000 Americans die because they do not have health  insurance, and Republicans have chosen to turn their backs on these  Americans and make this crisis worse.\n\nNot only does their bill fail to extend the ACA tax credits,  something that helps 88,000 folks in my district afford…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698385/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…unity,       community stability, and opportunity.\n\nWhen we protect TPS, we protect families. We uphold a       fundamental human value, a value that implores us to not turn       our backs on people in their time of need. This is not merely       an ``immigrant'' issue, the termination of TPS impacts all of       us, citizens and noncitizens alike. This…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…inaction of this Congress.\n\nMr. Speaker, I know that many of the people back home must be writing  to you with similar stories. We can't fail these families. We can't  turn our backs on working people who are struggling to get by.  Healthcare is a basic and fundamental human right. If we have it in our  power right now, today, to help make people's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…might take Greenland by force  without the consent of Denmark.\n\nThis would open a shameful chapter, as we celebrate the 250th year of  our own independence, that we would turn our backs on the principles  established by the Founding Fathers and act as if we are one of the  thug nations of the world ourselves.\n\nSaddam Hussein's Iraq seized Kuwait. Vladimir…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States. God forbid we are ever in another conflict in some  country and turn to the local population to stand by us and risk their  lives to help us and when they agree, turn our backs on them again.  That is not what a great nation does.\n\nI think most Americans feel particularly that Afghans who risked  their lives to help our troops deserve better than…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…that? How cruel is that?\n\nMr. Speaker, that may be true someday. It is no excuse to let people  starve today and not because of Republicans' cruel policies. We should  not turn our backs on millions of Americans and their fight to survive  poverty and live with dignity.\n\nRepublicans are doing nothing to bring down costs. Instead, their  policies and their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…supporting the brave men and women of law  enforcement.\n\nMr. Speaker, we cannot afford to forget January 6. We cannot afford  to be absent, Mr. Speaker, to take a walk, to turn our backs on what  happened on January 6. To do so is to risk its repeated actions.\n\nIt did not end when a bipartisan majority in this House impeached  Trump the following week,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…providing diagnoses, catching illnesses early, and  providing care and treatment early, in the long run, saves money for  all of us.\n\nIt is unforgivable that they decided to turn their backs on millions  of Americans, including their own constituents whose health and well- being is on the line.\n\nSince this bill passed, of course, some Republicans are trying…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…often  left untreated, becoming virtual death sentences.\n\nWe established and later expanded Medicaid because we understood  that, in a country as great as ours, we don't turn our backs on our  neighbors. But we also created Medicaid because we know that it is in  all of our economic interests to have more healthy people. When more  people are healthy…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…happening on our  universities, all while China is upping their investments in  universities. I can't believe that they are trying to out-America us  and we are trying to turn our backs on our most successful traditions.\n\nIn one of his first actions, President Trump imposed a communications  freeze on all U.S. health Agencies, effectively silencing some…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…consequences.\n\nImmigrant businessowners start businesses at high rates. They create  jobs. They invest in their communities. If we care about economic  growth, we cannot afford to turn our backs on them.\n\nAs someone who has worked closely with small business owners in  immigrant communities, I have seen the resilience and determination  they bring to our economy.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…group chat and share it with the editor in chief of a  national publication?\n\nIn conjunction with all of the other actions the Trump administration  has taken to dismiss or turn our backs on our allies, I am deeply  concerned about how Signal-gate will make us much, much less safe in  the long term. Our Nation deserves better. Our servicewomen and  servicemen…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…appropriations process will simply break down.\n\nHow can we be assured that these bipartisan agreements are being made  in good faith if Republicans are just going to turn their backs on them  just a few months later? How can we be sure that the funding laws we  pass will help all of our communities succeed if our Republican  colleagues will simply…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…disabilities. It feeds seniors on fixed incomes and  families with young children. Most of these people have faced  unimaginable odds and have nowhere else to turn.\n\nWe cannot turn our backs on those who need us most. This is a moment  for moral clarity. Not one person in this country should go hungry, not  one person should be left behind, and certainly not…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…son. Please help save Job Corps.\n\nToday, I rise not just for policy, but for people. Every young person  in Hawaii and across this country just needs a chance. We must not turn  our backs on them now.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692031/opposition-to-job-corps-closures"}, {"senator": "John Rose", "party": "Republican", "sentence": "…to Seattle, where the mayor-elect has  chosen to boycott Starbucks, a company founded in her own city.\n\nIs this what we want, a country where those who run our cities turn  their backs on the very entrepreneurial spirit that made them thrive?\n\nMeanwhile, I believe that we are still that shining city on the hill.  We welcome more legal immigrants than…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697149/denouncing-the-horrors-of-socialism"}]