[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…happen is going to be  against the law and against Senate procedure.\n\nAs I understand it, Senate Republicans are preparing to have this  Senate go nuclear not just once but twice. First, we will go nuclear  and overturn the rule on points of order during a CRA, which is in the  law. Then Republicans plan to go nuclear a second time: to throw out  the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…treat wind as reliable baseload  energy through formulas that that ISO has developed.\n\nAnd clean? Yes, it is clean. It burns no fossil fuel.\n\nAnd yet the Trump administration twice has tried to shut down that  project--twice. Just yesterday, they got blown up in Federal court for  the second time when they tried for the second time to shut down that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…precedent.  It undermines the ability of Congress to make a serious and well- documented case for impeachment against this or any future president.\n\nPresident Trump was impeached twice during his first term, and I  voted to impeach him both times. We conducted a formal inquiry during  the first impeachment, where we subpoenaed witnesses and held public  hearings…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…school this week.\n\nFor many, school is so much more than just a place for learning. For  13 million food insecure children, it is a place where they can rely on  having a meal twice a day.\n\nYes, even six decades after Michael Harrington published the great  book, ``The Other America,'' which became a blueprint to fight poverty  and hunger in America and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694834/fy-2026-education-cuts"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…talk about the Civil  War.\n\nYeah, it started there in the Charleston Harbor, but if you go back  and look at the Battle of Charleston, that critical battle that we had  lost twice, General Gates was not a good general, and then George  Washington decided that he would get outside of his comfort zone.  George Washington decided that he would not hold…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…statistics that face Black and Brown  communities.\n\nBlack women are three times more likely to die due to pregnancy- related causes than White women.\n\nBlack people are about twice as likely to die from diabetes than  White people.\n\nOn the South Side of Chicago, which I represent, Black people are  expected to die 11 years earlier than White people living…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…should not be overturning this plan with the  sledgehammer of the CRA.\n\nI strongly urge my colleagues to vote ``no'' on the resolution. I  urge my Republican colleagues to think twice about the consequences of  this action and setting this chaotic precedent.\n\nMr. HUFFMAN. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that have already been paid by the consumer,       insurance, or a government program such as Medicare or       Medicaid. This practice can coerce consumers into paying       twice for the same service.\n\nExceeding legal limits: Companies must attempt to collect       amounts that surpass federal or state caps, such as those set       by the federal No…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…wishes--first to L.A., then DC. And he isn't stopping there.  He is also attempting to deploy troops to Portland, though a Federal  judge he appointed blocked his efforts there twice because, in his own  hand-picked appointee's words, Trump's claims about why they are needed  were ``untethered to facts.'' Another way to put that is that he is  lying.\n\nIn…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…given  moment in August of 2024. You paid 20 bucks per megawatt hour for the  exact same circumstance. Six years earlier, you would have paid 35,  maybe 40 bucks--20 bucks, twice as much, basically.\n\nThe reason the cost went down from 2018 to 2024 was new, inexpensive,  clean energy coming on the grid.\n\nWhy is it inexpensive? It is inexpensive because…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…ago, a Hawaii veteran, Sae Joon  Park, said goodbye to his family which included his elderly mother with  dementia, his two adult children, and his home.\n\nMr. Park was shot twice in combat, earning a Purple Heart for his  bravery. Yet despite his sacrifice, ICE officers gave him no choice but  to deport himself back to South Korea after nearly 50 years.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…lead to good outcomes for them and  for their babies.\n\nToday, Black women are three times more likely to die from a  pregnancy-related cause than other women. They are also twice as likely  to lose an infant to premature death. These disparities have not  improved for more than 30 years, and that is unacceptable.\n\nThat is why I am proud to join the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689759/devastating-maternal-healthcare-inequities"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…about 100 years and  like it currently is. This amendment will allow modern military and  government shotguns and some rifles to be sold.\n\nTo save lives, Democrats have now twice passed the bill that would  expand background checks on every gun sale, and here my Republican  colleagues are wanting to make it even easier to dodge the rules that  we do…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…up in smoke. This energy  emergency is just fossil fuel gaslighting of the American people.\n\nSince Trump took office, electricity prices have gone up more than 10  percent--twice as fast as general inflation, which also remains  historically high thanks to the Trump administration running our  economy into the ground. Their tariffs and their healthcare…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…this bill across the  line.\n\nI am pleased this bill includes nearly $9 billion for the  Environmental Protection Agency, a significant increase over the House  position and twice that of what the White House had proposed for the  EPA.\n\nThis bill also fully funds the National Endowment for the Arts and  the Humanities at $207 million each. This bill,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698755/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Vietnam from  1967 to 1968 with the 11th Armored Cavalry Regiment (Blackhorse), where  he served under Colonel George Patton and Colonel Jimmie Leach. During  that time, he was twice wounded by RPG attacks, survived two mine  explosions, and earned two Bronze Stars for Valor, the Army  Commendation Medal, and the Vietnamese Cross of Gallantry. He was  medevacked…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and for being a       forceful speaker;\n\n[Whereas, during the Civil War, Douglass was a recruiter       for the first African-American army regiment;\n\n[Whereas Douglass met twice with President Lincoln, first       about the pay and treatment of Black soldiers and then to       discuss the President's desire to assist escaping slaves;\n\n[Whereas after…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…the  United States, and the gentleman from New Jersey brings up the point.\n\nThe fact of the matter is, Mr. Chair, these new windmills that they  propose off my district are twice as high as the ones that they have  initially proposed. They have never been placed in the maritime  environment, so we have no idea what the undersea effect will be. In my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…removed an illegal  immigrant from Guatemala who was facing charges of aggravated sexual  assault of a child under the age of 14, after previously being caught  and removed twice before.\n\nIn January, a 24-year-old Mexican national was charged with the  murder of his girlfriend in Utah just one week after being deported for  the second time.\n\nThese are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…work with this proposed law to  provide a strong deterrent against those coming here illegally in the  first place.\n\nWith these enhanced punishments in place, people will think twice  before breaking our laws and choosing to overwhelm our immigration  system. The harsher the punishment, the more the deterrence. That is  just common sense.\n\nA nation that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…responsibility. This was a reflection of the confidence placed  in him by soldiers and senior leaders alike. Over the course of his  career, General Mingus deployed not once, not twice--nope--not 5 times,  not even 10. General Mingus deployed 12 times to Iraq and Afghanistan,  repeatedly placing himself along soldiers in harm's way and earning the  enduring…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…injunctions, depriving the American people of the changes  they demanded in November.\n\nTo put how unprecedented this is into perspective, President Trump  has faced more than twice as many nationwide injunctions as Presidents  Bush, Obama, and Biden combined. In addition, more than 90 percent of  these nationwide injunctions have been issued by Democrat…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Unfortunately, we had Secretary Haaland implement it.  Secretary Haaland did not implement it. Secretary Haaland, when she  went through her confirmation hearing, committed to me twice: Senator,  I will make this a priority of mine to implement this bill. You know  what she did? She didn't do anything.\n\nShamefully, because radical leftwing environmental groups…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…India, another group that didn't even necessarily know  English when they got here. Indian Americans make far more income than  the average American. Indeed, they make almost twice the income as the  average European American.\n\nOther groups that do tremendously well are the Taiwanese, the  Filipinos, the Cubans, people who come here from the West Indies.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…horrific violence against the people of Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and  extradition to the United States. He was indicted twice in Federal  court and should stand trial in the United States.\n\nWith Maduro rightfully captured, the circumstances have now changed.  While I support the operation to seize…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…politics and has been repeatedly recognized for her service,  most recently receiving the Spirit of Unity Award from the Sedgwick  County Black Republican Council. She has also twice received the Kansas  Republican Party's Huck Boyd Volunteer of the Year Award.\n\nShe has been an integral member of winning campaigns locally and  statewide. She served as the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…here we are just nibbling around the edges begging for crumbs. Please,  oh, please, please give me $150 billion a year in savings on a $7  trillion annual budget, up almost twice in a decade, bloated and  expanded under COVID, bloated and expanded under both Democrat and  Republican regimes.\n\nWe have had an extraordinary first 100 days. The President…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Veterans Memorial Park. He and his  staff were awarded the ``Service Office of the Year'' in 2009 and 2012,  making Marion County the only county to have received the award twice  from the Department of Florida and the VFW.\n\nI congratulate him on an incredible career and thank him for his  service. We wish him the best as he moves on from Marion County…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…commit to me, Congresswoman Deb Haaland, is to rapidly implement  this bill, OK? These are Vietnam vets. A lot of them are dying, OK?  Make this a priority.\n\nI met with her twice, and she committed to me twice to do that. Guess  what. Secretary Haaland did not keep her commitment at all. As a matter  of fact, one of the first things she did when she…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…crippled Iran's nuclear program. He  strengthened the success of the Abraham Accords. He secured the release  of the hostages in Gaza. He ended wars around the world not once, not  twice, but eight times. President Trump is the President of peace, and  he is achieving this peace through American strength and leadership.\n\nThese are the policies that Americans…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}]