[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…it is air that my father was breathing  even as an infant. It was America at the beginning of 1945, when a war  was still being waged around this world. The real threat of tyranny and  some, rightfully--and I join in this--say evil was taking place.\n\nAmerica helped end a world war in Asia and in Europe. That war gave  us the word ``Holocaust,'' the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in that situation was rather hard to look at.  Yet, their presence underscored the danger stemming from their close  and increasing cooperation, enlarging the spiderweb of tyranny led by  Russia, China, North Korea, and Iran, all of them acting against  liberty around the world.\n\nXi said that Russia and China should be friends of steel. He said  that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…exists to ask questions  for the people, even if those questions are uncomfortable--especially  when those questions are uncomfortable--and shine a light on the places  where tyranny and despotism can grow and foster and fester?\n\nBecause here is the bottom line: Article I, section 8 says that ``the  Congress shall have [the] Power . . . To declare War.''…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…incompatible with self-governance and the rule of law,  and will remain a threat to the Constitution if allowed to remain in  office.                             Article VII: Tyranny\n\nThe Constitution provides that the House of Representatives shall  have the sole power of impeachment and that the President shall be  removed from office on impeachment…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…have a choice, and Dr. King  spelled it out. We decide where we go from here.\n\nWe decide: Is it more chaos, division, hatred, propaganda, violence,  voter suppression, and tyranny where we pit one group against another  to stay in power?\n\nThat is one choice.\n\nDr. King gave his life for community where we come together, where we  work together, and where…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…for  three decades, and they lost it to the internal corrosion of the  separation of powers and the checks and balances of a democracy. And  certainly that led to the current tyranny, the authoritarian state that  they live in now.\n\nBut did the Trump administration say: We want to help Venezuelans  reclaim their country? No. They said: We like dictatorships.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…served our democracy so well. Republicans,  through it, are surrendering more and more unrestrained power to  President Trump. This rule is but another step on the march to tyranny.\n\nTrump is seeking to create a master file of information on every  single American, a digital ID tracking your movements, where you live,  where you work, when you see a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…is inherent in ICE operations.\n\nIt is heartbreaking to know that Mr. Brutus' death was not an  isolated tragedy. There have been 45 deaths and counting under Donald  Trump's tyranny.\n\nIn what moral nation would the penalty for seeking a better life for  yourself or your neighbors be a terrible death?\n\nIn what decent society would the government deploy…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…in developing countries and conflict zones and will end  programs that prevent conflict and pandemics.\n\nThis bill abandons the people of Ukraine while they resist Putin's  tyranny.\n\nThis bill puts America last.\n\nWhen we retreat from the world diplomatically and through our  assistance to vulnerable people, America will be alone without allies  in a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…democracy and the insidiousness  that violence presents or that fear of violent reprisal presents.\n\nJefferson said it so eloquently:\n\nWhen people fear their government, there is tyranny. When       the government fears [its] people, there is liberty.\n\nWhat is so disturbing when you see a Member of this body thrown to  the floor, a knee on his shoulder, arms…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…with Venezuela, we must act  according to our principles. That means ensuring humanitarian  protections at home and abroad for the Venezuelan people who have been  victims of tyranny for so long.\n\nAt home, that includes extending TPS. We cannot deport people to a  nation where our actions have set off a new wave of oppression.\n\nIn Venezuela, that means…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…COUNTRY!'' What hurts Trump are facts when he demands flattery.\n\nThis attempt to quash thorough, objective NPR and PBS reporting is a  sign of Trump's weakness, of his drive toward tyranny. Trump doesn't  want a country of engaged, informed Americans. He prefers those who  salute on command, like for his North Korean-style, taxpayer-funded,  wasteful $45 million…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692535/rescissions-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…came home, lived a full  life, helped educate me about what liberty really is: freedom from  oppression. Freedom is the condition of being free. Liberty is being  freed from tyranny. He was a part of that.\n\nI honor Alexander Drabik, from my own district. He was a great  soldier who was in the Army and was the first man to cross the Remagen  Bridge in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…for a better future.\n\nMembers of this body, both Democrats and Republicans alike,  understand that this is not just Ukraine's fight. This is a battle  between democracy and tyranny, between freedom and oppression.\n\nThat is why this body has come together on numerous occasions to pass  legislation to help the people of Ukraine resist the Russian invasion…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…law. He was abducted from his  home and sent to a foreign prison infamously known for human rights  violations. When the President defies the courts, he crosses the line  into tyranny. He is even arresting judges whom he sees as standing in  his way.\n\nWhen tyranny takes root, no one is safe. Today, it is immigrants with  tattoos, 2-year-olds, and even children…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Mr. Speaker, I urge a vote in favor of H.R. 1540. Let us stand  together not just for Falun Gong practitioners but for the millions  suffering under the CCP's oppression and tyranny. Let us affirm that  the United States will always champion truth, compassion, and  tolerance.\n\nMr. Speaker, I thank the chair, again, for bringing the bill to the  floor.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…justice for all, regardless of race, gender or background.\n\nAbroad, America plays a critical role in promoting freedom       by supporting democratic movements, opposing tyranny, and       providing humanitarian aid.\n\nThe U.S. has historically used its influence to encourage       the spread of human rights and liberty worldwide, embodying       the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…defending our way of life  from Lexington to Normandy.\n\nAnd throughout our history, American servicemembers have demonstrated  tremendous courage and strength, beating back tyranny to the ends of  the earth.\n\nI was glad to sponsor Jack's nomination, and I am confident that his  talents will distinguish him among his peers during his time at the  Academy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692771/congratulating-jack-godbee"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Force is the world's preeminent force in air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength, beating back tyranny to the ends of the earth.\n\nI was honored to sponsor John's nomination, and I am confident that  his talents will distinguish him among his peers both during his time  at Air…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692743/congratulating-john-epps"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…least because conflict with Nazi Germany was succeeded  immediately by the threat of conflict with the Soviet Union. Millions  in Eastern Europe had gone from living under Nazi tyranny to living  under Soviet tyranny.\n\nThe American people understood the stakes. Back in 1947, more than  three-quarters of Americans rejected the idea that the Soviet Union was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…dollars.\n\nFor too long, schools have turned a blind eye to the CCP's demands  for fear of losing CCP money. However, every dollar came with strings  attached: lessons glorifying tyranny, rewriting history, and  indoctrinating students instead of teaching American values.\n\nEven more concerning, many of these schools were near U.S. military  bases, raising…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…stories of the Iranian people today sound strikingly similar to  the stories of the American people throughout our history: resilient,  courageous, unwilling to surrender to tyranny, and determined to leave  a better world for their children.\n\nMr. Speaker, history shows us this: When people demand sovereignty,  and the free world supports them, the world…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…freedom is not always loud, not always quiet.  Standing up for your freedom is swimming against the school, looking  for those who may follow. It is a war cry against the face of tyranny  and injustice. It is a tough battle, one that we as Americans must be  proud to face every day because, simply, it is American.''\n\nOur next winner is Tanner Gill, who is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…without hesitation. Mr. Wells' bravery, and  the bravery of all who fought beside him, helped secure the freedom we  enjoy today. He was part of a generation that stared down tyranny,  defended liberty, and rebuilt a shattered world. And for that, we are  eternally grateful. Floyd's service didn't end when the war did. He  came home, built a life, raised…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Parliament would be able to have the power over the King. So when we  were leading up to the Revolution, the cry from James Otis was,  ``Taxation without representation is tyranny.''\n\nThese were the words of James Otis, but they still ring true today.  It should not come as a surprise that in a country founded on a tax  revolt, one person  is not allowed…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…spirit--characterized by courage, service, and an enduring commitment  to his country. He was born in a 1920, a defining moment in history  when the world faced the threat of tyranny and oppression. Answering  his Nation's call to service, Captain Blair served honorably in the  United States Army Air Forces during the Second World War, where he  demonstrated…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697045/recognizing-captain-floyd-blair"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…both sides of the aisle to support this bill  and help send a clear message that the United States will not allow  international financing that empowers brutal dictatorship or tyranny in  Burma.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the CBO estimate  for this bill.   H.R. 4423, NO NEW BURMA FUNDS ACT, AS REPORTED BY THE HOUSE COMMITTEE ON…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Speaker, unfortunately, that is not the case under Democrat rule.  Under Democrat rule, especially in our Nation's Capital, we are forced  to live under the cloud of anarcho-tyranny where criminals roam free  and law-abiding families live in fear.\n\nMr. Speaker, under President Trump's leadership, Republicans are  restoring law and order to cities that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Since  its establishment 250 years ago, tens of millions of American patriots  have put their lives on the line to protect national security, defend  our allies, and fight tyranny and terror from distant shores.\n\nToday, the Army is comprised of roughly 450,000 Active-Duty  servicemen, 325,000 National Guardsmen, and 176,000 members of the  Reserve,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. ``Taxation without representation is tyranny,'' bellowed  James Otis in the days and weeks and years leading up to the American  Revolution.\n\nThis became the rallying cry of American patriots: No taxation  without representation.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]