[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…including at the Department of Education itself, we  need to make sure that we are pushing back and fighting back against  these cuts because our kids are worth it.\n\nThe big, ugly bill slashed funding for Medicaid and SNAP, which  families in our community rely on to keep their kids healthy and fed.  If we really want to be profamily, prokids, and proparents,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sources.\n\nEver since President Trump took office earlier this year, Republicans  have been obsessed with crusading against wind and solar whenever they  can. They passed the big, ugly bill, which slashed tax incentives for  clean energy and made electricity more expensive for everyone. They  have tried to kill every wind or solar project on Federal lands…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…in order the pay for tax breaks for  billionaires. Who does that?\n\nWhy are they meeting at 1 o'clock in the morning? It turns out their  big, beautiful bill is really a big, ugly bill.\n\nRepublicans don't want you, the American people, to know what they  are doing. Tune in tonight at 1 a.m. Call your Congressperson and tell  them to vote ``no'' on this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691511/one-big-beautiful-bill"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…women of organized labor?\n\nIs it because my Republican colleagues are too consumed with enacting  massive tax breaks for their billionaire donors, which is what the one  big, ugly bill was all about, but have zero interest in lifting up the  quality of life of hardworking American taxpayers, including, but not  limited to, the men and women of our Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…amounting to $10 billion,  that will raise Floridians' electric bills by hundreds of dollars every  month.\n\nMr. Chair, Republicans in Congress are now making it worse. Their  big, ugly bill, which was passed in July, already is projected to crush  working families with higher costs, and now their spending bill adds  insult to injury by slashing home improvement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…just the cost of healthcare  that is going up, but our hospitals, clinics, and providers who are  struggling to make sure that they can stay afloat, especially after the  big, ugly bill gutted and promised to take $1.5 trillion out of the  public healthcare system.\n\nIt is why I have been working to champion bipartisan healthcare and  health solutions,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…found that  energy costs would go up by more than $100 per year for every  individual. At the same time, that is on top of the costs imposed by  Republicans' big beautiful or ugly bill.\n\nThe Department of Energy also found that natural gas prices would  increase by over 30 percent, so we are essentially, in this bill,  removing crucial safeguards. What…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…bill means billions of dollars for DHS to continue obstructing  Congress and denying due process to legal immigrants.\n\nMy Republican colleagues may be fooled by the one big, ugly bill, but  the American people are not. I urge my colleagues to vote ``no'' on the  rule and the underlying bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693217/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…even more expensive.  Household electricity prices are up across America by about 13 percent  and a lot higher in some places.\n\nWhy is that the case? First of all, the big, ugly bill that  Republicans passed in July to provide tax breaks to the wealthy and  well-connected took away tax credits to keep cleaner, cheaper energy  producing across America.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…coming to the  floor likely tomorrow, and Democrats are here to say we are going to  fight to protect Americans' pocketbooks. We want lower costs.\n\nWe know the impact of the big, ugly bill was to raise healthcare  costs and to raise energy bills. It is really time that the average  working American get a break for a change. We want to cancel the cuts  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…reports of Trump's airstrikes, there  are many concerns that we are not hearing about here at home: hostages;  Ukraine; Federal institutions, like USAID and NIH, gutted; the big,  ugly bill that would slash Medicaid for 14 million Americans, including  110,000 of my constituents; and the cruel cuts at SAMHSA that will  jeopardize the lives of those struggling…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693115/trump-leads-with-smoke-and-mirrors"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…greedy  corporations. And they accuse Democrats of being in the pocket of the  insurance industry?\n\nGive me a break. Nobody believes this BS.\n\nMr. Speaker, look at your big, ugly bill. Look at all the tax breaks  that go to millionaires and billionaires and big corporations. Every  millionaire, as I stated before, because of Republicans, are getting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…uninsured, that  were worried about how their healthcare centers, their hospitals were  going to have the volumes to stay open.\n\nWe expanded Medicaid. During the--I call it the big, ugly bill, we  put millions of Americans at risk of losing their health insurance  through cuts to Medicaid. We saw a list of over 300 hospitals in rural  areas identified as being…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…now can't use for other  things.\n\nAdvanced medical equipment like this is increasingly expensive under  the Trump administration. Add to that the Medicaid cuts in the big,  ugly bill and the end of the ACA tax credits, the strain and  uncertainty is challenging.\n\nOn National Rural Health Day, we should be working together to expand  care, not making…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…from people was, we are tired of a government that doesn't deliver to  the people. Make my life better, not worse.\n\nYet, somehow, we are waiting for a Senate bill, this big, ugly bill,  as if it couldn't get any uglier, that would actually slash more  resources from the very same people that sent us here instead of making  their life better.\n\nMr. Speaker,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Government is not the only one bingeing on debt. Look at China and  other countries, this and that. As the demographics of the  industrialized world start to functionally get really ugly, and we are  having to provide services, the amount of savings is starting to be  chewed up.\n\nOne of the benefits we had in the previous decade and the decade  before that is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…The next time we get someone here saying that we need more money for  our hospitals, outpatient surgeries, and hospice care, point out to  them that, in 7 years, there is an ugly cut coming. This 11 percent  shortfall isn't even in our long-run CBO projections yet because a year  ago, to give you an idea of how these numbers eroded in 1 year--I think…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…ground, no  changing of minds, and no rebirth of faith and freedom that we so  desperately need.\n\nFree societies do not fear words and thoughts, even those that are  hateful, ugly, evil, or obscene, because the same freedom that protects  these darkest  impulses of our nature also protects the right of men and women of good  will to confront them, expose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…parroted their party line, claiming that this bill will end  up being unpopular.\n\nThey have done everything from describing this as not the Big  Beautiful Bill but as the ``Big Ugly Bill'' and claiming that somehow  it benefits only a fraction of the American people at the top 1 percent  and accusing us of fiscal irresponsibility, while they claim that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…socialism is,  and we, those of us who did not vote for this guy, are going to pay the  price. It is up to all of us to fight back, to educate our youth, and  to contain this ugly monster so it does not spread and destroy our  country.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…out.\n\nAs I said last night to my colleagues, as a person who loves history  and has a history degree, I need to get all the documents on the table,  the good, the bad, and the ugly, and let history determine what  occurred on that day.\n\nThere is no point in trying to hide it. I don't understand why my  colleagues on the other side want to hide a terabyte.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, after decades of pledging Never Again, we are  watching the vile presence of anti-Semitism rear its ugly head once  again.\n\nFirst, the unthinkable happened 2 weeks ago here in the streets of  the Nation's Capital when two staffers from the Israeli Embassy, Yaron  Lischinsky and…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}]