[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…their Representatives or write  them a letter and tell them what they think about whether war is  necessary and whether the sacrifice we ask of our troops should be the  ultimate sacrifice that we are often asking of them in war.\n\nThat has been the Constitution since 1787. The Constitution has been  amended, probably, in 25 or 26 amendments now. That has…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…laid to rest under a headstone misidentifying their  religion.\n\nIt ensures the United States properly honors the religion and  heritage of the men and women who made the ultimate sacrifice for our  Nation. It does so by creating a program with the American Battle  Monuments Commission to identify American-Jewish servicemembers buried  in U.S. military cemeteries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…as well. There are U.S. citizens who have been arrested and  detained, even veterans. Think about that: individuals who have served  our country, prepared to pay the ultimate sacrifice in defense of our  Nation and our democracy, now being rounded up indiscriminately.\n\nIf you think I am exaggerating with this concern, let the comments  coming out of…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…has  three sons--three sons--all serving in the U.S. Marine Corps.\n\nMr. Speaker, we make movies about families like this. He has three  sons who are ready to make the ultimate sacrifice for this great  Nation, and, instead, he is being held in custody in an ICE facility in  Los Angeles.\n\nOur Federal agents should be taking criminals off of our streets,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693093/wake-up-call-for-immigration-reform"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…thoughts are with his wife, family, his many good friends, and  colleagues. I hope his memory brings comfort and strength in the  difficult days ahead.\n\nOfficer Facio's ultimate sacrifice, his courage, and his selflessness  will never be forgotten.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…and for  mourning. Over 58,000 United States soldiers and more than 250,000  South Vietnamese soldiers gave their lives in service. These brave men  and women made the ultimate sacrifice, and they deserve our continued  and unwavering gratitude.\n\nWe mourn not only those who fought for freedom but the countless  innocent lives lost during the war, those…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…act of unwavering conviction, he  was publicly executed in 1675 in Delhi, India, and is fondly remembered  as Dharam Di Chadar, or, ``Shield of the Religions,'' for his ultimate  sacrifice to protect the rights of others and uphold the universal  principles of human dignity, freedom of conscience, and the right to  worship according to one's beliefs.…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…families of servicemembers  who died during inactive or Active-Duty training, as well as travel to  and from training or duty stations.\n\nThese families have already made the ultimate sacrifice for our  country, and they deserve for us to fix this technicality. I thank  Representative Evans for bringing this forward and everyone who worked  on this in a bipartisan…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691052/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today during National Police Week to  honor the courageous law enforcement officers from New Mexico who have  made the ultimate sacrifice in service to our communities.\n\nEvery day across our country and in my home State, law enforcement  officers wake up, put on the badge, and commit themselves to protecting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Corps in California.\n\nWhat do you tell the American public when you tell them that the  father of three marines who took an oath to defend this country, to  make the ultimate sacrifice for this country, we are deporting their  father because he is a criminal?\n\nI asked Alejandro if, at Camp Pendleton, there are other marines in  his situation. He said…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…safe.\n\nOn May 2, the 17th Annual Imperial Valley Law Enforcement Memorial  Ceremony brought our community together in El Centro to remember the 49  officers who made the ultimate sacrifice in their service to the  Imperial Valley.\n\nThis week, the Riverside County Sheriff's Office held its own  memorial, recommitting to their mission to protect and serve.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691331/9999"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…spouses and the children of our law enforcement who  deal with the risk of their loved ones who may not come home.\n\nFinally, we remember the family members who made the ultimate  sacrifice for our safety. Serving in the people's House means we  support law enforcement. I am proud to have secured funding for police  training and safety.\n\nFrom Rockford to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691333/thanking-our-law-enforcement-officers-and-their-families"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…completely unknown.\n\nHow many billions of dollars of taxpayers' money would be spent so  Pete Hegseth can play a wartime general? How many U.S. servicemembers  would make the ultimate sacrifice so Donald Trump can do in Latin  America what Vladimir Putin does in Europe?\n\nThe power over matters of war and peace belongs to the United States  Congress. It is our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Commonwealth of  Pennsylvania.\n\nOne of those remarkable Pennsylvanians was Army Specialist Ross  McGinnis, a young man from Clarion County who, at just 19 years old,  made the ultimate sacrifice to save the lives of his fellow soldiers.\n\nOn December 4, 2006, while on patrol in eastern Baghdad, Specialist  McGinnis and his unit came under attack. An enemy insurgent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country. American-Jewish       servicemembers served with honor and bravery, playing a       crucial role in winning the Allied victory. They deserve to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…day.\n\nToday, I rise in observance of Clay County Police Memorial Day on  Thursday, May 8th, in Clay County, Florida, and to honor the brave men  and women who made the ultimate sacrifice in the line of duty.\n\nClay County Police Memorial Day is more than a ceremony--it is a  solemn tribute, a reminder of their courage, and a commitment to never  forget…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…young marine  who fell  in 1992 during the Gulf War. A section of the beautiful park, the Sgt.  Richard Parker Memorial Wing, pays tribute to a local hero who made the  ultimate sacrifice in Operation Iraqi Freedom in 2007.\n\nEvery summer, the town celebrates it history and community spirit  with Pierpole Days, a festival of parades, food, music, and family…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…week in which that day falls as Police Week.\n\nThousands of law enforcement officers are visiting Washington, D.C.,  this week to honor their colleagues who have made the ultimate  sacrifice. I extend my sincere gratitude to all local law enforcement  officers and their families for their sacrifice and their service.\n\nThese police officers risk their lives…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Week.\n\nEstablished in 1962 through a joint resolution of Congress, National  Police Week is a time for our Nation to honor the courageous men and  women who made the ultimate sacrifice in the line of duty.\n\nThese officers gave their lives to protect our families, our  neighborhoods, and our way of life. Their legacy lives on in the  communities they…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…selflessness, and dedication deserve our deepest  respect, not just this week, but every single day.\n\nLet us also remember, honor, and mourn the officers who made the  ultimate sacrifice in the line of duty. Their legacy lives on in the  lives they protected, the officers they mentored, and the communities  they kept safe.\n\nMr. Speaker, I thank every…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…State, county, or local police animal assisting a Federal agency.\n\nThe effort is not just symbolic. It is timely and necessary. Last  year, 21 police canines made the ultimate sacrifice in the line of  duty, including K9 Leo of Marion County, Florida, who the bill is named  after and who is pictured right beside me.\n\nMr. Speaker, these animals run toward…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…honored to represent when multiple police officers were shot while in  the line of duty. One, Officer Andrew Duarte of the West York Borough  Police Department, made the ultimate sacrifice. Mr. Speaker, he was  only 30 years old.\n\nPolice officers across the country put their lives on the line every  single day to keep us safe. Every day that they go out,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Post Office Building.\n\nIt is appropriate to name this post office after Anthony  Mazurkiewicz. A grateful community should always find ways to honor  those who made the ultimate sacrifice in its service.\n\nOfficer Anthony Mazurkiewicz, also known as Tony, was born on  November 7, 1967, in Amsterdam, New York. Officer Mazurkiewicz was a  graduate of Avon…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…law  enforcement and Commonwealth's Attorney Marsha Garst to honor those who  lost their lives in the line of duty. Since 1776, nearly 27,000  officers have made the ultimate sacrifice, including 165 last year and  25 so far this year. Their service and their sacrifice must never be  forgotten.\n\nMr. Speaker, the men and women of law enforcement represent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…safety. These brave men and women  provide essential help in times of need, embodying sacrifice for the  greater good. Some law enforcement and first responders make the  ultimate sacrifice in serving their communities.\n\nIn 2024, the FBI reported that 64 law enforcement personnel were  murdered while on duty. That same year, another 56 law enforcement  officers…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…heritage.\n\nAn estimated 600 American-Jewish servicemembers remain improperly  buried under the Latin Cross, not the Star of David. Many brave  servicemembers made the ultimate sacrifice while defending freedom in  World War I and World War II, but due to clerical errors or concerns  for their safety during service, their religious identities were not…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689753/american-jewish-servicemembers-to-be-buried-under-the-star-of-david"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Commander Olson, who made  the ultimate sacrifice in service to a grateful nation. I yield back  the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…devote themselves to the pursuit of justice. Their devotion merits  our admiration, and we are deeply indebted to them.\n\nWe especially honor the fallen heroes who made the ultimate sacrifice  in the line of duty. This year, we are honoring 234 law enforcement  officers who were killed in the line of duty.\n\nThe list of fallen includes two of my fellow Iowans,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}]