[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…all the programs that are contained in this bill that are  being authorized are being gutted by this administration, and my  friends are saying nothing about it. That is the ultimate kind of  cynical maneuver.\n\nI mean, this administration is cutting money for first responder  training, cutting money for pregnant and postpartum women, cutting  programs…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…equal opportunity       investigators and are designed to combat waste, fraud, abuse       and misconduct . . . without regard to political affiliation.       They are the ultimate [drainers of the swamp].\n\nOne of Donald Trump's very first acts after taking office was to fire  these independent investigators. In less than a year, he has gutted the  integrity…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…are born and the day you find out your ``why''.  Officer Thomas found his ``why'' in uplifting others, and he lived it  every day at the gate.\n\nHis commitment was put to the ultimate test one fateful day, when a  young man drove up to his gate, not to enter the base, but to say a  final goodbye. Officer Thomas immediately engaged with the young man,  and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…educators in my district whose jobs will  be on the line and whose students risk losing vital support if this  funding isn't restored.\n\nIt is our students who will pay the ultimate price, but it doesn't  stop there. The Department of Education has been painfully slow to  respond to those seeking help.\n\nMy constituents have been waiting for months for…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Impeachment  against the President, but I don't expect that it is going to happen  because my colleagues on the other side of the aisle are too afraid to  do so. It is the ultimate exercise of congressional oversight, and it  requires a simple majority vote in the House of Representatives and a  two-thirds majority vote in the Senate in order to impeach…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…It offers personalized  assistance, including career counseling, vocational training, and  educational support to help veterans overcome employment barriers.\n\nThe program's ultimate goal is to empower disabled veterans to  achieve independence and a successful career in the civilian workforce.\n\nI take great pride in my work on the Honoring our PACT Act…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695444/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…swift recovery.\n\nAhmed, Spencer, and countless others should never be put in these  unimaginable situations. Yet their selfless acts in the face of such  violence are the ultimate demonstration of love--a willingness to risk  their own lives to save a stranger.\n\nAs we seek to address the scourge of anti-Semitism and gun violence,  may we act in the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of Belarus or Kim Jong-Un of North Korea, but these are all  examples of our country, the United States of America, in the last 3  months and what is planned.\n\nFear is the ultimate goal of leaders like this. We need to stand up  for freedom and democracy or we may lose them forever. This Congress  must stop being a rubberstamp for this President and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690906/congress-must-provide-checks-and-balances"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…residents as well. There are U.S. citizens who have been arrested and  detained, even veterans. Think about that: individuals who have served  our country, prepared to pay the ultimate sacrifice in defense of our  Nation and our democracy, now being rounded up indiscriminately.\n\nIf you think I am exaggerating with this concern, let the comments  coming out…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…elderly or disabled or can't  easily get to your townhall, what are you to do? Faced with these  barriers, they may just give up and not vote at all, which I believe is  the ultimate objective of this legislation.\n\nVoter suppression is the way, I believe, that President Trump and  others believe they can succeed at the polls. What the Constitution and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…million when you account for the  cuts to ACA and other forms of insurance.\n\nThis finalized, independent analysis from the CBO confirms it:  Republicans' signature bill is the ultimate--the ultimate--betrayal of  the American people. It betrays every single family who will lose  health insurance. It betrays our financial future. It is betraying our  children…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693882/budget"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…certain pieces of land and how land  is going to be divided, many countries who are viewing this are  concluding that to protect themselves, they are going to have to have  the ultimate weapon. Just as North Korea made that decision, others are  making that decision. I don't support any of those decisions. I don't  support any nuclear weapons. I would like…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Senate. Senate  Democrats will let hell freeze over and fight this in every way that we  can.\n\nDonald Trump told House Republicans that voting no on his bill will  be the ultimate betrayal, but the real betrayal this morning was the  Republicans voting yes--the betrayal of the American people--because  there is nothing beautiful about the biggest cuts…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Ms. McBRIDE. Mr. Speaker, I rise today to recognize one of Kent and  Sussex Counties' most committed neighbors, Frank ``Fresh'' Coverdale.\n\nFresh has been described as the ultimate ambassador for the Food Bank  of Delaware, where he spent 22 years delivering food to working  families throughout Delaware.\n\nA native of Harrington, Fresh has been giving…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…importantly, he has  three sons--three sons--all serving in the U.S. Marine Corps.\n\nMr. Speaker, we make movies about families like this. He has three  sons who are ready to make the ultimate sacrifice for this great  Nation, and, instead, he is being held in custody in an ICE facility in  Los Angeles.\n\nOur Federal agents should be taking criminals off of our streets,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693093/wake-up-call-for-immigration-reform"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…religion or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country. American-Jewish       servicemembers served with honor and bravery, playing a       crucial role in winning the Allied victory. They deserve to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…claims, that this is a handout to  billionaires. It is their party that abandoned the middle class by  spending like crazy. Not extending the 2017 Trump tax cuts would be the  ultimate betrayal of the middle class. The average taxpayer in my  district, in the Ninth District of Indiana, would see a 26 percent tax  hike if the tax cuts the Democrats oppose…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…deportees.\n\nThe reason the Soviets did this is pretty simple: They wanted to  crush civil society in newly occupied areas because they took over the  Baltic countries in 1940.\n\nThe ultimate goal was to eliminate Estonian, Latvian, and Lithuanian  national identity entirely, replacing it with, of course, a Soviet- Russian identity. The Soviets did not succeed…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…have to experience.\n\nWhen others run away from danger, law enforcement and first  responders run toward it. They fight crime, protect the innocent, and  too often, make the ultimate sacrifice.\n\nDuring my time in Congress, Mississippi has lost too many heroes: In  June 2023, Madison Police Officer Randy Tyler was shot and killed while  responding to a…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…reserve the balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Commander Olson, who made  the ultimate sacrifice in service to a grateful nation. I yield back  the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…cheating easy  and destroy the public's confidence in the process.\n\nIn many jurisdictions, the Democrats have made it clear that they  intend to allow noncitizens to vote, the ultimate in foreign election  interference.\n\nI have news for my colleagues on the other side of the aisle:  American elections are for Americans.\n\nThe SAVE Act restores this vital…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…safety. These brave men and women  provide essential help in times of need, embodying sacrifice for the  greater good. Some law enforcement and first responders make the  ultimate sacrifice in serving their communities.\n\nIn 2024, the FBI reported that 64 law enforcement personnel were  murdered while on duty. That same year, another 56 law enforcement…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…and across the Nation who serve  in law enforcement. Thousands of officers and their families come to  our Nation's Capital every year to pay tribute to those who paid the  ultimate sacrifice to protect our communities.\n\nEach name added to the memorial wall represents a story of courage,  selflessness, and sacrifice. Unfortunately, North Carolinians know…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "Mr. DUNN of Florida. Mr. Speaker, I rise today with a heavy heart to  honor Deputy William ``Will'' Paul Thomas May, who made the ultimate  sacrifice defending his community in the line of duty. Deputy May was a  dedicated officer, family man, and lifelong Floridian who demonstrates  the best that our state has…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to everyone, but  infinitely nourishing in exploration.''\n\nEarlier this year, Charlie said about his goal of conservatism. He  said: ``You have to try to point them toward ultimate purposes and  toward getting back to the church, getting back to faith, getting  married, having children. That is the type of conservatism that I  represent, and I am trying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…chairman of the Committee on Financial Services, French  Hill, from the great State of Arkansas, a bill, with a 390-9 vote, to  promote the idea of home affordability, the ultimate American Dream.  Sadly, as we have recognized over the last few years, that dream has  become further and further away for too many Americans.\n\nStarting today, we are moving…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years. I know changing spending policy is  hard, but if we were to maximize both, at the end of the decade we are  more prosperous.\n\nMr. Chairman, at some point that is the ultimate question here: Is  prosperity moral? Is there a way we can actually do our work here where  we maximize the prosperity for my 2\\1/2\\-year-old but also the person  heading…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…forever grateful community.\n\nThe city of Virginia Beach, the Commonwealth of Virginia, and the  United States of America will forever be grateful to these officers who  made the ultimate sacrifice protecting our community. Their families  will always remain in our prayers.\n\nOn behalf of myself, the Virginia congressional delegation, and the  United States…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Memorial  Post Office Building.\n\nIt is appropriate to name this post office after Anthony  Mazurkiewicz. A grateful community should always find ways to honor  those who made the ultimate sacrifice in its service.\n\nOfficer Anthony Mazurkiewicz, also known as Tony, was born on  November 7, 1967, in Amsterdam, New York. Officer Mazurkiewicz was a  graduate of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Police Week.\n\nEstablished in 1962 through a joint resolution of Congress, National  Police Week is a time for our Nation to honor the courageous men and  women who made the ultimate sacrifice in the line of duty.\n\nThese officers gave their lives to protect our families, our  neighborhoods, and our way of life. Their legacy lives on in the  communities…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}]