[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…percent increase in just 1 year. Families cannot afford that.\n\nMr. Speaker, I am all for cutting waste and finding fraud and abuse,  but taking away healthcare and making it unaffordable for the people of  Texas is not the way to do it.\n\nTexas Medicaid, Medicare, and Social Security programs must be  protected. They represent our commitment to the American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…every day, on behalf of the people  of the region I represent, but also for people across our country.  Americans are facing the high cost of energy, and it is becoming  unaffordable, but it is not their fault.\n\nAt the same time, many Federal incentives to help lower energy costs  and to create the new energy systems for the future have been rolled…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the streets without shelter because they lack  homes, and here is a program designed to keep them in their homes, and  the Secretary is canceling it.\n\nWith housing more unaffordable than ever and veterans losing their  jobs, I am at a loss--total, absolute loss--to understand how he can  cancel a critical program that helps veterans undergoing financial…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…another product  to be sold.\n\nIn Michigan, the Great Lakes Water Authority voted to increase water  rates by 5.9 percent and sewage rates by 4.5 percent. They approved  these unaffordable increases despite unanimous and passionate public  opposition, Mr. Speaker.\n\nI want folks to imagine how it feels for many of our residents in  Detroit who have been living…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…disappointed. This is really disappointing. By blocking  my resolution, Washington Republicans are saying they are OK with  extreme policies that can make vaccinations inaccessible, unaffordable,  roll back vaccine requirements for schoolchildren, and put us all at  risk for diseases like measles, polio, and smallpox, to our families,  to our communities, to those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cost of  living. Under the Trump administration, healthcare costs are rising,  and putting food on the table is getting harder as egg prices skyrocket  and housing remains unaffordable.\n\nUnfortunately, the Republican rip-off is a slap in the face to  working families.\n\nTrump, Elon Musk, and House Republicans are asking us to support  axing Medicaid by…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, in recognition of National Health Month, let  me put some quotes out there from individuals that I represent.\n\nJust in Ohio, we know health insurance will become unaffordable for  tens  of thousands of people across our northwest Ohio district, over half a  million Ohioans, and 15 million Americans.\n\nPlease let me share some examples. A constituent…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696841/rising-healthcare-costs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…business going.  However, now she is being told that if these enhanced credits expire,  her premium could double.\n\nWhen she found out that her healthcare costs could become  unaffordable, she said: ``The only reason I can work at all is because  I can manage my lupus with regular care. I can't pay New York City  rent, pay those premiums, and keep my business…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…matters worse. Not only does this  bill fail to extend the tax credits, but it promotes junk insurance  plans that will rip off consumers and make healthcare even more  unaffordable.\n\nHouse Republicans are incapable of dealing with our Nation's  affordability crisis. They should stop their political games and put  the bipartisan Jeffries bills on the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698384/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…people's  lives better, but the Republican majority has stopped that. The lives  of average Americans everywhere are getting much worse.\n\nPrices are skyrocketing. Homes are unaffordable. Consumer debt is  surging. Unemployment is rising. Credit scores are plummeting. Family  farms are going under. Gun violence continues to devastate our schools  and our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…skyrocketing costs.\n\nIt is up to Donald Trump and the Republican Party to decide if they  will join Democrats to restore these tax credits or whether they will  keep making life unaffordable for hardworking Americans. I urge the  Senate to act immediately and take up the premium extension bill passed  by the House.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…and it results in Americans paying higher prices  for their banking services. That means higher credit card interest  rates, higher fees, higher auto loan payments, and unaffordable  mortgages. And when these banks become too big to fail, the entire  economy feels the pain when those banks' risk-taking blows up, and  taxpayers are the ones who have…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Madam Speaker, thousands of Minnesotans and millions of  Americans are facing unaffordable healthcare costs. Because of their  cruelly named One Big Beautiful Bill Act and Speaker Johnson's refusal  to act, the Republican majority is creating a healthcare crisis…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…be forced to go uninsured  or make incredibly tough choices just to make ends meet. This is life  or death for people.\n\nHealthcare should be a right for everyone, not an unaffordable luxury  for the wealthy.\n\nMr. Speaker, I urge my Republican colleagues to vote ``no'' on the  previous question and to join us in extending these tax credits today.\n\nMr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…The affordability crisis is real. It is quite literally hitting homes  as well, as the cost of buying a home feels out of reach for far too  many and rent is increasingly unaffordable. Families are struggling to  afford childcare and groceries. As the American public knows all too  well, President Trump and Republicans have caused their healthcare  costs…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…a few aspects.\n\nTo be abundantly clear, Republicans are currently dealing with the  aftermath of what has been a decade or so of failure. The Democrats put  in place an unaffordable and fraudulent healthcare system.\n\nFor years, Democrats promised ObamaCare would lower costs. In  reality, premiums have increased nearly 80 percent since the so-called…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…holding back residential  housing construction, and the available credits are increasingly  expensive.\n\nThese costs are passed down to the consumer, exacerbating the already  unaffordable housing market that the U.S. is facing.\n\nUnpredictable and lengthy permitting timelines for mitigation banks  are making it more challenging to bring new credits to the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…drugs. Americans were promised lower costs, more choices,  and better care. More than a decade later, too many families are asking  what happened.\n\nSince its passage, the unaffordable care act has created a subsidy- fueled illusion with spiraling costs hidden by taxpayer dollars and  deficit spending.\n\nToday, many Americans have insurance on paper but…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…$5,000 out of their own pocket to hit  their deductible. The average out-of-pocket spending maximum for 1 year  is over $20,000. Without a doubt, ObamaCare has proven to be  unaffordable and unsustainable.\n\nIn an attempt to respond to the affordability crisis created by  ObamaCare, Democrats leveraged a public health emergency to shovel  hundreds of billions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…think that was the  best solution to provide access to healthcare. Only Democrats voted for  it. Now they have created this incredible mess--this unworkable,  unsustainable, unaffordable healthcare system within the rest of our  healthcare system. They look to us, the Republicans--the people who did  not create this problem--and ask: OK. Now how are you…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Democrats and their failed policies. They are the  ones that have caused the increase in the electric rates by requiring  the electric companies to include unreliable and unaffordable energy  resources in their mix.\n\nWhile they claim coal is an energy of the past, clearly that is not  the case. Coal-fired power plants are the most reliable and cost- effective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…also now working to terminate the Biden electric vehicle  mandate. The switch to electric vehicles that the Biden administration  envisioned was unwelcome, unworkable, and unaffordable for a lot of  Americans and, as I said, threatened to put an incredible new strain on  our already creaky electric grid. I know South Dakotans were concerned  about the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…want to offer healthcare  benefits. Small business owners work very hard to provide for their  employees. The problem is that healthcare in this country has become  simply unaffordable for far too many businesses and working families.\n\nEmployers are looking for innovative solutions to lower costs and  increase coverage for their employees. When asked,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. Speaker, I rise today in support of H.R. 6703.\n\nBecause of the unaffordable care act, healthcare costs are out-of- control, and small businesses and the families that they employ are  paying the price. The unaffordable care act drove premiums up…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…insurance companies. Instead of attempting to lower the premiums of the  individuals who are on the insurance plan that the Democrats created,  which should be called the unaffordable care act, the Democrats have  cried wolf that Republicans are responsible for premiums being  unaffordable, but let's get the facts straight.\n\nEvery single Democrat voted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…lower the price of gas for California residents.\n\nThe reality of life in California is this: We have the highest cost  of living of any State in the country. We are the most unaffordable  State. A big reason for that is because our gas prices are so much  higher than anywhere else in the country.\n\nThere are various reasons why they are so much higher. In…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Americans Act, which is the  right prescription to lower healthcare costs and provide American  citizens with more affordable coverage.\n\nNearly 15 years ago, the Democrats unaffordable care act broke our  healthcare system. They broke our healthcare system. Since its  inception, ObamaCare premiums have skyrocketed by over 220 percent. A  family of four…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698370/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…vehicles to sell because of the inventory of  unsellable EVs. My constituents simply cannot afford this ridiculous  regulation and should not be forced to purchase entirely unaffordable  vehicles that do not meet their needs.\n\nOur economy was built on an open market and the freedom of consumer  choice. Congress cannot allow California to continue its abuse…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I thank the vice chair of the committee for  yielding.\n\nMr. Speaker, the unaffordable care act was born as a lie and  continues to be promoted in terms that are lies.\n\nMr. Speaker, do you remember these promises?\n\nIf you like your doctor, you can keep your…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(1) identifies obstacles middle-income households face when       looking to secure affordable housing;\n\n(2) identifies geographic areas where housing is the most       unaffordable and unavailable for middle-income households;\n\n(3) includes a list of Federal housing programs, including       Federal tax credits, grants, and loan programs, that are…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]