[{"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "In addition to remarks Senate Judiciary Committee Ranking Member Dianne Feinstein (D-Calif.) delivered today on the importance of access to abortion care, she submitted the following statement for the record:\n\n            \"The bill we are considering at today's hearing addresses the rare instances where an abortion is performed later in pregnancy -- when a woman has learned that continuing the pregnancy is a threat to her life, or that her unborn child cannot survive."}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "This bill defines pregnancy centers as organizations that support  ``protecting the life of the mother and the unborn child,'' but  Republican's commitment to funneling taxpayer dollars to medical  grifters endangers both."}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "It means that if there is a complication in a  pregnancy, those parents can focus on their health and the health of  their unborn child, not whether or not they will be able to cover the  costs of their care."}, {"senator": "Thomas R. Carper", "party": "Democrat", "sentence": "Mercury has a devastating impact on the neurological development of unborn children and the health of children and our most vulnerable populations."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "S.3275, the Pain-Capable Unborn Child Protection Act, would make it illegal for any person to perform or attempt an abortion after 20 weeks of pregnancy, with a possible penalty of up to five years in prison, fines, or both."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "The second bill, the Pain-Capable Unborn Child Protection Act, would create a nationwide prohibition on abortions for cases where the woman has been pregnant for 20 weeks or more, and would put doctors in prison for violating the legislation's ban on abortions."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "They  are honest, dedicated, hardworking people who care about the pregnant  mothers and the unborn children."}, {"senator": "John Thune", "party": "Republican", "sentence": "Unfortunately, the Born-Alive Abortion Survivors Protection Act and the Pain-Capable Unborn Child Protection Act were both defeated, largely on party lines."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today voted for two critical pro-life bills, the Pain Capable Unborn Child Protection Act and the Born-Alive Abortion Survivors Protection Act."}, {"senator": "Tim Scott", "party": "Republican", "sentence": "Cassidy for his leadership of the Teleabortion Prevention Act, which would make the performance of mail-order abortions a federal offense, and I am glad to support it as a cosponsor.\"\n\n\"Performing an abortion without the presence of a health care provider puts the lives of both the mother and unborn child in serious danger."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Pain-Capable Unborn Child Protection Act\n\nThe Pain-Capable Unborn Child Protection Act would limit abortions after 20 weeks gestation, at which point scientific data shows an unborn child is capable of experiencing pain."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "We are going to be  voting on two bills in the Senate tomorrow: the Born-Alive Abortion  Survivors Protection Act and the Pain-Capable Unborn Child Protection  Act."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.) joined Kevin Cramer (R-N.D.), Steve Daines (R-Mont.), Cindy Hyde-Smith (R-Miss.), Tom Cotton (R-Ark.) and Marsha Blackburn (R-Tenn.) in introducing the \"Unborn Child Support Act\" today, a bill to give mothers the ability to receive child support payments while they are pregnant."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Two things: One, we have a lot of work to do in fighting for unborn children."}, {"senator": "Todd Young", "party": "Republican", "sentence": "As I continue to serve the state of Indiana, I will always fight to protect life at all of its stages.\"\n\nIn 2019 Senator Young co-sponsored:  No Taxpayer Funding for Abortion and Abortion Insurance Full Disclosure Act of 2019, Born-Alive Abortion Survivors Protection Act, Pain-Capable Unborn Child Protection Act, and the Dignity for Aborted Children Act."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "The Pain-Capable Unborn Child Protection Act bans abortions after 20 weeks when babies can feel pain inside the womb."}, {"senator": "Mike Braun", "party": "Republican", "sentence": "I hope that my  colleagues, especially on the other side of the aisle, will not deny  science by allowing abortions to be performed on unborn children  capable of feeling pain."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "We will be voting on a second bill, which will provide protections  for unborn children that are practiced in almost all of the civilized  world."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.) today voted in favor of the Pain-Capable Unborn Child Protection Act and the Born-Alive Abortion Survivors Protection Act."}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Senator Graham is the sponsor of the Pain-Capable Unborn Child Protection Act, which limits abortion after 20 weeks post-fertilization, the point at which there is scientific evidence that abortion inflicts tremendous pain on the unborn child."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Senator Fischer has long supported pro-life legislation in the Senate, including: \n\n* The Born Alive Abortion Survivors Protection Act which protects children who survive attempted abortions* The Pain-Capable Unborn Child Protection Act, which makes it unlawful in most cases to perform an abortion if the estimated post-fertilization age of a fetus is 20 weeks or more."}, {"senator": "Mike Lee", "party": "Republican", "sentence": "For more than four decades, we have failed American women and their  unborn children."}]