[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…I support this bill because I believe it is a meaningful step for  working families. At a time when families continue to feel the  pressures of rising costs and financial uncertainty, the INVEST Act  represents a meaningful, commonsense step to help Americans secure  their financial futures.\n\nMr. Chair, 62 percent of Americans are invested in the stock…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…First Congressional District.\n\nWhat I heard loud and clear was that families are struggling with  rising costs at the grocery store, skyrocketing utility bills, and  economic uncertainty that has been created by the chaos from this  administration.\n\nMy constituents know exactly that this economic pain and unfairness  stems from the so-called One Big Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695037/temporary-benefits-for-working-families"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Operators are  forced to navigate conflicting rules between what the treaty allows and  what our domestic regulations enforce. It's a situation that adds  unnecessary risk, uncertainty and cost to an industry that is already  facing tight margins and fierce international competition.\n\nThis uncertainty has serious consequences, particularly for Hawaii.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only       adds costs and uncertainty, making it more difficult to       handle the economic headwinds and growth opportunities ahead.\n\nBills like H.R. 5214, the District of Columbia Cash Bail       Reform Act,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…do the  important work needed to save lives.\n\nThrough strength, resilience, and raising awareness, Evan and Angela  are demanding better from all of us and turning their uncertainty into  action.\n\nThe act of caregiving is often shaped by moments of fear,  frustration, and heartbreak, but more than anything else, it is shaped  by purpose, devotion, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…expensive, and as a  result of some of the reckless policies coming out of the Trump  administration, including the Trump tariffs, on-again, off-again,  creating so much uncertainty, but certainly will result in thousands of  dollars per year in additional costs on everyday Americans.\n\nWe are committed to lowering the high costs of living. We are  committed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are still in place, plus  the increased Chinese tariffs.\n\nThird, all of this chaos is horrible for the economy. Small  businesses cannot plan or operate under this level of uncertainty.\n\nWhat big business would want to invest in any new manufacturing if  there is no telling what policy is in place tomorrow? How can our  trading partners believe what we…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…challenges facing small businesses.\n\nTake a walk down a Main Street, Mr. Speaker, and you will hear the  same concern from small business owners up and down the block: The  uncertainty and rising costs tied to the President Trump tariffs are  crushing their small businesses, plain and simple.\n\nWe should be working together on issues that matter: lowering…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…is being sown by this President and this administration.\n\nJust over 100 days in and the American people are exceedingly worried  and exhausted. They are exhausted by the uncertainty that has defined  this Presidency. They are fatigued by the endless cascade of bad news  from every corner of our Federal Government. They are bone weary by the  fear of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…matters. In sum, the bill would scrap rules and practices       that are clear and familiar and replace them with nothing.       This will only cause confusion and uncertainty both for law       enforcement and those suspected of an immigration violation.       The Council is already considering a proposal from Mayor       Muriel Bowser to reconsider…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…retirement savings  evaporate. Families don't know if they are going to be able to afford  basic goods, much less Christmas dolls. Businesses, big and small, are  paralyzed by uncertainty and reducing their spending, and many small  businesses may not survive.\n\nTo add insult to injury, when faced with these facts, the President  says: Deal with it. Those…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only       adds costs and uncertainty, making it more difficult to       handle the economic headwinds and growth opportunities ahead.\n\nBills like H.R. 5214, the District of Columbia Cash Bail       Reform Act,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…markets to New Hampshire  supermarkets, consumers and businesses aren't sure what to expect.\n\nThey are looking at higher prices, at layoffs, at longer wait times,  and at uncertainty, which many businessowners I have talked to tell me  it is just as bad as higher tariffs because they don't know what to  expect, and they can't plan.\n\nI recently met with…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…are tired of it, and they are tired of the  lies. They see right through them. They are tired of feeling like they  have no say in this horrible feeling of insecurity and uncertainty.\n\nHow is it that, in the richest, most powerful country in the world,  we have this much unpredictability and this much anxiety that hangs  over us? But that can end today;…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…on about this Cabinet sharing war plans on  Signal chats.\n\nDo I have to tell you more about the chaos, Mr. Speaker, the  disruption? Do I have to tell you more about the uncertainty and the  situation that we find ourselves in, Mr. Speaker?\n\nWe are here trying to place a lid on these overdraft fees because  people don't know whether or not they are…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…first make its decision.\n\nTo overlook the very basis of the emergency in the hope of removing  tariffs for which the President has other authorities to pursue only  increases uncertainty in the short term.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on the resolution.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…too long, innovators have been stuck in a regulatory gray zone  caught between agencies and overlapping authority and subject to  enforcement instead of clear rules.\n\nThe uncertainty has driven jobs, investment, and innovation offshore  while leaving American consumers exposed.\n\nThe CLARITY Act fixes this. It establishes clear, functional rules  for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…efficient government rather than expanding it, reinforces user-funded  government services, strengthens accountability and oversight, and  reduces market distortions caused by uncertainty.\n\nMr. Speaker, I urge its support, and I yield back the balance of my  time.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…pertaining to state assumption of the       Section 404 program for Florida, Michigan, and New Jersey.       Litigation over state assumption has created significant       uncertainty for CWA permitting nationally, and NAHB urges       Congress to return Section 404 to its original intent,       allowing states to assume the permitting role. This will…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…applications  to the Social Security Administration--well, they will be delayed.\n\nNow, many military families also live paycheck to paycheck. They are  going to face a lot of uncertainty. The men and women who protect our  families will be left to wonder how they can protect their own  families. Border Patrol agents, they put their lives on the line every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…those words,  Coach Herb Brooks rallied the young, underdog U.S. hockey team during a  dark chapter of the Cold War, a time when Americans faced nuclear  threats, economic uncertainty, and a crisis of confidence.\n\nThe Soviet Union's hockey team had dominated for decades, beating the  U.S. in their last 12 matchups, including a crushing 10-3 exhibition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…disproportionately burden residents       of economically distressed areas;\n\n(vi) provisions regarding review of by-right development       proposals to streamline review and reduce uncertainty,       including--\n\n(I) nondiscretionary, ministerial review; and\n\n(II) entitlement and design review processes;\n\n(vii) the reduction of obstacles, regulatory or otherwise,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…tax  dollars from funding woke, perverted projects that the other side of  the aisle seeks to push.\n\nToday, 60 percent of American taxpayers are facing rising taxes and  uncertainty. To address these challenges, this resolution provides for  the extension of the Trump tax cuts, funds the largest mass deportation  operation in U.S. history, and cuts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…and mandated rushed transition to renewables, consumers paid  more.\n\nI don't know about New York or California, but Ohio cannot afford  rolling blackouts, price spikes, or uncertainty about whether our grid  can meet future demand.\n\nEarlier this year, the Department of Energy released a reliability  report warning that blackouts could increase by 100…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…harm's way every day  in the pursuit of justice and protection of the innocent. They are the  thin blue line that represents courage when faced with unbelievable  chaos and uncertainty.\n\nOne of the greatest strengths of law enforcement is their ability to  bridge gaps, forge connections, and build trust within our communities.  For our officers, stopping…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691307/thanking-police-officers-for-all-they-do"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Congress explicitly says  so--no more regulatory whiplash, no more political games.\n\nFor Florida, this is critical. It protects our section 404 program,  and it ends the uncertainty caused by conflicting court rulings and  shifting interpretations in Washington.\n\nMeanwhile, the Army Corps of Engineers got a gut punch with an  overwhelming caseload while…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…therapies by  reducing the certainty that companies will be able to benefit from the  exclusivity protections Congress intended. Lowering the bar will create  regulatory uncertainty, leading to litigation, market instability, and  hesitation from investors who fund rare disease innovation. Lowering  the bar will set a dangerous precedent for copycat…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…today, regulatory  whiplash will continue, investment will remain frozen, and local  communities will shoulder the burden of Federal indecision.\n\nH.J. Res. 131 ends that uncertainty. It restores the legally  compliant 2020 Record of Decision. It restores the full acreage  Congress authorized for leasing, and it restores, importantly, the  voice of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…We never know where he is at, right?\n\nHis tariffs are raising the costs of housing. In New Mexico, the  firing of Federal employees and the domino effects of the economic  uncertainty because of his tariffs are making jobs harder to find.\n\nMr. Speaker, Trump promised to lower prices on day one. Instead, his  tariffs are crashing our economy, making those…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…virtue signaling  over good fiscal stewardship and the interests of the American people  by exposing manufacturers and other stakeholders in our industries to  regulatory uncertainty and forcing American families to shoulder the  burden.\n\nAs Florida's attorney general, I was proud many times to lead the  fight against regulations that made no sense and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]