[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…longest-serving employee in the campus' history.\n\nPaul married Gladys Cota in 1958, becoming a devoted husband and  loving father to Marcia, Ronald, and Paula. Known fondly as ``Uncle  Paulie'' and ``The Mayor of Chino Street,'' he and Gladys became  cherished pillars of Santa Barbara's Westside, mentoring and caring for  generations of local children with…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, it is an honor to serve as the ranking  member of the Committee on Veterans' Affairs.\n\nToday, I rise to recognize one veteran in particular, my great uncle,  Manzo Takahashi.\n\nUncle Mon served in the legendary 442nd Infantry Battalion and gave  his life in service to our Nation on this very day 80 years ago. He  gave the last…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690036/protecting-the-promise-of-america"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…week, we heard the White House Chief of Staff--the  White House Chief of Staff--admit on the record that Donald Trump  ``wants to keep on blowing boats up until Maduro cries uncle.''\n\nFolks, the fact of the matter is, Congress has not declared war, nor  has Congress authorized the use of military force in Latin America. Do  you want to have that debate?…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…military personnel who  died in foreign conflicts where crude oil interests underpinned the  surface warfare. I say no more.\n\nWorld War II, in the 1940s, during World War II, our Uncle Tony was  deployed by the Office of Strategic Services, or OSS, to the China- Burma-India theater. He served as an Army parachutist and truck  driver--he was so brave--under…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…people's lives.\n\nTomorrow, when my daughter turns 10 and I think back at how I almost  became that statistic but how we are also coming up on the 1-year  anniversary of when her uncle became the statistic of a Black man more  likely to die because of a heart attack, I am going to follow the theme  of the 2025 National Minority Health Awareness Month: Advancing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…and emergency needs of  the littlest New Englanders.\n\nAlan was a philanthropist, businessman, and reformer, but, most  important, he was a dear friend, husband, stepfather, uncle, and  granddad.\n\nBefore taking this office, and once sworn in, Alan provided me wise  counsel sharing pragmatic, solutions-oriented advice on how to be of  service and make…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…workforce reductions, service limitations, and financial       strain on already overburdened health care facilities.\n\nThe Governor of Nevada knows that my mom, my aunt, my uncle, my other  aunt--they live in Nevada. My mom lives in a retirement community  there. This Governor knows that that State would be hit so hard by a  reduction of these services…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Mount Zion Baptist  Church in Albany, Georgia.\n\nAdrian Earl Jenkins, Sr. was born May 7, 1928, in LaGrange, Georgia,  to Julia Byrd and was primarily raised by his aunt and uncle, William  and Jesse Pattilo. His hands told his story: strong from teaching  generations of students, callused from building a home and other  community structures with his…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…painful to have to do that every morning and going back from work.  That doesn't compare to the pain of someone who loses a mother, a  father, a son, a daughter, a cousin, an uncle, an aunt, or what have  you.\n\nIf we want to deal with drunk driving, let's seriously deal with  drunk driving. This legislation is not the way to do it.\n\nMadam Speaker, I yield…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…servicemembers who could have ended up at the bottom of the  Red Sea or over foreign soil. Their reckless leak risked American lives  and our security.\n\nMr. Speaker, as our Marine Corps uncle would say: Shape up.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…examples of courage and  resilience for all Native Hawaiians.\n\nPrince Jonah Kuhio Kalanianaole was born into royal lineage on March  26, 1871. After his parents' death, his uncle King Kalakaua took him in  as hanai son and gave him the title Prince. An avid scholar during his  youth, Prince Kuhio was also a notable athlete in football, rowing,  track,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…as this year's Boots on the Ground  Alliance's Veteran of the Year, an honor his life and service  absolutely merit.\n\nBorn and raised in Whittier, Mauro was inspired by his uncle, a  Korean War veteran, to continue his family's proud tradition of  military service. Answering the call of duty, he enlisted in the United  States Army in November 1966 and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…during the 1980s, when I was first elected, the first decade of  my service. I pay tribute to him and to what he taught us, what we saw.\n\nI pay tribute to my own family, to Uncle Stanley Rogowski, who was D- day 4 on Normandy's beaches, wounded in action, came home, lived a full  life, helped educate me about what liberty really is: freedom from  oppression.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…would you speak to my mom? She loves you.\n\nHe got on the phone and graciously spoke to her for about 5 minutes.\n\nA few months later, I was down in Florida. I had an aunt and uncle-- the same thing. I called him up--the same thing. He can be a gracious  person.\n\nThe President, though, got it wrong. He was right in saying that I am  not running anymore.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Vietnam. So these great men and women went  to serve their country in Vietnam. When they got drafted, they would  say: Hey, it is my time. My dad fought in World War II. My uncle fought  in Korea. I am just going.\n\nSo they all went. And what happened--every Alaska Native had the  ability to get, under a 1906 law, a Native allotment. You could go and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…saying that many Vietnam veterans  suffered greatly in service to their country. Thousands of Vietnam  veterans still live with invisible and visible wounds of war today.\n\nMy own uncle is one of them. He served in Vietnam and, like so many  others, suffered debilitating injuries from his service. Sadly, many  never received the treatment or recognition they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689625/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…decorated war  veteran who served in World War II and in Korea, devoted his career to  Senator Mike Mansfield and ultimately served as Secretary of the Senate  from 1977-1981. His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional life to serving…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…need commonsense policies like the ones in  the one big, beautiful bill to ensure their businesses can stay afloat  and that their families won't lose their inheritance because Uncle Sam  is trying to bankrupt them.\n\nIf Congress fails to get this bill across the finish line, the  average Kansas family will see a tax hike of $2,200 this January. I  understand…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…serving meals and singing  in the choir.\n\nBruce will be remembered for his great sense of humor and his  generous heart. He was a faithful son, wonderful brother, and a fun  uncle to his nephews and nieces.\n\nHis personal relationship with Jesus Christ took him through his last  difficult journey with the strength and confidence that he could trust  his…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…today to support the timber  industry and the harvest of trees in our forests.\n\nWhen I was growing up, my father was a forestry professor at  Washington State University and my uncle was a smokejumper. I served in  the U.S. Forest Service.\n\nYears of fear and hesitation around commonsense tools like select  timber harvest and controlled burns have left many…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…not just a business but a  blessing for our district.\n\nTheir family is directly affected by ``22 a day,'' the number of  veterans who take their own lives each and every day. Uncle Ry,  Kendra's husband's younger brother, was just 26 when he lost his battle  to post-traumatic stress on U.S. soil. Ryan was a son, a brother, a  best friend, and an uncle.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…usdebtclock.org, the website,  the numbers are spinning literally out of control. To put this debt in  perspective, every American household is on the hook for over $238,000  to cover Uncle Sam's reckless spending spree.\n\nTo put it bluntly, the state of our Nation's fiscal health is bleak.  The government now spends over a trillion dollars just on interest.  This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}]