[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "This is unacceptable and  unconscionable."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "This so-called pause on lifesaving food aid is unnecessary and  unconscionable."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "This is unconscionable, unacceptable, and unnecessary."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "It is unconscionable."}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "It is unconscionable to give $2 trillion in tax breaks to the ultra- wealthy by defunding this food assistance American families depend on."}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "As an OB/GYN who has spent my life caring for women and delivering  babies, let me tell you: It is unconscionable to threaten the care  women receive before, during, and after pregnancy, but that is exactly  what the Republican majority is doing with their budget."}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "As an OB/GYN, as a mother, as a Member of Congress, and as an American,  this is unconscionable to me."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is unconscionable that Republicans are ripping away coverage to  fund their tax breaks for billionaires, the wealthy, and the well- connected."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "The inclusion of these  provisions is unconscionable when families are still grieving, and the  airspace congestion has not improved."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "The idea that you could take healthcare  away from people is unconscionable and that you will do so with a  straight face is unconscionable."}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "The unconscionable and, frankly, offensive decision to terminate our  Forest Service workers will make us less safe and more vulnerable to  the natural disasters that we are guaranteed to experience."}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "At the time when the greatest number of baby boomers are retiring and  need the most help and when SSA already is at its lowest staffing level  in decades, it is unconscionable that the Republicans seek to gut  Social Security and throw seniors, orphans, and those with disabilities  into poverty."}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "The cruelty of this bill is  not just unconscionable, it is heartless."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "It is  unconscionable."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "After the unconscionable act of gun violence that took the life of  Charlie Kirk, Representative Omar clearly and immediately condemned  this assassination."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "We hear the stories that people are reading about people in their  districts, and they say how it is unconscionable."}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Speaker, we gather today to confront one of the most  unconscionable human rights atrocities of our time."}, {"senator": "Russell Fry", "party": "Republican", "sentence": "This is unconscionable."}, {"senator": "John James", "party": "Republican", "sentence": "It is unconscionable."}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "It is unconscionable."}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "The idea that those who put their own lives on the line  to protect us would be assaulted for doing their jobs is  unconscionable."}]