[{"senator": "Al Green", "party": "Democrat", "sentence": "…people who are standing up. I am proud to say that,  here in the Congress of the United States of America, there are people  who are taking a stand against this President's unconstitutional  behavior. They are taking a stand.\n\nI am proud to tell you that many Articles of Impeachment have been  filed since the first was filed. Many have been filed, and I am…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I will offer my impression of a congressional  Member owl who will not stand up to the unconstitutional acts of this  administration.\n\nWho? Who me? Everything is okay. I see the beatings on TV. I see ICE  showing up at people's doors. I see what is happening, but I am not…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699196/impression-of-a-congressional-member-owl"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the NSF is  now halted, and the existing grants are under review for termination.\n\nI led over 100 of my fellow Members in a letter to the administration  opposing this unconstitutional grant freeze, which is in direct  opposition to Congress' appropriations.\n\nThis measure comes after canceling over 1,000 NSF active research  grants last month, with another…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Venezuela or a  regime change with Maduro and you want to use military force to do it,  you need to come to Congress for an authorization. There being none,  these strikes are unconstitutional and unlawful.\n\nI would urge my colleagues to join Senator Kaine and myself in  supporting this resolution.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…he was doing.\n\nThe American people see through these lies, just as they see that  this administration is taking action every single day against its own  people that are unconstitutional, un-American, and unconscionable.  People are talking about it everywhere. In our House Democratic Caucus,  we are talking about what we can do about it.\n\nThe only place…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699596/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…coaster head next week? Nobody really knows.\n\nNone of the tariffs that the President has proposed and implemented  have ever had a single vote in this Congress. This is unconstitutional,  and it has caused a loss in the 401(k) retirement accounts of tens of  millions of Americans. Those took a nosedive. They have been yo-yoing  up and down. We are talking…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…undermine  schools in rural communities, and also eliminate the civil rights  protections that people fought and died for.\n\nThis executive order will be an illegal and unconstitutional abuse of  power. An act of Congress created the Department of Education and only  an act of Congress can dismantle it, and we will fight that.\n\nLast month, I introduced…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…of these people have no criminal records in the United States, and yet  all of these people have now been imprisoned in a foreign country with  no end date in sight.\n\nUnconstitutional doesn't even begin to cover that.\n\nThere are so many questions--basic questions--about this that we all  should be demanding answers to. At the barest, smallest, slimmest…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Administrative Procedure Act.\n\nMr. Speaker, really? This doesn't make good sense.\n\nShouldn't Trump, Elon Musk, and DOGE minions have to follow the law?\n\nLet me be clear. It is unconstitutional for the President to delete  the Consumer Financial Protection Bureau or any other agency without  congressional approval.\n\nMs. WATERS.  Garcia).\n\nMr. Speaker, CFPB's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the other side who support this bill.\n\nThe main point I want to raise right now is that it appears to me  that this bill, as drafted, would create a scenario that is  unconstitutional. As I read it, it strikes a 5-day provision. In other  words, when somebody is initially arrested, they can be held for 5  days, and so, Mr. Speaker, you can have the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…administration of special  education programs under IDEA, the Individuals with Disabilities  Education Act, to other Federal agencies. The most likely choice for  this unconstitutional and illegal transfer? It is to the Department of  Health and Human Services.\n\nMr. Speaker, this means that Secretary Robert F. Kennedy, Jr., would  be in charge of administering…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Democrats that the administration release  these funds for their intended purposes, yet we have heard nothing,  nothing, from House Republicans about the illegal and unconstitutional  withholding of these congressionally appropriated dollars.\n\nIs there a fear of President Trump keeping them from their commitment  to the millions of students in the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…are       whisked off the street by masked officials in unmarked cars       or sent off to imprisonment abroad without due process. Trump       talks publicly about an unconstitutional third term without a       word of concern from his own party.\n\nAmerican democracy and American security are inextricably       linked; weaken one and the other inevitably…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…of trade deals  like the USMCA could destabilize job-creating industries within  Illinois.\n\nMoreover, this trade strategy is not only economically damaging, but  also unconstitutional. Congress, not the President, holds the exclusive  authority to regulate foreign commerce. The Administration's abuse of  emergency powers to give himself authority to…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…raise questions not put before the  court by parties and invite the Florida attorney general to intervene  and weigh in on these questions.\n\nHe wrote an opinion holding unconstitutional a Florida law that  allows minors to seek abortions without parental consent through  judicial waivers. The case didn't require a court to rule on the law's  constitutionality,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…out the $200 tax on  suppressors and short-barreled firearms under the draconian National  Firearms Act. This tax had been on the books since 1934, representing  both an unconstitutional and financial barrier to our Second Amendment  rights. Thankfully, starting January 1, 2026, American citizens will no  longer be subjected to this unnecessary and unconstitutional…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Talk about self-dealing.\n\nOne hundred days of courtroom drama, with courts--district,  appellate, and even the Supreme Court--saying Trump's actions are  likely illegal, unconstitutional, and must be paused to avoid  irreparable harm to the American people.\n\nWhile Trump defies the law and damages our economy, what are House  Republicans doing? This week…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…if the resolution were drawn to say, ``Mr. President, you can't  do this  anymore,'' that would actually have some effect or attempt to have some  effect. It would be unconstitutional, unenforceable. But to tell him  not to do something or to stop doing something he is not doing is  nonsense.\n\nThe effect of this is to slap the President of the United…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…illegal, unlawful search and seizure, but punishing everybody  for this crime, whether they have committed it or not, whether they are  going to commit it or not, should be unconstitutional. This shouldn't  really be a question.\n\nWe all want to get to the problem, and we are happy to work with  everybody on all sides to deal with it, but you cannot punish…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699282/amendment-no-1-offered-by-mr-massie"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…orchestrated by someone they don't  like, President Trump.\n\nInstead of celebrating the administration of justice by an impartial  U.S. court, they bemoan it. They call it unconstitutional, illegal,  impeachable, and fascist. They insinuate that our government is somehow  no better than Maduro's Socialist and murderous regime. That is just  nonsense. In…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Commission currently limits President Trump's choices for  D.C. judges to a very narrow list of names. That process is slow, it is  politicized, and it is very likely unconstitutional under the  appointments clause. The result has been persistent vacancies, clogged  courts, and criminals slipping through the cracks.\n\nThis legislation abolishes the commission…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…no longer viable as a political entity. That is why we need to make  sure that this provision does not pass. In addition, importantly, we  need to make sure that the unconstitutional scheme whereby former  residents would be ensnared is not allowed to even begin to be  executed.\n\nThat is why I am working on legislation here in the House of  Representatives,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…person can be limited by Congress's ability to cut  off funding for military operations they don't approve of.\n\nSo the War Powers Act, I think from its very founding, is  unconstitutional, but this is a case study of the chaos that would be  created if we accepted the proponents' version of this: that President  Trump would have to come to the Congress…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…``case-or-controversy'' requirements.\n\nUniversal injunctions were almost unheard of for the first 175 years  of our history and only became common in the last decade. In addition  to being unconstitutional, they are also anti-democratic. Universal  injunctions have become a favorite tool of those seeking to obstruct  President Trump's agenda.\n\nIndividual district judges…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…close.\n\nMr. MASSIE. Mr. Chair, the last time we offered this amendment, it  had bipartisan support.\n\nI urge my colleagues to vote for this amendment. It would defund an  unconstitutional and unworkable mandate that has already missed the  deadlines.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. MASSIE. Mr. Chair, I demand a recorded vote.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Speaker, I rise today in support of the Trump administration's  actions in capturing Nicolas Maduro.\n\nOver the past week, Democrats have claimed that Maduro's capture was  unconstitutional, illegal, and violated international norms. Democrats  argue that Congress must declare war or give explicit authorization  before the President can act.\n\nArticle II is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Rose", "party": "Republican", "sentence": "…didn't.''\n\nThe consensus of many legal experts is that this provision amounts to  a pay increase. To me, the provision reads like a Christmas bonus, and  that is blatantly unconstitutional. It defies the 27th Amendment, which  says no law can change a lawmaker's compensation until a new Congress  is sworn in.\n\nIf the House legislation we are debating today…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…military force is used, crescendoing with an approval process by  the Congress, and if that approval is not given, the operations must  cease.\n\nIn my view, it is patently unconstitutional. You are creating,  through the War Powers Act, 535 Commanders in Chief. The Members of  Congress sit in judgment over the Commander in Chief, and under the War  Powers…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…President is never truly checked by the minority party, other than  through elections. Meaningful checks and balances require the  President's party to stand up and resist unconstitutional usurpations  of power. Until that happens, the dangerous precedent of unlimited war- making power will continue to be abused by Presidents of both parties.\n\nI recommend…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…withdraw. You cannot remove troops  that don't even exist. That alone shows how unserious Democrats are in  this effort.\n\nThey also claim the act to remove Maduro was unconstitutional, which  ignores Article II and decades of bipartisan precedent where Presidents  have undertaken limited military action without a declaration of war.\n\nClinton acted in…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]