[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…United Nations has any U.S.  President ever stood with the dictators of Russia.\n\nThose countries that voted with Russia yesterday are state sponsors  of terrorism. Russia understands terror. That is what she does. For the  United States to stand beside Russia, North Korea, and Belarus at the  United Nations, it is appalling. It is appalling.\n\nRussia's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…four banks alone hold more assets than the next 75 banks combined.\n\nThis problem can be life or death for small businesses that can't get  ahold of anyone at a big bank who understands the local economy or the  nuances of their business or their credit needs.\n\nAt a big bank, you get a 1-800 number and a cookie-cutter product  developed in some far-off…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…participation  in New START. Onsite inspections remain paused. The treaty itself is  set to expire in less than 1 month.\n\nAnyone who remembers past arms control negotiations understands the  gravity of this moment. Negotiating a successor agreement will take  years, not months, and we are already past the danger zone.\n\nIf New START expires without a replacement,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…which would cut off the lifesaving  resources they provide.\n\nYoung people, young Americans, when they are in crisis, should be  able to speak to a professional counselor who understands their  experiences and is trained to communicate with people facing similar  struggles.\n\nThis is a cruel idea. For the health and safety of all young  Americans, the President…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…there is no sign that they  are going to do this.\n\nI see that Senator Welch just entered the Chamber. He was the lead  author on this bill in the House of Representatives and understands  exactly what I am talking about.\n\nThat is an example, when you look at Medicaid and the use for, yes,  children with disabilities, kids throughout our land, but also our…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…they realize it or  not, every single American benefits from having a competitive maritime  marketplace. For that to be the case, you have to have a cop on the  beat that understands the job, is focused on anticompetitive behavior,  and is driven to make sure that the free market works in the maritime  space.\n\nMr. Speaker, this bill pushes forward all…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…stories from New York's Ninth District and every  district represented by the CBC. We will make sure that this Chamber  hears their names, sees and feels their struggle, and understands the  real-world consequences of inaction, because this is not just a policy.\n\nThis is about whether families in Brooklyn, New York, can afford  their medications; whether…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…sure that the customers are serviced  properly, that when a big merger wants to have support from the  government, that they will have been vetted in such a way that OCC  understands very well: How are you going to service these customers?  Are you going to close down these branch bankers? How are you going to  help somebody that is looking for a mortgage?…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…policy rather than  with empty statements.\n\nThe American people deserve more than rhetoric. They deserve a system  built on data and durability. They deserve leadership that understands  that affordability is engineered, not declared.\n\nThey deserve lower bills. The path to lower bills runs directly  through the clean energy deployment that markets are already…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…should work  in good faith with our neighbors to strengthen the USMCA trade  agreement that the President himself originally negotiated.\n\nOur bipartisan group of cosponsors understands this. This isn't about  politics. It is about jobs, economic stability, and respect for the  successful agreement that we committed to in the past. It is why this  resolution…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…on the  battlefields of the last century remains unbreakable in this century.\n\nUnder Kevin's tenure, the United States-Australia partnership has  never been stronger. He understands that our alliance isn't just an old  friendship to be maintained; it is a living bond to be continually  strengthened. He built personal relationships across the whole…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…communities by investing in our  city's young people.\n\nThrough the establishment of the Chicago Youth Boxing Club, and as  the director of mentoring at New Life Centers, Mario understands that  building community and building relationships are the recipe for safer  neighborhoods. Through his mentorship of young people, including those  in my own community…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…a partisan repeal.\n\nNow, just kind of stick with me here about a normal deal. You make an  agreement with a friend: I will do this if you do that.\n\nWell, everyone kind of understands that is a partnership. You have an  agreement. But what if one person bails on that agreement later? It is  a betrayal. But bailing on the agreement is exactly what this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…and so much  else.\n\nI am honored now to welcome in a colleague from California who has  strong Pennsylvania roots.\n\nMr. Speaker, I thank the gentleman from California who  understands deeply what we need to do on this economic patriotism. The  gentleman understands what it means for manufacturing and what it means  for communities who saw these jobs not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…foolishness. Place this proposal to  downgrade careers where it belongs: in the department of garbage and  sanitation. Let's get back to grownup, serious government that  understands the problems in America and addresses those problems.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697491/bringing-attention-to-anti-education-agenda"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…small.\n\nHere is the truth about Arjun: If something needs to get done, he is  going to get it done with excellence. He doesn't just know policy and  process; he knows and understands people. He doesn't just build high- impact teams; he builds loyalty among the teams. He doesn't just work  hard; he works well with everyone.\n\nWhen the stakes are the highest,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "James Risch", "party": "Republican", "sentence": "…short before the opportunity expires to snap back  sanctions, as has been described by my colleague from Nebraska.\n\nThis resolution would make it clear that the U.S. Senate understands  the threats we face from a nuclear Iran and urges our UK, French, and  German partners to immediately trigger snapback sanctions pursuant to  U.N. Security Council Resolution…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Saudi nationals were responsible for Mr. Khashoggi's  death, and they were subsequently sanctioned.\n\nIn addition, the Saudis themselves took action. President Trump also  understands--and we should all understand--that the United States needs  stable and invested security partners in the Middle East. Saudi Arabia  has played an increasingly important…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Simple thing: What five tasks did you  accomplish?\n\nTell me, as Mr. Torres said, who among us doesn't have to justify our  work? Why should government be any different?\n\nDOGE understands something fundamental: Washington should work for  the people, not the other way around. That means questioning contracts,  finding and cutting waste, and making sure that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…currency placing  ``the highest urgency on research and development efforts into the  potential design and development options of a United States CBDC.''\n\nPresident Trump understands a CBDC's threat to our American freedoms.\n\nIn his January 2025 executive order, President Trump explicitly  prohibited any Federal agency from issuing or advancing a CBDC…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of Nazi Germany. He talked about the road to serfdom. Mr.  Speaker, we think of some of these policies potentially as the scenic  route to socialism.\n\nHe is someone who  understands market capitalism and a constitutional Republic like no  other Member.\n\nMr. HILL of Arkansas.  Malliotakis), who serves on the House  Ways and Means Committee and who is…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…years of public service,  Bill has represented Montana's interests very well. He is committed to  the rule of law and the original interpretation of the Constitution.\n\nHe understands Montana's laws and issues. His experience as a widely  respected and effective member of the Montana House has helped him  understand the needs of our State, our families,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…know a lot about Medicaid because I  am a former member of the Florida State Senate, and Medicaid is the  fastest-growing government program in our State.\n\nJust so everyone understands, it is not Medicare. It is Medicaid.  Medicaid is the program that is simply known as welfare healthcare,  which helps people most in need: persons in nursing homes, the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…this great  guy running for the House of Representatives who we know from the State  legislature in California. He cares about who we are, represents our  interests, and understands the trust responsibility. American Indians,  Native Americans, had no better friend in the House of Representatives  than Doug LaMalfa. Then as I got to know him as a person…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…recreation area, not a preservation  area.\n\nMr. Speaker, the people of Utah deserve better. They deserve a  government that listens, that respects their traditions, and  understands the importance of balancing conservation with access.\n\nGlen Canyon National Recreation Area is very popular, as my colleague  across the aisle pointed out. The Orange Cliffs…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…connect with their descendants. This vital effort will       correct the historical record and ensure our fallen heroes       are remembered as they lived and served.\n\nJVW understands that approximately 900 American-Jewish       servicemembers who lost their lives during World War I and       World War II and were buried in U.S. military cemeteries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…job running the Small Business Administration  in the last Trump administration. I have no reason to believe that she  cannot run the Department of Education. I think she understands the  difference between the State and Federal role in education.\n\nI also expect that she understands the difference between the  executive and legislative branches when…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…promises change. Clearly, his  election meant that they want fundamental changes in government.\n\nMr. Speaker, different programs have different goals. Just so the  public understands, the appropriations bills are for what we call  discretionary spending. The reconciliation bills are what are referred  to as mandatory spending. Between the two bills that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…interesting they bring up this previous question,  defeat the previous question, and we will present this other bill.\n\nLet me explain to the folks back home, I know the Speaker understands  this and my colleagues, I think, understand this: that is, in the form  of an amendment and adding to the existing bills in the rule, it is not  germane to either of the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…laws that are also holding us back  from our true mineral potential.\n\nI think each and every one of my colleagues in this body, from both  sides of the aisle, Mr. Speaker, understands and realizes the important  role that critical minerals play in our 21st century economy. This will  only increase as time goes on.\n\nWe have tremendous mineral wealth in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]