[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…. . . To declare War.''\n\nAnd every American should know that Congress is not giving up on its  most basic constitutional right to debate and determine whether U.S.  forces undertake further operations--offensive operations--against the  Iranian regime or any other.\n\nThis resolution, with my amendment, would give Senators confidence  that a vote on that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…regulations. Those procedures expressly provide that       when OMB disapproves or makes a change to an information       collection in a current regulation, the agency must       ``undertake such procedures as are necessary in compliance       with [APA] and other applicable law to amend or rescind the       collection of information, and shall notify the public…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…it knew it had a fast lane through this body.\n\nThe third way they could have done this, which was actually commenced  in the first Trump administration, was to have the EPA undertake an  administrative review of the three key predicates that have to be  checked off in order to grant the waiver to California and proceed  under ordinary administrative Agency…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…has money coming in. So now a grant can be brought  here to the floor and wiped out.\n\nWhat about a permit? A permit is very close to being a waiver,  saying: Hey, you can undertake this process. We are giving you  permission. Well, that is what a waiver does. It says: Yes, you can  undertake that process.\n\nSo now no one has a foundation for pursuing…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…nurse  administered an ultrasound and told the plaintiff that she had a viable  intrauterine pregnancy. The nurse was not licensed to diagnose viable  pregnancies and did not undertake appropriate medical measures to rule  out an ectopic pregnancy.\n\nRather than referring the patient for immediate medical evaluation,  Clear Way staff focused on encouraging…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…and mechanical.\n\nIn that law, there is another M that very seldom gets recognized. The  Morrill Land Grant Act lists this as part of the training these  institutions should undertake; military. It is in the law. Some of  these schools, like South Carolina State, have taken that seriously.\n\nOver the years, other land-grant schools like Tuskegee University--…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…enforcement problems as  challenges for the U.S. military.\n\nI strongly support the resolution my colleague has filed.\n\nWhen President Trump announced in August that he might undertake this  action, Senator Schiff and I conferred with other Senators. And when  the first strike was taken on the 4th of September, we wrote a letter  to the President, as the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and the Committee on Small Business and       Entrepreneurship of the Senate an implementation plan       detailing the actions the Small Business Administration will       undertake to establish and implement policies and procedures       to govern information technology modernization projects of       the Administration. Such policies and procedures…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…under the WTO TRIPS Agreement and without  informing Congress, attempting to remove the rights of American  investors under the USMCA.\n\nSecond, I also agree that we should not undertake tariff actions  lightly on our allies or free-trade agreement partners.\n\nWe should, however, take care before we say that all options are  completely off the table. In fact,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…capable the troops of Georgia are. Georgian troops have  fought alongside American troops in the global war on terrorism and had  no limits on the assignments that they would undertake bravely and  competently.\n\nIn 2020, I was grateful to lead the Republican Study Committee  national security report under then-chairman and now Speaker   Mike  Johnson calling…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…requests for more parochial  matters, like stream gages on the Ohio River, to the distribution of  revenues from development off the gulf coast.\n\nWe did instruct Agencies not to undertake certain activities that  would waste taxpayer dollars and impose burdens, like the regulation of  lead tackle and greenhouse gas reporting requirements for farmers and  livestock…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Risch", "party": "Republican", "sentence": "…cleared staff members who have been       specifically authorized to do so by the security manager.\n\n(d) Access to Classified Material.--In general, Senators       and staff undertake to confine their access to classified       information on the basis of a ``need to know'' such       information related to their committee responsibilities.\n\n(e) Staff…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "French Hill", "party": "Republican", "sentence": "…pass the bill (H.R. 3395) to require the Comptroller General of the  United States to carry out a study of the costs associated with small-  and medium-sized companies to undertake initial public offerings, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3395\n\nBe it enacted…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…as the  National Petroleum Reserve in Alaska, a 23-million-acre area roughly  the size of Indiana. A 1980 amendment to the NPRPA directed the  Secretary of the Interior to undertake ``an expeditious program of  competitive leasing of oil and gas'' in the NPR-A and also set up  revenue sharing provision between the Federal Government and the State  of…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…is unable to       negotiate a satisfactory contract with the firm under       paragraph (3), the Commandant shall formally terminate       negotiations with such firm and undertake negotiations with       the next most qualified of the selected firms, continuing the       process until an agreement is reached.\n\n``(5) Additional firms.--If the Commandant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…development that the CLARITY Act seeks to protect. Both the  CFTC and the SEC must carefully examine and understand DeFi, which is  why we are requiring both Commissions to undertake a robust study on  the unique benefits and risks of DeFi.\n\nThrough the CLARITY Act, Congress is making an unambiguous statement  that DeFi is different, and it should be…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…provide weapons to Ukraine to defend against  these unprovoked attacks.\n\nThe President is right to support efforts to ensure innocent lives  are no longer lost. He is right to undertake efforts to stop the  bloodshed. As he continues to work toward a peaceful solution, we  should not remove the ability to provide what he thinks will help the  Ukrainian people…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Ouachita National Forest by President Coolidge in 1924)       and the Ozark National Forest in 1908.\n\nIn 1977, President Jimmy Carter requested that the Forest       Service undertake a review of all potential wilderness areas       across the country and make recommendations to Congress.       Their effort was referred to as the Second Roadless Area…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…from our  family farmers.\n\nThis Hoosier Heartland Tour promises to encompass many meaningful  conversations that will inform my work as we return in September, and I  eagerly undertake it.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694159/kickoff-of-hoosier-heartland-tour"}]