[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…subject to review, but House Republicans are ignoring the  law to try to set a precedent for drastically expanding what other  protections for the American people they can undermine with a CRA.\n\nAs if all this wasn't enough, Republicans wrapped up the week with an  attack on an endangered species of smelt in the San Francisco Bay- Delta. Delisting a…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…confront our global adversaries and build up an industrial  manufacturing base here at home in the United States. We can't give the  Communist Party of China any opportunity to undermine our homeland  security, and I support the goal of this legislation to prohibit DHS  from buying batteries from certain Chinese companies.\n\nDue to a Democratic amendment to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688684/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…functions: setting  priorities through the power of the purse.\n\nSo my question for you, as you hold the floor to shine a light on the  ways in which this President continues to undermine our democracy and  disregard the Constitution: How is Donald Trump undermining Congress  through his attacks on the bipartisan appropriations process? And when  he does that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Federal Government  chooses working families. It is time for our government to work for  working families, to empower people with opportunity and stability, not  terrorize and undermine their dreams and hard work.\n\nWe must raise the Federal minimum wage. We must help seniors age with  dignity and independence. We must ensure healthcare and housing are  affordable…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and his inner circle.\n\nThis week, we saw new reports that insiders made nearly $100 million  on Melania's meme coin.\n\nPublic officials being able to sell access using crypto undermine our  democracy and free market system.\n\nLet's look at this for what it is. This is how authoritarian regimes  do business.\n\nTrump has turned the Office of the Presidency…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…affect conditions in farms, factories, construction sites, and mines.\n\nThese changes are being framed as modernization. In reality, they put  workers at greater risk and undermine decades of hard-won labor  protections.\n\nAmong the most far-reaching proposals is the narrowing of OSHA's  general duty clause, one of the most important tools protecting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…process of rolling back  labor regulations that do a lot of things, such as promote  nondiscrimination and strengthen the regulations we have. The ones they  are trying to undermine are the regulations that promote  nondiscrimination and strengthen registered apprenticeship standards.  They are rolling those back.\n\nThey are rolling back the regulation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…is harmless.\n\nI would point out that, while the gentleman's amendment focuses  explicitly on efforts by foreign entities of concern to exploit supply  chain disruptions to undermine our leadership in the field of AI. I am  concerned about any effort by foreign entities of concern to exploit  energy supply chain disruptions. That is why I have been dismayed…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of our public safety       infrastructure and ecosystem. The effect of these       Congressional repeals would put our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…adjustment or modification due to additional revisions or controls  determined necessary or reject the requested license outright.  Crucially, the bill also does not alter or undermine congressional  oversight over direct commercial sales.\n\nIn short, while I have strong concerns about the arms sales and  security assistance policies of the Trump administration,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…nineties,  and beyond.\n\nTo push to eliminate DEI policies is a dangerous step backward in  this ongoing fight for justice and equality. It is no accident that  this movement to undermine DEI coincides with the resurgence of racism  and hatred, and this rhetoric and these policies are un-American.\n\nThese policies also coincide with the banning of books. I…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…billion.\n\nWhere is the action to help Americans pay their bills? Mr. Speaker,  you won't find it in any of these three measures. Instead, my  Republican colleagues seek to undermine waivers from Federal  regulations that California and 13 other States have relied upon for  half a century to protect our clean air.\n\nThis waiver has done much to clear the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…has repeatedly avoided the easy answer,  declaring loudly that he won't provide a direct response.\n\nWe should pass this bill, but we should also urge our President to  not undermine Taiwan and not undermine the world economy by talking  about withdrawing the United States from the IMF.\n\nI urge my colleagues to support this bill, and I reserve the balance…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…51-year- old building to an inadequate 28-year-old building, the Reagan  Building. Its exposed location and its design as an accessible public- private facility would greatly undermine the FBI security.\n\nI will continue to work on that throughout the year that I have  remaining to me.\n\nThere was language in the CJS bill that I wanted the Rules Committee…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…When a leader  can erase truth and rewrite reality, they can justify anything. They  can jail opponents. They can seize power and ignore the judges and the  rule of law. They undermine the very essence of democracy itself.\n\nMr. Speaker, science is not partisan. It is not our political enemy.  It is a safeguard against lies and misinformation. When our Nation's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…along and be part of the program with the rest  of the country to say: We are all going to work together to keep our  communities safe.\n\nThis provision is a direct attempt to undermine the Trump  administration's attempt to do that and their renewed enforcement of  our immigration laws.\n\nI know some people got used to the last 4 years, where 20 million…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…an incredible tragedy. Of course, any  homicide is an incredible tragedy, but that one really was.\n\nDespite these alarming trends, the radical D.C. Council has chosen to  undermine the very department responsible for protecting the city. Its  antipolice law strips the Metropolitan Police Department officers of  due process protections. It weakens collective…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…world, Congress must step in and assert  our Article I authority over independent agencies that stray beyond  their statutory authority, bypass the legislative process, and  undermine the public trust.\n\nLet's be clear: There is no apparent evidence of widespread consumer  harm that justifies this rule. There is no demonstrated market failure  here. What…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…motivated Biden-era restrictions that have shackled and  locked down our LNG industry. These restrictions did nothing but  threaten American jobs, drive away investment, and undermine the energy  security of our own allies and friends.\n\nH.R. 1949, led by my friend Representative August Pfluger from Texas,  fixes this. It lifts restrictions on the import…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…reliable  path to move forward with critical projects.\n\nH.R. 1949 ends the harmful Biden-era delays on liquefied natural gas  export approvals. Delays discourage investment, undermine our energy  leadership, and threaten the security of our global partners who depend  on the United States to break free from harmful foreign influence.\n\nThe United States…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…prosperity.\n\nMeanwhile, the region also faces significant challenges, including  rising geopolitical tensions, maritime disputes, and growing coercion  from bad actors seeking to undermine a rules-based order.\n\nThis bill is long overdue and sends a strong message that the United  States will stand shoulder to shoulder with our friends, including our  Indo-Pacific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…secrecy, and they will no longer be able to conceal their  financial backers or obscure their true loyalties.\n\nHuawei should serve as a warning. China is on the offensive to  undermine the security of America's communications. An attack on our  networks is a direct attack on the United States, and it is not one  that we should tolerate.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Mr. BIGGS of Arizona. Madam Chair, Taiwan is a great friend of the  United States, and it is a unique friend to Arizona.\n\nThe CCP uses every tool it can, including maps, to undermine truth  and assert illegitimate claims over sovereign territory. Congress  should not fund anything that supports the CCP's disinformation  efforts, and now is the time for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693690/department-of-defense-appropriations-act-2026"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…rise in support of my amendment, H.R. 3638,  which adds essential language to address the threat posed by foreign  entities of concern seeking to disrupt supply chains and undermine  United States leadership in artificial intelligence development.\n\nThe United States is in a race with the Chinese Communist Party to be  the  global leader in the development…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…of semiconductors will seriously hamper the  Russian war effort and show the world that we will not allow our  adversaries to work together to destroy sovereign nations and undermine  the international system.\n\nMadam Speaker, I urge my colleagues to support H.R. 1486.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…working to strengthen and secure and sustain Medicaid.\n\nDemocrats, through their reckless spending and unwillingness to enact  commonsense guardrails themselves, have worked to undermine this  critical program. We are laser-focused on protecting the absolute most  vulnerable among us, Americans with disabilities, pregnant women,  children, and our beloved…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…People want to come here to be a part of that, God bless them, but  the people who come here who want to change it, who want to turn it  into an Islamic state, who want to undermine it and who want advance  sharia law, who want to bring their flags of their country here instead  of adopting and becoming an American--shouldn't we not take a total  review…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…years,  my colleagues and I have sounded the alarm about adversaries exploiting  our education system. Malign foreign entities like the Chinese  Communist Party are working to undermine American values not just on  college campuses but across our K-12 schools, as well. This is not only  an attack on education and academic integrity, it is a threat to our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…clinical benefit in treating the underlying conditions. If  we allow marginal improvements rather than true clinical advancements  to justify breaking orphan exclusivity, we undermine the very incentive  that encourages companies to develop first-in-class therapies in the  first place. The FDA has a clear precedent for maintaining a high bar  for clinical…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…time, these institutions, many of which proudly divest  from fossil fuels and boycott Israel, are more than willing to accept  foreign funding from adversaries who seek to undermine our Nation.\n\nThe DETERRENT Act is our line in the sand. It demands transparency  and accountability from higher education. If universities are entangled  with foreign adversaries,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]