[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…through the roof. Energy bills climb higher and higher. This  is not economic patriotism. This isn't putting America first. It is  self-inflicted damage. Somebody doesn't understand where these lakes  exist. We share them with Canada.\n\nTrump tariffs on the U.S. and Canada put our workers not first but  put them last. Rising prices for consumers are hitting…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…OSHA to require rest  breaks, access to water, shaded or cool recovery areas, and training  that delivers information in a language and format that workers can  certainly understand. These are simple and sensible safeguards that  will save lives.\n\nAs the climate crisis accelerates, workers are increasingly at risk.  Heat stress is a predictable problem,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…that we could bring the whistleblower in who made  this evident and clear that this data is being kidnapped and taken to  the cloud, which means, for those of you that don't understand this, an  unsecure place.\n\nThe Social Security Administration has no idea. When I asked my  fellow Republican colleagues if they had any idea where this data was,  they had…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…seniors?\n\nSo what did we do? We finally ended the sweetheart deal, and we  passed a law. I would have been more aggressive about how many drugs we  could negotiate because I understand they start with a group of drugs,  and pretty soon that is going to help people who aren't seniors, as we  did with the insulin cap. That insulin cap, at 35 bucks a month,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Senator  was still speaking. I was sitting right here, speaking to an intern who  was shaking uncontrollably with fear. It was unusual and concerning,  but we still did not understand the scale of what was happening beyond  these walls.\n\n(Mr. CURTIS assumed the Chair.)\n\nAt 1:56 p.m., my brother, Scott, texted me two words: ``chaos  outside''--no explanation,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…aisle who have helped move  the ball forward on this issue, including the San Diego delegation, our  California senators, and my colleagues who are former Navy SEALs, who  understand the harm of training in these polluted waters.\n\nI also thank the cities of San Diego, Coronado, Imperial Beach, the  San Diego Regional Chamber of Commerce, San Diego Coastkeeper,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692166/international-boundary-and-water-commission-authority"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…human carcinogens. The  list goes on.\n\nAs a Member of Congress who strives always to find pragmatic,  bipartisan solutions for us and for our children, I simply fail to  understand when my colleagues on the other side of the aisle are  choosing to relax these standards for clean air, all while stripping  healthcare away from more than 13 million Americans.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691595/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…gamblers don't have  to pay taxes on phantom income and are not lured to offshore and  unregulated markets.\n\nMy legislation has bipartisan support because Members on both sides  understand that this is not ideological. It is just fair, good tax  policy.\n\nMr. Speaker, I urge everyone to bet on the come, and pass the FAIR  BET Act.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to  lower energy costs. In fact, costs keep going up, up, and up, and the  GOP policies are making it worse. I have to say that Americans deserve  a whole lot better.\n\nWe understand that the impact of the big, ugly bill passed a couple  months ago is going to raise the cost of living on hardworking families  across the country. There has been a lot of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…months for a  healthcare fix? The 5 million Americans who are estimated to find they  can no longer afford their health insurance premiums when the premium  goes up.\n\nI don't understand the priorities that Congress focused on this year.  I really don't. I don't understand how under H.R. 1, which I call the  big, ugly bill, Congress bent over backward, congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…to inform them of a  couple of things--No. 1, that Eric Tung would be unacceptable.\n\nBut, importantly, it is important for my colleagues on the other side  of the aisle to understand that we signaled a willingness to consider  more mainstream Republican candidates whom President Trump had  previously nominated for district court judgeships. We were willing…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…government knows about you, tracking where you live, where you  work, your earnings, your bank account, your health insurance, your  child support agreements, and more.\n\nTo understand the scope of this extraordinary project, my amendment  required the administration to produce materials related to the Social  Security Administration's role in data aggregation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…oppose this  bill which abandons our allies, damages our military readiness, and  promotes divisive policies that undermine morale.\n\nI come from a defense-dependent State. I understand the importance of  the investments we make in our Nation's defense. We must always work to  ensure that our servicemembers have the best possible equipment to  defend our…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Police  departments.\n\nBeyond their philanthropic work, the Stickney Police Association has  played a vital role in building and maintaining trust within our  community. They understand the importance of supporting one another and  serving all members of the community with respect and care.\n\nOur community appreciates their ongoing efforts to keep us safe…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690438/recognizing-the-stickney-police-association-100th-anniversary"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Jersey, it is New Jersey Family Care, right? So  Medicaid normally isn't called Medicaid; it is called something  different in every State.\n\nSo it is important for you to understand that so many of your  neighbors are on Medicaid even though it may not be called Medicaid in  your State. That is how we get to 24 percent of American families on  this particular…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, we just had a shutdown over something  that the American people I am not quite sure understand, but what they  do understand is that they cannot afford their health insurance. They  cannot, if you will, afford the cost of being insured. Prices of health  insurance…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…be my great staff who have done extraordinary  casework for years and years, and they are visiting here--if it was  within the rules for me to recognize them--I would. I understand the  rules, and I will not. But I do welcome them, nevertheless.\n\nI am here because yesterday, the President had a tour up in Michigan,  I believe, and a reporter asked him…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, I understand there is a bill from Senator  Merkley at the desk that is due for a second reading.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690868/measure-placed-on-the-calendar-s-1668"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…would be roughly 4  months ago, that attempts to cap overdraft fees.\n\nOverdraft fees are a necessary evil that I believe in most cases  actually help the consumer. Now, I understand nobody wants to pay it,  but transparency is certainly helpful for consumers on an issue like  this, and I am not sure these caps are the way to go.\n\nTraditionally, things…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…commercials:  He dared to talk about saving Social Security, saving Medicare,  reforming how we deliver services so they are stable and so people have  a future.\n\nIf Members want to understand why this place is so damned toxic,  those of us who are actually trying to fix things also write the attack  commercials for the other side. It is a sickness, but the math…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…SMALL BUSINESS CONCERNS.\n\n(a) In General.--Each covered notice shall be written in a       manner--\n\n(1) such that a small business concern can easily       understand the intent of the covered notice; and\n\n(2) that--\n\n(A) is clear, concise, and well-organized; and\n\n(B) to the maximum extent practicable, follows other best       practices…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691850/plain-language-in-contracting-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Abu Dhabi. There is no question  about that. It is the black letter of the resolution. It only goes for  about three lines. I would invite anyone to read it, and you will  understand that the Democrats are once again dissembling.\n\nNo reasonable person denies the authority of the President to strike  a terrorist threat on foreign soil. Yet the Democrats…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…energy development.\n\nThe petroleum reserve dates back a century, to President Harding's  withdrawal and initial control by the U.S. Navy.\n\nMore recently, Congress has come to understand not only the naval  value but the national value of the area. They have directed the  Department of the Interior to ``conduct an expeditious program of  competitive leasing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…will do what it can do, which is force those who are saying that  they are going to filibuster to actually take the floor of the Senate  and filibuster.\n\nSee, people don't understand Senate rules. They think that the ``Mr.  Smith Goes to Washington'' version of the filibuster is the filibuster.  But the truth is that Senators have, for a long time, hidden…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "Mr. CRAWFORD. Mr. Speaker, it is particularly important with this  Special Order to clear the air. Americans deserve no less than to  understand the truth of what just transpired in Venezuela.\n\nNicolas Maduro has been removed as the reigning despot,  narcoterrorist, and illegitimate President of Venezuela. This fact…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…English and not in any other  language.\n\nThis commonsense measure would help guarantee that all truckdrivers  can read traffic signs, communicate with law enforcement, and  understand directions clearly and safely.\n\nIn addition, I cosponsored Senator Moody's Safer Truckers Act, which  restricts the issuance of CDLs to only U.S. citizens, lawful permanent…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…can to turn our country into the Third  World hell hole that they came from.\n\nWe are different. We want a great country, not a Third World country.  These foreigners don't understand what this country stands for. This  country owes you nothing but an opportunity to succeed. It doesn't owe  you a handout.\n\nIslamist immigrants come to this country with…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…taken  seriously, you have to act seriously. If you want respect, you have to  act respectfully.\n\nPrime Minister Carney, you say that President Trump is not a fair  trader. I understand your point of view. I don't agree with you, but I  understand your point of view. You have got to stand up for your  people. Prime Minister Carney, if you believe in free…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…legislative process on a  non-partisan, academic basis. Throughout their time in the program,  these students have studied legislation, prepared mock bills, and  worked to better understand critical issues that impact their  communities and countless families across the country. It is incredible  how in-depth and thorough their work has been. This determined…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Texas,  Representative McBath, who is the ranking member on our Subcommittee of  Crime and Federal Government Surveillance, and supported by Members of  both parties who understand that freedom collapses when the law becomes  unknowable.\n\nThis bill is co-led by staunch conservatives like Representative Roy  and myself and our colleagues, who occasionally…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}]