[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…not support a military campaign that may draw us into another  endless war or destabilize the region. And we can start by releasing  the video of one deadly strike already undertaken, but the evidence of  which has been withheld from the American people.\n\nI urge passage of this bill.\n\nAs if in legislative session and notwithstanding rule XXII, I ask…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…will move the country exactly the opposite  direction that Ronald Reagan moved the country back in 1981.\n\nBy the end of this year--\n\nReagan said--       EPA expects to have undertaken more than 400 emergency       actions to remove and contain public health hazards. And       because we recognize that we need to do more cleanup work       than the current…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…DISTRICT OF COLUMBIA.\n\nSection 502(f)(2)(A) of title 32, United States Code, is       amended to read as follows:\n\n``(A) Support of operations or missions undertaken by the       member's unit at the request of the President or Secretary of       Defense, with the consent of--\n\n``(i) the chief executive officer of each State (as such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…litigated. That was a fact that was  invented behind the curtains of the Supreme Court by those five  Justices. History shows since then that had a real factfinding effort  been undertaken, it would have been clear that this spending is not at  all independent of political campaigns.\n\nBut here is where it is indisputable. The Court also held--those five  Judges--that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…avenue that Republicans could have followed  here, that the fossil fuel industry could have followed here, but  simply didn't want to.\n\nThe third avenue that they could have undertaken was to go talk to  California. This is California's waiver. Last I heard, California had a  Governor. Last I heard, the United States has a President. They could  talk. They…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…as a direct voice for  my constituents in Illinois' 13th district.\n\nAleksi has been at the center of some of the most important  legislative and district activities I have undertaken. She has guided  my office through farm bill negotiations and markups, ensured that our  team was well-prepared for the annual Farm Progress Show, and  represented my office…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…filibuster, because it is inherently  advantageous for them, given the difference in how Democrats and  Republicans pursue bills.\n\nPerhaps the most antidemocratic initiative yet undertaken       by the Trump administration is the creation of the       Presidential Advisory Commission on Election Integrity,       chaired by Vice President Mike Pence but run…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…today, I met with the chancellor of the University of  California, Berkeley, and we discussed much of what you just brought to  our attention.\n\nThe research that has been undertaken at UC Berkeley has in the  previous year, 2024, created 1,618 new small businesses directly as a  result of the research and the effort that the university is making to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…costs may be incurred.  Military units supporting Operation Southern Spear are incurring a  different type of cost, lost time training for missions that they would  have undertaken had they not been diverted to the President's  unauthorized activities in SOUTHCOM.\n\nPresident Trump has also made several public comments about the  potential for U.S. military…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…openly stated by the Trump administration,  including by Donald John Trump's own address to Congress on March 4,  2025.\n\nIn this capacity, Mr. Musk and his subordinates have undertaken  numerous violations of the Constitution and laws, including by:\n\nOne, impoundment of funds appropriated by Congress; two, violations  of privacy and security laws with respect…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…as that.\n\nThe American people don't want their sons or their daughters sent  into harm's way for their missions to Venezuela or to Greenland or to  anywhere else that are undertaken just to enrich corporations and the  most wealthy amongst us and cronies of the President's, and to do  nothing in the process to lower the cost of living, to help families…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Chamber,  ready to fulfill our constitutional duty to ratify the electoral  college votes that would elect Joe Biden as the 46th President of the  United States, a peaceful duty undertaken by Congress after every  Presidential election since 1789.\n\nBut by the afternoon, the peaceful transition of power was obstructed  by armed rioters sent to us by Donald Trump.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…states, to reform juvenile justice with a focus  on rehabilitation rather than punishment. For example, Texas, a state  known for its traditionally tough stance on crime, has undertaken  significant reforms since 2007. These reforms have focused on  encouraging local, evidence-based supervision for low-level youth  offenders, which has led to a significant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…are going up,  meaning it is going to be harder to afford groceries.\n\nMr. Speaker, these are the most self-destructive, wealth-destroying  policies any administration has undertaken in modern American history.  They have tariffs at 1909 levels at 22.5 percent, making a global trade  war. Businesses have lost confidence.\n\nThere is only one way out. We…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…large-scale  transportation projects that have made a lasting impact in New  Hampshire. Projects include: the Interstate 93 expansion from Salem to  Manchester, the largest undertaken by the NHDOT; the Sarah Mildred Long  Bridge project; the Memorial Bridge Project; and many other projects  that have and will continue to improve transportation in New Hampshire.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of surface lands,  but is completely enveloped within ANWR and hampered from developing  these acres to their fullest potential. Mr. Lampe shared the continuous  efforts undertaken by KIC in order to open ANWR to oil and gas  operations. He highlighted the fact that pursuing oil and gas endeavors  in ANWR is essential to realizing self-determination…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Governmental Affairs of the Senate a report that includes--\n\n(1) the determination made under subsection (a)(2);\n\n(2) a detailed summary of any implementation actions       undertaken pursuant to subsection (a);\n\n(3) an evaluation of the effectiveness of tenant       communication protocols; and\n\n(4) any recommendations for additional legislative or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…this out-of-control agency.\n\nHistorically, this office was responsible for some of the most  egregious rules regulating the lives of Americans. Previous regulatory  actions undertaken include air cleaners, fans and blowers,  dehumidifiers, commercial clothes washers, and conventional cooktops.  Who in the hell do these people think they are? We are Americans.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…are in  this effort.\n\nThey also claim the act to remove Maduro was unconstitutional, which  ignores Article II and decades of bipartisan precedent where Presidents  have undertaken limited military action without a declaration of war.\n\nClinton acted in Kosovo. Obama acted in Libya. Most similarly, George  H.W. Bush captured drug-trafficker Manuel Noriega…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…of non-agency parties by foreclosing       certain actions through the establishment of land use       designations and the delineation of the activities that may       be undertaken in the decision area.\n\nHere, the Grand Staircase RMP includes some procedural       changes, such as the new requirement for personnel to utilize       a revised drought…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…McCollum).\n\nMr. CALVERT. Mr. Chair, I yield back the balance of my time.\n\nMr. CALVERT. Mr. Chair, the amendment strikes $15 million for HIV  prevention education activities undertaken in connection with the  United States military training exercises and the humanitarian  assistance activities conducted primarily in African nations.\n\nThis funding supports…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…executive branch.\n\nGeorge Washington remarked that ``the Constitution vests the power of  declaring war with Congress; therefore no offensive expedition of  importance can be undertaken until after they shall have deliberated  upon the subject, and authorized such a measure.'' No offensive  expedition without congressional approval.\n\nSt. George Tucker, a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…because it foreclosed certain actions by       non-agency entities, through the establishment of land use       designations and delineation of the activities that may be       undertaken in the planning area.\n\nHere, the Buffalo RMPA does entail some changes to agency       procedure in that BLM will no longer consider coal leasing       applications within…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…immediate dismissal from the Committee staff.\n\n10.9. Within the Committee staff shall be an element with       the capability to perform audits of programs and activities       undertaken by departments and agencies with intelligence       functions. The audit element shall conduct audits and       oversight projects that have been specifically authorized…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…report gifts from or contracts with foreign  governments, and resources must be available for parents to review.\n\nWe know this can go on right now. We know contracts are undertaken  with all of our school districts now. We know that the lawyers on staff  have means by which to make sure that the appropriate t's are crossed  and i's are dotted. They…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…confirmed again to Congress on January  14 that there are currently no U.S. troops in Venezuela and that the  introduction of U.S. Armed Forces into future hostilities will be  undertaken consistent with notification of the War Powers Resolution if  required.\n\nMr. Speaker, the hypocrisy of House Democrats is palpable this  afternoon in this Chamber.\n\nI urge…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…came in 2018 with the creation of the       DFC, which made its first equity investment in the critical       minerals sector the following year. In 2023, a review was       undertaken of the effectiveness of the President's Advisory       Council on Doing Business in Africa (PAC-DBIA), an initiative       launched during the Obama administration with the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…always called out laggards and urged  European allies to share more of the burden.\n\nBut I have also given credit where it is due, and the simple truth is  that our allies have undertaken a profound--profound--transformation.  This year, Poland will spend 4.8 percent of its GDP on defense. Estonia  and Lithuania will spend 5 percent, and Latvia will hit that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…of which an officer, director, or member       may be a member; or\n\n``(B) prevent the payment of reasonable compensation to the       corporation's employees for services undertaken on behalf of       the corporation.\n\n``(d) Loans.--The corporation may not make a loan to a       director, officer, member, or employee.\n\n``(e) Immunity From Liability.--Members…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697185/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…And it is an  important mission. We need to have a secure border, and we need to  deport criminal illegal immigrants.\n\nNow, we can have a debate about how these tasks are undertaken, but  we are not going to support anything that makes it impossible for law  enforcement to carry out its job. We are not going to support anything  that makes it more dangerous…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700181/state-of-the-union-address"}]