[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…facilities for  those who are beaten and dragged off the street.\n\nThis is not who we are. This is not the character of our country. I  don't think my Republican colleagues understand the gravity of their  silence. It seems they have been silenced from speaking out against  this brutality due to their fear of this President.\n\nThey are even too afraid to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Chair, I rise in opposition to the amendment.\n\nMr. TAKANO. Mr. Chair, Americans understand that trans people do  exist and that transgender servicemembers have served our country with  distinction and honor for almost a decade. They were able to do this  openly.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…week, I visited the Tacoma, Washington, ICE detention facility  to visit constituents and to conduct oversight. I wanted the  opportunity to see for myself the facility, to understand what my  constituents are being put through. I gave ICE their 7-day notice of my  arrival, as they had requested, but I knew I would get a sanitized  version of the privatized…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't want a  shutdown. We want them to reel in an out-of-control ICE agency that is  killing American citizens right before our very eyes. That is what we  want.\n\nI don't understand for the life of me why that is such a heavy lift  from my Republican friends, but that is what we are asking for. We  don't want to shut the government down. That is not…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…double-check--if I am not mistaken, not a single  Supreme Court Justice who ruled in that case had ever stood for office,  ever had a fundraiser, ever had to go through it and understand what it  does to you.\n\nI think ethical reform that is meaningful requires a scandal that is  earth-shattering. I am not sure what is left by way of scandal. What is  going…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…devices to alert  consumers when a device includes a camera or a microphone if a consumer  would not reasonably expect it to do so. I think most consumers don't  recognize or understand this.\n\nWhile this bill addresses significant privacy concerns, it is also  important that we recommit to adopting a bipartisan, comprehensive  privacy framework that starts…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…still in the uniform of our great Nation  today.\n\nIf only this five-time draft dodger hadn't cried ``bone spurs'' when  his Nation needed him the most, then maybe he would understand the  first thing about what it means to actually honor those who serve.", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…insurance premiums will rise for another 20 million Americans. Three  million people will have food taken off the table, including kids,  seniors, and veterans.\n\nI can't understand the celebration of the facts that I have just  read.\n\nI have heard misstatements. One misstatement was: Don't worry. The  people we take off Medicaid will be the illegal…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…perhaps the chairman  knows. It is a fairly empty Chamber here. I don't see any other  Members. Maybe he might engage in a bit of discourse here in a  colloquy.\n\nI am trying to understand why the CRA is necessary, given that the  Interior Department retains the ability to amend and modify these  resource management plans in any way that the Secretary deems…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Agencies Subcommittee because I believe that energy and water  will be two of the greatest challenges for our national security and  economic stability in the years ahead.\n\nI understand the role of the Indiana State regulators, but I also  believe that the Federal Government and this bill have a role to  promote the availability of a variety of energy resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694858/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…deserve transparency also. It is this transparency that  helps people to have the confidence in the system necessary to prevent  runs on banks.\n\nAgain, I would want people to understand that institutional knowledge  is a supreme exemplar of what can occur when we have these  circumstances that require bold action, but you can't have bold action,  Mr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…pressure on natural gas  prices.''\n\nThat is 30 percent inflation in just one month from just one  facility. Supply and demand is real. This is not complicated.\n\nMr. Speaker, understand what this bill is trying to do. By  stipulating that all exports are in the national interest, you are  stipulating that raising every American's monthly heating bill is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to demonstrate that we can be adults.\n\nSo we were achingly close to a deal, but I am afraid that my  colleagues on the other side of the aisle have run out of patience.\n\nI understand the overall argument about the number of nominees who  are in a backlog. I understand that argument. I am not talking about  that. I am talking about they just want to go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and Republicans are putting our elections in a vice grip-- Executive orders from the President on one end and dangerous  legislation from Congress on the other. They don't understand the  sacredness of elections and keeping them fair. The kind of legislation,  the kind of Executive orders which are so jaundiced, so slanted on the  side of one party, are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I want my colleagues to understand that  when the Affordable Care Act was adopted, it was adopted for middle- class people who could not afford health insurance. They had no other  option. They had nowhere…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696742/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…not go through any committee  in the House, and could never be passed and signed into law if it was  discussed openly where the American citizens could actually see and  understand what was happening.\n\nWe were given a choice the other day, open the government or keep the  government closed.\n\nThe people on my side of the aisle, almost unanimously, voted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the newly sworn-in  Secretary of Transportation, Sean Duffy. Our conversation that night  was one of many that would then span the course of the following year,  trying to understand how an accident like this could occur and how to  prevent it from ever happening again.\n\nAt the airport, we learned the tragic news that there were no  survivors. Of those…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…cannot leave  these decisions to unelected bureaucrats in Washington who don't know  where McCook, NE, is, who don't know the issues facing the Santee Sioux  Nation, who don't understand where Greeley is, where Gothenburg is--and  some, probably, where Omaha or Lincoln are.\n\nJust as important in bringing Federal tax dollars back home, it is  providing that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…I came to Washington, one of my first  jobs was I taught economics. I would say to my colleagues that they  need to get beyond Karl Marx's ``The Communist Manifesto'' to  understand how the world actually works.\n\nWhen Joe Biden was President, prices went up 5 percent a year. Under  the  Trump trade regime that is supposedly making things so expensive…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699967/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…free healthcare, and now the shutdown is simply over whether they  should go home. What we are dealing with is a fetishization of illegal  immigrants that I simply can't understand. Sometimes I think it is  delusion, that they live in a world of sunshine and rainbows and pixie  dust and unicorns where anyone who wants should be able to come to the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…time  and passed, and that the motion to reconsider be considered made and  laid upon the table.\n\nMr. KENNEDY. I will not, Mr. President.\n\nI would like to explain why.\n\nI understand Senator Paul is making a good point. What he is saying  is, rather than saying, as I am, that nobody else is being paid so  Members of Congress shouldn't be paid--I think…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, sometimes in this room I feel like I am in the  twilight zone. We are hearing that the world is going to end, but  Americans  need to understand that this bill does two and only two things. By the  way, these are things that we already do in Florida today, and we don't  have issues with our elections.\n\nNumber one,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700011/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…House NDAA last year,  would ensure that base commanders follow Federal law by ensuring that  only approved flags are flown on military installations.\n\nPatriotic Americans understand that the American flag is to be  revered.\n\nAnybody who has served understands the sacrifice that has been made  to keep Old Glory flying.\n\nOn military bases, it is truly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…afterwards, those same Democrats that said  this about Pearl Harbor, they came after all of us Republicans and said  this January 6 attack was racist. And, you know, I didn't understand  that--being the first day here, I went, Wait a minute. I mean, I  thought we are all in this together. They know dang well this wasn't a  racist attack, but it was just…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…workers because care options are limited or unaffordable.\n\nThe Empowering Employer Child and Elder Care Solutions Act sends a  clear message: We value work. We value family. We understand that the  two are deeply connected.\n\nMr. Speaker, I urge my colleagues to support this legislation, not  only because it is good policy but because it reflects the lived…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…colleagues to support S. 423, and I reserve  the balance of my time.\n\nOne, for the people listening to the rhetoric that came from the  other side of the aisle, they need to understand that the VA has  477,000 employees. With that massive amount of employees, over the last  several years, many of the jobs were not getting done correctly even  though we…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…opportunity, and attention paid to       the merit of the work of employees;\n\n``(v) effectively managing employees with unacceptable       performance, including training to understand the       disciplinary options and procedures available to the       supervisor;\n\n``(vi) effectively using the probationary period to examine       whether an employee has…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…leading to higher rates of both  injuries and fatalities. That is why I introduced this legislation to  ensure that we are doing all that we can at the Federal level to  understand, prevent, and respond to these targeted attacks.\n\nThe Improving Law Enforcement Officer Safety and Wellness Through  Data Act enhances our ability to collect and, more importantly,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the enforcement  of the law over the course of a career, upon retirement those old  animosities often linger.\n\nThose of us who support this measure and support it strongly  understand and argue that it is essential to the safety of our existing  officers and to the safety of our retired officers that we recognize  that ongoing risk and burden that they…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Ms. MURKOWSKI. Mr. President, I understand that there is a bill at  the desk, and I ask for its first reading.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698675/measure-read-the-first-time-hr-6938"}]