[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…no sense.\n\nTariffs will hurt jobs across our region's manufacturing belt, in the  automotive industry, in the energy sectors. The significant harm to our  economy cannot be undone overnight, and it is happening right now as I  speak.\n\nThe regions' economies are intertwined across the Great Lakes, with  iron ore and steel, auto parts and finished vehicles,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…a partisan basis, meaning half the room, they decide what programs to  cut. That means a deal was done in the beginning between Democrats and  Republicans, and then it was undone. The programs that were cut were  the programs, by and large, the Democrats had advocated for. How do you  do the next deal in that situation?\n\nThen we have Mr. Vought saying:…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…It  forced healthcare providers to choose between following their sworn  oath to care for patients or facing criminal charges. It caused trauma  and suffering that cannot be undone.\n\nIn fact, Mr. Speaker, a 10-year-old rape victim was denied the care  she needed and was forced to flee the State  to get the care that saved her life and her future.\n\nYet,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…opportunities in our communities.\n\nThis month and every month, we will continue to make clear that the  contributions of Black Americans will not and cannot be erased,  undermined, or undone.\n\nWe will continue to fight for access to the ballot box, fair  representation, diversity initiatives, and our fundamental freedoms,  which are, sadly, under threat each and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…period, and then  the program reaches the end of the year and poof, like Cinderella's  carriage, it turns into a pumpkin, and the work we passed by law and  authorized by law is undone with no vote of Congress.\n\nMr. MERKLEY. That is a violation of the Constitution. We have the  responsibility to defend the power of the purse. Let's honor our oath  to a democratic…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699431/consolidated-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…period in the law, the funds evaporate at the end of the year. So in  other words, with no approval from the House or Senate, no new law  being passed, the existing law is undone on the clock. It is like-- well, it is like Cinderella's coach. It reaches midnight, and the coach  becomes a pumpkin. It falls apart. It disappears.\n\nThat is a threat that…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…knew that in  their darkest hour, the United States would stand with them.\n\nThen, unfortunately, the Trump administration took over, and in 100  days, this administration has undone six decades of investments that  have made the United States more respected and influential than any  other nation.\n\nThe administration and the President have raised and lowered…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…him, but in the meantime we have to deal with the  wreckage.\n\nIf he, by accident, did something the gentleman agrees with, bully  for him, great, but in the meantime, he has undone the will of  Congress. He has nullified and canceled hundreds of millions of dollars  going out to public safety and criminal law enforcement across America.\n\nLet's get back…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…that a deal be a deal; that  Congress fully live up to it but the White House fully live up to it as  well.\n\nWe have seen, throughout this year already, congressional deals  undone by the President unilaterally: tens of thousands of people  fired, economic development projects that had been announced and  celebrated canceled, funds to public health Agencies…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…later? It is  a betrayal. But bailing on the agreement is exactly what this bill is.\n\nDemocrats and Republicans together made those spending decisions, and  now they are being undone in a purely partisan fashion. They are  breaking the deal. They are going back on the agreement. They are  breaking their word. That is pretty shameful, and it is why my  colleagues…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…committee. Over the course of the prior year, both  the House and Senate had passed a Farm Bill and having to change all  the numbers during conference negotiations would have undone a year's  worth of work. There is also longstanding precedent to not update for  new baseline estimates at the last minute when a bill that has been  carefully negotiated is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…congressional Republicans refuse to stand up for their constituents,  they diminish their power and Congress' and damage the country's  democratic future.\n\nAt the same time, Trump has undone Congress' decades-long ethics  rules and enforcement laws. In doing so, he has removed many of the  institutions and watchdogs that would serve as a check on his own self-…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…have demonstrated that that is who they are. These are their  true colors. We cannot expect Democrats to go along with any bipartisan  funding deal if that agreement can be undone with a party line vote.  Congress must assert its authority over the power of the purse.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Global                              Health Programs                              (April 2, 2025)\n\n``In less than two months, the Trump Administration has       undone six decades of investments that made the United States       more respected and influential than any other nation. The       resulting chaos has left us weaker and more vulnerable.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the disbursal of funds;  by freezing the funds; by impounding the funds; by delaying until the  end of the year and then submitting a request to legislatively have the  funds undone but then the clock runs out on the year, and poof, the  funds disappear. He has a fancy name for it: a pocket rescission. But  think of it more like the carriage in ``Cinderella''…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…used to be. That is not what is happening  anymore.\n\nSo I wanted to be able to talk through with this body a few of the  things that I saw there and the work that is still undone.\n\nOne, that section of the gap in the fence is right there at Tijuana,  on the eastern side of San Diego. That gap is still there, but  something has changed. Construction…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…taking from the State and private mineral owners.\n\nThroughout the rulemaking process, this point was made very clear,  but BLM ignored it. And it is unacceptable and needs to be undone. And  I will add that it needs to be undone by Congress so it is clear to the  bureaucracy that this sort of resource management plan is out of  bounds.\n\nBy passing this resolution,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…enhance our  election administration, and make our elections secure.\n\nThis legislation is just one step that we can take to ensure  President Trump's executive order could not be undone. Americans  deserve to have confidence in our elections. We must pass the SAVE Act  to prevent noncitizen voting and secure our elections.\n\nMr. STEIL.  Lee), the chair of the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…no way to build long-term  infrastructure in our country.\n\nWe need a cross-border permitting process that is transparent,  predictable, and durable, a process that can't be undone with the  stroke of a pen. The Keystone XL Pipeline should have been a wake-up  call. It would have carried 800,000 barrels of oil each day from Canada  to refineries in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}]