[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and gas companies and  producers, I should say, that this helps because they don't want to  have to upgrade. They don't care. They just want to pollute. That is  really the unfortunate part of all of this. Instead of encouraging the  good actors, we encourage the bad actors.\n\nMr. Speaker, addressing methane pollution can yield tremendous  financial, climate,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…said they are willing to support the  resolution. That hasn't been enough for our Republican colleagues. This  is the time for sunlight instead of fear of sunlight. It is unfortunate  that this transparency, which should not be controversial, is not  included in this bill.\n\nI will be voting for this bill, as we did in committee, but it is  relatively…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…it into the country, paid $40,000 for it, and then  had to pay $4,000 more, making it $44,000, adds that $4,000 to the  product when you buy it. That $4,000 is added.\n\nThe unfortunate thing is that it is not done the way a sales tax is  done. It is not noted that you are paying it. You pay it because it is  a part of buying the product, but there is nothing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…privilege. I  consider myself to be blessed. I think here in Congress, a lot of the  time, we see a lot of people born on third base thinking they hit a  triple. That is the unfortunate reality of where we find ourselves-- people forgetting where they came from, people forgetting what we went  through, people forgetting how we got here in the first place,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…simply reinvent and pretend, if you will, that the color black is the  color white or an orange is an apple--because everyone understands a  waiver is not a rule.\n\nSo it is unfortunate that the colleagues in charge of the legislative  process have so corrupted it yesterday and today, not even trying to  actually enact the law to accomplish what they want…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Americans. It will hurt people that Republicans  represent in rural America and all while undermining American  leadership in the world.\n\nMr. Speaker, once again, this is unfortunate. Once again, we see a  Congress not functioning as a separate and coequal branch of  government. We see a Congress, given this Republican majority, not  willing to serve…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Black women  and men have always been on the front lines, standing for the values  that make our Nation great.\n\nWith such a storied legacy of service to our Nation, it is  unfortunate that racially discriminatory practices have for too long  obstructed Black veterans from equally accessing veterans benefits,  like housing, education, and healthcare.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…support that. I will not vote to send more money to see innocent men,  women, and especially children slaughtered the way it is taking place  right before our very eyes.\n\nThe unfortunate thing is there are too many among us who are afraid  to speak up. I refuse to be among those who at this time are  challenging controversy, who would sit and cower. I am…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…grid  operator can prove that to you in the way they actually operate our  electric grids. They call up clean energy first because it is less  expensive, period.\n\nSo it is unfortunate that here we are with this web of denial  controlling so much of what happens in this building--fossil fuel  industry dark money slashing through this building--and we can't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in strong opposition to H. Res.  516, the Condemning the violent June 2025 riots in Los Angeles,  California. It is deeply unfortunate that instead of working with  Democrats on a bipartisan resolution to condemn violence, Republicans  have instead written a partisan resolution designed to attack elected…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that is to find common ground.\n\nYou don't always pick your neighbors, but you find a way to live next  to your neighbors. You find a way to work with them. And what is so  unfortunate about what is going on tonight is that it didn't happen  here. There was no crossing over the fence with some coffee for the  neighbors to try to have a meeting, to try…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…wage  war by decree. That is why today, I proudly voted for two War Powers  resolutions to block further escalation and reassert Congress's  constitutional authority. It is unfortunate that Democrats had to force  these votes under the War Powers Resolution just to ensure Congress  carries out its duties, despite Speaker Johnson's best efforts to keep…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…will give  polluting gas plants an unfair and costly shortcut to the electric grid  while doing nothing to protect working families from rising energy  costs.\n\nThis is an unfortunate theme this Congress. Despite the promises of  the President and my Republican colleagues in Congress, they haven't  brought any bill that will help address the affordability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Defense Authorization Act is an important piece of  annual legislation that governs the policies of the Department of  Defense and authorizes our common defense. It is deeply unfortunate  that Congress considers this year's NDAA amongst a steady stream of  alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…additional maintenance costs, as  well as unforeseen accidents, as we just saw with the USS Harry  Truman's high operational tempo while deployed in the Middle East. It  is unfortunate that the Department of Defense has failed to provide the  Appropriations Committee with a full account of operational costs in  SOUTHCOM and a projection of what future…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "James Risch", "party": "Republican", "sentence": "…U.S. interests and  citizens. The operation only saw 200 troops, and they were inside  Venezuela, on Venezuela's soil, for less than 2 hours. Those troops  engaged with some unfortunate Cuban guards, who are no longer with us,  for 27 minutes. That is what this was made up of. It was incredibly  brief, targeted, and very successful.\n\nThe War Powers Act…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…side--not one objection  from one Republican.\n\nIt is the Democrats that are holding it up here. We are not the ones.\n\nSecondly, I want to make very clear: This is a very unfortunate  occurrence in the Senate. It is a bad habit that we have gotten into,  and it is a habit that we must break.\n\nThe habit involves raising an objection. One of the things…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…assault, murder,  drug trafficking, human trafficking, violent crime, and property crime,  you name it, Mr. Speaker, illegal immigration makes it worse.\n\nWhat is perhaps most unfortunate is that many of the worst offenders  in this specific category return to the United States after being  deported due to gaps in the current immigration law.\n\nAs a former…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…sanctity  of Social Security. I have said that, and our colleagues have said  that. We have done nothing.\n\nPutting out false information to the American people is really  unfortunate because it does frighten people. However, we have the facts  on our side, Mr. Speaker, and the facts are that no bills we passed,  the budget bill nor the Trump administration…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…stand  and applaud.\n\nYet, the contrast could not have been starker in President Trump's  speech and the reaction to it here in the Chamber on Tuesday.\n\nI think that is really unfortunate because Americans of all party  affiliations--Republican, Democratic, Independent, Green Party,  whatever the case may be--repeatedly say in overwhelming numbers that  the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…at the U.S. Capitol.\n\nIn my former life, I was a talk show host. I did many other things,  but as a talk show host, in my community one time, there was a  shooting. It was unfortunate. It was a young man who got pulled over.  Police were questioning this young man, and as he was talking to the  police, he turned and started to run. As he turned and started…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Unfortunately, the Postal Service has done nothing about it.\n\nMiami Lakes alone has gone through the USPS' boundary review process  three times to no avail, which is, again, unfortunate.\n\nWhile the Postal Service operates, by the way, on a fee-for-service  basis and receives no direct appropriations--I want to make sure that  everybody understands that--my…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…not subjected to the swing of the  political pendulum with ever-changing interpretations of the law.\n\nFurther, this legislation is simple and pro-consumer choice. It is  unfortunate that my colleagues on the other side of the aisle are  seeking more regulation for its own sake and limiting the choices of  American consumers. If an individual wants low…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the complexities of arrest or the nuances of  reasonable suspicion, Democrats are instead attacking their authority,  their dignity, and their work at large. That is beyond unfortunate as  ICE agents are arresting some of the worst criminals imaginable.\n\nDuring the first year of the Trump administration, ICE arrested 7,000  gang members from America's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to know each other  pretty well in significant late-night engagement in debate. The ranking  member of the Committee on Rules, Mr. McGovern from Massachusetts, has  had an unfortunate loss that words cannot possibly convey as a dad what  he and his wife are going through with the loss of his daughter, Molly.\n\nI say from this side of the aisle, I know…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…constituents and on all  Americans who enjoy outdoor recreation.\n\nMr. Speaker, I am prepared to close and continue to reserve the  balance of my time.\n\nI just want to say that it is unfortunate that we are having to use a  Congressional Review Act, but it is unfortunate that a former  administration tried to legislate from the administrative branch.\n\nThat is the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…page of every newspaper, on every TV  channel, as has the broader American public.\n\nThis issue has been so politicized by so many people in so many ways,  which is deeply unfortunate when we are talking about matters of the  highest sensitivity and untold suffering.\n\nIt is my hope that the passage of this resolution today, together  with the work of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696819/epstein-files-transparency-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…And if we tie them together  surgically in one bill, it will impair their passage, Republican and  Democratic alike. We don't need to do that here. We ought not. This is  unfortunate, but I will be back soon.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…from agriculture in the Central Valley, it is  unsustainable. You can't grow anything without water.\n\nWe need to get back to the science, as Mr. LaMalfa stated, and it is  unfortunate that we have to do a CRA on an  endangered species listing, but that is what happens when  administrations make bad decisions.\n\nMr. Speaker, first, I acknowledge and agree…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…do just one last little fact check on that. When you look at  who has the most homicides and some of the highest crime rates, it is  indeed Republican States. Yes, it is unfortunate, and it is something  we need to work on. Democrats raise this issue all the time, but the  highest levels of crime and homicides are--let me go through those  States--Mississippi,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]