[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…counterparty. You succeed as a real estate  wheeler-dealer if your counterparty goes away angry. I tell you what,  if you are a manufacturer, the last thing you want is an unhappy  customer.\n\nDemocrats understand that the real job creators in this economy are  customers, and we understand that customers come from the middle class.\n\nFor time immemorial,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…like a toxin.\n\nLook, we know how tonight is going to work. Donald Trump will claim  that everything in America is going great, but he is in a huge bubble.  America is deeply unhappy with his leadership, and he will blame  everyone else for all our country's troubles. He will blame Biden. He  will blame the Supreme Court. He will point the finger at everyone…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…whole British Empire if not its total Destruction,'' he wrote       in January 1773 to Rhode Island's deputy governor, Darius       Sessions.\n\n``I have long feard that this unhappy Contest between       Britain & America will end in Rivers of Blood,'' Adams wrote.                    An `uncelebrated burning' is forgotten\n\nMost of the Rhode Islanders…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…or two John McCains who are  going to step forward and lift their hand enough to vote and save  health insurance for Americans across the board. I know some people  would be unhappy; in fact, some may threaten to defeat you politically  because of it.\n\nBut I am sure that after John voted no to save the Affordable Care  Act despite President Trump's telephone…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…responsibility now to make it better so that we can turn this  around and make this agency work.\n\nI am not for abolishing ICE. There will be a lot of people who are  going to be unhappy with my saying that, but so be it. We need to  reform it. We need to turn it around. We need to make it work on behalf  of the American people, not make it the fear that a…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Okay, Mr. Trump,  Elon is obviously your bestie, and he spent all this money. So we will  go along with it--even though apparently the Cabinet and Republicans  were really unhappy about it.\n\nThey are, like, okay, fine.\n\nThen we are going scorched Earth here now. It was actually really  interesting to me earlier on the House floor. How are Republicans…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…ICE is fully funded for the next 3 years because of the  reconciliation bill we passed last year. So Democrats really can't  impact the funding of the Agency that they are unhappy with.\n\nNow, they have various demands that they have with regard to this,  and again, some of these demands are already addressed in the Homeland  Security bill. For example,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…all 4,  $4.5 trillion.\n\nOne of the hardest votes I made in my decade-plus here was standing  right there and swallowing saying: I am going to vote for this, but I  am really unhappy because we are capable of doing more. And if we don't  start to telegraph to the bond markets we are going to do something  serious, at what moment does the bond market say:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…When you talk about  testimonials in the old Soviet Union, Mr. Speaker, and probably to this  day because the work ethic hasn't changed enough, you run into a lot of  very unhappy people because they are stuck in an economic system in  which they have to work for the government.\n\nAs a matter of fact, I know a friend who went to Cuba. It was an  interesting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…intellectual laziness, I thought, of the Senate. Look, this is where I  am being a bit sarcastic, if not mean. The House is not perfect. There  are a number of things I am unhappy with. Leadership still doesn't have  my vote on it until I get some agreements that we are able to move  policy to start changing some of these numbers, but I have shown up…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…not just a  cause that we should care about for the Iranian people, though we  should. As Americans, we are a people whose country was founded because  a group of people were unhappy by the tyranny we faced. There is no  question they face it over there, as well.\n\nThe cause of Iran is one that we should care about because it is in  the best interest of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…into the general fund to  pay for it? Probably. It is not in the debt projections yet. The scale  of this is off the charts.\n\nBack to the math problem. If I am making someone unhappy, be mad at  the math, not me. Be mad at all the people who have never told you the  truth with a calculator.\n\nHow do I save my future? Remember, my little boy turned 3 years…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…hoax.\n\nThis little girl was in a Western country, a well-off family,  somebody who hypothetically should have been happy, right? According to  her father, Greta Thunberg was unhappy, despite all her material  wealth. I think that is true of a lot of people, sadly. They are  spoiled people with time on their hands in the West.\n\nShe became happy by spending…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of borrowing, and they look at  you angrily because, my belief is, the political class for so long  hasn't told the truth.\n\nLet's go on our truth binge. Anyone I am making unhappy, grab your  phone, grab your computer, and go hit DOGE.gov. It is right there. It  is live right now. You can go look it up. I actually really support  using technology to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the young girl who was obsessed with global warming in Sweden.\n\nWe will call it Thunberg syndrome. You all remember the little girl  whose father said she was depressed and unhappy, but then she read  about global warming and decided to obsess over it. She, all of a  sudden, became happy because she could run around and had a purpose in  life. Prior…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}]