[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…of them were convicted of  violently assaulting law enforcement officers. It was a blatant and  disgusting disregard for the rule of law and for our fine men and women  in uniform.\n\nNext, during his first week, he fired nearly 20 inspectors general,  the independent watchdogs in the executive branch agencies. It is their  responsibility to ensure that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Constitution.\n\nThat is why we reject any further U.S. military intervention without  congressional authorization. If we are together, as a nation, to put  our men and women in uniform at risk, then our Constitution wisely  demands that the decisions be made by the Representatives of those  people. It may well be that Congress will have voted for or against…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…home.\n\nIt is not about the rhetoric or just the celebration of birthdays.  What really matters is what we do between the birthdays to keep faith  with our men and women in uniform and afterward when they return to our  great Nation. We can leave no veteran behind in healthcare as well as  in education and training and in everything they need to be successful…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…safety.\n\nI do all this and support this bill, despite my extreme lack of  confidence in this Pentagon's leadership, but I must always support the  men and women who wear the uniform. Our servicemembers and their  families make extraordinary sacrifices for our Nation, and now,  especially now, we must fulfill our commitments to them.\n\nMr. Speaker, with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…served in the U.S. Marine Corps. I swore an oath to support and  defend the Constitution of the United States, and I know what it means  to take that oath seriously, not just in uniform but in life, which is  why I will be offering an amendment to the Defense appropriations bill  to ensure that military funeral honors remain reserved for those who  have defended…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…When a young person signs up to join the military, Americans make  them a promise that we will take care of them for the rest of their  lives because they have put on the uniform of this country and risked  their lives for all of us.\n\nThat is why it is perplexing and unconscionable that this  administration has proposed devastating cuts to VA healthcare…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…make: I understand why our administration  was very careful in disclosing information about the removal of Maduro  from office. The lives and futures of the men and women in uniform from  the United States were on the line, and we should not compromise their  safety in any way to achieve our goal; but there comes a point--and  that point should be immediately--when…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…because we understand that an injustice anywhere is a  threat to justice anywhere. Today, that legacy lives on through the  more than 350,000 Black Americans currently serving in uniform and the  more than 2 million Black Americans who are veterans. They served with  that same courage, that same resilience, and that same excellence as  those who came before…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Trump negotiations as to a nuclear agreement was the  bombing campaign that Netanyahu did that sabotaged those talks.\n\nAgain, I say congratulations to our men and women in uniform who,  when they were ordered by the President to do the strike on the nuclear  facilities, did it and did it well, but we should not at all discount  how precarious that situation…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…sacrifice--the physical cost of defending our freedoms.\n\nCorporal Donald served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous years of conflict, ending in 2011.  During that period, he witnessed the loss of many fellow Marines-- brothers and sisters in arms…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…clear plan, not with honesty,  but with a President who thinks foreign policy is a reality show and  human lives are props.\n\nLet's be clear about what is at stake: Americans in uniform, American  families, a region that could explode, an economy in which working  people are already struggling to survive, and where a wider war could  set energy prices soaring…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…newer challenges in this country.  I feel a deep urgency to support mental health issues in particular  because I lost one of my dear childhood friends, who died by suicide in  uniform.\n\nI want to make a simple adjustment to this legislation--very simple.  What it would do is basically say that when this body has approved  these grant programs, the President…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…veterans, creating  jobs, and boosting our local economies.\n\nMr. Speaker, I urge my colleagues to support this bill and show our  veterans that we have their backs, both in uniform and beyond.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…markup that passed out of the Armed Services  Committee. The bill that we delivered to this floor this week was  overwhelmingly bipartisan. It supported our men and women in uniform  and strengthened our national defense.\n\nIt was an honor to work so closely with Chairman Rogers and Ranking  Member Smith on that bill.\n\nUnfortunately, the toxically amended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Toxic Exposures Fund, which  was created to support veterans exposed to burn pits and Agent Orange.  We made a promise to stand by the men and women who served our country  in uniform. This bill does not live up to that promise.\n\nMr. Speaker, Republicans need to stop taking photographs with  veterans and then vote against their healthcare.\n\nThose who lead…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, 2026, is a testament to caring for those who have  selflessly worn America's uniform, their families, and the defenders  who follow their path of service. We meet this mission not only in  words of gratitude but in policies that support them.\n\nThis legislation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with the Federal Land Policy and       Management Act of 1976 (43 U.S.C. 1701 et seq.); and\n\n(2) based on an appraisal that is conducted in accordance       with--\n\n(A) the Uniform Appraisal Standards for Federal Land       Acquisitions; and\n\n(B) the Uniform Standards of Professional Appraisal       Practice.\n\n(e) Costs.--In addition to the fair market…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…motor  vehicle accident. His death will be felt by his family, his fellow  officers, and our entire State.\n\nChristopher Ohlmeyer was a great officer, but he was more than the  uniform he wore. He was a husband, a father, and a friend.\n\nThe way that he died, though tragic, is a testament to the way he  lived. Deputy Ohlmeyer was struck as he was serving…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699609/9999"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…opportunity to advance his education and training, further his  knowledge, and move up within the company.\n\nAdditionally, a fellow Army veteran, Elder Childs served his country  in uniform while also deepening his faith and love of fellow man, a  lesson that would stay with him throughout his life.\n\nWhen Elder Childs was first appointed pastor of St. Clara's…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…ultimate sacrifice  for their communities, and they need our support now more than ever.\n\nI had a colleague of mine in the Judiciary Committee today make a  great point. That uniform now includes a bulletproof vest. They know  what they have signed up for. They wear that as a matter of procedure  because every single day they go out there, they assume…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…programs to as many as  6,000 elementary students each fall. In a city where many families face  economic hardship, this may be the only chance some children have to  wear a uniform, be part of a team, and to feel that sense of belonging.\n\nThis is not a school-funded program. It exists because individuals in  our communities step up. It is working. Research…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…there for America every step  of the way. For 389 years, these men and women have represented  America's best.\n\nMr. Speaker, today we honor the men and women who have worn the  uniform of the National Guard, past and present. We salute their  sacrifice, their courage, and unwavering dedication to serving the  American people through war and peace, disaster…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…technology, and innovation. Its cutting-edge advancements will  drive the future of food production and environmental stewardship.\n\nThe blue FFA jacket is more than just a uniform. It symbolizes hard  work, commitment, and leadership. The young men and women who wear it  today are tomorrow's farmers, veterinarians, researchers, policymakers,  and business…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Association, and VFW Post 9738.\n\nMr. Speaker, I am honored and privileged to recognize Chief Master  Smith on his retirement upon more than 38 years of service to our  Nation in uniform--26 of those in the Pennsylvania Air National Guard.  His tireless service and dedication to his fellow Airmen and the United  States of America set the standard by which…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…alone.\n\n``Fearless'' isn't just her nickname. It is a legacy she is building  with every mile.\n\nMr. Speaker, today we salute Andrea Smith Brown for her service not  only in uniform but also her continued devotion to others by showing  what it means to serve, heal, and keep moving forward.                           Recognizing Dr. Jim Hotz\n\nMr. CARTER…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "John Rose", "party": "Republican", "sentence": "…taxes. It puts many of our  law enforcement officers in a tax bracket that costs them more money.\n\nFortunately, it is not about the money for most of our men and women  in uniform. Fortunately, the One Big Beautiful Bill Act ensures that  our brave law enforcement officers won't be taxed on their overtime  pay.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…legacy. Let's  reignite growth. Let's rein in some of the spending and root out the  waste, fraud, and abuse in these programs. Let's reinvest in our sons  and daughters in uniform who do the most difficult and dangerous jobs.\n\nLet's look not where the puck is but where the puck is going, as they  say in hockey. Why would I know anything about hockey?…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…has the opportunity to right its wrong.\n\nThe Lumbees are more than 55,000 strong, making them the largest  Tribe east of the Mississippi. They have defended this Nation in  uniform. They have contributed to our economy and preserved a proud  heritage that strengthens our State and our country.\n\nToday, this House has an opportunity to finally deliver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695243/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…$28.4  billion in regulated market activity, and produces some $1.5 billion in  state tax revenue.\n\nThe hemp industry has stepped forward to self-regulate in the absence  of uniform federal regulations--uniting behind a framework which  restricts the sale and possession of hemp products to adults 21 years  and older, standardizes packaging to eliminate…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…of all walks of  life to participate in local celebrations across our beautiful country.\n\nI am grateful to celebrate 250 years of freedom and honor all those  who served in uniform to keep us free for generations yet to come.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}]