[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…of them were convicted of  violently assaulting law enforcement officers. It was a blatant and  disgusting disregard for the rule of law and for our fine men and women  in uniform.\n\nNext, during his first week, he fired nearly 20 inspectors general,  the independent watchdogs in the executive branch agencies. It is their  responsibility to ensure that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Constitution.\n\nThat is why we reject any further U.S. military intervention without  congressional authorization. If we are together, as a nation, to put  our men and women in uniform at risk, then our Constitution wisely  demands that the decisions be made by the Representatives of those  people. It may well be that Congress will have voted for or against…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…devoted their lives to  caring for veterans, and now, with the sweep of a hand, they get the  back of a hand from Elon Musk, who has never ever even thought about  wearing the uniform of the U.S. military.\n\nThese human impacts include world-class researchers who are looking  into how to predict stroke risk among veterans; enrollment of veterans  into clinical…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…markup that passed out of the Armed Services  Committee. The bill that we delivered to this floor this week was  overwhelmingly bipartisan. It supported our men and women in uniform  and strengthened our national defense.\n\nIt was an honor to work so closely with Chairman Rogers and Ranking  Member Smith on that bill.\n\nUnfortunately, the toxically amended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Through this bill, we have the solemn responsibility of appropriating  the funds necessary to defend our Nation and to protect the safety and  well-being of our men and women in uniform. However, I must oppose this  bill which abandons our allies, damages our military readiness, and  promotes divisive policies that undermine morale.\n\nI come from a defense-dependent…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…When a young person signs up to join the military, Americans make  them a promise that we will take care of them for the rest of their  lives because they have put on the uniform of this country and risked  their lives for all of us.\n\nThat is why it is perplexing and unconscionable that this  administration has proposed devastating cuts to VA healthcare…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…uniformity of safety       standards, treatment, and management, such as--\n\n(i) disseminating information on concussion safety and       management to the public; and\n\n(ii) applying uniform best practice standards for       concussion safety and management to all students enrolled in       public schools.\n\n(2) Posting of information on concussions.--Each public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…percent of veteran cases back to the board, resting the clock and  compounding delays.\n\nMadam Speaker, our obligation to veterans does not end when they no  longer serve in uniform. It continues in how we care for them, how we  honor their service, and how seriously we take the responsibility to  deliver the benefits they have earned. That is what guides…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…on-base housing during their  service.\n\nThese are all veterans who continue to carry hidden wounds from  service that often don't show up until years after they take off the  uniform.\n\nAs we learn of these communities with toxic exposure and illness  beyond the battle, we need to make sure that we have adequate systems  in place to take care of them. This…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…answered the call and put their lives on the  line to protect their neighbors.\n\nAs a former prosecutor and Army veteran, I understand the mission  that our men and women in uniform take on every day. They serve knowing  that their work is bigger than any one person. It is about protecting  our communities and upholding the law for our families and loved…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691301/commending-virginias-seventh-district-law-enforcement-officers-for-their-bravery"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…particularly likely to  lack documentary proof of citizenship, including passports, copies of  their birth certificates, or other documents.\n\nWhat about the men and women in uniform who serve our country all  over the world?\n\nCan a member of our military use their military ID?\n\nSurely military IDs should be enough to register to vote, but not  according…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…newer challenges in this country.  I feel a deep urgency to support mental health issues in particular  because I lost one of my dear childhood friends, who died by suicide in  uniform.\n\nI want to make a simple adjustment to this legislation--very simple.  What it would do is basically say that when this body has approved  these grant programs, the President…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…responsibility Congress has under the Constitution. Let's not surrender  our responsibility to a President who speaks so casually about taking  over other nations. Our men and women in uniform deserve better than  that, and our country deserves better than that.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…safety.\n\nI do all this and support this bill, despite my extreme lack of  confidence in this Pentagon's leadership, but I must always support the  men and women who wear the uniform. Our servicemembers and their  families make extraordinary sacrifices for our Nation, and now,  especially now, we must fulfill our commitments to them.\n\nMr. Speaker, with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…physical, and our emotional health are critically  important to our success as leaders. It is important to our teachers,  our taxi drivers, our nurses, our men and women in uniform, our police  officers, our firefighters, and the people that are working everyday  jobs who keep America moving.\n\nWhat makes America tick? Americans make America tick. Healthy…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is why I am proud to cosponsor legislation that honors fallen  officers and strengthens protections for those who continue to serve. I  thank every officer who puts on the uniform each day with courage and  conviction. On behalf of a grateful nation, we salute them.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…values, and  protected the American people with unwavering courage.\n\nThis historic anniversary reminds us of the countless sacrifices made  by generations of men and women in uniform, those who have answered the  call to serve, often at great personal cost.\n\nOn this special occasion, we honor their legacy of dedication and  resilience that continues to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, every American who puts on the  uniform deserves to be remembered with dignity and respect.\n\nI was proud to introduce the bipartisan Fallen Servicemembers  Religious Heritage Restoration Act to help ensure that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689753/american-jewish-servicemembers-to-be-buried-under-the-star-of-david"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…He enlisted in the Iowa Army National Guard. It was there that he  learned the mundane tasks of a young soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills in a blustery cold Iowa. But he also learned the more  impactful lessons in the National Guard, such as leadership and  teamwork and caring…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…country has carried out one of the boldest law enforcement  operations in decades, and we should be very proud. We should celebrate  it and be proud of the men and women in uniform who made sure this was  successful. This administration had the courage to do what was right,  what needed to be done; and America, Venezuela, and the world are much  safer…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…legacy. Let's  reignite growth. Let's rein in some of the spending and root out the  waste, fraud, and abuse in these programs. Let's reinvest in our sons  and daughters in uniform who do the most difficult and dangerous jobs.\n\nLet's look not where the puck is but where the puck is going, as they  say in hockey. Why would I know anything about hockey?…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…look to pop culture for their  heroes, but their heroes walk right among them, right in their own  communities every single day, again, being willing when they put on  that uniform, when they sign up, to say, ``I will give all for my  community,'' running to the sound of the gun, running to the danger,  unlike most other people whose senses, whose sensibilities,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "John Rose", "party": "Republican", "sentence": "…taxes. It puts many of our  law enforcement officers in a tax bracket that costs them more money.\n\nFortunately, it is not about the money for most of our men and women  in uniform. Fortunately, the One Big Beautiful Bill Act ensures that  our brave law enforcement officers won't be taxed on their overtime  pay.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with the Federal Land Policy and       Management Act of 1976 (43 U.S.C. 1701 et seq.); and\n\n(2) based on an appraisal that is conducted in accordance       with--\n\n(A) the Uniform Appraisal Standards for Federal Land       Acquisitions; and\n\n(B) the Uniform Standards of Professional Appraisal       Practice.\n\n(e) Costs.--In addition to the fair market…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…has the opportunity to right its wrong.\n\nThe Lumbees are more than 55,000 strong, making them the largest  Tribe east of the Mississippi. They have defended this Nation in  uniform. They have contributed to our economy and preserved a proud  heritage that strengthens our State and our country.\n\nToday, this House has an opportunity to finally deliver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695243/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…It also means fostering a  climate of respect and appreciation for the burdens they and their  loved ones carry.\n\nI remain steadfast in my commitment to those who wear the uniform and  to the families who sacrifice alongside them. Their service deserves  not only our gratitude but also our unwavering support.\n\nLet us come together this week and throughout…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…servicemembers and their families.\n\nIn Congress, I remain committed to supporting legislation that  strengthens our national defense and honors the men and women who wear  the uniform.\n\nMr. Speaker, I wish a happy 250th birthday to the United States Army.  May their legacy of service continue for generations to come.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, 2026, is a testament to caring for those who have  selflessly worn America's uniform, their families, and the defenders  who follow their path of service. We meet this mission not only in  words of gratitude but in policies that support them.\n\nThis legislation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…again  unilaterally plunge the American people into war without the people's  representatives in Congress debating the issue. We owe it to all  Americans who have worn the uniform to honor that humbling  responsibility.\n\nMoreover, despite the tactical success of our strikes, they may end  up proving to be a strategic failure. It is unclear if this…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…and (2) one motion to recommit.\n\nSec. 6.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 3062) to       establish a more uniform, transparent, and modern process to       authorize the construction, connection, operation, and       maintenance of international border-crossing facilities for       the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]