[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…fragility and of the danger. Nuclear-armed  India exchanged fire with nuclear-armed Pakistan just this year. Cooler  heads prevailed, this time.\n\nNuclear-armed Israel conducted unilateral strikes on facilities in  Iran. That war didn't go nuclear this time.\n\nNuclear-armed Russia continues its brutal war of conquest in Ukraine.  We are avoiding escalations…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the  precipice--the precipice of war, a constitutional crisis, and millions  living in fear and marching in the streets.\n\nMr. Speaker, 3 days ago, the President ordered a unilateral military  strike against Iran and notified the majority of Congress and the  American people, essentially, by tweet, using a social media post on  Truth Social.\n\nDays later,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…obligation to brief Congress and has reportedly threatened  to take steps to choke off the amount of information we have and need  to assess the impact and the consequences of unilateral military  action; an administration that openly disdains and threatens a free  press, ignoring the fact that our fourth estate exists to ask questions  for the people, even…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…should do every 5 to 10 years. The world is constantly  changing, and our priorities and funding decisions need to adapt. But  for an administration to take such a drastic, unilateral step is  unprecedented, short-sighted, and certain to weaken U.S. global  leadership and U.S. national security.\n\nAmong the organizations and programs the President plans…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…resolution they have thrown up at  the last minute here.\n\nMr. RASKIN. There is nothing in there except for a series of  qualifying weasel words which are added to give complete, unilateral,  and subjective discretion to the Attorney General to decide what should  be in and what should be out. It starts off by saying whereas--our  resolution says: ``All documents,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693713/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States has carried out four lethal  strikes on boats in the Caribbean, reportedly killing 21 individuals.  These attacks have been retroactively explained by the President's  unilateral declaration that the United States is in ``armed conflict''  with unnamed ``non-state armed groups'' throughout the Western  Hemisphere.\n\nHe has deployed thousands of U.S.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…extension, our constituents the chance to  openly debate  issues that demand answers, like the National Guard in our streets, the  purges at the Pentagon, or the abuse of Trump's unilateral military  force abroad.\n\nNot surprisingly, not one of the ten amendments I submitted were made  in order.\n\nLet me tell you what Republicans apparently don't care about:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…filibuster. No. What  Republicans are proposing to do would go far beyond just eliminating  the filibuster. If they insist on plowing forward, Federal Agencies  will now have unilateral power to trigger privilege on the Senate floor  with no institutional check from the legislative branch.\n\nJust as EPA has submitted California's waivers with full knowledge…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…withholding the amounts until they can no longer be used. But to quote  the late Justice Scalia, the Congress ``does not, one might say, hide  elephants in mouseholes.'' Indeed, unilateral actions by the Executive  Branch that would impound congressionally passed and duly enacted  appropriations is the very thing the Impoundment Control Act prohibits.\n\nDirector…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…comes to  Federal resources.\n\nFunding laws are still laws, and Congress passed these laws with  bipartisan support to direct resources to these programs. No President  gets unilateral say on how any law is implemented, and no President  gets to overrule Congress's bipartisan laws.\n\nBut the legislation pending before the Senate today would open up a  slippery…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…issues of nuclear weapons, arms control, and strategic  stability, not as abstract policy debates but as matters grounded in  technical reality.\n\nArms control is not about unilateral disarmament, wishful thinking,  fantasies of dominance, or trusting adversaries. Arms control is about  verifiable limits, predictability, and reducing the risk of  miscalculation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…three Iranian  nuclear facilities. There was no congressional authorization. There was  no debate in this Chamber. There was no vote in this Chamber. The  President made a unilateral decision that risked bringing the United  States into another extended war in the Middle East.\n\nThat is not how our Founders designed our Nation through the  architecture…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…authorize the funds to pay for war.\n\nMr. Speaker, I strongly supported this year's national defense bill.  We must conduct vigorous oversight to halt this executive branch  unilateral war-making. Our soldiers deserve us to do that.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…strategy.\n\nI ask my colleagues: Remember what Colin Powell used to say about  military force? You break it; you own it.\n\nIt is the old Pottery Barn rule.\n\nThis is the danger of unilateral attacks against Venezuela. If we  break it, we are going to own it. The mere thought of another endless  war ought to make the American people sick to their stomachs.\n\nSo,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…not only the Korean American community but also many       residents across the area.\n\nThe Korean American Federation of Los Angeles (KAFLA)       strongly condemns these unilateral and excessive enforcement       measures, particularly those executed without adherence to       due process. We urgently call upon our local, state, and       federal elected…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…necessity, not a political football.\n\nThe resolution before us does not mandate projects, mining sites,  firms, or schedules. It simply reverses the Biden administration's  unilateral short-circuiting of the normal permitting process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…(Critical Questions by Gracelin Baskaran)\n\nThe African Growth and Opportunity Act (AGOA), first signed       into law by President Bill Clinton in 2000, is a unilateral       U.S. trade preference program set to expire in September       2025. Its pending reauthorization has sparked debate over       whether--and how--it should be extended…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…enforcement action that the military was merely assisting.\n\nThat is the problem we have because then it became obvious that we  were undertaking a military exercise. If the unilateral use of force  was not enough, then the executive has compounded this abuse by seizing  Venezuela's oil revenues, selling them, and depositing that money in  U.S. Treasury-controlled…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Cross-Border Energy  Infrastructure Act. This legislation will help fix this problem. This  bill requires Congress to approve the reversal of a cross-border  project, no more unilateral decisions based on politics.\n\nThis bill would also replace the outdated Presidential permitting  process with a clear statutory framework: the certificate of crossing.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…times of need: The  President can have the power to put on tariffs. It never says that.  This will be an extraordinary use of something never intended to be a  way to have--unilateral--one single person invoke a tax on the people.\n\nWith regard to tariffs, let's be very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…suffocated under the enormity of regulatory burdens implemented under  the Biden administration. To be clear, the Biden administration cost  the taxpayers $1.8 trillion through unilateral rulemaking and executive  orders.\n\nThis brazen abuse of executive power stymied commerce and our free  markets and directly affected our ability to innovate and remain  competitive…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688641/deregulation-empowers-free-enterprise"}]