[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…give up just to be able to pay for these premiums. I am speaking  for those who have the horrible feeling in the pit of their stomachs  because they know the risk of being uninsured, being one hospital visit  away from bankruptcy.\n\nMy Republican colleagues and, certainly, Donald Trump might not  understand this, but health insurance is not a luxury.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…House.\n\nIn addition, New Hampshire's Medicaid expansion, established on a  bipartisan basis, would end with any decrease in Federal funds, leaving  68,000 Granite Staters uninsured and devastating our hospitals and  community health centers.\n\nI have heard from literally thousands of Granite Staters on this  issue, including a woman who contacted my…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…for all of our people. But Medicaid saves lives. Over the  course of the program's history, Medicaid has allowed hundreds of  millions of Americans who otherwise would be uninsured to live  healthier lives and to build a future.\n\nBut now the Trump administration and some of my Republican colleagues  are poised to end Medicaid as we know it in order…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for the holidays while American families paid the price.\n\nRepublicans also pushed a partisan healthcare bill that would make  things much worse by increasing the number of uninsured people,  shifting costs onto working families, and weakening the protections  that so many Americans rely upon.\n\nI offered an amendment to protect working families from losing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…want to give you a chance.\n\nSpeaker Johnson could end this crisis and bring the bill up. Instead,  they are wasting time on this dusty bill that will increase the number  of uninsured Americans, and that is a fact. People don't need  healthcare that costs more and covers less. To stave off this crisis,  this bipartisan discharge petition is a workable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…big  corporations.\n\nMadam Chair, Nevada Democrats and Republicans worked together to  implement the Affordable Care Act, including the expansion of Medicaid.  We reduced the uninsured rate by a third, and 563,000 children were  able to receive coverage as a result. The fact that Nevada did the  right thing then means we have more to lose as Republicans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688077/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…health insurance, drive down uncompensated  care, drive down everybody's cost, and deliver good healthcare for our  citizens. Since the passage of the Affordable Care Act, the uninsured  rate was cut in half from almost 16 percent--roughly 15.7 percent  in 2010--down to an alltime low of 7.7 percent in 2023. So the result  is not just healthy Americans having…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…when they get sick--because  they will--they don't show up in the hospital when it is too late or  more expensive to treat. Also, when more people show up in those  hospitals uninsured, they will get care, and the cost of that care goes  to everybody else.\n\nTonight, Mr. Speaker, you will hear stories of people who purchased  their insurance through the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…provide jobs for more people,  but they all receive affordable healthcare through the ACA. Without the  ACA tax credits, their employees may have no other option but to go  uninsured or find another job. If they decide to leave, my  constituents' businesses won't be able to run.\n\nIt is simple: We all do better when we all do better. We are all  healthier…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…are being forced to make impossible  choices between food, car payments, and housing costs. If we fail to  immediately solve these problems, millions of people will become  uninsured in this country, and those who will retain coverage will pay  double or triple for their healthcare plans.\n\nIt is not too late to do something even though we are hopelessly…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise in opposition to this big, ugly  bill. Let's be clear: This bill is TrumpCare. And TrumpCare means 17  million more Americans will be uninsured and all the rest of us will be  paying higher costs and driving further to get care.\n\nOver the last several months, I have met with hundreds of  Delawareans--parents, patients,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693205/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…I bring up Medicaid is that, in New Mexico, we had a  Republican Governor who actually embraced Medicaid expansion. So New  Mexico was one of the States that had the most uninsured people per  capita and became one of the most insured. Because of that expansion,  people were able to get care and help.\n\nAs for those rural health clinics that also provide…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that we have to work together to address the Affordable  Care Act and that the system needs to continue to have updates.\n\nWe know that in this time period since 2010, the uninsured rate in  the United States was a staggering 18.2 percent. After the enactment of  the ACA, which significantly expanded coverage, around 45 million  Americans had access…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…hardest.\n\nLet me be crystal clear: Texas already ranks 43rd in the Nation in  access to healthcare. It is a statistic I am not proud of from my  State. We lead  the Nation in uninsured adults. We also lead the Nation in maternal  mortality and infant mortality, two statistics the Republicans in our  State should be embarrassed of.\n\nNow, Trump and Republicans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…target. Cutting Medicaid by hundreds of billions       of dollars and focusing many of those cuts on the Medicaid       expansion would lead millions of people to become       uninsured. Eliminating Medicaid expansion was a key goal of       Republicans' failed effort to repeal the ACA eight years ago,       and Congress should once again reject efforts…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Women for Gulfside group in May 2022.  Since then, she has played a key role in fundraising efforts supporting  programs that rely entirely on donations, such as care for uninsured  patients, family bereavement support, and Pet Peace of Mind,  which helps hospice patients care for their pets. Joan also contributes  to Gulfside's four major annual fundraising…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…thing we can all agree  on, no matter what your party, healthcare is too expensive.\n\nI am a doctor who worked at a hospital in the public hospital system  for the working uninsured and poorly insured. And it is not just the  poor but middle-income Americans who have a really hard time right now  affording their healthcare.\n\nThere is a little bit of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…band together, like large companies, to  lower costs and deliver high-quality coverage. The CBO report today  estimates that this could cover more than 200,000 previously uninsured  Americans and attract 700,000 people annually to association health  plans.\n\nComplementing this, the Self-Insurance Protection Act, authored by  Representative Bob Onder,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…pursuant       to such clause;\n\n``(cc) the likely effect of the determination and such       action on the incentives and conduct of insured depository       institutions and uninsured depositors;\n\n``(dd) any mismanagement by the executives and board of the       insured depository institution that contributed to the       failure of the insured depository…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…applications. The       Congressional Budget Office projected that the tax bill's       ObamaCare fraud controls could result in about one million       more people going uninsured, but most aren't eligible for       subsidies--and some might not even exist.\n\nDemocrats want to boost enrollment in ObamaCare no matter       the cost because they view…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…they were getting signed up for were  still receiving these subsidies.\n\nOriginally, when we talk about ObamaCare, it was just for folks who  were very low-income and were uninsured and didn't have the ability to  make any payments toward covering their own insurance.\n\nWhat ObamaCare does is it says if a person is 100 percent or 150  percent of poverty…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Association of Realtors--let's see if I got the name right--in  an article from 2023, the leader said that they would create a plan for  7,000 association members who were uninsured because they don't make  enough money to afford the Federal marketplace coverage--that would be  the so-called Affordable Care Act--or to qualify for subsidies in the  small…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…pursuant       to such clause;\n\n``(cc) the likely effect of the determination and such       action on the incentives and conduct of insured depository       institutions and uninsured depositors;\n\n``(dd) any mismanagement by the executives and board of the       insured depository institution that contributed to the       failure of the insured depository…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…their care  despite being insured. A policy that you can't afford when you are sick  is not a real solution, only an illusion of coverage, leaving  individuals functionally uninsured.\n\nCompounding these design failures are serious fraud and enforcement  breakdowns within the system itself. A 2024 GAO investigation found  that fake identities were approved…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…line.\n\nHow much of the healthcare population in America is actually in the  ACA? It is really important. Forty-eight percent is employer sponsored,  7 percent we believe is uninsured, veterans are about 3 percent,  Medicare is 18 percent, and Medicaid is 22 percent. Now over the next  couple years that flips. Only 7 percent of the healthcare population…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "John Thune", "party": "Republican", "sentence": "…population, about 140  million Americans, who get it through Medicaid, 21 percent, as you can  see, and Medicare, about 15 percent. And then, in the balance here,  some are uninsured. And then there are some who get it in the nongroup  market. There is a sliver there for the military. But in this nongroup,  individual market, that is what we are talking…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}]