[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Congress  of its vital role in approving the use of force, but such a list kept  hidden from the American people, if used as a justification, may drag  our Nation into an unintended war.\n\nIf it were as simple for a President--any President--to claim that  war power for himself by placing an individual or a group of  individuals on a list, let alone one…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…This bipartisan bill, H.R. 2225, the Access to Small Business  Investor Capital Act, makes a narrow technical correction of the  Federal securities rules that had a major unintended consequence over  the last two decades.\n\nIn 1980, Congress created Business Development Companies to  facilitate capital formation and get that capital to small- and medium-…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…fundamental freedoms.\n\nThis funding has been a core pillar of U.S. assistance since the  1950s, and it is lifesaving. Estimates suggest that each year, it  prevents 17.1 million unintended pregnancies and saves the lives of  34,000 women and girls who otherwise would have died from complications  of pregnancy and childbirth.\n\nThe UNFPA is a critical piece of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…they need?\n\nNo. It is because this budget takes that money and it gives it to the  very richest corporations at the expense of small businesses and  working families. The unintended consequences of these cuts will hurt  every American, even if they are not on Medicaid or SNAP, and force  more middle-class families to live paycheck to paycheck while giving…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687964/proposed-cuts-to-medicaid-and-snap-benefits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…abortion; it is a war on women's health, launched by  this administration. And, unfortunately, this administration is just  getting started.\n\nThe fact is that unsafe and unintended pregnancies have huge costs in  lives and dollars, impacting all of us. That is why I am proud to live  in Connecticut that has expanded abortion care and ensured that women…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…possess these weapons. While       that might not be the intent of the bill authors, that will       be the real-life impact.\n\nH.R. 2189/S. 1283 will have another chilling unintended       consequence: domestic abusers and others who are prohibited       under federal law from possessing firearms will modify       ``less-than-lethal projectile devices''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Security recipients in your  district. I know that you do not stand for having their personal  information gone through, looked over, and utilized for anything that  was unintended, let alone having been taken from its secure position in  Social Security and stored in a cloud that no one from the Social  Security Administration has access to. That makes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…possess these weapons. While       that might not be the intent of the bill authors, that will       be the real-life impact.\n\nH.R. 2189/S. 1283 will have another chilling unintended       consequence: domestic abusers and others who are prohibited       under federal law from possessing firearms will modify       ``less-than-lethal projectile devices''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…piece of legislation.\n\nThe bipartisan Access to Small Business Investor Capital Act makes a  narrow technical correction to a federal securities rule that has had  major unintended consequences over the last two decades.\n\nIn 1980, Congress created Business Development Companies (BDCs) to  facilitate capital formation into small and medium-sized businesses.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…addiction, overdoses, gun  violence, and preventable diseases like measles. Let's work on that.\n\nBanning doctors from providing healthcare to transgender young people  has serious unintended consequences. Politicians are getting in the way  of doctors, who have years of training and experience and are  practicing according to professional standards of care. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698358/protect-childrens-innocence-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…the bill cuts PEPFAR by $400  million.\n\nWhen you cut funding to family planning programs, tens of millions  will be denied modern contraceptives, resulting in millions of  unintended pregnancies and tens of thousands of preventable pregnancy- related deaths.\n\nWhen you cut funding for international peacekeeping and to people  escaping violence, people…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…really trust them to get an 870-page bill  right?\n\nNot only are we going to find things that were sneaked into this  bill, we are going to find massive mistakes that have unintended  consequences for people and industries across this country.\n\nThis whole process has been lousy, and this rule is no exception.\n\nMr. McGOVERN. Mr. Speaker, there is a lot…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Defense Tuition Assistance Program in  2013.\n\nWhile I strongly support expanding educational access for our  Nation's veterans, H.R. 1458, as it is currently  drafted, may have unintended consequences. Veterans deserve the widest  possible array of educational opportunities, but not at the cost of  diminished quality, oversight, or value.\n\nMr. TAKANO. Madam…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is time for us to stop complying.\n\nLet's face it, let's face the facts and not ignore them. The  starvation that we are seeing today, it is not unforeseen. It is not  the unintended, unfortunate consequence of war. The starvation we are  witnessing today is the self-conscious result of a military policy to  concentrate the Palestinian population into…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…those in       power, only serves the powerful, only serves the wealthy. As       your constituent affected by neuromuscular disease, I am       concerned about the potential unintended consequences of the       efforts to so-call reform Medicaid.\n\nSeventy-two million Americans rely on Medicaid for affordable  accessible and State health coverage, including…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…my colleagues to support the bill, and I reserve  the balance of my time.\n\nMrs. WAGNER. Mr. Speaker, in closing, this is a smart and bipartisan  solution that removes an unintended barrier to capital formation  without reducing investor protections.\n\nMr. Speaker, I urge my colleagues to support H.R. 2225, and I yield  back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…evaluated consistently,       accurately, and safely. This framework ensures that only true       less-than-lethal devices fall within the updated category       while preventing unintended loopholes or misuse.\n\nH.R. 4242 harmonizes tax statutes with the classification       framework in H.R. 2189. It ensures consistent federal       treatment across the National…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…advanced to the floor, it should be vetted  through that process so that the Senate can fully understand and  appreciate its scope, its effect, its legal posture, and whatever  unintended or intended consequences the legislation might have.\n\nI have made it clear, from the beginning, that I am willing to work  with the Senator from Florida. In fact, I have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "John James", "party": "Republican", "sentence": "…increase the number of trucks  required, which is going to increase the cost of everything from gas to  groceries.\n\nThe death of the American trucking industry is not just an unintended  consequence of this radical California policy. Mr. Speaker, it is the  goal. They intend to set unworkable emission standards that will  cripple our supply chains and make…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Chairman Steil to advance  policies that lead to stronger elections across our country.\n\nThese tools will help the States ensure their rolls are accurate and  help prevent any unintended errors.\n\nWe know that some States have continued to discover noncitizens on  their voter rolls, and there is evidence that some of them have voted  in recent elections. We…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…sure that we have the right type of language.\n\nWhat I am going to do is work with the gentlewoman as we move forward  on this legislation to make sure that we don't have any unintended  consequences in the language. We will do that as we move this  legislation forward. I appreciate the gentlewoman withdrawing the  amendment.\n\nMr. CALVERT. Madam Chair, I…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}]