[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Virgin  Islands.\n\nThis bill is an important step to enhance American communications  security and competitiveness around the world.\n\nIn recent years, Mr. Speaker, the United States and many allies have  recognized the threat posed by untrusted Chinese telecommunications  equipment to our national security. Thanks to the work of the Energy  and Commerce Committee…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…received far too little attention from Congress  and the administration, and with tomorrow's expiration of the New START  Treaty, it is staring us in the face.\n\nThe United States, and our allies, must urgently seek to reinvigorate  negotiations on a verifiable replacement for New START, with more  effective mechanisms to prevent the development, proliferation,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…entities in China if the relationship is either in the  national security interests of the United States or has no bearing on  the national security interests of the United States or its allies.\n\nThis is critical, as the bill's language could encompass all sorts of  agreements between academic institutions in the United States and  China, including student…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…America's commitment to expanding economic opportunity,  creating jobs, strengthening strategic partnerships, and forging  mutually beneficial economic bonds between the United States and our  allies in sub-Saharan Africa.\n\nSince its enactment in 2000, AGOA has provided duty-free access to  the U.S. market for a broad range of goods from eligible AGOA sub- Saharan…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…for devastation.\n\nThese are not just theoretical consequences, lines on paper,  assumptions, and equations. They were real, and they are very real  still.\n\nThe United States and its allies conducted 318 nuclear tests in the  Pacific islands. The people who lived on the islands lost their  ancestral homes, now uninhabitable, and the people who were…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…on which the  President seems to be so obsessed or focused is exactly the arrangement  that produced two world wars. It is exactly why, after World War II,  the United States and our allies established the rules-based order to  peacefully resolve conflicts, regulate global trade, and ultimately  ensure rules-based international exchange. That order…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…ocean floor.\n\nIt goes without saying that control and manufacture of these cables  matter not just for economic development but will matter in any  conflict.\n\nThe United States, with allies and partners, must maintain strategic  independence and should seek to become the primary source of this  critical infrastructure. This bill will force the Bureau…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694820/undersea-cable-control-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…acute malnutrition, urgent treatment to prevent  starvation. All the while, these trucks that are filled with food and  medicine, much of that aid provided by the United States and our  allies, are right there across the border.\n\nThis situation that folks face in Gaza is unprecedented in  contemporary conflict. We cannot have or sanction a government's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691093/senate-resolution-224-calling-for-the-urgent-delivery-of-humanitarian-aid-to-address-the-needs-of-civilians-in-gaza"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…export controls and licensing policies for items identified       pursuant to paragraph (1) with respect to foreign       adversaries.\n\n(3) An identification of United States allies and partners       that have a share of the global market with respect to the       items so identified, including a detailed description of the       availability of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…determine what countries are threats to  the United States and targets endowment investments into those threats.\n\nThe ICC has baselessly asserted jurisdiction over the United States  and its allies like Israel and further abused its power by issuing  frivolous arrest warrants. There is no reason to use the ICC to define  what countries are actively seeking…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…paragraph (4), by striking the period at the end and       inserting ``; and''; and\n\n(3) by adding at the end the following new paragraph:\n\n``(5) encourage, as appropriate, United States allies and       partners to oppose the People's Republic of China's efforts       to undermine Taiwan's official diplomatic relationships and       its partnerships with countries…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…leader. He was an indicted  narcoterrorist who helped turn Venezuela into a hub for drug  trafficking, corruption, and foreign influence that directly threatened  the United States and our allies. For a year, there was bipartisan  agreement on this fact. The difference is President Trump acted.\n\nAs Secretary of State Marco Rubio made clear, this was a limited…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…or by coercion, by 2027. It is simply  foolish to continue to send money to fuel these technologies that could  be used perhaps in the next few years against the United States and our  allies.\n\nThis legislation would create a notification regime to create more  transparency around investments that are not prohibited. You know, as  long as we are blind…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…to the axis  of evil. Make no mistake, China, Russia, and Iran are exerting  influence across the globe that is causing harm and posing major  threats to both the United States and our allies.\n\nIt is vitally important that the United States and our European Union  allies work together to find solutions that both combat these  adversities and ensure that…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…future risks requires ensuring a secure and stable       supply chain for semiconductors that will support the       economic and national security needs of the United States and       its allies.\n\n(4) The supply chain for semiconductors is complex and       global. While the United States plays a leading role in       certain segments of the semiconductor…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…influence over the  Government of Lebanon.\n\nThis bill, the PAGER Act, offers a clear roadmap to strategically  realign the Lebanese Government to no longer threaten the United States  or our allies and interests in the Middle East.\n\nIn fact, a significant portion of Lebanon's military expenditures  don't even go toward its defense. Over 70 percent of its budget…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…aggressive. This  week, Xi Jinping is hosting Iran, North Korea, Russia, and other  hostile actors for a military parade. They are clearly sending a  message to the United States and our allies that they are more united  than ever.\n\nTime is of the essence. We need to expedite the AUKUS partners'  access to markets and make sure this defense pact is working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…vital we prevent it.\n\nThat is exactly what President Trump did, and he did it effectively.  For over 40 years, Iran has targeted, threatened, and terrorized the  United States and our allies. We know from our own intelligence and  from independent experts that Iran was dangerously close to getting  nuclear weapons.\n\nMy colleagues on the other side of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…weekend, that  promise became a reality.\n\nThe Iranian regime has supported terrorist groups throughout the  Middle East that all have one goal in common: to destroy the United  States and our allies in the region.\n\nA nuclear-armed Iran is a threat to our servicemembers in the region  and a threat to the entire Western world. President Trump's decisive  action…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…provide a 2-year funding mechanism for the  State Partnership Program. This is a key security cooperation program  that enables our National Guard units to train with United States  allies and increases the interoperability, compatibility, and overall  readiness of the National Guard.\n\nBudget volatility has brought fiscal uncertainty to this program,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…could unlock greater       capital flows into Africa's mining sector, while ensuring       that off-take agreements from new projects are secured with       the United States and its allies.\n\nA useful precedent for an investment incentive came from       the Inflation Reduction Act's Section 30D tax credit, which       offered up to $7,500 for the purchase…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…or by coercion, by 2027. It is simply  foolish to continue to send money to fuel these technologies that could  be used perhaps in the next few years against the United States and our  allies.\n\nThis legislation would create a notification regime to create more  transparency around investments that are not prohibited. You know, as  long as we are blind…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}]