[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and the online grocery platform Mercato have partnered  to help thousands of low-income New Yorkers with diet-driven chronic  diseases purchase more nutritious food. The United Way of New York City  is anchoring one produce prescription project, Connect2Food, that  provides hungry people with $80 per month to purchase fresh fruits and  vegetables.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…John Vieau  for marching with us.\n\nThe hundreds of other people who joined the march--students,  advocates, members of my staff, community leaders such as Tim Garvin of  the United Way of Central Massachusetts, Sean Barry, Shannon from the  Martin Luther King Center in Springfield, and so many, many more--are  incredible. We had double the number of marchers…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…payer mix. Without the Affordable Care Act  subsidies, we will have more uninsured people, and these hospitals  could go under.\n\nPrior to being in Congress, I worked at the United Way before the  Affordable Care Act working on healthcare access, and my county had a  21 percent uninsured rate. We have a lot of farmers, small business  people. We have people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…baseball,  and more. In 2017, he was inducted into the Brainerd High School Hall  of Fame for his remarkable coverage.\n\nOff the air, Colin served tirelessly--co-chairing United Way  campaigns, emceeing the Walk for Diabetes and Special Olympics Polar  Plunge, and coaching youth softball and baseball for over 15 years.\n\nMac delivered his final broadcast…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…initiatives. Alongside his wife Beth, Pat founded Team Terrell to help  promote and fundraise for the American Diabetes Association. He also  served as a regional spokesman for United Way and was honored as an NFL  Player representative for the United Negro College Fund. During his  time as a pilot, Pat volunteered to transport hundreds of American and  allied…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Mining Minnesota; Jobs for Minnesotans; American Exploration       and Mining Association; Society for Mining, Metallurgy &       Exploration; National Mining Association; United Way of       Northeastern Minnesota; American Chemistry Council; Teamsters       Joint Council 32; Teamsters Local 346; Laborers Local 1097       ``Iron Range''; Sprinkler Fitters…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Award for community service. He was  also Managing General Partner for Fuller Properties, LTD and former  host of the Lee County Report.\n\nHe's served as past President of The United Way of Lee County,  Opelika Rotary Club and The Opelika Chamber of Commerce. He has served  as past director of Opelika Dixie Youth Baseball, Opelika Main Street,  Opelika Utilities…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Donna Telesco has made as a volunteer with United  Way of Hernando County. Donna not only coordinated relief supplies  inventory at our Family Resource Center (FRC) daily for 2 weeks, she  was a lead volunteer when it came to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…joining Goodwill in 2016, he served as Executive Director of the  Hult Center for Healthy Living and as Vice President of Community  Investments at the Heart of Illinois United Way. In those roles, he  championed data-driven community investments, built expansive volunteer  networks, and led public health and education initiatives, including  211, Success…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…come.                           Recognizing Swann Seiler\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Swann  Seiler, named the 2026 Woman of the Year by the United Way of the  Coastal Empire at the annual Women Who Rule event in Savannah, Georgia.\n\nMs. Seiler's leadership, service, and commitment to community reflect  the very best of civic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…also committed himself and Principal Financial to  philanthropic causes in Des Moines and across the State of Iowa.\n\nUnder his leadership, Principal donated generously to United Way and  the annual Principal charity golf classic which raised millions of  dollars for Iowa youth. The Principal Foundation awards grants to  worthy causes including disaster…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  United Way of the Bradford Area as they celebrate 100 years of  dedicated service to our community.\n\nSince 1925, the United Way chapter has been a driving force in  improving lives…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691973/recognizing-united-way-of-the-bradford-area"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…to give back to the Commonwealth that he so deeply cherishes.  He hosted annual fundraisers for the Cardinal Hill Rehabilitation  Hospital in Lexington, chaired both the United Way board of directors  and the annual campaign, and served as chairman of the Children's  Advocacy Center board of directors. His expert gameplans have also been  sought after…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…for the 11th legislative district.\n\nCouncil has held leadership roles in many organizations such as the  Urban League of Nebraska, North Omaha Community Care Council, and  United Way of the Midlands.\n\nMs. Council has been married to her husband for 40 years. Together,  they have one son and five grandchildren.\n\nFred Conley is a pioneering figure in Nebraska…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Charles Anderson has made through his work with  United Way of Pasco County. Charles W. Anderson, recently retired  January 2025 as President & CEO of United Way of Pasco County (UWPC).  He has made a profound and lasting impact on…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}]