[{"senator": "George Latimer", "party": "Democrat", "sentence": "…the suburb is man-made.  What we do on the Westchester/Bronx border and at any border anywhere  is work together, and that is the prototype for the America that surely  needs unity.\n\nThink about how much we are going to need that unity, all Americans  working together, when we face the next existential threat to our  freedom and democracy, as we did with…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…other provisions that, for me, were  profoundly important. It is a compromise. And ``compromise'' is not a  four-letter word; it is the way to get things done.\n\nThis picture of unity is worth a thousand of my words, but it is also  a clear response to a crisis that we face, and we face it today. It is  a crisis in healthcare. It is a crisis in hunger. It…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…pursue education but never abandoned their passion for music.       Their name, ``CaRiMi,'' derived from the first two letters of       their       names, became a symbol of unity, passion, and innovation in       the music industry;\n\nWhereas, their impact quickly transcended borders,       garnering international recognition with Best Album of the…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…responsibility to  pursue peace and justice, religious tolerance and coexistence, and  environmental stewardship in all we do.\n\nHis historic visit serves as a profound moment of unity, reflection,  and joy for Greek Orthodox New Jerseyans and Americans of all faiths  across the country. We deeply respect and appreciate his decades of  moral leadership and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695894/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…them to. We owe it to ourselves and, even more so, to the bravest  Americans who answered the call that day and laid down their lives to  recommit ourselves to civility and unity.\n\nWe must never forget 9/11. We must never forget the victims, the  survivors, and their families. I believe with every fiber of my being  that we can heal our Nation and mend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695319/recommitting-to-civility-and-unity"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…courage and defended their democracy  through peaceful civil disobedience, through lawful impeachment, and,  now, through a free and fair election.\n\nThey have shown strength, unity, and a dedication to the rule of law  in a way that the rest of the world could do well to emulate.\n\nMr. Speaker, I say to the citizens of South Korea, the people of the  free…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…religion through discoveries and insights that deepen our  understanding across faiths. Since being elected Ecumenical Patriarch,  Bartholomew has been a courageous voice for unity, religious freedom,  and environmental stewardship. His leadership has left a lasting mark  on both the Orthodox world and the entire global community.\n\nThis will not be his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the  President opened for refugees coming to the United States from South  Africa was limited to Afrikaners, even though Afrikaners are  represented in the current National Unity government of South Africa,  but he claimed that Afrikaners are being persecuted.\n\nNotice a few months later, he also claimed that Nigerians were being  persecuted if they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…For our children, what is next for them if this       protection is stripped away? Separating families in this way       undermines everything we claim to value about family unity,       community stability, and opportunity.\n\nWhen we protect TPS, we protect families. We uphold a       fundamental human value, a value that implores us to not turn…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…the practice of Taekwondo  while instilling discipline, pride, and cultural identity in  generations of students. His efforts have created a community rooted in  respect and unity.\n\nMr. Kim's passion for youth development and multicultural outreach  has helped foster deeper understanding across communities, and his role  in bringing the 23rd Annual Korean…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…someone who I believe to be a leader in  the community. He is someone who I know stands up by defending our  neighbors. He is someone who recognizes that fear does not create unity  and love. Fear creates division. As we reflect on what it means to  stand up to authoritarianism by defending our neighbors, our  neighborhoods, and our culture, I recognize…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…act. It is so very important to highlight moments where we do  come together here in the body, and this bipartisan, bicameral  legislation is a bright moment of that kind of unity.\n\nI am really grateful for the support and partnership of my colleagues  in this effort, Representative Fitzpatrick and Senators Coons and  Boozman, on the other side of the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…celebration of America's anniversary offers an  opportunity to reflect on the resilience of the American experiment.  Our Nation has faced countless tests to our strength and our unity,  including a civil war, two world wars, natural disasters, and more.\n\nYet through each of these profound challenges, this country has  endured and continues to strive toward…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…perspective, he has received  honorary doctorates from leading institutions across the world.\n\nThroughout his time as Ecumenical Patriarch, Bartholomew has worked  to build unity among the Christian churches and foster meaningful  dialogue between world religions. He has convened many international  conferences, bringing together religious leaders from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…hand to honor       Fulton County and its distinguished history on this momentous       occasion. May the legacy of Fulton County's past continue to       inspire progress, unity, and pride for the generations to       come.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sincere congratulations to the City of  Brooksville and its residents on this historic occasion. I commend them  for 170 years of achievement and wish them continued growth, unity, and  success for generations to come.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Justice all completed a report that  noted the DHS intelligence enterprise was not as effective and as  valuable as it could be. This was attributed, in part, to a lack of  unity throughout the DHS intelligence enterprise.\n\nFor the intelligence community, the stakes could not be higher. Our  Nation's security depends on streamlined coordination across…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…dialogue, religious freedom,  and environmental stewardship, earning him the title of ``Green  Patriarch'' and international recognition for his vision of  reconciliation and unity. He has convened historic gatherings of  Orthodox leaders, fostered dialogue with other Christian traditions,  and extended a hand of friendship to leaders of the Jewish and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Navy Club has remained deeply embedded in the  life of the Georgetown community--supporting Navy Junior Reserve  Officers, honoring naval heritage, and fostering a spirit of unity  among veterans and civilians alike.\n\nWhat began in 1925, as a gathering of like-minded servicemembers, has  grown into a lasting institution, one that continues to support…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693998/recognizing-the-navy-club-of-georgetown-sc"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…engagement initiatives. She actively  promotes Brooksville's historic cham and economic growth by working  with local businesses, encouraging participation, and fostering a sense  of unity among merchants and residents. Her efforts to support small  businesses align perfectly with BMS's mission to strengthen the local  economy while preserving the character of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…come together as a country, and I don't believe  that an attack on the homeland is the only thing that can rekindle it.  At this moment, working to rediscover that capacity for unity is a  matter of the highest urgency to our Nation's future.\n\nA simple thing we can all do: If you have a friend or family member  whom you have stopped talking to because of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…have never been necessary to expend.\n\nThese actions were not simply acts of graffiti. They were acts to  damage our legacy. These monuments stand as reminders of sacrifice,  unity, and the ongoing work of perfecting this Union. They deserve our  utmost respect.\n\nWe owe it to those who fought for these freedoms and to the future  generations of Americans…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…of       ushering in the hoped for messianic era which Greenberg       testifies is within human reach in our postmodern era with       its new opportunity for creative human unity within enriching       diversity, upholding universal human dignity and equality via       restoring God's violated image, ``I hope it will appeal to       non-Jewish readers…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…shared meals that  reflected the enduring spirit of the Tribe.\n\nAs the American flag and the Spokane Tribe flag flew side by side,  this celebration stood as a powerful symbol of unity, resilience, and  the living heritage that continues to enrich the inland northwest.\n\nMr. Speaker, I am not a Native Tribal member myself, but growing up  in eastern Washington,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…into a  club with much greater purpose.\n\nThe Brother's Keepers Motorcycle Club focuses on safety and  motorcycle awareness nationwide. However, realizing the strength of  their unity, these firefighting bikers have turned their fun and  relaxation into fundraising and charitable work. For example, their  Kentucky chapters collectively support the Shriners…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…less fortunate,  veterans, first responders, and community programs. His generosity has  directly impacted countless individuals and families in need,  reinforcing the sense of unity that defines Brooksville.\n\nCasey's leadership extends to mentoring and supporting others in the  community. He is known for offering guidance and encouragement to young  entrepreneurs,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Affairs Advisory Board has long served as a strong  advocate for our Hispanic community. It leads countywide efforts to  celebrate Hispanic Heritage Month and to promote cultural unity across  our diverse community.\n\nThis year, Miami-Dade County's 2025 Hispanic Heritage Month Kickoff  Celebration will bring together elected officials, more than 30 Consuls…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695658/recognizing-hispanic-heritage-month-and-the-miami-dade-county-hispanic-affairs-advisory-board"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…University of  Tennessee commit and McDonald's All American, who grabbed 9 rebounds  and scored 20 points.\n\nThe entire team made critical contributions, showing their depth and  the unity of this team. The championship caps off a season where the  Pirates won by an average of 57 points.\n\nI congratulate the entire Palm Bay Pirates team. They have made our  entire…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…in the name of  religion is war against religion,'' Patriarch Bartholomew has built  strong relationships with religious and political leaders in every  continent to promote unity among faiths.\n\nIn 1997, Patriarch Bartholomew became the first Ecumenical Patriarch  to visit the United States, and it is our great pleasure to welcome him  back as he meets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Department  too often handcuffed U.S.-Taiwan engagement by clinging to outdated,  self-imposed restrictions and bureaucratic red tape, weakening a vital  partnership at a time when unity and strength are urgently needed. That  is unacceptable.\n\nThe Taiwan Assurance Act passed with bipartisan support in 2020, but  the stakes are even higher today. That is why…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}]