[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the wealth gap of  which I have been focused on my entire career.\n\nMr. MEEKS. That is why I support this bill. That is one of the main  reasons why I am here in the United States Congress.\n\nStrengthening our capital markets is not about helping the big guys.  It is about improving the financial security of working families.  Supporting the INVEST Act…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…important part of Arizona's diversity and character.\n\nI am proud to join Orthodox Christians in Arizona and across the  country in welcoming His All-Holiness to the United States and to  Congress. His visit is a point of pride for many Arizonans and a  reminder of the shared values of faith, service, and community that  strengthen our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Nobody gets wealthy on Social Security. It is the safety net for  capitalism. That is what Roosevelt intended it to be. It is long  overdue that we have a vote in the United States Congress to enhance  Social Security benefits for all Americans.\n\nThere are 10,000 baby boomers who become eligible for Social Security  every day. More than 70 million people…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…also very interesting and kind of cool that today I get to  debate with a colleague from the other side of the aisle where we are  both the youngest Members of the United States Congress. We may be the  youngest, but his ideas are very old.\n\nUndermining democracy in D.C. isn't new. It is just wrong. The people  who live in the Capital of the world's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…experience the great American Dream. They are unable to get  to that third leg. They are unable to live the good life. That is what  we should be focusing on here in the United States Congress, not  gutting Medicaid, not ripping food out of the mouths of hungry  children, and not rewarding billionaires with massive tax breaks.\n\nHow can you prepare to celebrate…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…violates international law, including the  Convention on the Prevention and Punishment of the Crime of Genocide,  would be unconstitutional absent the approval of the United States  Congress, and is profoundly unserious in light of the grave  humanitarian situation and ongoing armed conflict in Gaza.\n\nUsing the powers of his high office, Donald John Trump…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Government, and about rewards for  friends and retribution against opponents? We have heard absolutely  nothing. The silence is deafening.\n\nLast I checked, this is the United States Congress, not the Russian  Duma. We do not create a protected class of elites who can siphon off  public money, reward their friends, punish their political opponents,  and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of Alex Pretti.\n\nMr. Speaker, as co-chair of the Tom Lantos Human Rights Commission,  named after our former colleague, the only Holocaust survivor to serve  in the United States Congress, I have spent years documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.\n\nLet me say this plainly: A…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…vetted, as was  testified before the Ways and Means Committee last week.\n\nHow is it that DOGE employees are exempt because they are above the  law? It requires the United States Congress to call them in front of  us. If they are doing such a great job with efficiency, and if that was  their goal, clearly they ought to be able to come before Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…The legislation authorizes the use of  reimbursable and nonreimbursable agreements. Again, the effective  utilization of the taxpayer dollar of which we here in the United  States Congress are stewards of.\n\nIn addition, I will be providing direction on a merit review process  between the two agencies, reporting and compliance with research  security…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…would make the ultimate sacrifice so Donald Trump can do in Latin  America what Vladimir Putin does in Europe?\n\nThe power over matters of war and peace belongs to the United States  Congress. It is our most solemn duty given in the Constitution of the  United States, and votes like this are our most consequential. They are  literally about life and about…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Cluster, the Bronze Star Medal, the Meritorious Service Medal with two  Bronze Oak Leaf Clusters, and the Parachutist Badge.\n\nOn behalf of the people of Colorado and the United States Congress, I  extend profound gratitude to Major General Laura Clellan for her  remarkable service.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…protection, have justly placed him at the forefront of global  visionaries as an apostle of love, peace and reconciliation.\n\nIn 1997, he was awarded the Gold Medal of the United States Congress.  The Guardian recognized him as one of the world's leaders in raising  environmental awareness. And, in its category of Leaders and  revolutionaries, Time Magazine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "Mr. CASAR. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I am  Greg Casar. I am proud to represent the heart of  Texas in the United States Congress and to chair the Congressional  Progressive Caucus.\n\nBefore all of that, I started my career as a labor organizer, and I  saw up close how corporate lobbyists and corrupt…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689085/economic-populism"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Review is a quarterly publication of the Stennis Center for  Public Service. The Stennis Center is a federal, bipartisan legislative  branch agency established by the United States Congress to promote  public service and strengthen the highest ideals of public service in  America. Established in 1988 in honor of the late Senator John C.  Stennis of Mississippi,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Moore).\n\nMr. MOORE of North Carolina. Mr. Chair, we are not here today to  recognize the Lumbee Tribe of North Carolina. The Lumbee Tribe was  already recognized by the United States Congress in 1956.\n\nWe are, however, here today to right a wrong, to end the termination  era of Indian policy, and to take the Lumbee out of the legal limbo  that they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I rise today to recognize  Stephenville High School, which I am honored to represent in the United  States Congress.\n\nOn February 9, the National Football Foundation named Stephenville  High School the national winner of the Hatchell Cup award. This is the  highest academic team…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700201/stephenville-high-school-awarded-national-football-foundation-hatchell-cup"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…2021, a competitive  lease sale was held and multiple bids were received by prospective  developers as intended under the TCJA, raising millions of dollars for  the United States. Congress had set out terms and conditions of the  program, to give it a sound opportunity to succeed, and DOI followed  its statutory directive.\n\nHowever, following the election…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…perhaps my  colleagues would like us to dissolve and make all decisions the subject  of the Government Accountability Office instead of the elected Members  of the United States Congress. I ask everyone to vote ``yes'' on H.J.  Res. 89.\n\nMr. GRIFFITH. Madam Speaker, I yield myself such time as I may  consume.\n\nWe keep hearing that it is not a rule and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…of the Greatest Generation for sacrificing and fighting to preserve the  freedoms that we hold dear. It is my honor to recognize his life and  his service before the United States Congress.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…admirable contributions to  our community, I'm truly proud to have Ms. Day-Scanlon as a constituent  in Florida's 1st Congressional District.\n\nMr. Speaker, on behalf of the United States Congress, I am privileged  to recognize Ms. Kimberly Day-Scanlon for her many accomplishments, and  her commitment to excellence, professionalism, innovation and  collaboration…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…KILEY of California. Mr. Speaker, today on the House floor, there  was an amendment offered that suffered the most overwhelming defeat  that I have ever seen in the United States Congress, and for good  reason. It is perhaps the most abhorrent legislative proposal I have  ever seen in the United States Congress.\n\nThe Representative from Michigan, Representative…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…appliance prices to skyrocket.\n\nEvery day we can see how the so-called Inflation Reduction Act has  been given one of the most paradoxical bill titles ever in the United  States Congress. This was because, after passage, as we have seen,  inflation ran rampant. Only recently has that inflation rate started to  ebb. That is because of the policies of…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…decisions for us.\n\nMake no mistake, it is entirely appropriate that we are taking this  action here today. Article I of the U.S. Constitution gives this body,  the United States Congress, the ability to regulate interstate  commerce. As everyone knows, these vehicles, cars and trucks, are not  just manufactured for one State, the State of California,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…story reflects  not only the resilience of farm families in Northwest Florida but also  the essential role of agriculture in our Nation's future.\n\nOn behalf of the United States Congress, I commend the Tomlin family  for their outstanding contributions to agriculture and community life.  They are most deserving of this year's recognition as the Okaloosa…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695268/congratulating-the-tomlins-the-2025-okaloosa-county-farm-family-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today to address a  serious national security issue that requires the immediate attention  and immediate action from the United States Congress.\n\nAn illegal bio lab was just raided in Las Vegas, and it is directly  linked to the secret Chinese bio lab found in Reedley, California, in  late 2022. That lab was…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…led to confusion, legal uncertainty, and, ultimately,  consumer harm.\n\nAmerican innovation is a critical element in job creation and  economic opportunity here in the United States. Congress must look to  preserve this competitive advantage and not let it leave our shores.\n\nBy passing a comprehensive market structure framework, responsible  actors will…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…expert. I wish her the  best, congratulate her on her new role, and thank Molly Brimmer Lolli  for her service to the House Committee on Energy and Commerce and the  United States Congress. I also congratulate her on the birth of her and  her husband Tim's new 6 pound, 2 ounces baby girl Carmela Gray Lolli  who was born on October 26, 2025, and wish this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Jake Tyner for his  career in the United States Congress.\n\nA Towson, Maryland native, Jake began his career in Washington, D.C.  in 2016 as Director and Associate Policy Counsel of the Global Energy  Institute for the United…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…expert. I wish her the best, congratulate her on her  new role, and thank Kate O'Connor Harper for her service to the House  Committee on Energy and Commerce and the United States Congress.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}]