[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…spraying moms in parking lots. They are pulling childcare workers from  classrooms in front of desperate toddlers.\n\nThis is unacceptable.\n\nThe world is watching as the United States Government violates the  rights and due process of our neighbors. Families are frantically  trying to locate their loved ones who have been hauled away to  detention centers,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697132/immigrant-neighbors"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…vital hub       of entrepreneurial activity in the United States. Immigrants       who may not yet be citizens employ American citizens and pay       taxes to the United States government; they too deserve       access to Small Business Administration resources. Small       Business Majority strongly supports uplifting immigrant       communities working…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…money.\n\nThat is because H.R. 1450 would help investigators better follow the  money to make their sanctions and money laundering investigations more  fruitful for the United States Government, banks, and others that  employ such services.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMs. WATERS. Mr. Speaker,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…enrolled at the school;\n\n(4) a Uniformed Services identification card issued by the       Department of Defense;\n\n(5) any immigration or other document issued by the United       States Government bearing the alien's name and photograph; or\n\n(6) a State-issued identification card bearing the alien's       name and photograph.\n\n(b) Documents Establishing Continuous…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…seeking special treatment. They are sovereign  nations with legal and moral responsibilities to protect the well-being  of their citizens, their homelands, and the United States has a  government-to-government responsibility to work with them. Unrelated  policy disagreements should never be used to undermine that  relationship.\n\nThe Miccosukee Tribe has…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…didn't prep him for  was these guys attacking him. We never expected anything like that. We  expected these guys to act professionally and up to the standards of  the United States Government.\n\nAre masked, armed Federal agents who beat people on the ground really  the standards that the United States Government should be standing by?  Are these the types…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Republicans have made their values crystal clear. They value a  handful of wealthy people in this country over the millions of  hardworking families who depend on the United States Government.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…remanufacturing sector in the United States while employing over 51,000  American workers. This commonsense amendment is good for both the  economy, the environment, and the United States Government while  protecting good-paying manufacturing jobs right here in the United  States.\n\nOhio's 13th Congressional District has long been a trailblazer in  polymer science…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…more about Andry Romero,  this young gentleman right here. He is a gay hairstylist and makeup  artist who came to the United States with an asylum appointment. The  United States Government gave Andry an appointment to show up to the  border so that he could claim asylum using our process that we created.\n\nHe shows up with his appointment. What happens?…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690508/trump-immigration-policies"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…all of this because the big  issuers, the big boys, literally kind of own all of the information.  They are the issuers, et cetera, et cetera.\n\nIt is time for the United States Government to take charge, and our  central bank must be involved in the study and the research so that we  don't have issuers with crypto or anything else without the Federal…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…Speaker, in the nearly 2 weeks since the House  last met, people across America witnessed the execution of another  American citizen, Alex Pretti, by agents of the United States  Government, Border Patrol agents operating far from the border in  Minneapolis.\n\nPeople across the country watched in horror as Federal agents  executed him and then immediately…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699596/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…President shall order the U.S. flag be flown at half-staff. Current law  states that the President shall make this order ``upon the death of  principal figures of the United States Government and the Governor of a  State, territory, or possession, as a mark of respect to their  memory.'' Surely the D.C. Mayor, who has the same responsibilities as  governors…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…12 people left who survived that. There are very few people alive  today who remember the Great Depression. There are very few people  today who remember when the United States Government lived up to its  better nature and reached out, not to give a handout, but a hand up, to  millions of Americans who, in the blink of an eye, lost everything and  couldn't…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…and the  conservation of marine resources in the South Pacific.\n\nThis legislation would implement the South Pacific Tuna Treaty, a  multilateral treaty between the United States Government and the  Pacific Island states.\n\nThis treaty authorizes the small U.S. purse seine vessel fleet to  fish in specific and exclusive economic zones in the Pacific Island…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691005/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Last night, the House voted to task the oil and gas industry to report  on the state of fossil fuel refining in the United States.\n\nThey would like to see how the United States Government can do more  for their industry--drill, baby, drill--the claim being that our  government needs this report to increase fossil fuel production with an  implied promise,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697162/renewable-energy-means-lower-energy-costs"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Designated Global Terrorists and the status       of the designation of the Haqqani Network as a foreign       terrorist organization.\n\n(III) A description of any United States Government       engagements with Sirajuddin Haqqani, Abdul Aziz Haqqani,       Yahya       Haqqani, or the Haqqani Network since September 1, 2021.\n\n(IV) Whether new information…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…results.\n\nHe simply is a cheap, drug-dealing, election fraudster.\n\nDon't take Republicans on this side of the aisle's word for it, Mr.  Speaker. The European Union, the United States Government under the  Biden and the Trump administrations, the Organization of American  States, his neighbors, they all agree Maduro stole the election in 2024  and compounded…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…in       the financial sector of the People's Republic of China on the       United States and global financial systems;\n\n(2) a description of the policies the United States       Government is adopting to protect the financial stability of       the United States and the global economy from any risks       described under paragraph (1);\n\n(3) a description…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…1. SHORT TITLE.\n\nThis Act may be cited as the ``American Cargo for American       Ships Act''.       SEC. 2. CARGOES PROCURED, FURNISHED, OR FINANCED BY UNITED                     STATES GOVERNMENT.\n\nSection 55305 of title 46, United States Code, is amended--\n\n(1) in subsection (a) by striking ``When the United States       Government'' and inserting…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…shake their  hand, tell them thank you, and look them in the eye and tell them how  much you appreciate them.\n\nWe couldn't conduct our business, the business of the United States  Government, in this Capitol Building if we didn't have those men and  women who stand watch for us each and every day, and we need to be very  thankful for them, as well.\n\nI…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…forms of threats.\n\n4. A description of how a threat is identified and assessed       at or near the borders, including a description of the       capabilities of the United States Government to detect and       identify UAS operated by, or on behalf of, malign actors.\n\n5. The adequacy of United States technology used to detect,       identify, track, monitor,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…2025''.       SEC. 2. SENSE OF CONGRESS.\n\nIt is the sense of Congress that the Government of the       People's Republic of China should--\n\n(1) work with the United States Government to identify a       list of unregulated chemicals used to create precursor       chemicals that bear increased scrutiny;\n\n(2) require the proper labeling of chemical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…associated with the  LPTA FAR standard.\n\nInstead of just looking at the initial price tag and procuring the  cheapest product and service, it is vitally important that the United  States Government understand the national security implications  associated with its own Federal procurement policies.\n\nMr. Speaker, I thank the ranking member, Mr. Connolly, for co-leading…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, pursuant to House Resolution 313, I call  up the concurrent resolution (H. Con. Res. 14) establishing the  congressional budget for the United States Government for fiscal year  2025 and setting forth the appropriate budgetary levels for fiscal  years 2026 through 2034, with the Senate amendment thereto, and ask for  its immediate…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about. The United States just got downgraded by the third major credit  rating agency. Did you know there are 18 States that have a higher  credit rating than the United States Government right now? Eighteen  States have a higher credit rating, yet every dime a Member of Congress  will vote on, every dime of discretionary, nondefense discretionary,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the same size  as it is right now.\n\nInstead of spending less, right now we can't even agree to cut off  $9.4 billion in DOGE cuts. That is 0.13 percent of what our United  States Government is going to spend this year. It passed the House with  no support from Democrats and four Republicans voting against it, but  it can't get a floor vote in the Senate…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…subsection (d) of section 3730 of title 31,       United States Code, are not available for deposit to the       Fund; and\n\n``(ii) amounts necessary to reimburse the United States       Government for the damages which the Government sustains from       acts described in subsection (a) of section 3729 of title 31,       United States Code, are not available…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the end and       inserting ``; and''; and\n\n(3) by adding at the end the following new paragraph:\n\n``(5) to instruct, as appropriate, representatives of the       United States Government in all organizations described in       paragraph (1) to use the voice, vote, and influence of the       United States to advocate such organizations to resist the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…depend on the ability of us to act.                                  ______\n\nBy Mr. DURBIN (for himself, Mr. Merkley, and Mr. Bennet):\n\nS. 1749. A bill to prohibit United States Government recognition of  the Russian Federation's claim of sovereignty over Crimea, and for  other purposes; to the Committee on Foreign Relations.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}]