[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "University of Washington Medicine tells me that this would  leave them with shortfalls and that they might have to stop clinical  trials that are underway.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-04"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "The University of Rhode Island, just across the  bay, has a nationally recognized School of Oceanography, and they have  just devoted millions of dollars to upgrade and improve that.", "title": "National Oceanic and Atmospheric Administration", "date": "2025-02-26"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "These efforts are critical to my district, which includes the  University of North Carolina at Chapel Hill, Duke University, North  Carolina Central University, Durham and Wake Technical Community  Colleges, and so many new up-and-coming industry leaders in STEM.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Speaker, I rise to recognize the Washington University  women's soccer team, who just secured their second-straight Division  III national championship.", "title": "Recognizing Washington University Women's Soccer Team", "date": "2025-12-12"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "In the bill, a Chinese entity of concern  is any university or college in the People's Republic of China that  meets at least one of nine very broad criteria.", "title": "Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-07"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "As Operations Manager for the University of  Maryland's Health, Environmental, and Economic Justice Lab, she leads  initiatives that support grassroots environmental justice (EJ)  organizations and empower future generations through education and  mentorship.", "title": "Virginia's Fourth District Women in Excellence Awards", "date": "2025-05-01"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Over $715 million in National Science Foundation  grants have been terminated in New York's 20th Congressional District  alone, including a $1 million award to the University at Albany's  Project SAGES.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "A little bit of context: One of the reasons I got involved in  politics was as a student at Tulane University in New Orleans,  Hurricane Katrina hit the city at the time.", "title": "Concerns About Hurricane Season", "date": "2025-06-09"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "He founded the Hassenfeld  Child Health Innovation Institute at Brown University to improve family  mental health and created RI For Gun Safety to promote commonsense gun  reform.", "title": "Recognizing Arthur Coia of Rhode Island", "date": "2025-07-22"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Martha's passion for innovation led her to University Lab Partners,  where she helps startup companies develop groundbreaking medical  devices and diagnostic devices.", "title": "Daca Recipients Need Pathway to Citizenship", "date": "2025-02-27"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Gregory Mize--a Georgetown University law professor and retired trial  judge--offers a compelling perspective: we can use jury trials as  models for attaining higher levels of truthfulness and reliable  outcomes in government.", "title": "Valuing Truth `fullness': Lessons From Jury Trials", "date": "2025-04-10"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "When the landmark  Supreme Court decisions in 2023 and 2024 further restricted race- conscious university admissions and workplace policies, they  accelerated a retreat from this understanding.", "title": "Ending of Dei Programs Through Executive Order", "date": "2025-04-29"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "The Albany Area Chamber  of Commerce Military Affairs Committee, American Legion Post 30 and  Post 512, VFW 2785, Albany State University, Albany Area YMCA, and  numerous businesses and individuals have all rallied behind the Albany  Young Marines.", "title": "Recognizing the Albany, Georgia Young Marines", "date": "2025-05-15"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Chancellor Sharon  Gaber and the exceptional work that she has done leading the University  of North Carolina at Charlotte.", "title": "Recognizing Chancellor Sharon Gaber", "date": "2026-01-22"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Superintendent Ahmadi holds a bachelor's degree from San Jose State  University, a master's in teaching from Chicago, and a master's in  educational leadership from Saint Mary's College of California.", "title": "Recognizing Parvin Ahmadi", "date": "2025-06-03"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "After graduating from Washington State University and earning his law  degree from the University of Washington, he served as deputy Spokane  prosecutor and later as chief of the  Eastern Washington Attorney General's office before cofounding the  respected law firm, Reed & Giesa.", "title": "Operation Rolling Thunder", "date": null}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "In 2013, Evan  commissioned as a Logistics Readiness and Munitions Maintenance Officer  after graduating from the University of Colorado, where he received a  Bachelor of Arts Degree in International Affairs with magna cum laude  honors.", "title": "Recognizing and Expressing Gratitude to Defense Fellow Major Evan Hanson", "date": "2025-12-04"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "His service was featured on the  History Channel and in books like ``Hill 875'' and ``Dak To.''\n\nAfter his military service, Tom graduated from Florida State  University College of Law, joined the Florida bar in 1971, and gained  courtroom experience as both a public defender and as assistant State's  attorney.", "title": "Thanking Emergency Medical Services Personnel", "date": "2025-05-20"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Allen, Frank's commitment to public service  continued through his education at Auburn University and his work as a  legislative aide.", "title": "Recognizing the Retirement of Frank Caskey", "date": "2025-05-07"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "A native of Denison, Texas, Nate attended Denison High School and  graduated from Baylor University in 2003 with his Bachelor of Business  Administration.", "title": "Recognizing Congressional Patriot Award Recipient Nate Pike", "date": "2025-04-28"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "These centers already serve as trusted boots-on-the-ground advisers  in communities across the country, such as the University of Missouri- Columbia and Sedalia and other places where these SBDCs are providing  real help, real boots on the ground.", "title": "Ai for Main Street Act", "date": "2026-01-20"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Amanda went on to graduate from DePaul University.", "title": "Recognizing Amanda Brewer for Women's History Month", "date": "2025-03-25"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Speaker, I rise today to recognize the University  of North Dakota for earning the Gold Award as a 2025-2026 Military  Friendly School.", "title": "Recognizing University of North Dakota Upon Earning Gold Award", "date": "2025-11-20"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "A native of Monterey, California, Rob earned his degree in Psychology  from Gonzaga University in 2009 as a Distinguished Military Graduate.", "title": "Recognizing the Service of Major Robert Coleman", "date": "2025-07-23"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "After graduating from the University of Georgia--go Dawgs--Mr.", "title": "Recognizing Ben Chapman", "date": "2025-07-14"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Bodiford served as Director of Bands at my alma  mater, Jacksonville State University.", "title": "Recognizing Dr. Kenneth G. ``ken'' Bodiford for His Extraordinary Service to Jacksonville State University and the Field of Music Education", "date": "2025-11-07"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "A graduate  of the University of Georgia's Henry W.", "title": "Recognizing Riverview Hotel's 110th Anniversary", "date": "2026-01-13"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "President, it is my honor to introduce Rabbi Berman,  who just gave the prayer and who is president of the Yeshiva  University.", "title": "Dr. Rabbi Ari Berman", "date": null}]