[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…recipients  of their world-renowned awards, recognizing those who ``conferred the  greatest benefit to humankind.'' In 2025, a record-breaking number of  them came from one public university system: the University of  California. Today, it is my honor to recognize each of California's  five Nobel laureates for their achievements.\n\nFrederick J. Ramsdell, an alumnus…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…rise today to salute the life of Mayo  Peter Bartlett, who passed away in September at the age of 86.\n\nMr. Bartlett was born in 1939 in Rye, attended North Carolina Central  University, graduated with a degree in accounting, and membership  during college of the Alpha Kappa Chapter of the Kappa Alpha Psi  fraternity. Mr. Bartlett turned his degree into…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…do with command and control.  Those are words we remember from the Communist era, command and  control. Well, holy smokes, there is not a media company, a law firm,  or a university that has not been subject to the command and control of  the Oval Office.\n\nThe President has demanded money. It looks a little like extortion to  me, but in order to avoid…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Godinez Fundamental High School in Santa Ana and  then went on to earn a bachelor's degree in public health from UC  Merced in 2019.\n\nMartha's passion for innovation led her to University Lab Partners,  where she helps startup companies develop groundbreaking medical  devices and diagnostic devices. She helps bridge the gap between  research and real-world…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688313/daca-recipients-need-pathway-to-citizenship"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…millions  of researchers and innovators who push American STEM in our Nation's  workforce to the forefront.\n\nThese efforts are critical to my district, which includes the  University of North Carolina at Chapel Hill, Duke University, North  Carolina Central University, Durham and Wake Technical Community  Colleges, and so many new up-and-coming industry…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691388/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, I rise a proud South Carolina State  University alumnus to congratulate its football team on their new  title, the 2025 HBCU national champions. The Bulldogs erased a 21-point  half-time deficit, scoring three touchdowns…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Lisa Gissendaner,  who retired recently as the Canton Program Director for The Ohio State  University Young Scholars Program as this week's Champion of the Week  for Ohio's 13th Congressional District.\n\nThroughout her career, Lisa helped and supported countless students…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691972/recognizing-lisa-gissendaner"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…my constituents last week, Paul from Canaan.  Canaan is a small town in the northern part of New Hampshire. He is one  of those people who we talk about and who Georgetown University Center  talked about when they talked about the impact of those cost increases  on Americans. Paul's employer-sponsored insurance would be  prohibitively expensive for him…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…wife--and he  had two kids, younger kids--had the same form of rare cancer and his  wife died and we talked about that.\n\nBut there was a difference. We had insurance through the University  of Vermont where my wife was a professor. He had no insurance. He was  working late nights, long hours, raising these two kids by himself, and  he was trying to pay off…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…history: the 65th anniversary season of As Schools Match  Wits, an award-winning high school academic quiz show produced by New  England Public Media and Westfield State University. To the best of our  knowledge, As Schools Match Wits, known affectionately throughout the  region as ASMW, is the longest-running, continually broadcast  television program…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…constitutional authority to admit the       Commonwealth into the Union because of meritless threats of       litigation.            Sincerely yours,\n\nCaroline Fredrickson, Georgetown University Law Center;       Erwin Chemerinsky, University of California, Berkeley School       of Law; Stephen I. Vladeck, University of Texas Law School;       Franita Tolson, University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Rasmussen  University on their 125th anniversary.\n\nFounded in St. Paul, Minnesota, on September 1, 1900, Rasmussen  University has spent 125 years building a powerful legacy of  opportunity. What…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694738/recognizing-rasmussen-university-for-their-125th-anniversary"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…today for the 27th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nAccording to data compiled by Boston University, more than 70,000  children--children--have died this year because the Trump  administration has frozen food aid that had been delivered by this  country for years prior.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…its mission for more equitable and accessible  conflict resolution.\n\nTom also gives back to the legal community by serving as a guest  lecturer at law schools such as the University of Denver and helps  clients in his private practice.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Tom Downey for his…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…education for formerly enslaved people and  their children.\n\nOver two centuries later, her legacy still lives on in New Hampshire  with the Dinah Whipple STEAM Academy at the University of New  Hampshire. This program offers underrepresented young teens of color  the opportunity to explore science, technology, engineering, arts,  math, and black history…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…11,       2018, and unjustly sentenced to 20 years in prison in       retaliation for her sister's advocacy for Uyghur human rights       issues; and\n\n(C) Kamile Wayit, a university student and Uyghur, who was       wrongfully detained on December 12, 2022, after returning to       the XUAR while on break from studying during the winter       holiday;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Services,  Intelligence, and Foreign Affairs Committees. In 2013, Evan  commissioned as a Logistics Readiness and Munitions Maintenance Officer  after graduating from the University of Colorado, where he received a  Bachelor of Arts Degree in International Affairs with magna cum laude  honors. As a commissioned officer, Evan has remained committed to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…lifeline for the people of Lubbock County for 50  years: the UMC Emergency Medical Services team.\n\nSince their first 911 response back in November 1975, well before the  University Medical Center Hospital even opened its doors, UMC EMS has  been on the front lines of saving lives and serving our communities in  west Texas.\n\nWe are fortunate to have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…cross-sex hormones have no  demonstrable long-term benefits on the psychological well-being of  adolescents in gender dysphoria.\n\nI am reminded of a quote that a Vanderbilt University doctor said in  2022. He said: ``These affirming procedures are huge moneymakers.''\n\nWe are here to protect the children.\n\nMadam Speaker, I yield 2 minutes to the gentleman…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…dedicated himself to faithfully serving and protecting  our community.\n\nA native of Greenville, Texas, Lane earned his bachelor's degree in  criminal justice from East Texas A&M University. He began his lengthy  law enforcement career in 1974 as a Department of Public Safety officer  at Dallas Fort Worth International Airport. He worked his way up the  ranks…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize President Alisa  White of Sam Houston State University for her dedication, devotion and  leadership in service to Sam Houston State University, its students and  all Texans. Like Sam Houston himself, Dr. White saw Texas as a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to congratulate Angola,  Indiana's, Trine University women's softball team on winning the 2025  NCAA Division III softball championship. Under the leadership of head  coach Donnie Danklefsen, the Thunder gave the championship…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693078/trine-university-2025-womens-softball-champions"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Mrs. HOUCHIN. Mr. Speaker, today I rise in recognition of the 15-0  Indiana University football team for their historic season, winning the  Rose Bowl, then the Peach Bowl, and now advancing to the College  Football Playoff National Championship.\n\nThis team…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…political subdivision of any State,       territory, or federally recognized Indian Tribe, or any       agency or public instrumentality of any of the foregoing;\n\n(B) a college, university, or other institution of higher       education;\n\n(C) a nonprofit organization;\n\n(D) an angel investor group;\n\n(E) an incubator or accelerator;\n\n(F) a venture forum, venture…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…military, he went to work for a chemical company in  Spain. He and Nancy continued their relationship via letters and  visits.\n\nAs Nancy neared completion of her degree at University of California,  Berkeley, he asked her to marry him. They were married in California in  1961 and moved to Barcelona for several years. Their daughter was born  in 1963,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Born in Texarkana, Texas, Dennis attended Maud High School,  graduating in 1970, before pursuing higher education at United  Electronics Institute, Texarkana College, the University of North  Carolina, and Army Management Staff College, Army Logistics Management  College, where he completed the Leadership Management Program and  Logistics Management…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in Savannah, Georgia.\n\nMs. Seiler's leadership, service, and commitment to community reflect  the very best of civic engagement and personal dedication. A graduate  of the University of Georgia's Henry W. Grady School of Journalism, Ms.  Seiler built a distinguished career in corporate communications and  public affairs before retiring.\n\nMs. Seiler served…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…along with her sisters, Lisa Abernathy and Susie Carr. She  graduated from Southside High School in 1979, attended Gadsden State  Community College, and graduated from the University of Alabama at  Birmingham with a degree in Dental Hygiene.\n\nAfter working as a dental hygienist for 15 years, Anita joined her  family's construction business and eventually…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696590/recognizing-the-retirement-of-city-councilwoman-anita-bedwell"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…hospitals,  advanced medical programs, and an economic impact exceeding $7.5  billion.\n\nNamed alongside leading business and academic figures like Delta  Airlines Ed Bastian and University of Georgia President Jerry Morehead,  Dr. Hanley is in great company.\n\nHe credits all recognition to the dedicated staff and workforce at  Northeast Georgia Health System…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and commitment to duty  reflect the highest traditions of military service.\n\nBorn and raised in Holly, Michigan, Captain Retzlaff pursued higher  education at Cedarville University, where he earned a Bachelor of  Science degree in Exercise Science and completed the Army ROTC program.  In 2017, he was commissioned as an Armor Officer in the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}]