[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…national research  assets.\n\nH.R. 1318 clarifies--it is always nice to clarify in legislation--the  definition of malign foreign talent recruitment program so that our  beloved universities and research institutions can  readily ensure that their faculty members are not affiliated with  malign foreign talent.\n\nThe National Science Foundation affirmed that our…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…2, among the dozen or so most virulent signs of the decline of  our democracy, at the risk of an authoritarian regime taking hold of  this country, are the attacks on our universities. We see this in  Hungary and elsewhere. When rulers start to attack the independence,  the academic freedom of our universities, it is a sure sign of a  democracy in trouble.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…purchasing their products and distributing  them to people in need around the globe. If Republicans pass this bill,  those farmers will lose.\n\nFeed the Future also partners with universities and colleges across  the United States to operate innovation labs that draw on their  expertise to tackle the world's biggest challenges to food security.\n\nInstitutions…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…several  executive orders, trying to limit the ability of law firms to represent  their clients, one of the fundamental hallmarks of our system of law.\n\nHe has gone after universities. These institutions form the bedrock  foundation of the growth and innovation of our great country and  underpin and form the foundation for the best global economy in the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…ranked number one  in polymer science and plastic engineering. Partners in the Tech Hub  are also investing in industry-led workforce training programs in  collaboration with universities and community colleges.\n\nStrong coordination with the labor units through the Tri-County Labor  Council within the region ensures the creation of good-quality jobs for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…over our university athletic  departments. This creates the risk of further conference realignment,  cutting nonrevenue sports, and expanding for-profit influence over  universities.\n\nThis is why I have sent a letter with my Republican colleagues to end  the NCAA.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Where were you when the American press was being censored; when  international students were being disappeared from American streets  without due process; when American universities were being intimidated  into silence, challenging that fundamental idea of freedom of thought,  freedom of expression; when the law firms that represent clients that  may…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…have witnessed dictators and authoritarian  leaders suppress science and knowledge because it threatened their  rule.\n\nIn Nazi Germany, Jewish scientists were forced out of universities,  and research was put under complete control of the government. The  result was not only the loss of a generation of brilliant minds but a  society in which truth itself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 881, the DHS Restrictions on Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist Party.\n\nThe People's Republic of China and the CCP have poured hundreds of  millions of dollars into U.S. universities…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…of what is happening right now is threatening our economic  present but also our economic future.\n\nThere are massive cuts being made to science and research funding for  universities which have long been the basis for our innovation economy.  Whether in California, Boston, Atlanta, or around the country, we know  that high-end research creates jobs.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…gender discrimination and  enforces critical civil rights laws. It supports Pell Grants and other  forms of student aid, strengthens our Historically Black Colleges and  Universities (HBCUs), and ensures that students with disabilities  receive the services they need to succeed.\n\nBut now, President Trump wants to destroy all of that. Eliminating  the…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…eliminate the entire Agency.\n\nAnd on Valentine's Day, President Trump's Department of Education  threatened to cut Federal funding from public schools, as well as  colleges and universities, if they did not eliminate any program that  the Trump administration deems as promoting diversity, equity, and  inclusion.\n\nDuring her confirmation hearing, Mrs. McMahon…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…across every district in our country. He is using  the threat of cutting off Federal funding as a negative approach, very  much taking a tool right here to pressure the universities and  administrations to submit to his will in violation of freedom of speech  for their students.\n\nMr. Chair, instead of addressing any of these crises threatening our…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Materiel Command and the Naval Research Laboratory.\n\nA Marylander to her bones, Maryam prepared for this remarkable career  at the Free State's world class colleges and universities. She's earned  degrees at the University of Maryland-College Park, Hood College, and  the University of Baltimore School of Law. On behalf of a grateful  Nation and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…intimidating law firms with threats that they will be denied access to  security clearances or even to go on to governmental property, and  intimidation and threatening our universities, supposedly in the name  of anti-Semitism--nobody hates anti-Semitism more than I do, but I  despise using anti-Semitism as a pretext or a guise simply to attack  people…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Communist  China's second-generation ethnic policy is Hu Angang, who leads the  Institute for Contemporary China Studies at Tsinghua University.\n\nUnfortunately, American universities such as Yale, Harvard, and the  University of Pennsylvania have engaged in partnerships with Tsinghua  University. There is no reason why our universities should be  complacent…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Maintaining American  Superiority by Improving Export Control Transparency Act, a key piece  of legislation to ensure our country stays ahead of our adversaries.\n\nBusinesses and universities in the United States work constantly to  innovate, improve, and invent the best technologies and systems in this  world. This is what keeps America on the leading edge.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…they don't care how they do it. These enemies would  stoop so low as to target our young people. For years, countries like  the People's Republic of China have used our own universities to  advance agendas that hurt American security.\n\nAside from the state of Qatar, there is probably no other country in  the world that finances U.S. colleges and universities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Title  IX includes all of that.\n\nWe want students to know the rights given to them under Title IX  without creating excessive regulations or requirements for colleges and  universities.\n\nDespite what some of my colleagues have said today, the Pregnant  Students' Rights Act doesn't promote a certain viewpoint or ideology.  It simply affirms a basic principle,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…a student movement, this charity boxing  event was created to spread mental health awareness, particularly among  young men.\n\nWhat began in Athens now spans across eight universities with the  proceeds benefiting the Sam Asbury Foundation in Atlanta Georgia, and  other local charities.\n\nSam Asbury was a proud graduate of the University of Georgia and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…beholder.\n\nWhat we did in this bill, and I think it is something that everybody  on the floor can be proud of, we put into this bill the capability to  do extensive research by universities, the NIH, and the FDA. We created  a framework to do research on the 4,800 believed analogues of fentanyl.\n\nI believe it has two advantages. One, if we find one of these…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rabbi in our State.\n\nHe was born in Boston, Massachusetts, and moved to Little Rock with  his wife in 1992.\n\nRabbi Ciment has lectured on matters in Judaism at several  universities in Arkansas and has been a frequent author in the ``Ask  the Clergy'' section of our statewide newspaper, the Arkansas Democrat- Gazette. He studied at the Rabbinical Seminary…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689253/welcoming-guest-chaplain-rabbi-pinchus-ciment"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…and national security from dangerous  foreign actors.\n\nFor years, China has been attempting to exert soft power over our  country by forging ties with American schools and universities. In an  attempt to influence our future generation, the People's Republic of  China has been establishing Confucius classrooms in our K-12 public  schools. Styled as language…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…you, most Americans would say ``No one does that  anyway''--except they did. Under the Biden administration, this became  an issue, where multiple different colleges and universities would  reach into different religious organizations on campus and would deny  them access to be able to be on campus and use campus facilities at all  or they would say:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…final  bill as a result of the Byrd rule was an exemption for qualified  religious institutions from the excise tax on investment income of  certain private colleagues and universities, also known as the  university endowment tax. The qualified religious institution provision  would exempt any institution that, in short, is longstanding and has  substantive…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…2025-2026 Military  Friendly School.\n\nUND was named among the nation's top 10 military-spouse friendly  schools nationwide. This honor places UND in the top 10 percent of  universities across the U.S. for its commitment to serving our  servicemembers, veterans, and their families.\n\nUND's leadership reflects a long tradition of service that dates back…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697044/recognizing-university-of-north-dakota-upon-earning-gold-award"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Why should we continue to have taxpayer-funded sex-change operations?  The Senate bill puts that back in.\n\nWhy should we not tax these big university endowments and these  universities that are engaging in political activism and taking massive  Federal money and Federal student loan support? Why shouldn't we tax  them on it? The Senate reduces our tax…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Savannah River Site and nuclear modernization was included. The  two-site solution shows American commitment to peace through strength.\n\nSupport for defense programs at universities like the University of  South Carolina has provided for the promotion of academia and national  security together.\n\nWith President Trump's envoy, Tom Barrack, history is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…President Trump said something that was brilliant on the  campaign trail. He said: It is insane we educate people, then we send  them home with their degrees from the American universities to compete  with us. That sparked an idea, and then we got our economists to do the  modeling.\n\nIt creates about $150, $160 billion of additional tax receipts in the  10-year…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country. I think when you have proposals in Congress that  encourage that, that are very much thematically aligned with the pro- Hamas, anti-Semitic encampments that took over universities in the  country, it is very important that that is condemned strongly and  unequivocally. I am very proud that that is exactly what the House of  Representatives did today.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]