[{"senator": "Al Green", "party": "Democrat", "sentence": "…that classified information was not such.\n\nYou cannot get away with this kind of thing. ``The arc of the moral  universe . . . bends toward justice.'' What you have done is unjust,  and it will be told. The story will be told truthfully.\n\nI close with this: We who are given the honor of serving have been  accorded the trust of the public. It is said…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…based on charge alone violates           the Constitution\n\nThe proposed bill's provision requiring automatic pretrial       detention based solely on the charge is not only unjust--it       is almost certainly unconstitutional. The U.S. Supreme Court       made this clear in United States v. Salerno, holding that       pretrial detention must be a ``carefully…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, I rise today in strong opposition to  President Trump's unlawful and unjust deportations to El Salvador.\n\nEarlier this year, the administration invoked the Alien Enemies Act,  an 18th century wartime statute, to deport 137 Venezuelan men to a  notorious…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690504/trump-immigration-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…nursery for  her little son with her family and celebrating her son's last day of  kindergarten, but Adriana's body lies hooked to machines in a hospital  bed as part of an unjust medical experiment for more than 3 months. No  family should have to endure this.\n\nNone of us are free until all of us are free.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…administration.\n\nMajor damage is being done to our institutions, and all my brothers  and sisters can do on the other side of the aisle is cower in favor of  what they know is wrong and unjust.\n\nThis is abuse of authority, and we cannot let it go unchecked. As  much as Trump and his Department of Justice try to silence us, we must  all speak up and speak out. Democracy…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…option for nearly a million  veterans who have served 20 years and have a 50-percent VA disability  rating or higher. It has already dealt with one segment of this group.  This unjust assessment ultimately ought to be eliminated for all the  430,000 veterans who had their military retirement pay clawed back  because they are receiving VA disability benefits.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…inequality, injustice in healthcare is       the most shocking and inhumane.\n\nNot bigotry, not poverty--two things he fought so nobly against--he  said the most inhumane, the most unjust are what we are talking about  here.\n\nTake away access to healthcare from children, take away access to  healthcare from our elders, take away access to healthcare from people…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…overwhelmed if the New York  City office closes.\n\nThis bill weaponizes Federal resources to hurt cities that have made  the choice to protect immigrant communities. This is unjust.\n\nI have worked closely with my Democratic colleagues to raise these  concerns directly with the SBA administrator through multiple letters,  outreach, and even in the Small…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Ears and Camp Hale National  Monuments, elevated Tribal voices in the Colorado River Basin, and  advocated for the protection of the Dolores River.\n\nAfter generations of the unjust loss of their ancestral homelands,  Chairman Heart led the efforts to secure full Federal trust status for  the Tribe's Pinecrest Ranch, reclaiming a piece--a piece--of what…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…strong opposition to H.R.  3486. Let's be clear. This bill is not about border security. It is  about pouring gasoline on a prison system that is already bloated,  broken, and unjust.\n\nWhile American families are begging us to release the Epstein files,  to lower grocery prices, to keep doctors' offices open, to confront  mass shootings, Republicans have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695363/stop-illegal-entry-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the point.\n\nI recently returned from rural Louisiana where my colleagues and I  went behind the wall at two remote detention facilities. These  facilities have a history of unjust and unsafe conditions. Behind the  wall, as co-chair of the House's Reproductive Freedom Caucus, I met  women who were pregnant, entering the latter months of their pregnancy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the way, my guess is they  are not getting a big benefit from these tax cuts because they are  minimum wage or a little bit more.\n\nSo we are really doing something that is so unjust and, I believe,  un-American in rewarding the wealthy--some of whom have worked hard to  get it, some of whom just were lucky enough to be born to the right  parents. And we…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…men will be enabled to subvert the power of the people and to usurp for  themselves the reins of government, destroying afterwards the very  engines which have lifted them to unjust dominion.\n\nTowards the preservation of your government and the permanency of  your present happy state, it is requisite not only that you steadily  discountenance irregular…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…How will firing and abandoning Americans dedicated to helping others  make America greater?\n\nOur Federal workforce is the backbone of this Nation. And their  indiscriminate, unjust firings not only hurts them, but all Americans  who rely on the government for critical services.\n\nIt seems that Donald Trump and Elon Musk have mistaken the Federal  Government…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…were the caregivers and providers at home  and, when they were in the workforce, were making less than their male  counterparts. No matter how you look at it, it is unfair and unjust.\n\nSocial Security is the Nation's number one antipoverty program for  the elderly, and it is also the number one antipoverty program for  children.\n\nMadam Speaker, more veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…institutional reprisal, loss of athletic  scholarships, or even negative impacts on their academic opportunities  and their standing. Those fears and anxieties are not just unjust to  women but they are a poor reflection of how our higher education  institutions treat pregnant students.\n\nHigher education institutions and universities have a responsibility…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…will be enabled to subvert the  power of the people and to usurp for themselves the reins of  government, destroying afterwards the very engines which have lifted  them to unjust dominion.\n\n``Towards the preservation of your government and the permanency of  your present happy state, it is requisite, not only that you steadily  discountenance irregular…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…invasion of Ukraine. In Ecumenical Patriarch  Bartholomew's opinion, he says, ``This is the theology that the sister  Church of Russia began to teach, trying to justify an unjust, unholy,  unprovoked, diabolical war against a sovereign and independent  country--Ukraine.''\n\nThe Ecumenical Patriarch is a figure who has addressed the European  Parliament…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…aliens.\n\nMr. Speaker, they are doing that right now. That is exactly what they  are doing, and they are fighting for it. Allowing illegal aliens to  vote is not only grotesquely unjust, but it waters down the meaning of  citizenship for American citizens who are here.\n\nMr. Speaker, our government should represent our people, American  citizens. Illegal aliens…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…across the country that have repeatedly cited the unfair  treatment of the Tribe under the 1956 Lumbee Act.\n\nToday, Congress can take a major step forward to end the unfair and  unjust treatment of the Lumbee Tribe once and for all.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMr. ROUZER. Mr. Chair, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…radical left's goal, and we were mocked for it.\n\nThat is exactly what Democrats are doing right now, fighting to allow  illegal aliens to vote. This is not only grotesquely unjust, but it  waters down the meaning of American citizenship.\n\nMr. Speaker, by passing this bill, we reaffirm a simple but sacred  truth. American elections belong to Americans,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}]