[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…own citizens and  interests or to come to the collective self-defense of our allies and  our partners.\n\nIt comes down to this: The President has used our military to strike  unknown targets on at least four occasions, and he is promising more.  With at least 21 people dead and more killing on the way and with the  President telling us that strikes on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…residents suffer.\n\nA staffing shortage like this creates a domino effect that       will impact resident care for the foreseeable future. This       begins with the largely unknown ripples of this sudden change       in the labor force. It is clear that we have relied on TPS       employees to fill the CNA labor pool across the state, what       is unclear…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…once again, set  health, science, and medicine in America backward.\n\nThe new guidance says that only babies whose mothers test positive  for hepatitis B or whose status is unknown should receive the vaccine.\n\nFor every other baby, the committee has decided not to give a  recommendation.\n\nIf acting CDC Director O'Neil approves this recommendation, countless…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697786/attack-on-childrens-health"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…would have four sons. One  of them is named Shomari Figures, who stands here today as a Member of  Congress because of the fights of him and the fights of those known and  unknown before him.\n\nBlack history is not only my history. Black history is your history,  whether you like it or not. It is our history. Black history is  American history. Black…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…colonials, helping confound the       crown's probe. In some ways, their effort to hide was too       successful: Even today, about half the men who burned the       Gaspee are unknown.\n\nBut as the American Revolution began to slip out of living       memory, Rhode Islanders tried to lay a claim to the first       shot fired.\n\n``The first blood that was…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Mr. LEVIN. Mr. Speaker, in January, a largely unknown midlevel career  employee at the Social Security Administration, Leland Dudek, was  caught sharing unauthorized data with Elon Musk's team at DOGE. Senior  officials were…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688267/dismantling-social-security"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…authority? Who has the expertise? Our legislation helps answer those  questions before another emergency unfolds.\n\nMr. Speaker, first responders should not have to walk into an unknown  biological environment without clear Federal support. Parents should  not have to worry about hazardous material being stored in facilities  next door to schools and residential…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Bill       Act on access to care for millions of Americans.\n\nNearly two months after the law's passage, hospital       executives here say there are critical details still unknown       that make it difficult to determine exactly how it will       impact providers and patients.\n\n``My best guess is it's not going to be good for hospital       providers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…babies. Throughout their       lives, Matt and Chris, along with my parents and family, have       fought to ensure that they have the best care possible,       despite how unknown and underresearched their condition is.\n\nTaking Medicaid away from them would strip Matt and       Christian of basic access to specialized care that they rely       on and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…DOGE  service administrator, an office which remained vacant for several  weeks, and with the government's own attorneys claiming in court that  the official head of DOGE was unknown to them.\n\nSince that time, a nominal administrator has been named, despite the  repeated avowals from the President and his administration that Mr.  Musk controls and directs…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…passage of this legislation when it is       before you on the floor.\n\nLithium-ion batteries present a major challenge due to       their range of sizes, construction, frequently unknown       origin, and potential for ignition if damaged or defective.       While there are consensus standards to address the safety of       lithium-ion batteries and battery-powered…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…drink poisoned water and  breathe poisoned air.\n\nThe effects on the communities known as the downwinders have been  catastrophic, and their suffering is still, sadly, mostly unknown in  this country. We have made some small steps toward providing overdue  compensation to these Americans, the first and the most consistent  victims of our nuclear weapons…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…coordinator for Dartmouth Health. She helps  families every day. Because she got care when she needed it, she is now  working to provide care for others, touching untold and unknown numbers  of lives through her work. And she was my guest this year at the  President's joint address to Congress. But none of her recovery,  employment, and lifesaving work…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…history of the United  States of America, we can be proud, as a body, of that decision to  count the votes and do our duty, rather than shirk it in the midst of  that continuing unknown and potential danger as the security literally  went through the broken glass and the desecrated offices and this very  Chamber to make sure that there were no bombs or rioters…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…defense of Honolulu during the Second World War, the cemetery  opened to the public on July 19, 1949, with services for five who lost  their lives in service to our Nation: an unknown serviceman, two  Marines, an Army lieutenant and one civilian--noted war correspondent  Ernie Pyle. Since then, it has become the final resting place for an  estimated 53,000…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…going to ensure that future administrations cannot  create complicated review processes that lock out competition, provide  unnecessary delay, and keep things in limbo for unknown periods of  time.\n\nIn the true spirit of competition, this resolution cuts burdensome  red tape and allows banks to get back to what they do best: serving  customers and serving…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…None.............  ....................                                   Services            Than $500K,                                   Modernization       Direction Unknown.                                   Act, as amended. H.R. 4323......................  Trafficking         None..............  None.............  ....................…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…is fundamentally different from any past drug  epidemic. These substances are engineered to be highly lethal. The  amount that you can fit on a pinhead could kill a person. Unknown  exposure just from somebody coming to assist somebody could kill  somebody. These are weapons of mass destruction.\n\nIt is different from anything we have ever experienced…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…the Trump administration brought that number  down to 2.6 million hours and $135 million in 2019, the lack of unified  reporting means the full scope of the problem remains unknown today.  This is money that should have gone to serve the American people, not  to subsidize private union interests.\n\nEnding ``official time'' is a commonsense step to ensure…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Committee on the Chinese Communist Party.\n\nI want to share some of the details of that report, but I will start  with its conclusion: That no one knows whether there are other unknown  bio labs because there is no monitoring system in place.\n\nThose were the words of the Select Committee on the Chinese Communist  Party in 2023. We know there was at least…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Improvement Act                                             direction                                    of 2025, as                                                 unknown.                                    amended. ---------------------------------------------------------------------------------------------------------------- Source: Congressional…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…the Federal Government and  might be affected by the land management policy associated with that  parcel, are very important to that local population but might be  completely unknown not only to people on the other side of the country  but even to people in other parts of that same State.\n\nThere is a fair amount of legislation that moves through the  Committee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…State of Pennsylvania,  Chester County officials mistakenly omitted 7,000 third-party votes  from the voter rolls. Registered voters were turned away at the polls,  and an unknown number of unverified voters cast regular ballots.\n\nEvery single time Americans hear about election problems like those  in Chester County, they rightly question the integrity…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…None.............  ....................                                   Services            Than $500K.                                   Modemlzation Act,   Direction Unknown.                                   as amended. H.R. 4323......................  Trafficking         None..............  None.............  ....................…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Why? Well, because the whole argument about Fed  independence comes into question, right? If all of a sudden, the  Justice Department, apparently--according to the President, unknown to  him--he reported it was a surprise to him. Since then, he has been  briefed. He is standing by the Justice Department on this indictment.\n\nLadies and gentlemen, unless…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…nearly 100 Members of this institution, who  have cosponsored H.R. 1329. We can transfer this land and get this  museum built to honor the women who are currently known and unknown,  who have contributed so much, and who have built our Nation. This is  one of our new caucus' priorities, and we must get it done in this  term.\n\nLast week, something exciting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…they  that know the winters of the country know them to be sharp and violent,  subject to cruel and fierce storms, dangerous to travel to known  places, much more to search unknown coasts.\n\n``Besides, what could they see but a hideous and desolate wilderness,  full of wild beasts and wild men? And what multitudes of them there  were, they then knew not:…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…disable five 155-millimeter artillery       guns, which could have rained artillery fire on the American       forces landing on either beach, jeopardizing the invasion.\n\n(7) Unknown to the American forces, the guns had been moved       from the tip of the Pointe and hidden, pointed in the       direction of Utah Beach, in an inland apple orchard nearly…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Inpatient          Than $500K,                                   Services           Direction                                   Modernization      Unknown.                                   Act, as amended. H.R. 4323......................  Trafficking        None.............  None.............  ......................…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…threat  to the United States. This is alarming and a national security risk.\n\nLast Congress, I asked the Biden Administration to be transparent  about encounters with known or unknown terrorists entering our country.  Their answers were unsatisfactory.\n\nPublishing the number of special interest aliens who have been  granted entry to the U.S. would educate…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}]