[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…just conclude by stating something that has  conveniently been stifled in this whole debate--limited debate--and  conversation. So who benefits from all of this? It is not unleashing  job creation and innovation in States--the other 49 States--but  California. It is holding our Nation back in terms of improving air  quality and our transition to a clean…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…presenting evidence to  a judge that they should be removed.\n\nTrump has done this to legal permanent residents and talked openly  about doing it to American citizens.\n\nWhile unleashing terror on our streets, Trump's brazenly corrupt  decision to accept a $400 million Boeing 747 jet from Qatar for his  personal use is a direct violation of the Emoluments…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…competency in the hiring process and an administration that  focuses Federal law enforcement resources, not on violent offenders but  on prosecuting political opponents, unleashing masked ICE agents on  innocent people, and deporting children and grandmothers.\n\nAt the same time, we have seen the gutting of public health  infrastructure that was built…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…communities.\n\nThis week, the House will consider funding for DHS and give even more  funding to ICE.\n\nLet me be clear, Mr. Speaker: I am not only a no, I am a hell no.\n\nFrom unleashing violence in Minneapolis to dog whistles from the  White House, I have received countless calls from New Mexicans calling  for an end to this violence because we cannot and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699193/defund-ice"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…around the  country and realize, too, that it is time to rein in ICE's abuses. We  should be going after ``the worst of the worst,'' as the administration  says, instead of unleashing fear and chaos on everybody else.\n\nWhat Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "….  . . We believe the Senate now has a critical opportunity to restore  common sense and deliver a truly pro-energy growth final bill that  protects taxpayers while also unleashing the potential of U.S. energy  producers, manufacturers, and workers.''\n\nIn other words, every single one of these signatories--Jen Kiggans,  Brian Fitzpatrick, Juan Ciscomani,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump and Russell Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal  Government.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that history is watching and will  remember this moment.\n\nDid you stand with the American people and our democracy or did you  stand with the lawless administration who is unleashing chaos on our  communities and our democracy and our Nation? I encourage my colleagues  to find your backbone. Right your minds and right your hearts because  history will…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689319/history-will-remember"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…American  hostages freed; reducing the Federal bureaucracy, saving taxpayers  billions of dollars and rooting out waste, fraud, and abuse; reversing  the anti-crypto crusade; unleashing American energy; the green new scam  terminated; EV mandates eliminated; revoked DEI policies in the  military and government; affirming there are only two genders; no more…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Dakota but beyond. This CRA which  rejects the failed energy policies of the previous administration is in  alignment with the current administration's executive orders on  unleashing American energy and reinvigorating America's coal industry.\n\nIn combination with the provisions that Republicans enacted through  the reconciliation bill, this CRA will ensure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…Today, it is time for us to act so that we can get on with the real  work in our committees. In passing this budget framework, we are  unlocking the process to deliver on unleashing American energy  production, permanently securing our southern and northern borders, and  making tax cuts permanent for small businesses and working families.\n\nIf we fail,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…government.\n\nPeople are going to be feeling the effects of these tax savings in  their pocketbooks this tax season, where Georgia families can expect up  to $5,000 in savings. By unleashing American energy, we are bringing  relief to families right now.\n\nThe national average of gasoline is now under $3 a gallon. That  matters to everyone, from the large-scale…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…essential to Alaska's economic growth, and they are essential to  lowering costs for America's working families.\n\nThis resolution supports President Trump's commitment to unleashing  Alaska's extraordinary energy and resource potential. It restores  balance to public land policy, ensures that we meet our commitments to  Alaska's Native communities, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…estimated 70  million to 100 million people, roughly 5 to 7 percent of China's  population, were practicing Falun Gong.\n\nThis popularity triggered a brutal response from the CCP, unleashing  a campaign of illegal detentions, forced labor, torture, and most  horrifically, forced organ harvesting, a practice that amounts to mass  murder.\n\nOn July 20, 1999, the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…like the announcement from General Motors about increasing its  production in the Fort Wayne truck plant.\n\nHe has brought gas prices to their lowest point since 2021 by  unleashing American energy independence.\n\nOutside of the economic impacts that have saved money for everyday  Americans, President Trump has kept his commitment to protect American…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…shared agenda. We are  delivering on the promises that we made to the American people. We are  going to secure the border, we will restore peace through strength, we  are unleashing American energy, and we are going to stop the Democrats'  oncoming freight train of a $4 trillion tax increase.\n\nDemocrats oppose all of these things. They want to raise…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…consumers and manufacturers in my  district.\n\nAmazingly, my colleagues on the other side of the aisle were stuck in  their seats last night as President Trump spoke about unleashing  American energy and lowering costs. Regardless, House Republicans will  deliver.\n\nMr. Speaker, I thank Mr. Clyde for his leadership, and I urge a  ``yes'' vote.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688546/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…wishes of Alaskans and finalized a new RMP that enshrined  Public Land Order 5150.\n\nOn his first day in office in 2025, President Trump issued Executive  Order No. 14153 on ``Unleashing Alaska's Extraordinary Resource  Potential,'' which directly called for repealing the Biden  administration's central Yukon RMP. This CRA advances President Trump's  executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…regulatory costs and  over 50 million hours of reduced paperwork burdens. That is why I am  proud to support this bill which would advance  President Trump's executive order, Unleashing Prosperity Through  Deregulation.\n\nThis straightforward bill would require the SBA to operate under a  regulatory budget of zero, meaning that for each new regulation  imposed,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…worked alongside  President Trump to deliver on our promises and pass the One Big  Beautiful Bill Act.\n\nThe One Big Beautiful Bill Act is a historic win for our country,  unleashing American energy, promoting innovation, protecting our  Federal healthcare programs for our most vulnerable citizens, and  delivering historic tax cuts for families.\n\nAs chairman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…modernizes our Armed Forces for 21st  century threats by properly funding our military and funding the Golden  Dome.\n\nH.R. 1 ends the progressive left's war on American energy by  unleashing domestic oil, natural gas, and nuclear energy production.  H.R. 1 lowers energy costs, ensuring reliable and stable energy  sources. H.R. 1 renews not just energy independence…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…security.\n\nOf course, that is not all the President has accomplished during his  first 6 weeks in office. Among other things, he has also been laying  the groundwork for unleashing American energy. While Democrats may not  like to admit it, the United States is rapidly heading toward an energy  crisis where we simply don't have the supply to meet the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy resources and ecological significance. This renaming symbolizes  Republicans' commitment to putting America first, and honors the Gulf  of America's important role in unleashing American energy and our  Nation's return to greatness.\n\nMr. WESTERMAN.  Greene), the lead sponsor of this legislation.\n\nMr. Speaker, just earlier this week, this very committee…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}]