[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…from  the Medicaid Program. Wait until that cut works its way through the  economy to your local hospital and clinic, and watch what happens.\n\nThey have already warned us: Unless something is done, there is going  to be a lot of closures and a lot of reductions of services in these  hospitals in rural areas, in small towns, and the inner city. That…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…and build one of  those plants, you build the plant, you hook it up, you connect it to  the grid. The person who now is controlling the dispatch of that plant  never runs it unless it is cheaper than the electric grid. Every minute  you own a solar panel, every minute you own a cogeneration plant, a  wind turbine, all of these technologies that are out…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…here. He  wants those smaller countries. He wants them back. He longs for them,  but they are not his.\n\nPutin now issues an ultimatum. He says there will be no peace deal  unless Ukraine agrees to surrender territory that Russia ruthlessly and  illegally seized and invaded, this little country, just as he did in  Georgia.\n\nThe United States, as leader…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…result from these actions that have already been taken, but we  do know this: Under the CRA rules and ``rules'' is a technical term of  art here, normally cannot go into effect unless they are submitted for  congressional review.\n\nHere is the problem, BLM and the Forest Service have never considered  RMPs to be rules that they would submit to Congress. They…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…for our  communities, for Renee Good, for Alex Pretti, and for the very  principles that our country was founded on. That is why I will be  voting no on the bill before us unless--unless--DHS funding is stripped  out or unless critical reforms are incorporated into the bill.\n\nIf the leader put the other five appropriation bills on the floor  today,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…days before the government  runs out of funding and mere weeks before people receive notice of  their health insurance premiums going up by thousands of dollars next  year, unless the House Republicans extend healthcare tax credits for  working families.\n\nMost importantly, it is a wasted opportunity to spend 1 hour of  precious floor time in service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…student named Jack  Sullivan. He was sextorted by two men claiming to be a woman on  Instagram. They threatened Jack. They told him they would post intimate  images of him unless he paid huge sums of money. He paid and he paid.  When he could no longer pay their demands, Jack took his own life. We  must do better for Jack and every other victim of these…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Appalachia, from before the  industry was federally regulated. These sites will sit for years, with  rivers and streams running over them, polluting waterways in  perpetuity, unless taxpayers shoulder the cost of cleanup.\n\nWith limited government funds and personnel to clean up these mines,  many sites are left polluted for decades. To make matters worse,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, I join the ranking member of the Rules  Committee with a parliamentary inquiry of my own.\n\nMr. WHITEHOUSE. Mr. President, is it true that unless a piece of  legislation is privileged under a rule or a statutory provision or is  the subject of a unanimous consent agreement, motions to proceed to  that legislation are…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…number of soy farmers in the Commonwealth.  They are already struggling under the tariffs and as a result they  can't sell their crops.\n\nOne of my farmers said to me: Basically, unless you are a beef cattle  farmer, you are already a volunteer right now, and now we have to  figure out not only how we feed our families but how we pay for our  health insurance…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…refusing to spend money that Congress has directed. He is  picking winners and losers by withholding Federal grant funding for  programs like disaster relief and medical research unless people  basically bend a knee to his draconian demands.\n\nHe is picking winners and losers by firing nonpartisan experts in  programs that he doesn't like, and he is replacing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…wittingly or unwittingly, has put himself in  a position such that the Justice Department has pledged fealty to him.\n\nGenerals in the military: You don't get these positions now unless  you have pledged fealty to him.\n\nWe ought to be ashamed of ourselves to allow such a thing to have  happened. Yes, generals in the military, the Justice Department, the  courts,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…urgent to act  like it. That means saying to our Republican colleagues that we are not  going to act like business as usual, that we are not going to proceed  to legislation unless we have agreement, Republicans and Democrats, to  stop this assault on free speech and dissent. It requires the minority  party to say that right now.\n\nOnly if we come together…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…States.\n\nI want to mention that the gentleman talked about our Republican  colleagues who are talking a good game about how they won't vote for  this, that, and the other thing unless SALT is taken care of. Well,  SALT goes back to what it used to be if we don't do anything, so that  is where we could end up if this foolish tax bill that is being pushed…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…agents who show up in these cities cannot play by different  rules than police who live and work in our communities.\n\nYou need to wear a body camera. You should not be masked, unless it  is for your health. You need to have insignia that shows you are  actually real law enforcement. You need to have a judicial warrant to  come into someone's house, not…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…desk a  privileged resolution and ask for its immediate consideration.\n\nThe Clerk read the resolution, as follows:                                H. Res. 976\n\nResolved, That unless otherwise ordered, the hour of daily       meeting of the House shall be 2 p.m. on Mondays; noon on       Tuesdays (or 2 p.m. if no legislative business was conducted…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698545/providing-for-the-hour-of-meeting-of-the-house"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…attached to this resolution, as well,  to ensure that we have full transparency, such as requiring written  justification requirements for certain documents that are redacted,  unless they fall under certain sensitive categories.\n\nThis is a critical step forward in providing transparency into the  Epstein files and will give the public all the necessary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Rule 5. After the Chair and the Ranking Minority Member,       speaking order shall be based on order of arrival,       alternating between Majority and Minority Members, unless       otherwise directed by the Chair.\n\nRule 6. Any witness who is to appear before the Committee       in any hearing shall file with the clerk of the Committee at       least…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Assessment.--Section 6751(b)(1) of the       Internal Revenue Code of 1986 is amended to read as follows:\n\n``(1) In general.--No penalty under this title shall be       assessed or entered unless, before any written communication       with respect to such penalty (including proposal of a penalty       as an adjustment) is sent to the taxpayer, the initial       determination…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…nominations to the principal executive branch positions in       the field of foreign policy and diplomacy.                            rule 2--subcommittees\n\n(a) Creation.--Unless otherwise authorized by law or Senate       resolution, subcommittees shall be created by majority vote       of the committee and shall deal with such legislation and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…see a  doctor, they can tell you that, but if you just get it in the mail, you  have no idea.\n\nHow about this issue: If you have an ectopic pregnancy, which you  don't know unless you have an ultrasound, taking mifepristone can not  only kill the baby but could also kill the mom.\n\nThis is a big issue. The Biden administration became flippant about  this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…that were the result of this Byrd  process, I think it is only fair that we fix this one as well. Again, I  strongly support the underlying bill, but we will have to object,  unless the Senator can agree to my request.\n\nAccordingly, I ask that the Senator modify her request to include my  amendment, which is at the desk; that the amendment be considered…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…majority of Americans  do not want public funding for abortion. Abortion is the polar opposite  of healthcare.\n\nMr. SMITH of New Jersey. Mr. Speaker, abortion is not healthcare  unless one construes the life of an unborn child to be analogous to a  tumor to be excised or a disease to be vanquished.\n\nI appeal to my colleagues: Don't ignore or trivialize the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…DISEASES.\n\n(a) Extension.--Paragraph (5) of section 529(b) of the       Federal Food, Drug, and Cosmetic Act (21 U.S.C. 360ff(b)) is       amended by striking ``December 20, 2024, unless'' and all       that follows through the period at the end and inserting       ``September 30, 2029.''.\n\n(b) User Fee Payment.--Section 529(c)(4) of the Federal       Food,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…had lost her pocketbook. She had lost her phone. When  they called the MPD to come take a police report, the response was: You  will have to come down to the station because unless you are actually  hurt yourself, we don't have the officers to go out and actually go to  you. You have to come to us. That is just not right. That is an example  of a completely…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…re-implementing the plan approved in       the 2013 Record of Decision, with certain clarifications and       modifications. The plan adopted by the ROD will remain in       place unless and until BLM determines that new circumstances       require a different approach.\n\nUnder the ROD, approximately 11.8 million acres, or 52       percent, of the NPR-A's subsurface…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…They are now clearly a majority in the wildly wealthy city of  Minneapolis. These people are also a majority in many wildly wealthy  cities in California and in New York City. Unless we find a way to deal  with their psychological problems, it will be the end of the U.S.\n\nPrior to coming down here today, I attended a little program put on  by Stephen Miller,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…corrupted.\n\nIt is taken from its proper use as a store of value and an efficient  means of transaction, and it is corrupted into a tool for surveillance,  coercion, and control. Unless you comply with the regime, whoever that  is, then you don't get the right to transact.\n\nEverywhere it is depicted, whether it is fiction or Scripture, it is  evil, so we should…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…approve  the DC's fiscal year 2025 budget, and that language was continued in  the second CR. However, the House did not extend this anomaly in the  yearlong CR. As a result, unless this bill is passed, DC would have to  operate under its fiscal year 2024 budget for the remainder of 2025,  potentially requiring $1.1 billion in local spending cuts.\n\nReducing…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…with notice of such approval to all Members of the       Subcommittee.\n\nNo public hearing shall be held if the Minority Members of       the Subcommittee unanimously object, unless the Committee on       Homeland Security and Governmental Affairs (the       ``Committee'') approves of such public hearing by a majority       vote.\n\nSenate Rules will govern…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}]