[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…cry. Come on, man. You can do it.  Until it is too late. We often only go to a doctor when we are deathly  ill or we break a bone.\n\nOur counterparts, young ladies and women, unlike boys and men,  because  of the complexities of their bodies, are accustomed to having regular  checkups. Men, on the other hand, are taught you don't need it until  oftentimes…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Nation of laws  and not of men. They wanted a nation of laws that are not compromised  by threats of cutting salaries and changing lifestyles so that the  judiciary would be, unlike England, who had a king who made the laws.  It would be the parliament and the courts.\n\nMr. Chair, I suggest we withdraw this amendment, with all due respect  to my friend…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…had unnecessarily placed our troops at  risk.\n\nHis response to this was to say: I am completely exonerated; no  problem.\n\nHe didn't even try to fix it.\n\nAlso, this Pentagon, unlike any Secretary of Defense whom I have  dealt with, simply has not given Congress the information we are  supposed to receive and given us the ability to do the level of  oversight…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…problem becomes an emergency. They can manage chronic conditions. They  can live with dignity instead of fear of bankruptcy.\n\nDemocrats did not give up on the American people, unlike many  Republicans, who chose to let these tax credits expire 1 week ago. That  is right. When the ball dropped in Times Square on New Year's Eve,  millions of Americans saw…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…pool across the state, what       is unclear now is how the sudden drop of CNAs across the       state will impact our ability to fill these suddenly vacant       positions. Unlike COVID however this is not a problem that is       easily solved. Instead of a suddenly voluntary departure from       the workforce in this case we are shrinking the workforce.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the prices of U.S.       natural gas and electricity and reducing reliability. The       severity of the problem increases as export capacity       increases (see Figure 2).\n\nUnlike manufacturing companies, LNG customers are countries       who are insensitive to price and will pay any price to keep       the lights on in their country. No matter how high…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Police, vehicular pursuit policies must  ``balance the risks, take all of the factors into consideration, and  reach a decision that is best suited to their jurisdictions.'' Unlike  D.C., 2 percent of local police departments prohibit vehicular pursuits  altogether. The sponsor of this bill, who is from Louisiana, thinks he  knows better than D.C. how…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…individuals who invest their  money into startups.\n\nAgain, I know that angels enter Heaven. Whether well-off individuals  enter Heaven is a discussion for a more theological venue.\n\nUnlike prior iterations of this bill, the current bill prohibits demo  days from taking place at facilities owned by religious institutions.  That is what is prohibited. It allows…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…government's repeated moves to strip opposition-run city       governments of their control over local hospitals, police       forces, ports, and other infrastructure. Unlike the       Venezuelan president, however, President Trump was blocked by       the courts.\n\nAlthough President Trump has waged a war of words against       the media and other…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…``sacrifice'' if he had a dictionary laying open in  front of him. So how dare a coward who cried ``bone spurs,'' when his  Nation needed him the most, turn his back on those who, unlike him,  were actually brave enough to serve our country in uniform.\n\nWhat he has done to our veterans in just a few months since he has  been back in office amounts to a total…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…law  mandating disclosure of apportionments appears to be designed to evade  review of the rescission proposals by the Congress, Congress's  watchdog, and the public alike.\n\nUnlike in the past, OMB has refused to make the apportionments for  the accounts at issue available to the Government Accountability Office  for their required review under the Impoundment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…today.\n\nI rise in support of this bill. The accredited investor framework has  long protected the general public from investing in high-risk, illiquid  private securities. Unlike our public capital markets, in the private  capital markets, companies don't provide anywhere near the same  financial and other disclosures to investors. There are not the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…way--celebrated the  12th anniversary of my son's murder. If my colleagues want to talk  about protecting our kids, let's really do that and not this facade.\n\nMr. Speaker, unlike Columbine, Newtown, Las Vegas, Uvalde, Lewiston,  and Stockton, your home does not have to be next.\n\nTrust me, my colleagues. Every single one of us in this body has  people…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hospitals, and axed  good-paying energy jobs in red and blue States alike? Donald Trump.\n\nWho has been completely silent and invisible as Americans speed  toward a healthcare cliff unlike any we have seen in a long time, and  who has done nothing as families are on the brink of paying thousands  of dollars more on healthcare premiums? Donald Trump.\n\nSo, look,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…GBS. Like GBS, CIDP is caused by damage to the covering of the  nerves, called myelin. It can start at any age and in both genders.  Weakness occurs over two or more months. Unlike GBS, CIDP is chronic,  with symptoms constantly waxing and waning. Left untreated, 30 percent  of CIDP patients will progress to wheelchair dependence. Early  recognition and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Ranking Member Smith to introduce  the ALERT Act.\n\nThe ALERT Act is a comprehensive package of improvements that  addresses all 50 safety recommendations issued by the NTSB. Unlike the  bill before us today, the ALERT Act tackles all the identified root  causes that led to this deadly crash.\n\nUnfortunately, the ROTOR Act, or this piece of legislation,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…management of the monument, such       directives do not expand the President's statutory authority       under the Antiquies Act or displace BLM's obligations under       FLPMA. Unlike the case in B-333725, where OMB acted solely       under the authority delegated by the President under the       Property Act, the legal authority to manage federal land…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…administration had actually wanted to end.\n\nAs our colleagues will recall, the President observed last month that  Ukraine can win--the President said Ukraine can win--and unlike some of  his advisers, the American people are indicating in clear majorities  that they think we ought to help.\n\nBy one recent poll, more than 6 in 10 Americans support--support--…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…overseas and       otherwise supporting missions related to title 10, United       States Code;\n\n(4) the fact that members of the Armed Forces have service       requirements unlike those of other Federal employees, which       require them to continue to serve even if unpaid;\n\n(5) the impacts of historical shutdowns of the Federal       Government on…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Representative Bresnahan.\n\nThis bill is simply a reversal of an irresponsible change made by the  Biden administration's SBA, which raised concerns on both sides of the  aisle.\n\nUnlike a traditional community bank, small business lending  companies, or SBLCs, are regulated by the SBA. Historically, the SBA  recognized that they had finite resources to conduct…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…principles to all investment  decisions.\n\nTo suggest this bill bars a fiduciary from appropriately considering  any factor that may be material to investment is blatantly false.  Unlike the Biden-Harris rule, this legislation ensures neutrality and  prudent decisionmaking by fiduciaries.\n\nMy colleagues on the other side of the aisle have made many claims…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the rigorous permitting  requirements that the U.S. has to offer. It will also have to stand up  to the labor, health, and safety requirements that we have here in the  U.S., unlike many of the places around the world where these critical  minerals are mined.\n\nThis gives somebody a chance to develop a project to provide the  things that we need here in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…check.\n\nIf you want to make it easier to raise children, maybe raising the  personal exemption to $5,000 would be a good way to favor parents.\n\nOne thing that concerns me. Unlike people who want to encourage more  manufacturing, encourage more work, encourage more overtime, encourage  more children, there are people who want to change the tax code to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…committees begin  their work, there will be ample opportunity to debate, provide  amendment, and find opportunities in the reconciliation instructions  for common ground.\n\nUnlike my friends on the other side, we don't view the Rules  Committee as the first stop in the legislative process, but, rather,  the last. We should let the committees do their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Government before our people had a       right to settle aboriginal land claims should inform every       decision the Federal Government makes in managing those       lands.\n\nUnlike the Lower 48 model of indigenous representation       where tribal governments typically administer the delivery of       services such as healthcare, public safety, education,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…investment certainty across the energy       sector.\n\nPresident Trump is committed to unleashing American energy       dominance and Alaska's extraordinary resource potential.       Unlike the short-sighted and completely failed America-Last       energy policies of the Biden Administration, President Trump       prioritizes energy independence, global energy…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the gentlewoman from Iowa (Mrs. Miller- Meeks).\n\nThis bill lowers premiums for Americans, creates more insurance  options, brings greater transparency, and cuts red tape.\n\nUnlike our Democrat friends' plan, our Republican plan actually  lowers premiums by double digits, roughly 11 percent, according to the  data.\n\nAll the Democrats want to do is throw…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…who defended a President  who wasn't mentally competent.\n\nOne of the ladies mentioned that Donald Trump voted from a golf  course. Donald Trump could read a thank-you note, unlike President  Biden.\n\nDonald Trump had 77 million people who wanted to reverse the course  that this country was on for the last 4 years. To hear you all talk all  of a sudden…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…off-year special  election to try to overturn that decision.\n\nWhat is more, he has thrown out all of our election rules in order to  accelerate and condense the election timeline unlike anything we have  ever seen so that the county registrars are  unable to notify voters, as they usually would that there is an  election going on, so that the voter guide,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…transportation safety.\n\nAgriculture and logging are two of the largest industries in the  Commonwealth of Virginia, combining for over $120 billion in annual  economic impact. However, unlike many other States, currently Virginia  loggers primarily use rural roadways to transport product because of  weight limitations on interstate highways.\n\nMy bill increases the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688207/relief-for-virginias-farmers-and-loggers"}]