[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…little bit about this special place, a place in  which I have had the privilege to spend time. The Arctic refuge, the  homeland of Gwich'in and the Inupiat people, offers unmatched, truly  wild fishing and hunting opportunities for all Americans.\n\nIt is the only national wildlife refuge that protects an entire  Arctic ecosystem, and it stands as a profound…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…poll numbers  only reflect not only the downward spiral of our economy but of our  confidence in the future.\n\nThis administration has been cruel, and it has been dumb. It is  unmatched for its meanness and stupidity--the harm and hurt done to  everyday Americans in real life and realtime; the harm in tariffs  already having effect on the uncertainty of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…ecosystem. It is called the crown jewel of our public lands, and it is  called that for a reason. I saw why firsthand when I was there last  summer.\n\nThis special place offers unmatched, truly wild fishing and hunting  opportunities for all Americans. When you catch your first Arctic char  in the Canning River on the Coastal Plain, it is a moment you will…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…spud made by  local artists highlighting the Ocean State's role as the birthplace of  fun.\n\nHowever, it was outside the toy chest that Alan's incredible civic  spirit and unmatched generosity shone. His contributions to Rhode  Island's civic life were numerous and impactful.\n\nAlan spearheaded a political ethics reform movement, pioneered  concepts of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Born and raised in Toledo, Ohio, Marigene broke barriers as the  longest serving woman in the history of the Ohio Legislature. With her  intelligence, fierce conviction, and unmatched oratory--she was a tough  lawyer--she served our community for 24 consecutive years, often as the  only woman in the Ohio Senate. Can you imagine that?\n\nShe was a champion…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…strikes, it is not just  about boots on the ground. It is about paws in motion.\n\nToday, I rise in defense of those who cannot speak for themselves but  serve our Nation with unmatched loyalty, discipline, and courage. I am  talking about canines and horses that serve our law enforcement  officers on the front line every single day.\n\nFrom narcotics detection…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…lasting impact, and his advice  was highly valued by legislators, lobbyists, and fellow attorneys. His  exceptional memory and institutional knowledge of the legislature were  unmatched, and his dedication to public service earned him great  respect. Now retired, Frank's legacy continues, and we wish him  happiness and fulfillment as he enjoys his retirement,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of Georgia's  Combat Readiness Training Center at Savannah Air National Guard Base.\n\nSince assuming command in 2023, Colonel Thomas has led this premier  training hub with unmatched commitment and devotion.\n\nDrawing on nearly two decades of combined Active-Duty and Air  National Guard service, he elevated the CRTC's role in preparing  warfighters for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…called for ``an end to the usurpation of Presidential  authorities by Nicolas Maduro.''\n\nInstead of celebrating President Trump's historic leadership on this  issue and the unmatched operational excellence of the United States  military, law enforcement officers, and the intelligence community in  carrying out this historic and heroic effort, House Democrats…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…omnibuses,  backroom deals, and broken promises.\n\nMr. Speaker, those days are over.\n\nToday, following President Trump's America First agenda, along with  Chairman   Tom Cole's unmatched leadership, we are doing what the  American people sent us here to Washington, D.C., to do: Put America  first.\n\nMr. Speaker, 12 out of 12 appropriations bills will be passed…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and beyond for our office and district,  ensuring that passports are retrieved from the mail in urgent  situations or assisting with time-sensitive casework requests. Her  unmatched availability and commitment have directly improved customer  experience for countless constituents.\n\nI have requested the United States flag to be flown over our Nation's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…movie ``Top Gun,''  which was filmed on site in Miramar, and can be seen in the Top Gun  photo used in the movie.\n\nHis career was defined not only by his technical skills and unmatched  piloting abilities but also by his leadership. After 14 years in the  cockpit, he transitioned to staff roles, including serving as the Pol- Mil officer at U.S. European…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…winning campaigns, mentored future leaders, and built coalitions that  have delivered victory at every level--from Town Hall to Capitol Hill.  His political instincts are unmatched, and his advice has shaped the  success of candidates and party leaders across New York.\n\nWhat defines Jerry most, however, is his unwavering loyalty and deep  patriotism.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Lincoln-Douglas  debate, tackling the timely question of artificial general  intelligence. With four career State titles and a remarkable 29-3  record, Claire's leadership is unmatched.\n\nIn public forum, seniors U.V. Singh and Grayson Smith went  undefeated, while sophomore Dylan Hancock earned Salem's first-ever  congressional debate title with near-perfect…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…District at Cottage Hill Elementary School.\n\nFor 40 years, Mrs. Rowe has taught at the kindergarten grade level.  Her commitment to her students, colleagues, and district is unmatched.  Mrs. Rowe not only instills a strong literary and mathematical  foundation for young learners but also creates a safe and caring  environment where students can thrive…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…abrupt end. It is impossible to overstate the complexity of  this mission. But for our troops and our intelligence officers--whose  skill, professionalism, and bravery are unmatched in the world-- ``impossible'' isn't in their vocabulary.\n\nI also commend President Trump for having the courage to take bold,  decisive, and audacious action against Nicolas…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…and confidential drafting and  counseling services for bills, amendments, resolutions, and laws.\n\nThroughout his career in the House of Representatives, Noah has lent  his unmatched expertise to countless Members, committees, and staff  working on a broad array of policy issues. The Select Committee on the  Modernization of Congress relied heavily on…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…mission readiness intersect. With the support of President Trump, it  has been decided that Huntsville is that place.\n\nRedstone Arsenal is a hub for missile defense, with unmatched  infrastructure and mission synergy. Our workforce brings together  military expertise, leading civilian aerospace professionals, and a  pipeline of scientists and engineers.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…significantly to the experience in planning, preparation,  and execution.\n\nJust this past weekend, the world saw, once again, what American  resolve looks like when we are paired with unmatched precision and  capability. B-2s launched from Whiteman and executed a long-range  strike against Iran in Operation Midnight Hammer.\n\nThis is one of the best examples of integration…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…American Legion.\n\nA proud Legionnaire since 1975, Landkamer has been a cornerstone of  Post 16 in Norfolk. He has served at every level--post, county,  district, and area--with unmatched dedication to representing our  veteran community.\n\nFrom legislative advocacy in Washington to youth programs like  Cornhusker Boys State, Landkamer's commitment to service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695830/recognizing-norfolks-jerry-landkamer-on-his-election-as-national-vice-commander"}]