[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…long-oppressed churches, and recognizes the  independence of emerging Orthodox churches. His tireless efforts to  bring together Christians of different traditions do not go unnoticed.\n\nHis All-Holiness is a champion for interfaith dialogue and a  steadfast advocate for interfaith understanding. He builds meaningful  relationships with Muslim and Jewish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…country, we the people, will have  the last word.\n\nYou are going to see protests. You are going to see more protests  because we the people refuse to allow coverups to go unnoticed. You are  going to see more protests, but I say to everybody: Make it a peaceful  protest. Do not protest in any way other than with peace in your mind  and your head and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…have led 64 of my colleagues in urging the Secretary of  Labor to reverse course, and I am proud of the work we have done here  tonight to make sure that none of this goes unnoticed.\n\nThis work is about the people, the people we serve and every single  American. It is about the home care worker pulling double shifts. It is  about the construction worker…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…and rampant fuel smuggling.\n\nNevertheless, Dbeibah's administration continues to enjoy       international recognition and his outreach to the White House       has not gone unnoticed. Trump's senior adviser on Africa       affairs, Massad Boulos, traveled to Tripoli in July to hold       talks with Dbeibah that reportedly included a Libyan offer to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Impeach Ms. Noem is what we  should do. Aside from impeaching her, she gets her marching orders from  this dastard; he has to be impeached too. We cannot allow this to go  unnoticed and unchallenged. I cannot. I say we and all of the people  who agree with me. There are a good many who do not, and I don't want  to discredit them in any way, but I cannot.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…life as a  rightwing plot. I don't do that.\n\nI believe that people are responsible for their behavior. On a day  such as this, I don't know that we ought to allow this to go unnoticed  when there is a headline that reads: Growing leftwing violence blamed  for deadly shooting.\n\nI believe in specificities. I believe in the decency that human  beings should…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Nation's Black veterans.\n\nAs the conscience of the Congress, the Congressional Black Caucus  refuses to allow the sacrifices of these patriotic Americans, Black  Americans, to go unnoticed or to be erased.\n\nWe will never be able to fully repay our veterans, given the  sacrifices they have made for our country, but as Congress, it is our  responsibility to make…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…families to serve. In Carlsbad alone, the  government wasted nearly half a million taxpayer dollars training us,  only to fire us months later. These mass firings cannot go unnoticed.\n\nClaudia, who worked at Carlsbad Caverns National Park, shared this:  In 4\\1/2\\ months, I dedicated myself to my work, training others,  providing emergency medical services,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Buckley, Colonel Dexter has worked to bolster the  morale and well-being of the personnel under her charge. Her commitment  to creating a supportive environment does not go unnoticed and has  contributed to the readiness and effectiveness of the base.\n\nColonel Dexter has also been a remarkable advocate for the base  within the local community, strengthening…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693378/recognizing-colonel-heidi-dexter"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…skilled trades.\n\nThroughout his career, Mr. Thomas has demonstrated strong leadership  and an unwavering commitment to the labor movement, and his  contributions have not gone unnoticed. In 2016, he received the Lillian  L. McKittrick Labor Advocacy Award from the NAACP, an honor named in  memory of Lillian L. McKittrick, a lifelong advocate for the rights…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…service isn't always glamorous. It demands patience,  perseverance, and quiet strength. There are early mornings, late  nights, and countless moments when the work you do goes unnoticed by  the world outside. But it's people like Rikki who keep everything  running--the unseen hands and steady hearts behind the work we all  depend on, whether we realize it…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Their bravery, professionalism, and dedication embody the  spirit of resilience and unity that defines northern Michigan.\n\nThe determination of all those affected has not gone unnoticed. My  colleagues and I stand ready to support the State's request for Federal  assistance.\n\nMr. Speaker, please join me in thanking these everyday heroes who  rose to the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…team, but also to other members of my staff.\n\nIt is important that Representatives recognize outstanding staff such  as Mr. Trejo. Oftentimes, the work of these staffers goes unnoticed but  is nonetheless critical in maintaining the functions of our government.  Travis is a true patriot, and Maryland's First Congressional District  undoubtedly owes him…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692740/congratulating-mr-travis-trejo-on-8-years-of-service-to-marylands-first-congressional-district"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…first responders, and their  families, including the families of the fallen.\n\nBy passing H. Res. 364, we send a clear message that the sacrifices  of these families do not go unnoticed. We acknowledge that behind every  fallen officer, firefighter, or EMT is a family--spouse, children, and  parents--who bear the weight of that loss every day, yet continue…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…across mid- Michigan. Whether reporting breaking news or moderating debates. Sheri  brought clarity, dignity, and heart to every story she told.\n\nHer excellence has not gone unnoticed. Sheri is a proud inductee of  both the Michigan Journalism Hall of Fame and the Michigan Association  of Broadcasters Hall of Fame. She's received multiple Emmy nominations,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…state title at the  Xcel Energy Center in a suspenseful overtime game against Warroad. The  Wildcats claimed the win with a 4-3 final score.\n\nThe deciding goal almost went unnoticed, sneaking over the goal line  during a dramatic scramble at the net. Warroad came away with the puck,  but junior forward Zoe Heimer, who made the shot, knew the puck had…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…system activity. They rely on legitimate tools  and access privileges to conceal malicious behavior. This makes  detection extremely difficult and allows intrusions to remain unnoticed  until long after a compromise has taken place.\n\nWhile Federal agencies have taken important steps to respond, the  overall effort has revealed significant challenges in…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…of the  community since he purchased the property in 1992. Bill has served on  committees and boards repeatedly since moving to Milam County, as his  leadership cannot go unnoticed. In the early 2000's, he was selected to  serve on the committee tasked with developing the new jail for Milam  County. His work with this committee led to the conversion…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with a resilience  that is nothing short of remarkable.\n\nThis month is a special time to recognize and uplift a group of young  people whose strength and sacrifice often go unnoticed.\n\nThis is personal for me, not only as an American who deeply respects  our Armed Forces but also as a parent of a servicemember.\n\nI have watched firsthand what it means…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…War II in the 4th Infantry  Division and saw action in the European Theatre of Operations. His  efforts played a key role in providing peace for our country and does  not go unnoticed. He also continued to demonstrate his strong work  ethic at General Motors, where he later retired from leaving a proud  legacy of hard work behind.\n\nBeyond his dedication…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692324/recognizing-wwii-combat-veteran-albert-busacca-on-his-100th-birthday"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…personal pride in  his work, spearheading the smallest aspects of both the construction  and system-engineering aspects down to the minute details.\n\nKonrad's work has not gone unnoticed. His expansion efforts and day- to-day care for the facilities have led the Pennsylvania Biotechnology  Center to become a world-class biotechnology center, aiding  institutions…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…reach  their full potential. She also creates schedules for all of her  school's paraprofessionals to ensure smooth support across the campus.\n\nMrs. McCoy's efforts do not go unnoticed. She is an exceptional  educator, and she continues to make a strong impact in the educational  journey of her students. She is known by others for her hard work,  determination,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]