[{"senator": "Gabe Amo", "party": "Democrat", "sentence": "…the Remote Access  Security Act, as well as Chairman Mast and Ranking Member Meeks for  working together to get this through our committee.\n\nPresident Joe Biden imposed unprecedented export controls on China  and Russia to restrict their access to critical U.S. technologies that  could enhance their military capabilities. We know these controls were…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I thank the gentleman for yielding time.\n\nMr. Speaker, I strongly oppose this unprecedented, undemocratic, and  paternalistic disapproval resolution. This  disapproval resolution would sabotage the District of Columbia's tax  filing season and credit rating.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…equity, and inclusion  programs are not just limited to education. It prompted a purge of  federal agencies of employees who supported DEI initiatives,  culminating in the unprecedented firing of EEOC Commissioners. Without  their presence, the EEOC actually lacks a quorum and is essentially  unable to protect the rights of workers whose rights under Title…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…agencies as opposed to experts  who know what they are doing. The incompetence of DOGE and Elon Musk is  exposing Californians and millions of people around the country to  unprecedented danger. We have to do something about it before it is too  late.\n\nI urge Congress to intervene, reverse these cuts, and stop this  administration from putting more Americans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…impose excessive fees on  employment authorizations sought by asylum seekers and individuals  holding temporary protective status to work in the United States. At a  time of unprecedented worker shortages for south Florida businesses,  Congress should make it easier for companies to hire and not more  difficult.\n\nMy amendment caps employment authorization…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…me this opportunity to speak.\n\nI believe that the greatest issue that we face in this country is the  extreme concentration of wealth and power at the very top. It is  unprecedented and dangerous.\n\nAt the end of 2024, the 65 million Americans with the least amount of  wealth had about $4 trillion in wealth combined. The 905 billionaires  at the end…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…administration and Republicans in both  Chambers have been using the CRA to overturn public lands protections  that have never been considered rules in the past. In an entirely  unprecedented move, they are moving forward, even though the Government  Accountability Office hasn't yet ruled on whether they believe this  public land order constitutes a rule that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…false  claims of illegal voting by noncitizens, despite the fact that  noncitizen voting is essentially nonexistent.\n\nThis type of national voter roll collection is totally unprecedented  in our history. Nothing like it has ever been done before. Nothing like  this invasion of privacy and promises to voters would have been  imaginable before January of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the profits of polluters. This bill is a  good example of that.\n\nThis bill would elevate the Federal Energy Regulatory Commission  above any other Federal agency, give it unprecedented veto power, and  transform it and the North American Electric Reliability Corporation  into political actors. That is a world away from the independent  agencies that they…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…morally bankrupt tax breaks for billionaires and on Donald  Trump's dumb and costly tariffs, on the need to stand up for our  veterans and our national security, on the unprecedented corruption  Donald Trump has unleashed in our government, and finally on the  existential fight to protect Social Security from the chain saw of Elon  Musk. These are the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Madam Speaker, in Donald Trump's America, not even  Elmo is safe because over the last 100 days, we have seen an  unprecedented attack on the media, and especially our public media.\n\nLet me say this: The freedom of the press and freedom of speech are  not a privilege. They are enshrined in the United…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690908/a-free-press-is-vital-to-democracy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…troops at the expense of  taxpayers into a community where even the leader of the police  department says this is wrong.\n\nAll of this, from the beginning of our week to this unprecedented  action of violently removing a U.S. Senator from a Federal building,  from a room, thrown upon the ground, driven to his knees, and  handcuffed--this is all purposefully…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…her to create The Back to School Kids  Day, an all-day event providing food, games, activities, and free  haircuts for all of the children.\n\nHer love for her community was unprecedented. During the holiday  season, her organization would provide Thanksgiving dinner to the  homeless and those in need, toys for children, and blankets for the  sick and shut…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…underrepresented communities in  important constitutional and historic landmark cases. Right now, the  President and his cronies are shaking down the legal world in an  unprecedented manner. These law firms have provided services to our  underrepresented communities in a pro bono manner for decades.\n\nIn the past few weeks, the President has targeted…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…appropriations this  year has been made extremely challenging by President Trump's flagrant  lack of regard for Congress and our laws, and it has not been made any  easier by the unprecedented partisan rescissions package that  Republicans passed last week. But we cannot afford another slush fund,  full-year CR, and we cannot accept the draconian cuts being pushed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…today, we are considering H.R. 1, the One Big Beautiful  Bill Act, as passed by the Senate.\n\nThis bill creates the right incentives for historic economic growth,  makes unprecedented investments in our military and border security,  and implements the largest spending reduction in American history by  twofold, alongside other generational fiscal reforms.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…that killed tens of  thousands of Americans, the response would be immediate, unified, and  decisive.\n\nWe can and must act immediately to save American lives.\n\nThis is not unprecedented. Every President in my lifetime, in my  adult lifetime, has used the military to this end, to protect the  people of the United States, which is the President's first and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…it.\n\nAfter passing the largest savings in America's history through the  One Big Beautiful Bill Act earlier this month, the Rescissions Act  builds on House Republicans' unprecedented success in reining in  wasteful spending and the President's willingness to not spend  everything that we give him. That is unusual.\n\nThe list of egregious foreign aid…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…since 2021, a 500 percent  increase in illegal crossings, and over $115 billion in costs to State  and local governments. Most tragically, Biden's border crisis allowed  unprecedented amounts of deadly fentanyl into our communities, killing  over 100,000 Americans.\n\nNext, this bill enables us to permanently protect tax relief.  President Trump's Tax…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…United States.\n\nOn October 7, 2023, Hamas terrorists murdered and took hostage  innocent Israelis in an unprovoked attack. Since then, anti-Semitic  incidents have reached unprecedented levels across this great country.\n\nThe attack in Boulder, Colorado, is the most recent incident  following the murder of two Israeli Embassy staff members in  Washington,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…lowers electricity       costs for manufacturers and keeps Montana competitive.\n\nSecuring a domestic fuel source to supply affordable       baseload power during a period of unprecedented electricity       demand growth and ballooning projected future development.\n\nThe RMPA unfairly targets coal at the expense of working       families and rural economies.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…critical investigation into this collision is  continuing. While NTSB's final recommendations have not yet been  released, the Chair of the NTSB, Jennifer Homendy, took the  unprecedented step of publicly stating that the National Defense  Authorization Act does not adequately address the safety concerns  surrounding the mixed airspace at DCA.\n\nAnd while…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Democrat colleagues would tear down the border wall and return us  to open-border policies. They would have us oversee a continued decline  in our military readiness despite unprecedented theaters of global  conflict. They would destroy our economy in their unending appetite for  continued tax increases to feed their spending binges.\n\nMr. Speaker, the choice…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…attacks on October 7,  2022, when Iranian-backed Hamas terrorists launched the most harrowing  assault on Israel and the Jewish people since the Holocaust.\n\nWe witnessed an unprecedented act of violence that shocked the world  500 days ago. We will never forget the 1,200 innocent lives Hamas  murdered and the 240 civilians they took hostage that day, as…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Contractor Rule\n\nMr. KILEY of California. Mr. Speaker, I rise today to let folks in  California and across the country know that Medi-Cal, our version of  Medicaid, is facing an unprecedented threat. Its very solvency, its  sustainability, and its ability to provide coverage for Californians  are being threatened by a completely reckless policy enacted by  Governor…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…attempting to  unlawfully enter the U.S., including specifications on the encounter  location and the alien's country of origin.\n\nDuring President Biden's tenure, we saw an unprecedented number of  special interest aliens from China, Iran, and Russia.\n\nA special interest alien is a person who poses as a potential threat  to the United States. This is alarming…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…selected as President in 2004 at age  42, making him the youngest president in the school's history.\n\nDuring Collins' tenure at Loras College, the institution achieved  unprecedented success. He oversaw the most successful, comprehensive  campaign in history, increasing the endowment by 67 percent, and under  his leadership, the college completed major…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "John Thune", "party": "Republican", "sentence": "…this process on even noncontroversial  nominations is serving no one.\n\nMr. President, 57 out of 58 of the President's civilian nominees have  required cloture votes, an unprecedented number for recent  administrations; and of those 57 nominees, 17 received 60 or more votes  in support on their final confirmation vote--in other words, support  from a…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…to keep  such important authority over our Nation's currency issuance within the  hands of the people's Representatives.\n\nA central bank digital currency would centralize unprecedented power  in the Federal Government and could open the door to real-time  surveillance of every financial transaction in America.\n\nExisting banking practices safeguard Americans'…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693733/anti-cbdc-surveillance-state-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…billions of  taxpayer dollars are wasted on frivolous efforts to support programs  that have no benefit to taxpayers themselves.\n\nI was excited to see President Trump taking an unprecedented approach  to curb excessive spending by our Federal agencies by establishing the  Department of Government Efficiency. Since established, DOGE has  illuminated the billions…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}]