[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that there are U.S. Forces in violation of  the War Powers Resolution, or is it a hypothetical future?''\n\nCongressman   Tom McClintock said: ``If the President launched an  unprovoked attack on Venezuela . . . without congressional declaration,  we should have this debate. Until then, I think Democrats would do well  not to cry wolf on such an important…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…threats to our national security.\n\nAnd yet--the White House is now parroting Putin's talking points,  alleging that Ukraine started the war when we all know that Russia,  unprovoked, invaded Ukraine.\n\nPresident Trump has described Putin as a ``genius'' and ``very  savvy,'' and last week he called Ukrainian President Zelensky a  ``dictator.''\n\nUnder Donald…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…and shed more innocent blood.\n\nJust last week, Russia launched a barbaric missile strike on Kyiv  that killed and injured more than 100 Ukrainians.\n\nSince Russia began this unprovoked war more than 3 years ago, tens of  thousands of Ukrainians have paid with their lives, and we must never  forget the more than 20,000 children from Ukraine who have been…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Louisiana's own Republican Senators agree. Senator Kennedy  went further, calling Russia's dictator, Vladimir Putin, a gangster  with a black heart, a figure responsible for unprovoked war and  atrocities on a sovereign nation.\n\nIt was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion and annexation of Crimea in 2014 and through…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, last week, the world witnessed an  unprovoked violation of NATO airspace by Russia. Nearly 20 Russian  drones entered Polish airspace, some traveling up to 300 miles in the  country. For nearly 6 hours, NATO aircraft…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Ukraine, and speak up  against the grave threat the Trump administration's support for Russia  poses to democracy at home and abroad.\n\nYesterday marked 3 years since Russia's unprovoked and brutal  invasion of Ukraine, a sovereign nation. We have since witnessed  incredible bravery from the Ukrainian soldiers on the front lines to  the families who have…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Los Angeles, our home, and Californians.\n\nA few items my colleagues on the other side of the aisle forgot to  mention in their partisan resolution include: the President's  unprovoked escalation and mobilization of the National Guard and  Marines against Americans on American soil; the President's comments to  arrest Governor Gavin Newsom, an action that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692962/republicans-are-putting-forward-a-resolution-that-targets-los-angeles"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, 3 years ago this week, Russia launched an  unprovoked invasion on Ukraine. We are entering the fourth year of war  in Ukraine and 11 years of war on Ukraine since the invasion in Crimea  and the Donbas.\n\nIn the past few days,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…by who I believe were ICE agents--they were  masked--and is now sitting in an ICE holding facility in Los Angeles.  Videos show him being punched by masked Federal agents, unprovoked.\n\nNarciso Barranco has lived in my district for 25 years or more and  doesn't have a traffic ticket to his name. More importantly, he has  three sons--three sons--all serving…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693093/wake-up-call-for-immigration-reform"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Madam Speaker, I rise today to address the House as we  have just marked the third anniversary of the unprovoked Russian  invasion of Ukraine.\n\nFebruary 24, 2022, the date of the largest land grab in Europe since  World War II, joins an ignominious list of others as a day of infamy,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…in Ukraine, and to seize  Ukrainian territory to reconstitute a new Soviet Union, or at least a  Soviet-like sphere of influence.\n\nUkrainians have bravely stood up to this unprovoked, unlawful  aggression. The Ukrainian military has bravely fought back against the  much larger Russian military and has repelled this invasion for years.  The United States…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…sincere gratitude to all law enforcement  officers and their families for their service and sacrifice.\n\nUnfortunately, law enforcement officers face the continued threat of  unprovoked and ambush-style attacks. The bill before us, the Improving  Law Enforcement Officer Safety and Wellness Through Data Act, would  require the Attorney General to develop…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…which condemns the disturbing rise in anti-Semitic attacks  across the United States.\n\nOn October 7, 2023, Hamas terrorists murdered and took hostage  innocent Israelis in an unprovoked attack. Since then, anti-Semitic  incidents have reached unprecedented levels across this great country.\n\nThe attack in Boulder, Colorado, is the most recent incident  following…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…industry contributed $44 billion to the economy and  supported 220,000 good-paying jobs while providing $11 billion in taxes  and royalty payments.\n\nIn response to Russia's unprovoked invasion of Ukraine in 2022,  American energy producers immediately supplied Europe and our allies  with LNG. The U.S. was the number one supplier of LNG to Europe in  2023.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…States. And he has never engaged in  any talks that were in good faith.\n\nPutin repeatedly bombs civilians. He has forged a trail of broken  promises. He, and only he, chose--unprovoked--to start the largest land  war in Europe since World War II. Putin, and only Putin, did that.  Where in any of this has there been a showing of good faith?\n\nOn Saturday,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…fight back in an effective  way against Russian aggression. Just the other day, President Trump  took decisive action to provide weapons to Ukraine to defend against  these unprovoked attacks.\n\nThe President is right to support efforts to ensure innocent lives  are no longer lost. He is right to undertake efforts to stop the  bloodshed. As he continues…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Ukraine. In Ecumenical Patriarch  Bartholomew's opinion, he says, ``This is the theology that the sister  Church of Russia began to teach, trying to justify an unjust, unholy,  unprovoked, diabolical war against a sovereign and independent  country--Ukraine.''\n\nThe Ecumenical Patriarch is a figure who has addressed the European  Parliament and the U.S. Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Could  you imagine trying to compete in the global economy when energy prices  are three times as high and when you have a neighbor just a few  countries over that has an unprovoked and illegal invasion of another  country?\n\nWe can't just dismiss that this is important to Europe as well just  because they have full terminals.\n\nMrs. MILLER of West Virginia.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…not an  attack on a foreign power and, therefore, not an act of war. It is akin  to firing on Somali pirates menacing international shipping.\n\nIf the President launched an unprovoked attack on Venezuela or  Venezuelan-flagged vessels without congressional declaration, we should  have this debate. Until then, I think the Democrats would do well not  to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Rose", "party": "Republican", "sentence": "…families still  grieving from the heinous assault that claimed 1,200 innocent lives on  October 7, 2023.\n\nLast Monday marked 500 days since Hamas terrorists perpetrated the  unprovoked and truly evil attack. It was the deadliest assault on  Israel and the Jewish community since the Holocaust.\n\nI commend President Trump and Israeli Prime Minister Netanyahu…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688087/500-days-since-october-7-attack"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "Mr. WICKER. Mr. President, this month we will reach the fourth  anniversary of Vladimir Putin's unprovoked and illegal invasion of  Ukraine.\n\nAs we all know, Vladimir Putin is a war criminal, a KGB alumnus, an  oppressor of the Russian people, and we also are finding out more…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…have done before, that our  values are shared by other countries, but that is most decidedly not  the case with Putin's Russia. Putin has made his unwillingness to end  this unprovoked and barbaric war as plain as day. He has shown no  remorse that his country is nearing 1 million casualties. He clearly  doesn't care about the Russian people, who have been…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…freedom.\n\nI commend President Trump, President Zelenskyy, and European leaders  for continuing to come together to reach a consensus. As we seek a just  end to this brutal, unprovoked war, I urge everyone in Washington, in  Kyiv, and in the great capitals of Europe to remain united and to  remember who we are dealing with in the form and person of Vladimir…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]