[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Cabinet with billionaire friends who are  completely out of touch with everyday, working Americans who are often  living paycheck to paycheck.\n\nEarly in his term, he tapped an unqualified person, Elon Musk--the  wealthiest man in the world--who spent more money than anybody else to  get Donald Trump elected. He hired him to oversee an effort to  recklessly…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…country stays safe and  globally competitive; enough with pedaling disinformation that  jeopardizes the health and well-being of millions of Americans; and  enough with hiring unqualified pundits, influencers, and political  loyalists who pedal conspiracy theories and openly admit that no one  should rely on them for advice. Mr. Speaker, everyone knows who…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…than $2 billion in Federal  research grants. He wants to cut the NIH budget by 40 percent, and  these cuts would be carried out by Robert F. Kennedy, Jr., one of the  most unqualified individuals that we have seen to hold that position.\n\nSecretary Kennedy took an oath to faithfully discharge the duties of  the office in which he was about to enter, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…specialized education.\n\nI have heard from another mother whose entire family relies on  Medicaid for lifesaving care.\n\nAs House Republicans attack Medicaid, Elon Musk and his unqualified  team at DOGE have slashed 20,000 jobs at the Department of Health and  Human Services. Their staff cuts and restructuring have targeted the  Offices of Minority Health…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…which they excelled.  They are victims of the Trump Administration's drive to gut our  government and sell it for parts while replacing the professional civil  service with unqualified political sycophants.\n\nOne of my constituents working at the National Institutes of Health  wrote this summer about what it's been like to be a federal worker  during a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…tariffs, then he didn't, wiping out $11 trillion in wealth in  11 weeks. The price of gas, eggs, and other groceries are still too  high.\n\nThe President handed an unelected, unqualified billionaire, Elon  Musk, unfettered access to private data and indiscriminately fired  devoted civil servants. Services at Social Security and IRS have been  slowed in the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…1190, the Expanding Access to  Capital for Rural Job Creators Act, sponsored by my colleague, the  gentleman from Montana (Mr. Downing).\n\nI will point out that I am uniquely unqualified to address this bill  since my entire district is in an urban area, that of the great city of  Los Angeles. Yet, even I recognize the importance of getting capital to  our…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…competent  leadership. What it is, instead, is absolutely dangerous, and it is  putting sensitive information and decisions between life and death in  the hands of grossly unqualified people.\n\nSecretary Kennedy's pledge to make America healthy again is another  promise that this administration is either unwilling or incapable of  keeping. His idea to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…terms the attack by DOGE on the Women's Bureau at the Department of  Labor, the only Federal agency representing women in the workforce.\n\nLast week, Elon Musk's unelected, unqualified, inept team at DOGE  canceled millions of dollars in grants funded through the Women's  Bureau by calling them wasteful.\n\nThese terminations decimated the important work…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…factories where they work, then deporting U.S. kids with stage IV  cancer, pulling women by their hair down the street, and now just  murdering citizens in daylight. We have an unqualified, masked militia  eager to escalate.\n\nOne lady who I met recently in San Jose asked me: We have only been  through 1 year of this. How will we survive 4 years?\n\nWe won't.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699568/no-funding-for-ice"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…makes the Nation stronger. Being committed to truth and  justice about our paths only serves as a benefit. It doesn't take  anything away. The false narrative that people are unqualified simply  is not true. We know from these Halls of Congress right here that  people whose parents have been here before can teach their children how  to run for office, how…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…simple yes-or-no question about whether  schools receiving taxpayer dollars should be allowed to discriminate  against children with disabilities.\n\nMrs. McMahon is totally unqualified to oversee the education of our  Nation's children, but Donald Trump doesn't care about that. Linda  McMahon will carry out President Trump's dangerous agenda to dismantle…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…America: the nomination of  Emil Bove to be a judge on the court of appeals for the Third Circuit,  the second highest panel in our judiciary.\n\nAnd he is about as unfit and unqualified as any judicial nominee to  come before this body in my 15 years here. And I say that with sadness  as well as anger, as someone who still proudly would call myself a  litigator,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…our House counterparts to decry the ways this President has  already--already--only 100 days in, failed our country.\n\nIn the coming weeks, we will continue to oppose deeply unqualified  nominees who have no business serving in government. We have seen that  already, for instance, with the antics of Mr. Hegseth.\n\nWe will also fight Donald Trump's disastrous…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…indiscriminately fired thousands of Federal workers, like  this is some dystopian reboot of ``The Apprentice,'' except in this  episode, they are filling the government with unqualified sycophants,  who are running around firing meteorologists, health experts, and  emergency responders, people who keep our government running.\n\nToday, in the face of all…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…known as Alford Samuels, among several other  aliases. He was charged by the Florida Department of Law Enforcement in  Broward County with two felony counts of voting as an unqualified  elector. Nelson, illegal alien, unlawfully voted by mail.\n\nI can keep on going on and on and keep going down the list. It is  real. The only thing that we are putting forward…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…or competency testing.\n\nA Federal Motor Carrier Safety Administration audit prompted by  President Trump found that multiple States issued nondomiciled CDLs  improperly to unqualified, often foreign drivers, even in some  instances allowing them to keep licenses after their legal status  expired.\n\nIn the Florida case, the FMCSA investigation revealed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…questions when the SBA lifted the licensing moratorium.\n\nBiden's SBA hid behind promises of lender oversight and stronger  borrower protection yet still awarded a license to an unqualified  entity. This entity, which was seeking to sell its business when it was  awarded a license, ultimately surrendered its license before it could  even make a 7(a) loan.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}]