[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Republicans, people are going to be paying an  average of 114 percent more per person per month.\n\nIt is not like we just went into a lab and cooked up an issue to try  to hijack some unrelated moving legislative vehicle. The reason for  this is that 24 million Americans are specifically on the ACA exchange,  and they are absolutely going to get hosed. And because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, on an unrelated issue, last week, families  gathered around the table to give thanks and enjoy a plate or two of  turkey, mashed potatoes, casserole, cranberry sauce, and more. Except,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…article which has moved the gentleman  from South Carolina--a member who has consistently engaged in a  bipartisan and productive way with the committee's work, to make some  unrelated political statement will do profound damage to this essential  committee.\n\nNow, let me just talk for a moment about Ms. Plaskett. I have served  in this institution for 17…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…ended more than a decade ago, yet Presidents  from both parties have cited the 2002 Authorization for Use of Military  Force, or AUMF, to justify military actions completely unrelated to  Iraq. Leaving it on the books invites future Presidents to drag us into  reckless foreign wars. The American people do not want those wars, and  Congress has not yet…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the act.\n\nThe federal government, including the CFA, whose members are  appointed by the President, should not have any authority over D.C.  land-use policies and decisions unrelated to the federal presence. Not  only is the federal government's authority over D.C. buildings and  private property a violation of home rule, it also delays and increases…", "date": "2025-07-07", "source_url": "https://justfacts.votesmart.org/public-statement/1693244/introduction-of-the-commission-of-fine-arts-district-of-columbia-home-rule-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…allows this veto to stand, we set a troubling precedent.  It would mean that noncontroversial, bipartisan bills that pass without  objection can be rejected for reasons wholly unrelated to the substance  and be weaponized politically.\n\nIt is no secret--and I am sorry to come to this floor to have to say  this--that President Trump is, at the moment, engaged…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…threaten financial retribution.\n\nMr. Chair, for the sake of our democracy and the sanctity of  something that makes America special, which is a justice system that  works unrelated to threats of retribution, I urge the defeat of this  amendment.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. HOYER. Mr. Chair, I demand a recorded vote.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…years ago and who constantly threatens to  annex their country?\n\nThat is what Donald Trump has done with Canada.\n\nThese tariffs are doing nothing to help Americans. They are unrelated  to trade disputes.\n\nI hope every Senator will vote to repeal the taxes on Canadian goods  and help lower costs for our constituents.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…law and attending  routine immigration hearings.\n\nIt cannot continue. Today, Congress has a chance to act.\n\nNow, I understand that there are some decent parts to this bill  unrelated to ICE or the CBP. However, giving more taxpayer dollars to  fund this wave of violence without accountability for past abuses and  reforms to prevent more tragedies is not…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…are going to be made--no ifs, ands, or  buts about it. I hope the President makes that clear today.                            Operation Midway Blitz\n\nMr. President, on an unrelated topic, this coming weekend will mark 2  months since President Trump launched his so-called Operation Midway  Blitz in my home State of Illinois. The Presiding Officer will…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Yet when they had the chance for a revote 2  weeks ago, because they screwed it up the first time, they voted to cut  Medicaid and SNAP again.\n\nAs we stand here, debating unrelated immigration measures, Senate  Republicans are moving forward with their version of the big, ugly  bill. Because House Republicans broke so many rules when they passed  their…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…maintain that President Trump has, instead, demeaned and  dehumanized immigrants and their countries of origin since day one of  his political career for matters completely unrelated to public safety.  And since he has been in power to be President, both in his first term  and now this term, he has thrown everything he can at keeping people  out and even…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Trump administration is moving forward with its unauthorized and  illegal plans to eliminate SAMHSA altogether and combine mental health  and substance use programs under this unrelated agency called the new  Administration for a Healthy America.\n\nBelieve me, Secretary Kennedy has not explained in any way what this  new administration will do or how it will…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and protect the civil rights of students. We  have seen her slash funding for minority-serving institutions. We have  seen her move parts of our education infrastructure to unrelated  agencies, creating more hoops for administrators and staff to jump  through to get the funding they need.\n\nLast week, the Department of Education announced they are moving…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…argue, an  obligation--to support the Miccosukee Tribe in their efforts to protect  their homelands.\n\nPresident Trump has undermined that work, vetoing this bill based on  unrelated policy disputes and a fundamental misunderstanding of Tribal  sovereignty.\n\nH.R. 504 would expand the Miccosukee Reserved Area to include Osceola  Camp, which would strengthen…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…sex-related       offense, even if--\n\n(A) the member has had a previous temporary separation       including a previous temporary separation as the victim of a       previous unrelated alleged sex-related offense; or\n\n(B) the enlistment period of the member is not nearing       expiration or the tour or contract of the member is not       nearing completion;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…disappointed that so many of my colleagues on the other  side of the aisle refuse to support this commonsense bill. Instead,  they want to politicize and talk about completely unrelated matters.\n\nWhile some on the other side resort to fear-mongering, House  Republicans and, as I said 22, I believe, commonsense Democrats, are  committed to ensuring law enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700029/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Air Force said  are in the national security interests of the United States, is because  they didn't like some of the political posts put on X by Elon Musk on  completely unrelated topics.\n\nThis gives you a sense of what a rogue agency the Coastal Commission  has become and the barriers that we will face to rebuilding Los Angeles  if this is allowed…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…authorities put forth new guidance that allowed States to rely on so- called hypothetical expenditures that let States spend Medicaid dollars  on services that were over budget and unrelated to the core functions  of the Medicaid program.\n\nSome examples of this included paying for air conditioning systems  for beneficiaries and for providing payments for legal…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…defining feature of  today's Democratic Party, and that is Trump derangement syndrome, which  is a real disease. No matter what legislation is before this House, no  matter how unrelated it is to President Trump, Democrats find a way to  twist the debate back to him--his personality, what they hate about  him--not the text of the bill, not any of the real-world…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…it was just  going to increase the demand for meth to come across the southern  border, and that is what happened. They created trade routes.\n\nThen along came the 1990s and unrelated to methamphetamine, we had a  lot of big drug companies and some bad actors, who decided they were  going to make more money by doing a lot of stuff they shouldn't have…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…abdication of responsibility?\n\nThey shut the government down, and the moment you call attention to  their own actions, all they do is obfuscate and start shrieking about  unrelated things.\n\nScientists should study this at length and try to come up with a  cure. It is a serious affliction, as was evidenced numerous times over  in our Rules Committee…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Artificial Intelligence systems used       to support environmental review or authorization activities,       excluding proprietary or general pretraining materials       unrelated to such agency-specific customization.\n\n(iii) Technical assistance.--The Council on Environmental       Quality shall provide to Congress technical assistance upon…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…any mineral, metal, and advanced processed       material), article, commodity, supply, product, critical       good, or item of supply; and\n\n(B) does not include software unrelated to the       manufacturing process.\n\n(15) Manufacturing technology.--The term ``manufacturing       technology'' means a technology that is necessary for the       manufacturing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…integrated health plans, pharmacy benefit managers, and other  intermediaries suppress competition, pocket valuable drug discounts,  and increase prices for consumers--all unrelated to the list price of  the drug.\n\nLast Congress, the Senate Finance Committee, which I chair, advanced  a number of our bipartisan proposals to reform our broken prescription…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}]