[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…I represent in  northwest Ohio are predominantly rural and home to hardworking farmers  who produce the nutritious food that feeds and fuels our Nation. They  deserve our unwavering support because what America makes and grows  makes and grows America.\n\nYet their work has never been harder. Over the past year, they have  endured setback after setback--including…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…congressional staff and provide details regarding  funeral arrangements.\n\nIn all, David McCormack represents the very best of America's public  servants--dedicated, thoughtful, and unwavering in his commitment in  service to others. On behalf of a grateful district, I want to  congratulate David on a well deserved and restful retirement.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…commemorate this remarkable 100-year milestone, I would like  to extend my deepest gratitude to the staff, counselors, and volunteers  of Family Counseling Service. Their unwavering dedication, compassion,  and expertise have been the driving force behind the organization's  success. Through their hard work, they have uplifted individuals,  strengthened…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…the sentiment I know many of us in this Chamber share.  Federal workers, like that veteran, swore an oath to protect this  country. Their dedication and service have been unwavering. We owe them  the same commitment in return. I am grateful for the way we have come  together across party lines to ensure the rights of working people and  protect those…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…deeper bonds across our city and champion unity across  diverse Jewish organizations.\n\nIt is an honor to recognize Monica Gurell during Jewish American  Heritage Month. Her unwavering dedication to faith, education, and  community has enriched the lives of countless others and continues to  serve as a beacon of strength.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Communities deserve policies that protect  families, protect peace and safety, and uphold rights.\n\nMr. Speaker, I thank the Catholic church and the bishops for their  courageous, unwavering support for the immigrant community in our  country. I ask all other religions and leaders of faith to come  forward.\n\nWhy are you silent in this shameful moment?\n\nWe should…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697447/fighting-dhs-immigration-raids"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Business Educators  Association.\n\nEdie is a business and IT career education teacher at Post Oak Middle  School. She was honored for her innovative teaching strategies,  unwavering commitment to student success, and active pursuit of  professional growth. Through her commitment to education, Edie has left  a lasting impact on both her students and colleagues.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…rights. As a leader in the  Michigan Equal Suffrage Association, she traveled the State organizing  campaigns, educating voters, and pushing for legislative change. Her  unwavering commitment helped pave the way for Michigan women to claim  their rightful place in the democratic process.\n\nThese are the stories of past historymakers who have changed…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…now Georgia College and State University.\n\nJudy began her teaching career at Bibb Elementary School in Columbus,  where she was a fifth and sixth grade teacher. Due to her unwavering  commitment to education and the future of young people, she was honored  as Columbus Teacher of the Year in 1973. During that same time, she  served as President of the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…of the community with respect and care.\n\nOur community appreciates their ongoing efforts to keep us safe and  supported.\n\nI thank the Stickney Police Association for their unwavering  commitment to service and their dedication to our community and each  other. Congratulations on their centennial celebration.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690438/recognizing-the-stickney-police-association-100th-anniversary"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in times  of need. His work reminds us all that small acts of kindness can have a  profound impact.\n\nI am honored to recognize Steve Martin today. Let's thank him for his  unwavering commitment to making our communities a better place for all.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, I rise to honor Robert ``Rex'' Baumgartner,  a true American hero, a man of the law. Rex embodied the very best of  our Nation: honor, respect, bravery, duty, and unwavering courage.\n\nBorn in east Toledo, Rex answered the call to serve early, joining  the United States Air Force and serving as an air policeman and sentry  dog handler around the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…values, and yet he has to stand here and defend himself. His  decision to step down is very personal and his decades of service speak  for themselves.\n\nWe are grateful for his unwavering commitment to public service. At a  moment where some are working overtime to protect the wealthy and gut  healthcare for working families, we should stand together united…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…sufficiently and to make sure they are updated to  the current CPI or Consumer Price Index.\n\nMr. Speaker, I urge my colleagues to support this bill. I thank my  colleagues for their unwavering commitment to supporting veterans. I  look forward to it being passed and signed into law.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…am honored to announce that the first bill I  will introduce as a Member of Congress is the Protect Veteran Jobs Act.  The men and women who serve our country deserve our unwavering support,  not broken promises.\n\nThe indiscriminate firing of veterans by the Trump administration and  Elon Musk's DOGE dishonors the unwavering commitment that these public…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688234/democratic-proposals"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…service and dedication to our  communities.\n\nBased in the Greater Philadelphia region, Ms. Kelly Botti has built a  distinguished career marked by integrity, compassion, and an unwavering  commitment to financial empowerment. As CEO of Trumark Credit Union,  she has championed innovative approaches to serve the underserved and  underbanked, expanding access…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Committee; Chairman Luttrell; members of the House and Senate Veterans'  Affairs Committees; Majority Leader   Steve Scalise, Senator Jerry  Moran; and leadership for their unwavering support for moving this  bill. Unlike many others in Congress, this was moved with Mach, with  airspeed, and I appreciate that.\n\nI am also deeply grateful to the dedicated…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…National  Honor Society, and a dedicated member of various extracurricular  organizations, always striving to lead with compassion and integrity.\n\nWhat sets Kacee apart is her unwavering commitment to lifting others  up. Whether stepping outside her comfort zone to sing the National  Anthem at sporting events or leading by example in her community, she  embodies…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…occurred, but his consistent dedication  remained. From water programs to broadband deployment, Clark made sure  rural communities had the infrastructure needed to thrive. The  unwavering support Clark received from  his wife, Donna, and his daughters, Tammy and Traci, was also  instrumental in him achieving such a successful career.\n\nMr. Speaker, I proudly…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699718/recognizing-mr-clark-d-thomas"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Recognizing Vance Dalton Upon His Retirement\n\nMs. FOXX. Mr. Speaker, I rise to recognize Vance Dalton, who recently  retired from AgSouth Farm Credit after three decades of unwavering,  passionate service.\n\nI have been very fortunate to call Vance a friend for many years. He  is a salt-of-the-earth person who is loyal, caring, and pleasant to  everyone…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Warrant Officer Thomas W. Thompson, Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio, and Sergeant Lloyd  Lasenby each served our country with honor and unwavering commitment.\n\nThough their paths and ranks differed, all shared a common purpose,  to defend our freedoms and protect the values that define the United  States of America.…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…award recognizes individuals who have demonstrated  exceptional leadership and made significant contributions to the field  of education in Arkansas.\n\nMr. Vent has shown unwavering dedication with an incredible 56-year  career in education, including 43 continuous years as a Superintendent,  making him the longest continuously serving Superintendent…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693884/recognizing-lee-vent"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Staff Sergeant Scott Gatto, a proud veteran of the United  States Marine Corps and our distinguished Veteran of the Month for June  2025 from Michigan's 9th…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…deep gratitude. The legacy  of New Freedom Farm will live on in the hearts it healed and the  community it united.\n\nMr. Speaker, I thank Lois for her vision, compassion, and unwavering  service. She has left an indelible mark on all she has touched.                 Honoring Retirement of Fire Chief Tim Williams\n\nMr. CLINE. Mr. Speaker, I rise to recognize…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Crews of the Vietnam War Congressional  Gold Medal Act, honoring the individuals who served in these selfless  and heroic missions. Mr. Sarrault's service exemplifies the unwavering  dedication shown by members of these Dustoff Crews to both their fellow  servicemembers and their country. Dustoff crews--which include a pilot,  crew chief, and medic--served…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…today to recognize and honor the  former President of the Republic of Colombia, Alvaro Uribe Velez, for  his extraordinary leadership, steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Speaker, I am excited to vote on this bill shortly. I thank  these young men for creating the most memorable moment in sports  history and demonstrating to the world the unwavering strength of the  American spirit.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…recognize and  express my sincere gratitude to my former Director of Operations, Kathy  Zhu of Kissimmee, Florida, for her exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Over the years, Kathy proved to be an  invaluable asset to my office, where her attention to detail was…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…have dedicated themselves to keeping our village safe.\n\nFor 150 years, these brave men and women have put their lives on the  line, responding to countless emergencies with unwavering courage.  Beyond their role as first responders, they connect with our community  daily and strengthen the bonds that make East Palestine a special place  in which to live.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}]