[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…Corey's dedication, passion, and  commitment have left an indelible mark on our community. She has  inspired others to give back and has demonstrated the power of music to  heal, uplift, and unite.\n\nOn behalf of the Sixth Congressional District of Colorado, I extend  my gratitude to Corey Rose for her fifteen years of service and her  extraordinary contributions…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Michigan's 12th Congressional District and across the  country.\n\nCaribbean American Heritage Month, first recognized in 2005, was  established after years of global efforts to uplift our Caribbean- American neighbors. Their vibrant culture and contributions to our  country and throughout the 12th Congressional District has uplifted  many of our communities.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…two decades, and I will miss our  community's friend, mentor, and leader. His legacy lives on in the  hearts of the more than 20,000 neighbors he has helped to support and  uplift.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…men of accomplishment and service, representing diverse professions and  industries. Together, they have embodied the Fraternity's founding  mission by working diligently to uplift and empower their communities  through servant leadership and civic engagement.\n\nThrough the Epsilon Sigma Boule Foundation, the fraternity has  invested substantially in initiatives…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Westfield State  University, and the countless educators, students, producers, and  supporters who have sustained this remarkable program. May ASMW  continue to inspire and uplift students for many years to come.", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…disabled veteran who has dedicated her life to  service both in uniform and in her neighborhood. She has spent decades  being a driving force of opportunity, making sure to uplift her  community and ensure that other veterans receive the respect that they  deserve.\n\nAs the founder of the Hearst Community Organization, she has fought  for jobs and public…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…instrument,  right on the House floor.\n\nIf the intent is truly about preserving access, there are better ways  to do it. There are certainly much better ways for Congress to uplift  and support our national parks; for example, standing up to Donald  Trump and Elon Musk's gutting of the National Park Service.\n\nI wish we spent more time talking about that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Americans.\n\nIt is a privilege to be able to stand here today. Black History Month  is not just an opportunity to reflect on our past, but it is certainly  an opportunity to uplift our present and renew the cause to fight for  our future.\n\nI begin with a story because Black History Month is often thought of  as a time to recognize those historical figures…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…underscores the collective commitment to fostering  the potential of our Nation's youth.\n\nAt a time when our youth face unprecedented challenges, it is  essential that we continue to uplift and recognize their efforts. By  supporting the bill, we can take a small step to reaffirm our  commitment to supporting the youth, nurturing their potential, and  celebrating…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698223/congressional-award-program-reauthorization-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…complaining, never  once backing down from a fight when the people needed him. He walked  these Halls not for power, not for prestige, but for purpose. That  purpose was clear: to uplift the forgotten and fight for the unseen and  to ensure that every child, no matter the ZIP Code they were born in,  had a fair shot at success.\n\nHis legacy will be defined by…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to acknowledge and uplift  Small Business Saturday this year.\n\nEvery year, our country celebrates Small Business Saturday the  weekend after Thanksgiving. This year that will be November 29, and I…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…lives. I congratulate Omar.                             Honoring Mario Vega\n\nMrs. RAMIREZ. Mr. Speaker, I rise today to honor Mario Vega for his  work to create spaces that uplift our young people and build safe and  thriving communities.\n\nMario has transformed his own personal experiences, growing up in  Chicago, to realize safety in our communities…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…housing for young boys.\n\nDuring Caribbean American Heritage Month, it is my great privilege to  recognize Roosevelt Mareus. His leadership and service continues to  inspire and uplift communities both here at home and abroad.", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692566/recognizing-roosevelt-mareus"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…celebrated institution.\n\nThrough exhibits, events, oral history sharing, and more, the  National Museum of Puerto Rican Arts and Culture does important work to  preserve and uplift the rich culture of Puerto Rican traditions and to  stand up to gentrification through cultural resistance.\n\nOn behalf of Illinois' Third Congressional District, I commend…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…cinema.\n\n``Sinners'' deploys the imagery of Southern Gothic horror to excavate  the truths this Republic has long preferred to bury.\n\nVampirism became a metaphor in the film to uplift systems that fed on  Black life, body, and spirit since the founding of this country.\n\nIt is the full humanity that he lifts up in this movie, the humanity  of Black folks…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700026/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…her mentorship or her personal  relationships, Krista taught all those around her how to live with  purpose, to approach challenges with resilience and compassion, and to  uplift others in the process. She was a dedicated wife, daughter,  sister, stepmother, and friend, and her legacy lives on in the hearts  of all who were fortunate enough to know…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…beyond his post as he also  served as District Commander of VFW Pennsylvania District 16. His  contributions to these organizations were rooted in his desire to  support and uplift fellow Veterans and their families, constantly  working to grow membership and expand community outreach.\n\nIn addition to his work in the VFW, Walt's passion for supporting…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…antisemitism;\n\n(2) calls on the executive branch and State and local       leaders to educate the public on the contributions of the       Jewish-American community and uplift Jewish stories and       voices; and\n\n(3) takes all possible steps to ensure the safety,       security, and dignity of American Jews in all aspects of       their lives, including…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…American  people and the people of Haiti are interconnected. We have such  historic ties that go beyond the current political crisis, so it is  imperative that we step up and help uplift Haiti out of the present  circumstances.\n\nSince their President was assassinated just a few years ago, the  Haitian people have endured hardship. They have endured political…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…with great pride that I recognize and commend the  Orion Area Chamber of Commerce for 75 years of extraordinary service,  leadership, and impact. Their tireless efforts to uplift local  businesses and strengthen community ties have left an indelible mark on  the region. I extend my sincerest congratulations and best wishes for  continued success in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Forces (SAF), and countless  outreach events. You'll find them at Homeless Veteran Stand-Downs, the  Mexican Consulate, VA hospitals, and more. They respond with empathy,  uplift fellow volunteers and staff with kind words and hugs, and lead  with quiet strength. Team SAF can always rely on them to take  initiative, represent the Red Cross with professionalism,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…parents, and the  comfort of staying in one place, and they do it all with a resilience  that is nothing short of remarkable.\n\nThis month is a special time to recognize and uplift a group of young  people whose strength and sacrifice often go unnoticed.\n\nThis is personal for me, not only as an American who deeply respects  our Armed Forces but also as…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…journey with YFA began at the RAP House youth  shelter, where she selflessly volunteered her time to create meaningful  opportunities and provide vital resources to support and uplift the  youth we serve. Driven by a bold vision, Victoria imagined a large- scale annual event in New Port Richey--one that would not only generate  funds for the RAP House but…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Rahazhynskaya has had  throughout her career and we happily celebrate the first anniversary of  her salon. We wish for her continued success as she continues to serve  and uplift our community.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Wilkerson is a fourth-generation owner, carrying  on his family's legacy by serving as the paper's publisher, ensuring  that The Comanche Chief continues to inform, engage, and uplift its  readers.\n\nAs the oldest continuous business institution in Comanche County, The  Comanche Chief is more than just a newspaper. It is a pillar of our  community for past…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…being her favorite, which she  performed during the competition.\n\nAllison's service initiative focuses on one-to-one mentoring  relationships, a meaningful way to empower and uplift youth in our  communities. Examples like hers inspire students to work hard, serve  those around them, and find ways to give back to their communities.\n\nJust this past weekend,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "French Hill", "party": "Republican", "sentence": "…importance  of financial literacy. His efforts prove it is never too late or too  early to learn how to manage your finances.\n\nAs a former community banker, I admire his efforts to uplift his  community and help those around him build a stronger foundation in  finance.\n\nI look forward to seeing Keaton's continued impact in central  Arkansas  and wish him the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for his kindness, respect, and  caring nature. Even on challenging days, he remains dedicated to the  school and its mission. His positive attitude and unwavering support  uplift those around him, creating a nurturing and encouraging  environment. Furthermore, Mr. Ross is a strong advocate for parent  involvement. He actively supports all parent involvement…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and historic places here in Washington, D.C.\n\nI am very happy to be authoring this bill in the House to make it the  policy of the United States that Federal buildings should uplift and  beautify public spaces, inspire the human spirit, ennoble the United  States, and command respect from the general public.\n\nIt declares that these buildings should be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…volunteer who selflessly give their own time and  energy, are making lasting differences and creating deep impacts in the  lives of students and their families. They not only uplift and  encourage the youth who come here every day but also strengthen the  entire community by shaping the minds of our future leaders and  dedicated public servants.\n\nWhile…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}]