[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…are  having their spouses ripped away. Even servicemembers are seeing their  families targeted. They are having their parents ripped away. They are  having their lives turned upside down.\n\nLet's not forget, U.S. citizens are even being detained by this  administration. We have several instances now where American citizens  have been caught up in Trump's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to rise, led to  more job losses, disrupted trade, and caused tourism to drop 31  percent. These are no victories.\n\nMr. Speaker, I just wish to say that I voted to end this upside-down  trade mess today. Let's strengthen our economy and make life affordable  again.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…vetting, sometimes for years, before they have been allowed to  come to the United States. They followed our laws, came here in the  ``right way.'' Now their lives will be turned upside down again to  serve the President's political agenda.\n\nThe fraud in Minnesota is serious and warrants continued  investigation, but punishing thousands of refugees because…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…harder for people to get by.\n\nFor all the talking that Republicans do about cutting the deficit,  with more than $4.5 trillion in tax breaks for the ultrawealthy, this  is an upside-down approach that will still manage to increase and blow  up the debt by almost $3 trillion. That is not responsible governing.  That is not fiscal responsibility. It is slashing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…this is under the guise of  cost savings, but the reality is there are no meaningful savings or  other benefits for average taxpayers.\n\nReal people's lives are being turned upside down: our National Park  Service and workers at a number of Federal agencies, farmers, and  firefighters. Everyone who depends on Federal services is feeling the  squeeze of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…residents near busy highways. Not the doctors and nurses. Not  even the drivers.\n\nIt is the polluters. This dependence on fossil fuels allows Big Oil  CEOs to turn drivers upside down at the pump and shake money out of  their pockets.\n\nThe Republicans say ``all of the above.'' No. No. It is ``oil above  all.'' We put 70 percent of the oil we consume…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…just loaded with waste and fraud,  but they aren't going to look there.\n\nThey are looking at the pockets of ordinary families in our country,  and they are going to tip them upside down and shake the money out of  their pockets, 2 days before Christmas, and make them pay more money in  order to get the health coverage that their families need.\n\nSo the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…But these are the people who will have their premiums skyrocketing,  forcing some like Amanda to lose care altogether and forcing others  like Evan to lose employees.\n\nThe upside is that there is a very simple way to fix this, and it is  right in front of us: pass the bill that Senator Shaheen and I lead to  make these tax breaks permanent.\n\nTime is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…things over  to Big Oil and  Big Coal, and this week, they are right back at it.\n\nThe majority is making us vote on legislation that would turn the  management of public lands upside down, throwing it into chaos, all  just to score that quick win for their fossil fuel buddies because the  existing plans don't give away the store the way they would like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…dollars is not just wrongheaded. It is reckless and  outrageous. It will make power less reliable and more expensive for our  four States. In other words, it is all downside, no upside.\n\nWe have now seen weeks of taking a chain saw to our Federal programs  and damage to our grid, national forests, national security, and,  frankly, personal security. It is…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…you think  it raises serious questions, presumably you would want the answers to  those questions. You don't get answers by rushing to judgment and  turning the whole process upside down.\n\nThis resolution starts by saying that we censure her, that we remove  her from committee. The very next component of it says that we direct  the Committee on Ethics…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…you make $21,597 a year, or a family of four who makes $44,000 to  $45,000 a year, you are supposed to absorb your healthcare costs if you  lose access to Medicaid. That is upside down, and what we are saying is  to the least of these, you are on your own. They deserve better.\n\nWe have 4 days to try to prevent millions of Americans from losing  access…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…big offense? Being a friend of  Trump's.\n\nWhat are you trying to do here? Do the right thing? The right thing  is to continue to investigate Jack Smith for turning the law upside  down, for creating a precedent that should scare every Senator in this  body.\n\nThe law is pretty clear--there is a statute on point--that the  Senate, even with a nondisclosure…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Yes, I think we should get  to the bottom of that. Yes, I want to know how those dollars are  flowing. Yes, I want to know why the people of San Antonio have to be  turned upside down or the people of Charlotte, North Carolina, have to  be turned upside down because a radical group of billionaires are  funding organizations that are funding these people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…sarcasm       and deprecating self-loathing. We do know that biting dark       humor was used by the camps' condemned inmates as a survival       mechanism in a universe turned upside down.\n\nThe author, however, finds tragic, grotesque and Kafkian       qualities in a so-called normal post-Holocaust reality where       the unnamed book's protagonist becomes…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…current coal miners. Their entire  pension system and their healthcare system were based on a time when  there were always new people coming in and fewer people going out.\n\nIt is upside down now. If my friend had been here, he would have seen  in the Longworth Cafeteria or the Rayburn Cafeteria, day in and day  out, people with their coal hats on, their miner…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to cheat, or is this  going to absorb young people even further into digital worlds?\n\nThose are certainly concerns. However, the focus of our hearing is  going to be on the upside. It will be on the tremendous potential, the  boundless opportunities that AI--even as it exists right now, let alone  what its capabilities are going to be in a matter of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Federal law actually interferes with and prevents  States from using Federal data to check their voter rolls to ensure  that only citizens are voting, such that we end up in the upside-down  situation where a State like Arizona has two different sets of systems,  one for State and local and one for Federal.\n\nFact three: This is a recipe for fraud and a recipe…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…tax increase that will  amount to about $1,500 on a family earning just $75,000.\n\nAt Yosemite National Park, in my district, disgruntled employees hung  a giant American flag upside-down on El Capitan the other day, ruining  the view for tourists who came to enjoy Yosemite's famous firefall.  Remote cameras at the park are now blocked by protest signs.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…When we bring these charts in, it is one of the classic problems of  when you do this thing, look at this. Tax receipts are way up; but the  tax receipts and spending are upside down. One is based on $7-plus  trillion, the other is based on $5 trillion, meaning that gap is not  nearly as tight as you think it is.\n\nI am going to pass through some of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…burning a lot more energy, meaning you are burning a lot more carbon  dioxide, by the way. In other words, you are left with a policy that is  pretty much all cost and no clear upside to it.\n\nIf you look at the justification, the Biden EPA claimed they  implemented this rule to address hazardous air pollutants from tire  manufacturers. Here is the thing:…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…condemn what is happening in L.A., and the violence being perpetrated  against our law enforcement agents who are simply trying to uphold the  laws of the land.\n\nThat is how upside down and backward the Democratic Party has become.  You won't hear any of that. These people are risking their lives for  you and for me and our families and our communities…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}]