[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and restrictive covenants.\n\nFor some families, rising costs lead to housing instability or  homelessness. That is why, last November, I pressed the Department of  Housing and Urban Development to protect Federal funding and  homelessness prevention programs in Summit and Stark Counties. These  continuum of care dollars support nearly 2,700 beds in my…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…early 1960s.\n\nPulling those funds away is a betrayal of the working families who  were promised progress and, instead, are left with fewer jobs, less  opportunity, and delayed urban renewal. It is uncertainty that has  existed over the last 9 months, and that uncertainty is part of a great  American city that I have lived in for my entire life.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…crisis will make the American people wait longer for healthcare. It  will make Americans pay more for worse healthcare systems. And for  people who live in rural, as well as urban areas, your clinics and your  hospitals are shut down. Why? Because the Republicans have been after a  challenge dating back to the 1960s when the Medicare program was put…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…healthcare in the marketplace--a lot of people don't even know  they are on ACA and receiving the tax credit--that half of them are  small businesses.\n\nI come from Delaware. We are urban, suburban, rural, and coastal. And  so we also know that a quarter of farmers and ranchers are getting  their healthcare this way. And then we think about the fact that this…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…millions of dollars going to our people.\n\nMr. Speaker, are our colleagues going to allow DOGE to get away with  this critical destruction of law enforcement in rural communities,  urban communities, and suburban communities across the land?\n\nApparently so. They remain silent on it. They won't utter a word in  favor of it, but they don't utter a peep against…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Meanwhile, Republicans are pushing to gut SNAP, a program that feeds  40 million Americans and delivers billions in revenue back to the farm  country.\n\nWorking families in urban, suburban, and rural communities across  America are footing the bill for Trump's chaos.\n\nThe bottom line is that Trump's broken economy isn't working for  anyone.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690373/first-100-days"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…path, if the bill passes,  here is what will happen: The Departments of Defense, Labor, Health and  Human Services, Education, State, Treasury, Transportation, and Housing  and Urban Development will be fully funded through the end of  September.\n\nThe Democratic wins we secured in this bill will be locked in. We  will reject $163 billion in cuts to public…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…district when she became speaker of the assembly,  and I remember he just not only welcomed her there--this is a person he  had very little in common with, a southern California urban African- American member that voted together with him almost never, but Doug  gave her the VIP tour of his farm and of the Sacramento Valley and rice  country. He got her up…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Her whole background is anti-public schools.\n\nWhen you slash Federal funding for education, it leads to higher  taxes back home. So many of our school districts--they could be urban,  suburban, or rural--depend on Federal funding, and when you cut that,  it leads to higher property taxes to make up for the loss of money.  Communities will also be forced…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…right to vote. We see it in its various  forms now. We see it in this push to engage in gerrymandering around  the country. But we see it in closing down polling stations in urban  areas. We see it in efforts to suppress the vote of certain  communities. We see it in the purging of voter rolls. We see it in  affirmative efforts to discourage people from…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…laws. This bill  would similarly allow individuals to use marijuana in federally  assisted housing in compliance with a state's marijuana laws. The  Department of Housing and Urban Development (HUD), like DOJ, should not  be allowed to interfere with jurisdictions implementing their marijuana  laws.\n\nUnder this bill, HUD must develop regulations that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…unsafe batteries off of the market.\n\nElectrically-powered micromobility is quickly becoming an       essential part of our nation's transportation system,       especially in urban areas. These micromobility devices also       enable flexible earning opportunities for workers across the       country, including the couriers--we call them ``Dashers''--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…uncertainty and loss of funding for special  education and other programs that benefit children and the neediest and  most vulnerable of our districts, in rural areas as well as urban; and,  of course, the damage to our fundamental freedoms, women's reproductive  freedoms, the suspension of title X grants, and the assault on women's  healthcare--other freedoms:…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Madam Chair, last week, I had five townhall meetings  across northwest Oregon in urban, suburban, and rural areas. Not one  person, not one of the thousands who attended, asked me to support a  budget that cuts Medicaid, gives tax breaks to the wealthiest, raises…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the city center to  do her public service work. The middle schoolchildren were needed to  clean up the debris of the area around the downtown of Hiroshima. They  were doing an urban renewal project to widen the streets.\n\nThey knew, the people of Hiroshima, the political class knew that  Hiroshima was a target because it was an industrial city. But little…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Absolutely not. No tax dollars  should be allocated to covering healthcare costs for any person who is  in this country illegally.\n\nTo the American parents, whether rural or urban, who are struggling  to feed your children, I ask: Should illegal immigrants receive tax- funded meals day in, day out to eat on your dime?\n\nAgain, I heartily say: Absolutely…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…healthcare  professionals with the appropriate safeguards so that they can continue  to prescribe medically necessary treatments to veterans via  telemedicine.\n\nFor veterans in our urban communities, letting this waiver expire  means longer wait times, fewer appointment slots, and even more strain  on an already overburdened VA system.\n\nFor veterans in rural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…parents, grandparents, or other loved  ones who rely on these homes for care and community in their golden  years. We understand just how vital nursing homes are--whether it is in  urban, suburban, or rural areas--to help seniors in our country thrive.\n\nBut, unfortunately, a Federal rule that is still in place from the  Biden era is putting many of America's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…parades,       concerts, sporting events, political rallies, holiday       markets, places of worship, public demonstrations, and       ceremonial events.\n\n(iii) High-density urban areas with limited physical       security measures such as pedestrianized city centers,       commercial districts, residential neighborhoods, public       parks, recreational…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…law enforcement       authorities, State insurance regulators, and Federal       agencies, shall issue a report every 2 years to the Committee       on Banking, Housing, and Urban Affairs and the Special       Committee on Aging of the Senate and the Committee on       Financial Services of the House of Representatives, the first       of which shall…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 225) to require the Inspector General of the Department of  Housing and Urban Development to testify before the Congress annually,  and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…strengthens coordination between Federal, State,  and local governments and the private sector to better safeguard public  gatherings, critical infrastructure, and high-density urban areas.\n\nI thank Congressman Troy Carter, who represents the community  devastated by the New Year's Day attack, for his partnership and  leadership on this effort.\n\nThis practical…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Act. This piece of  legislation would require States to reimburse homebuilders for the cost  difference between State mandated energy codes and the Department of  Housing and Urban Development's minimum standard for homes built within  Federal Opportunity Zones.\n\nStakeholders in my district, builders and citizens who want to reach  the American Dream,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Department of Education, the       Department of Energy, the Department of Health and Human       Services, the Department of Homeland Security, the Department       of Housing and Urban Development, the Department of the       Interior, the Department of Labor, the Department of       Transportation, the Department of the Treasury, the Commodity       Futures…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…about is this issue of  rural broadband. For those who don't know, this is a program that has  been allocated over $40 billion so that everyone, not just a select few  in higher urban areas, can enjoy high-speed internet access. This  program, which is allocated over $40 billion, is one which takes time,  because as everyone knows who is in business, you…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Government; Homeland Security; Labor, Health, and Human  Services, and Education; National Security; Department of State and  Related Programs; and Transportation and Housing and Urban Development.\n\nMadam President, as a valued and important member of the  Appropriations Committee, you know well that these are fiscally  responsible bills that reflect many…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Ranking Member of the Committee on Financial Services of the       House of Representatives, and the Chairman and Ranking Member       of the Committee on Banking, Housing, and Urban Affairs of       the Senate.\n\n(2) Financial institution.--The term ``financial       institution'' means a United States financial institution or       a foreign financial…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reauthorized. This bill is vital to  restoring critical funding, preventing further school closures, and  ensuring rural students have access to quality education that can  compete with urban communities.\n\nHowever, this is not just an education issue. This is about investing  in the future of rural America and supporting communities surrounded by  Federal forests.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…1,270.484           2,255.469     Outlays...........................................            289.719          1,244.541    2,253.613------- Banking, Housing, and Urban Affairs:--------     Budget Authority..................................             26.245             87.321             277.233     Outlays...........................................…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Department of Health and Human Services,  President Trump's Department of Education, President Trump's Department  of Transportation, President Trump's Department of Housing and Urban  Development, President Trump's Department of State, President Trump's  Department of the Treasury, and many agencies related to each of these  departments.\n\nSimply put, a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]