[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…and  others for their cooperation in crafting this critical legislation. I  look forward to our continued collaboration as this legislation moves  forward, and I urge all Members to support this bill.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…microloan program was not  enacted into law. I am glad to be working across the aisle again to  make sure territories receive full access to SBA services.\n\nMadam Speaker, I urge Members to support this important bill, and I  reserve the balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I urge my colleagues to support this  legislation, and I yield back the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699175/northern-mariana-islands-small-business-access-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…two bills up for consideration are on  their way, so should I speak slowly, or should we go into recess?  Either way, we are not delaying the House.\n\nMr. Speaker, I urge Members to support H.R. 1190, the Expanding  Access to Capital for Rural Job Creators Act. It is a simple but  important step to directing the SEC's small business advocate to  include…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…communities.\n\nI commend Dr. Morrison, Mr. Downing, Mr. Pappas, and Mr. Bean for  their work on this bill.\n\nMs. VELAZQUEZ.  Morrison).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge Members to support this bill, and  I yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…with Congress  and not against Congress' efforts to strengthen America's ability to  compete with China like this bill that aims to do exactly that.\n\nMr. Speaker, I urge all Members to support this legislation, and I  yield back the balance of my time.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…examples of American  innovation and manufacturing which is helping pioneer the grid of the  future and create high-skilled domestic jobs in the process.\n\nMr. Chairman, I urge Members to support my amendment, and I reserve  the balance of my time.\n\nMr. MIN. Mr. Chair, I yield back the balance of my time.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…outstanding concerns of the Committee on Financial Services Democrats.\n\nAs such, I am pleased to recommend to my colleagues to vote ``yes''  on this bill.\n\nMr. Speaker, I urge all Members to support H.R. 3352, the Helping  Angels Lead Our Startups Act, or HALOS Act, sponsored by Mr. Lawler.\n\nThis legislation will help startups have easier access to the funding…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Connolly was the epitome of a public servant and will be deeply  missed. It is our job now to continue this fight in his memory.\n\nMr. LYNCH. Mr. Speaker, in closing, I urge all Members to support  this bill, and I yield back the balance of my time.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…satisfies all  the committee's requirements for consideration.\n\nMs. SIMON. Mr. Speaker, I have no speakers. I reserve the balance of  my time.\n\nMs. SIMON. Mr. Speaker, I urge all Members to support this bill, and  I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…designed to empower.\n\nWe expect that contracting officers will have more confidence working  with WOSBs, knowing that the SBA has already verified them.\n\nMr. Speaker, I urge all Members to support this bill.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691797/wosb-accountability-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…America's Workforce Act restores a  balanced, targeted framework that respects national security, while  reaffirming the rights of those who serve us.\n\nMr. Speaker, I urge all Members to support this legislation and  restore these protections for over 1 million Federal workers. Again,  this particular legislation is about no political loyalty test having…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…liquidity deployment, as well as understanding  barriers like stigma that need to be addressed to improve the  functioning of the discount window.\n\nMr. Speaker, I urge Members to support H.R. 3390, and I reserve the  balance of my time.\n\nMr. Speaker, this bill will help ensure smaller banks can access the  Federal discount window when they need it,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…to Chairman Williams; his staff  director, Lauren Holmes; and all the floor staff for seeing this bill  through today. It is greatly appreciated.\n\nMadam Speaker, I urge Members to support this bill, and I reserve the  balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I commend Ms. Scholten and Mr. Downing  for their dedication to our Nation's innovative…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…capable, and lethal fighting force we need to deter China  and our adversaries. It will deliver on President Trump's peace through  strength agenda.\n\nMr. Speaker, I urge all Members to support the bill, and I reserve  the balance of my time.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank Chairman Rogers  for yielding.\n\nI am grateful to support the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Williams and his staff, my colleagues from both  sides of the aisle, and the entire Small Business Committee for  supporting this commonsense solution.\n\nMr. Speaker, I urge all Members to support this bill.\n\nMcGARVEY.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691851/plain-language-in-contracting-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…solution to the  challenges we face and ensures that American warfighters remain the  most prepared, most adaptable, and most resilient force on Earth.\n\nMr. Chair, I urge Members to support this amendment.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…to get it across the finish  line. This vote is about governing responsibly and doing our jobs.\n\nI look forward to us nearing the completion of our FY26 duties. I  urge all Members to support this bipartisan package.\n\nMr. COLE. Madam Speaker, I yield 3 minutes to the gentleman from  Arkansas (Mr. Womack), the distinguished chairman of the  Transportation,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Again, I thank Mr. Thanedar for his work on this important  legislation, and I appreciate Chairman Green and the committee staff  for their work on this issue. I urge all Members to support H.R. 1692.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and Leader Thune for  prioritizing national security in this bill, and I thank Chairman  Wicker for his strong partnership throughout this process.\n\nMr. Speaker, I urge all Members to support this bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…privacy and private  property rights must be protected. The American economy thrives on  choice, competition, and liberty, not on coercion and control.\n\nMr. Speaker, I urge all Members to support this bill, preserving  liberty, protecting privacy, and ensuring the United States of America  is a global leader in financial innovation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…work to bring this  bill to the floor to ensure that we finally end China's support for  Russia's defense industrial base.\n\nIt is a great piece of legislation, and I urge all Members to support  H.R. 1486.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…in  our ability to project power across the oceans and in the air and to  ensure that America's defense remains second to none, now and for  generations to come. I urge all Members to support a vote in favor of  this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…economic deterrence,  military preparation, peace through strength, but also diplomacy and  economic deterrence.\n\nMr. Lucas' bill is an excellent step in that regard. I urge all  Members to support it on both sides of the aisle, and I yield back the  balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…reduce unnecessary  government hurdles.\n\nMr. Speaker, this legislation aligns perfectly with President Trump's  mission to make the VA truly work for our veterans. I urge all Members  to support H.R. 981.\n\nMr. BOST. Mr. Speaker, at this time, I encourage all of our Members  to support this bill, and I yield back the balance of my time.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…women's sports  is incompatible with the values of our servicemembers, our service  academies, and basic notions of fairness and good, old-fashioned common  sense.\n\nI urge all Members to support this amendment, and I reserve the  balance of my time.\n\nMs. MACE. Mr. Chairman, may I inquire as to the time remaining.\n\nMs. MACE. Mr. Chair, imagine being a woman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…President Trump keeps his pen ready  because full-year appropriations are advancing and certainty is being  restored.\n\nMr. Chair, I thank my colleagues for their time. I urge all Members  to support this bipartisan package, and I reserve the balance of my  time.\n\nMr. COLE. Mr. Chairman, I yield 5 minutes to the gentleman from  Florida (Mr. Diaz-Balart), my very…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Chairman Rogers for their steady leadership throughout this process,  and I thank the subcommittee staff for their hard work on this  legislation.\n\nMr. Speaker, I urge all Members to support this bill. Our time is  now.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…use their VR&E benefits to attend flight school.\n\nAs a disabled veteran, I am proud to lead this legislation on behalf  of our veteran community.\n\nMr. Speaker, I urge all Members to support H.R. 980, as amended.\n\nMr. BOST. Mr. Speaker, I have no more speakers.\n\nMr. BOST. Madam Speaker, oh, how I missed my colleagues last week.\n\nMadam Speaker, I yield…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}]