[{"senator": "André Carson", "party": "Democrat", "sentence": "…for a permanent recognition of his groundbreaking  and legendary work by renaming the House Press Gallery the Frederick  Douglass Press Gallery.\n\nMr. Speaker, I urge all of my colleagues to join me in supporting  passage of this resolution.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…welcome such a leading figure to the Nation's  Capital and recognize his significant contributions to peace,  interreligious dialogue, and cultural understanding.\n\nI urge my colleagues to join me in celebrating this historic visit.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nI urge my colleagues to join me in supporting this legislation to  sustain and expand U.S. engagement in this critical region.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…want to use military force to do it,  you need to come to Congress for an authorization. There being none,  these strikes are unconstitutional and unlawful.\n\nI would urge my colleagues to join Senator Kaine and myself in  supporting this resolution.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…change. It has nothing to do with drugs.\n\nMr. Speaker, I rise today in strong support of this resolution. I was  proud to co-lead Ranking Member Meeks' effort, and I urge all my  colleagues to join us today in reasserting this body's constitutional  authority on matters of war and peace.\n\nLet's be perfectly clear: Only Congress has the power to declare war.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698240/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…bipartisan  leadership in advancing this proven funding mechanism and ensuring that  future generations inherit healthy wetlands and thriving wildlife.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMs. HOYLE of Oregon. Mr. Speaker, I urge my colleagues to support  this really great legislation, and I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…LaCour's record, I am concerned that he will continue to  display his clear ideological preferences if he is confirmed to the  bench.\n\nI oppose his nomination. I urge my colleagues to join me.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…workforce development and strengthening communities. I  commend their efforts and other employers who are actively hiring  people of all abilities.\n\nMr. Speaker, I urge my colleagues to join me in recognizing National  Disability Employment Awareness Month and in advancing policies that  empower every American to secure a job and thrive. During the month…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…introduced the Renewing Efforts to Suspend  Testing and Reinforce Arms Control Initiative Now, the RESTRAIN Act.  This would prohibit the resumption of nuclear testing. I urge my  colleagues to join me in supporting this and getting this passed before  we begin another arms race.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…But if we  want to put an end to this warmongering, we need to keep pressing until  we have a veto-proof majority. Today's vote is not the end of the line.  So I urge all my colleagues to join us in asserting our authority and  continuing to send President Trump a simple message: No American boots  on the ground. No trading blood for oil. No war.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…400 cases of SUDC in the U.S.  every year. Without a known cause or form of prevention, the NIH  research conducted on SUDC is critical and could be lifesaving.\n\nI urge my colleagues to join in supporting full funding for the NIH's  lifesaving work so that not another family has to experience what the  Nies have endured.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695280/recognizing-the-life-of-hugh-nie"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Pell grant and restore its purchasing power so  students do not have to rely mostly on loans to pay for college.\n\nSadly, none of this is on Mrs. McMahon's agenda.\n\nI urge my colleagues to join me in ushering in a new public education  movement--a movement to ensure that this generation, as well as future  ones, has the foundation to achieve their full potential…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…strength, our determination, and our  unyielding commitment to preserving our history and to ensuring that no  Communist regime can rewrite our history.\n\nMr. Speaker, I urge my colleagues to join me in not only remembering  the hardships we face, but also in celebrating the incredible  resilience of the Vietnamese people. Let us honor the lives of those  who…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Healthy Homes grants.\n\nMore generally, we know housing is healthcare. This bill provides $74  billion in discretionary spending for housing programs.\n\nMr. Chair, I urge my colleagues to join me in supporting this  package, and I thank the chairman and the ranking member.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Congress continues to acknowledge the invaluable  contributions of Caribbean Americans to our nation's history and their  role in shaping our future.\n\nMr. Speaker, I urge my colleagues to join me in honoring National  Caribbean American Heritage Month.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…administrations solely as a law  enforcement matter. We tried that for decades, and it didn't work. It  cost hundreds of thousands of American lives.\n\nMr. Speaker, I urge my colleagues to join me in protecting Americans  by opposing this resolution.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the National Flood Insurance Program is a Federal  program, meaning that Congress and the President can change and improve  it. We just need to have the will.\n\nSo I urge my colleagues to join me in working with the Trump  administration to end Risk Rating 2.0.\n\nIn 2019, my office worked with the Trump administration to  successfully delay Risk Rating 2.0…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to lead in the financial markets of  the future or watch the next FTX fail while we are left saying once  again: Well, we have been here before.\n\nMr. Speaker, I urge all my colleagues to join me on both sides of the  aisle and support the CLARITY Act. Let's fill these regulatory gaps  with the proper Federal oversight. Let's create a competitive digital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…across our country. It strengthens our  national posture against a foreign adversary that has already shown its  willingness to target essential American services.\n\nI urge my colleagues to join me in supporting this important  legislation.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…reliably. Energy security is national security. We must never forget  this.\n\nI am proud to support this bill. It is a wise, good bill that will  strengthen America. I urge my colleagues to join me in unlocking  America's full LNG potential to achieve world energy dominance.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…establishing best practices, this bill  positions the United States as a leader in  blockchain technology, driving economic growth and technological  advancement.\n\nI urge my colleagues to join me in passing this very good bill  primarily sponsored by my good friend Mrs. Cammack from the State of  Florida. Let's get this done.\n\nMr. BILIRAKIS. Mr. Speaker,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…that no  community is too small to be overlooked or to matter, and that we are  committed to building a stronger and more equitable nation for all.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 3095.  Let us give these communities and the millions of Americans the  representation, the recognition, the resources, and the respect that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "John James", "party": "Republican", "sentence": "…global supply chains are the cornerstone of American  innovation and leadership, and we must take clear and decisive action  in the global competition.\n\nMr. Speaker, I urge my colleagues to join me in supporting this  legislation, H.R. 2444, the Promoting Resilient Supply Chains Act of  2025.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…retirement savings. What a shame.\n\nBy requiring a fraud ban notification, we can put a stop to these  senseless scams and protect vulnerable consumers.\n\nMr. Speaker, I urge my colleagues to join me in voting in favor of  H.R.\n\nMr. BILIRAKIS. Mr. Speaker, in closing, I urge a ``yes'' vote on this  particular bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…support is a testament to just how important it is for  the United States to retain its global competitive edge when it comes  to advanced industrial technologies.\n\nI urge my colleagues to join me in backing this bill, and I yield  back the balance of my time.\n\nMr. BABIN. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…a  new day here in America, but it is important that we pass this  legislation to protect the successes of this administration in the long  term.\n\nMr. Speaker, I urge my colleagues to join me in supporting the  American Entrepreneurs First Act.\n\nMr. WILLIAMS of Texas.  Van Duyne).\n\nMs. VAN DYNE. Mr. Speaker, we have heard a little bit of concerns  about…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Bureau, all for working with us  collectively both on the Natural Resources Committee staff and my staff  to bring this forward and make it a reality.\n\nMr. Speaker, I urge my colleagues to join the committee and me in  supporting a unanimous vote for H.R. 3187.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…delivery, and  empowers a trusted partner to do even more for our communities.\n\nThis is a narrowly tailored, fiscally responsible bill with broad  support. Mr. Speaker, I urge my colleagues to join me in advancing this  measure and helping more Alaskans get the care that they deserve.\n\nMr. BEGICH. Mr. Speaker, I rise in support of H.R. 3176, the bill to  reauthorize…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…congratulate the team on this  accomplishment, and I look forward to seeing many more championship  wins in their future. I am proud to recognize this talented team, and I  urge my colleagues to join me in applauding their outstanding season.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…offered a thoughtful amendment during  our Natural Resources Committee markup to expand this bill to national  forests, refuges, and all public lands.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, as we get ready to celebrate our 250th anniversary--and,  actually, we are already in it with some of the Revolutionary War  battles…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}]