[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "I thank my colleagues who have already joined my resolution, and I  urge all my colleagues to consider supporting this resolution which  demonstrates the House of Representatives dedication to protect  retirement security by not raising the retirement age.", "title": "Introduction of A Resolution Affirming the President's Promise Not to Raise the Social Security and Medicare Retirement Age", "date": "2025-08-15"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "I thank all of our colleagues who joined in supporting my resolution  and urge others to consider supporting this resolution, which  demonstrates the House of Representatives' dedication to protecting  retirement security by not raising the retirement age.", "title": "Protecting Social Security", "date": "2026-02-10"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Given the importance of the Tax Court, I urge my colleagues on both  sides of the aisle to support this important legislation.", "title": "Tax Court Improvement Act", "date": "2025-12-01"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Speaker, I urge my colleagues to vote ``no'' on this ridiculous  bill.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "I urge my colleagues to oppose this harmful bill.", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "I urge my friends in the Senate to fix this mess and actually lower  energy prices for the American people.", "title": "Big, Ugly Bill, Clean Energy Tax Credits.", "date": "2025-06-04"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Speaker, I urge my colleagues to vote ``no'' on this attack on  our democracy.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-11"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "I urge my  colleagues to vote ``yes'' on this important bill.", "title": "Improving Access to Small Business Information Act", "date": "2025-07-21"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Today, as arms control architectures fray and nuclear dangers mount,  that example takes on new urgency.", "title": "Marking the 15th Annual International Day Against Nuclear Tests", "date": "2025-08-29"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Speaker, I rise today to open the Special Order hour  to discuss the expiration of the New START treaty, the importance of  arms control, and the urgent need to strengthen global nuclear  security.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "I urge my Senate  colleagues to quickly advance this legislation because it is in  everyone's interests to have an efficient, reliable, and fair criminal  justice system.", "title": "Fsgg Federal Defenders Funding", "date": "2026-01-15"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Speaker, I urge my colleagues to reject this irresponsible  legislation.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "I urge my  colleagues to vote no.", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Speaker, I urge my colleagues to oppose this bill.", "title": "Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "I urge my colleagues to support this bill.", "title": "Introduction of the Salary Transparency Act", "date": "2025-03-10"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Madam Speaker, I urge my colleagues to support H.R.", "title": "Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025", "date": "2025-11-17"}, {"senator": "French Hill", "party": "Republican", "sentence": "Wagner for  their leadership, I urge a ``yes'' vote, and I yield back the balance  of my time.", "title": "National Senior Investor Initiative Act of 2025", "date": "2025-07-21"}, {"senator": "John Rose", "party": "Republican", "sentence": "I urge my colleagues to pass the SAVE America Act.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-11"}, {"senator": "French Hill", "party": "Republican", "sentence": "Because of that, I urge all my colleagues on both sides of the aisle  to join me in supporting this good bill, and I reserve the balance of  my time.", "title": "Financial Technology Protection Act of 2025", "date": "2025-07-21"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, I urge my colleagues to support H.R.", "title": "Hydropower Licensing Transparency Act", "date": "2025-07-14"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Speaker, I rise today to urge my colleagues to  approve my bipartisan legislation, H.R.", "title": "Secure Our Ports Act of 2025", "date": "2025-06-09"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Speaker, I urge support of this legislation, and I reserve the  balance of my time.", "title": "Courthouse Affordability and Space Efficiency Act of 2025", "date": null}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Speaker, I urge all of my colleagues to support this bill.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Anna Luna", "party": "Republican", "sentence": "Speaker, I urge all of my colleagues to give this a  fair shot.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-01"}, {"senator": "John Rose", "party": "Republican", "sentence": "Speaker, I urge my colleagues to support Representative Scott's  legislation and to support my resolution so we can stand up for the  integrity of Congress, uphold the Constitution, and restore public  trust in this institution.", "title": "Repeal of Senate Notification Requirements Relating to Legal Process on Disclosures of Senate Data", "date": "2025-11-19"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "I urge my colleagues to  join me in voting for this particular bill, a very important bill, very  critical, H.R.", "title": "Critical Infrastructure Manufacturing Feasibility Act", "date": "2025-04-28"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Speaker, I urge support for this legislation, and I reserve the  balance of my time.", "title": "Snow Water Supply Forecasting Reauthorization Act of 2025", "date": "2025-12-09"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Chair, I urge Members to support this amendment.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-16"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, I urge my colleagues to vote ``yes,'' and I reserve the  balance of my time.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Speaker, I urge my colleagues to support S.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}]