[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…are we waiting for? The oath of office that all Members of Congress  took demands that we protect the American people. Yet, every day that  we delay, lives are lost.\n\nI urge my Republican colleagues to join House Democrats, the  Congressional Black Caucus, and the House Gun Violence Prevention Task  Force in advancing meaningful, commonsense reforms that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…President Trump's illegal attempts to remove the two  Democratic commissioners from their posts, undermining the legitimacy  and transparency of the FTC.\n\nMr. Speaker, I urge my Republican colleagues to stand up for the two  representatives, or I should say for the restoration of an independent  FTC, to ensure this bill and the many others that are tasked…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…millions of moms and dads across the country.\n\nGiving a handout to the rich at the expense of families' access to  care is shameful. It is just shameful.\n\nMr. Speaker, I urge my Republican colleagues to stand up and fight  for their constituents, not for their billionaire buddies.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691435/gop-tax-scam-hurts-women-and-families"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…unconscionable, that Donald Trump would put America's leadership  in question. It is the kind of thing that only one beholden to Russia  and China would do.\n\nMr. Speaker, I urge my Republican colleagues to speak out against the  President's suggestion that we retreat from the world stage and loudly  oppose any outcome of this review that will harm America's…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Americans.  This includes over 282,000 people in my district. Mr. Speaker, 103,000  children under the age of 19 and 37,000 seniors would have their care  ripped away.\n\nI urge my Republican colleagues to stop with their empty platitudes,  to stop catering to the cruel authority of President Trump, to stop  putting billionaires over the American people. I…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690602/pope-francis-led-by-example"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…taking  this stand and why America can't wait for Donald Trump to tell them  that they are sick enough now to be given this subsidy, which they  deserve.\n\nI am here to urge my Republican colleagues to stop rolling over for  Donald Trump. Their constituents, as well as ours, are affected by this  delay in providing affordable health insurance. For months…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…richer. Children will go hungry. Seniors will lose  their healthcare. Students will lose their financial aid. Hospitals  will close. Americans will die.\n\nMr. Speaker, I urge my Republican colleagues to stand up; grow a  spine; stop bowing down to your king, Donald Trump; represent your  constituents like you were elected to do; and vote ``no'' on this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…commissioner,  regardless of party, is safe, and no business that harms consumers  should fear accountability, so long as it shows sufficient loyalty to  the President.\n\nI urge my Republican colleagues to recognize that restoring the FTC  as an independent agency, as this Congress intended, is essential to  ensuring this bill and similar efforts to protect…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…replacements in the past, it has led to  the American people paying the price in treasure and in blood.\n\nSo now we have the opportunity to stop. We are very close. We urge  our Republican colleagues to join us. Tell the American people you want  to focus on what they care about: the cost of groceries, the cost of  healthcare, the cost of electricity and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…then the person has to be detained for the entire pretrial  period.\n\nMr. IVEY. Mr. Speaker, I would say at this point, though, that  because it is unconstitutional, I urge my Republican colleagues to  oppose this bill. I urge all of my colleagues to oppose this bill.\n\nI would note that Salerno was written by Chief Justice Rehnquist, no  liberal advocate,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…shortages at the VA, the consequences for  American families and servicemembers are dire.\n\nVeterans have always had our backs. It is time we step up to have  theirs. I urge my Republican colleagues to join us in opposing the  previous question so that we can take up this important measure to  restore the livelihoods of veterans who have served our country…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…affordable.\n\nLet's make no mistake: This vote would not have taken place had it  not been for the relentless efforts of House Democrats and our leader,  Hakeem Jeffries. I urge my Republican colleagues to vote ``yes'' to  restore the ACA credits and lower healthcare costs. In the words of Dr.  King: ``The time is always right to do what is right.''\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698813/breaking-the-gridlock-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…making improvements, public option. We can go on  and on and on.\n\nBut, right now, we have one crisis that is hitting so many Americans,  and we have a way to fix it. So I urge my Republican colleagues to join  us to stop Americans' healthcare premiums from skyrocketing, and simply  bring to the Senate floor and pass the bipartisan House-passed bill to  extend…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Taiwan has been an excellent contributor to the global economy and  should not be absent from organizations such as the IMF.\n\nCongress should support this bill, and I urge my Republican  colleagues not only to urge that Donald Trump carry this bill out but  also support the people of Taiwan and support the role of the IMF as we  go forward.\n\nI again…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…It  fails to extend critical tax credits. This is all to give billions of  dollars of tax credits to the wealthiest Americans.\n\nTime is running out, as we all know. I urge my Republican colleagues  to do the right thing and work with Democrats to make healthcare more  affordable and more effective for Americans.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698147/affordability-crisis-in-america"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…influence of the CCP, and that our students, our intellectual  property, and our national security are protected from the malign  influence of the CCP.\n\nMr. Speaker, I urge all of my Republican and Democratic colleagues to  support this legislation.\n\nMr. PFLUGER. Mr. Speaker, I will point out that this bill was  actually brought up during the Biden administration…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Republican colleagues, let's join together as a team and  end this war on hydrocarbons now.\n\nPresident Trump's White House has explicitly endorsed this  resolution, and I urge all of my Republican colleagues to join us and  vote for this critical legislation to empower consumer choice and  champion American manufacturing.\n\nI will close by saying, we expect…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…energy production now.\n\nAs the distinguished gentleman from Alabama (Mr. Palmer) noted,  President Trump's White House has explicitly endorsed this resolution.  I urge all of my Republican colleagues to join me and vote for this  critical legislation to empower consumer choice, champion American  manufacturing, and save blue-collar jobs in the heart…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}]