[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…heartfelt thanks to  Justice Mary Yu. Her service has bent the arc of justice further in our  state, and her legacy will continue to guide and inspire generations to  come, I urge my colleagues to join me in celebrating her extraordinary  contributions to Washington State and to our country.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…congressional  Republicans have no intention of doing anything to lower energy bills  for Americans, and H.J. Res. 35 is just the latest proof of that.\n\nMr. Speaker, I urge my colleagues to vote ``no,'' and I reserve the  balance of my time.\n\nMr. PALLONE. Mr. Speaker, I would like to ask about this  parliamentary inquiry. I yield myself such time if I…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…need it most.\n\nI thank my fellow Midwesterner and friend, Congresswoman Wagner, for  her leadership on this. I am proud to lead this important legislation,  and I urge all my colleagues to support it.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…disease  abroad, that gives a chance for the disease to replicate, mutate, and  then migrate back to the United States.\n\nI feel that H.R. 1713 does improve CFIUS. I urge my Republican  colleagues also to work to protect SNAP, the USDA, and our efforts at  global health. I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nThis…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. hundreds of thousands of dollars. The  2012 law requires the Board to hold a special election on a Tuesday  occurring between 70 and 174 days after a vacancy. I urge my colleagues  to support this bill.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697291/introduction-of-the-district-of-columbia-special-elections-home-rule-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…traditional Medicare. Our bill, which expands access to these  lifesaving meals, will lead to billions of dollars in savings without  adding one dime to the deficit.\n\nI urge my colleagues to join the growing bipartisan Food is Medicine  movement and pass our medically tailored meals bill. Let's work  together to end hunger now.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695649/medically-tailored-meals-save-lives-and-lower-healthcare-costs"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…the Tax Court will have a tangible impact on  thousands of taxpayers, and it will raise $6 million over the next 10  years.\n\nGiven the importance of the Tax Court, I urge my colleagues on both  sides of the aisle to support this important legislation.\n\nMr. Speaker, in closing, in support of H.R. 5349, the Tax Court  Improvement Act, is the fact that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and working dads will be  turned down  and turned away all because of a vote taken here today.\n\nThis mandate isn't just unfunded. It is unfathomable.\n\nMr. Speaker, I urge my colleagues to reject this provision, reject  this rule, and reject this betrayal. Don't reward the rich on the backs  of hungry Americans.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…happen.\n\nAfter sacrificing so much, our great veterans should never struggle  to get the care, recognition, and respect they have rightfully earned.  That is why I strongly urge my colleagues to support the en bloc  package.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…American people with the cost of living. The President said he was  going to bring it down on the first day. He has done nothing but make  it worse.\n\nMr. Speaker, I strongly urge my colleagues to oppose this bill which  forfeits our global leadership, undermines national security, and  steals from the American people to hand more wealth to billionaires.\n\nMs.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…some shield to protect the polluters.\n\nWe shouldn't let them do that. That is not what we are supposed to  do. We are supposed to worry about the public.\n\nMr. Speaker, I urge my colleagues to vote ``no,'' and I reserve the  balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our  Subcommittee on Energy.\n\nMr. Speaker, I have a lot of respect…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…government better serve people, especially in a time of need.\n\nThis is why we should come together and support the bipartisan  Disaster Related Extension of Deadlines Act. I urge my colleagues to  support this bill that would help our government be better in helping  those constituents in times of need all across this country.\n\nMr. Speaker, I want to say briefly…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Madam Speaker, I thank the ranking member of the  Appropriations Committee for yielding.\n\nMadam Speaker, there are five of these bills which are not  controversial. I urge my colleagues to vote for them to keep the  government operating, to make sure that our Federal employees come to  work and do their job for the American people and get paid for it.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…very relevant to important decisions that we  take in our relationship with El Salvador and also in our decisions we  take with respect to the Appropriations Act. So I urge my colleagues to  vote for S. Res. 195.\n\nMr. KAINE. Mr. President, I will conclude prior to the vote just by  saying this is a very basic resolution.\n\nEveryone in this body, knowing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…our country's small communications providers have the necessary tools  to make informed decisions about the need for new technology in their  networks.\n\nMr. Speaker, I urge my colleagues to support the bill, and I yield  back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…protecting children is one of Congress' most solemn  responsibilities. H.R. 6732 is a necessary, targeted, and responsible  response to a real and growing threat.\n\nI urge my colleagues to support this bill.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…tactical vehicles our troops rely on that  are built by a critical manufacturer right in the Lehigh Valley.\n\nMadam Chair, I am proud to cosponsor this amendment, and I urge my  colleagues to join me in supporting its passage.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693689/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…force  remains the world's premier fighting force.\n\nThe fiscal year `26 NDAA builds a stronger military, a more resilient  industrial base, and a more secure nation. I urge my colleagues to  support this legislation.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697791/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…stamps  support efforts to connect the next generation of Americans to the  outdoors.\n\nThe legislation before us would reauthorize the program through  fiscal year 2031. I urge my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. STAUBER. Mr. Speaker, this bill reauthorizes an important program  that invests in the next generation…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698168/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…only sat on the Adams Memorial Commission but also was the  main Democratic sponsor of this legislation and a champion for the  Adams Family Memorial.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nJust down the hall from this Chamber, we get to take our constituents  many times on a tour through Statuary Hall and we see the desk location…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…also thank the House Oversight Committee  for unanimously supporting my legislation in a recent markup. Given the  bill's advancement of good-government principles, I urge my colleagues  to vote for this long overdue legislation, and I yield back the balance  of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…employment so that every veteran has  access to the opportunities that they want, all the while protecting  the taxpayers' investment and these programs.\n\nMadam Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Madam Speaker, I appreciate the concerns of the minority,  and I would like to dispel some misinformation provided by the ranking  member.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…support the Tipped Employee Protection Act. Congress  should make it clear that we are working to help put more money back in  tipped workers' pockets.\n\nMr. Speaker, I urge my colleagues to support this bill and the  millions of workers who will benefit from it, and I reserve the balance  of my time.\n\nMr. Speaker, let's talk facts again. The Fair Labor…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the problem by going after just part of it. Ending this emergency  declaration will tell the cartels that they should shift their focus to  the northern border.\n\nSo I urge my colleagues to oppose this resolution and ensure that  President Trump has the tools that he needs to combat the flow of  fentanyl from all directions.\n\nThis is the second resolution…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Speaker, to every Gold Shield family, their loved one's service  mattered. The sacrifice of their loved one will not be forgotten, and  neither will theirs.\n\nMr. Speaker, I urge my colleagues to support H. Res. 364. Let's pass  this resolution and give these families the recognition and community  support that they have long deserved.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…at all. It just reverses a burdensome rule  that does more harm than good.\n\nMr. Speaker, I am proud to stand with Chairman Griffith in support of  this resolution. I urge all my colleagues on both sides to do the same.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…our natural  resources, and to deliver on Speaker Johnson's directive to have the  resolution on the President's desk by Memorial Day.\n\nMr. Speaker, I support it, and I urge my colleagues to do the same.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Mr. Speaker, I thank Chairman Cole for his leadership and Ranking  Member Espaillat and our subcommittee members and their staff and our  staff for their work, and I urge my colleagues to vote ``yes.''\n\nMr. Speaker, it has been an interesting debate.\n\nFrankly, as a couple of my colleagues have suggested, a lot of the  rhetoric on the other side hasn't…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…legislation has a strong history of bipartisan support in the  Committee on Energy and Commerce and passed the full committee in April  by voice vote.\n\nMr. Speaker, I urge my colleagues to support H.R. 2037, and I reserve  the balance of my time.\n\nMr. LATTA. Mr. Speaker, I have no further speakers, and I am prepared  to close at this time.\n\nMr. LATTA.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…to work with the ranking member this  fall on a bipartisan piece of legislation like this one that puts  veterans' and servicemembers' needs first.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, once again, I encourage all Members to support  this legislation, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695471/servicemember-residence-protection-act"}]