[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…2026 significantly in the red. We  just fixed that.\n\nI thank Chair Cole, Ranking Member DeLauro, Chair Joyce, and Ranking  Member Hoyer for leading this issue in the House. I urge my Senate  colleagues to quickly advance this legislation because it is in  everyone's interests to have an efficient, reliable, and fair criminal  justice system.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699126/fsgg-federal-defenders-funding"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for  failing to ensure that Americans have healthcare coverage and we are  actually lowering their costs.\n\nMr. Speaker, this bill is deceptive at best and cruel at worst. I  urge my colleagues to extend the enhanced tax credits before it is too  late.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…for their organs,  including by coercion, deception, and abuse of a position of  vulnerability. It is abhorrent, repugnant, and dehumanizing.\n\nI support this legislation, I urge all of my colleagues to likewise  support it again in this Congress, and I reserve the balance of my  time.\n\nMr. Speaker, H.R. 1503 is an important, bipartisan measure. We know…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…stability and livelihood. In this Chamber we constantly have  to subsidize. We constantly have to take care of the workers when their  CEOs and the companies don't do that.\n\nI urge my colleagues to please support the Tax Excessive CEO Pay Act.                               War Profiteering\n\nMs. TLAIB. Mr. Speaker, Republicans already voted to give $5 trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…adopted, overriding federalism  and State control over elections.\n\nThis bill is part of a long-term effort by Republicans to literally  make it harder to vote.\n\nMr. Speaker, I urge my colleagues, when this bill comes up, to vote  ``no'' because it will be a disaster for America and a disaster for  democracy.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689430/disenfranchising-voters"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…country might not have received  PPP assistance in a timely manner, if they received it at all.\n\nFor these reasons, I oppose the Small Business Regulatory Reduction  Act, and I urge my colleagues to oppose it.\n\nMr. Speaker, I will close with this: Trump's tariffs, not  regulations, are crushing small businesses. I know that it is painful  for the other…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…inland. I thank my colleagues,  Representatives Radewagen and Moylan, for co-leading this legislation,  and Senators Sullivan and Whitehouse for leading it in the Senate. I  urge my colleagues to support the Save Our Seas 2.0 Amendments Act.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I reserve the balance of my  time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…boat-related activities. Under this Act, each state receives a minimum  of one percent of the total amount apportioned, while D.C. is capped at  one-third of one percent.\n\nI urge my colleagues to support this bill.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700089/introduction-of-the-pittman-robertson-wildlife-restoration-act-and-dingell-johnson-sport-fish-restoration-act-district-of-columbia-equality-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…that these programs are reviewed periodically to  verify their value sufficiently and to make sure they are updated to  the current CPI or Consumer Price Index.\n\nMr. Speaker, I urge my colleagues to support this bill. I thank my  colleagues for their unwavering commitment to supporting veterans. I  look forward to it being passed and signed into law.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…regulations are not so high that it stifles innovation and hinders  growth.\n\nI thank Mr. Haridopolos for his bipartisan leadership on this  legislation.\n\nMr. Speaker, again, I urge my colleagues to support this bill, and I  yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…priority is pleasing President Trump with  whatever he wants. They give in to his every wish, even if it means  driving up utility bills for American families.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy Subcommittee.\n\nMr. PALLONE.  Frankel).…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Speaker, I rise to urge passage of my FAIR BET Act.  The Republican's Triple B overturned a half-century tax provision that  allowed gamblers to deduct 100 percent of their losses from their  winnings.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration: Keep your hands off our  lakes. We will not stand by while shortsighted proposals gut the  programs that have protected our water, our health, and our jobs. I  would urge the President, while he is in Michigan, to go visit Flint,  Michigan, and look at what we have to do to restore enterprise and  freshwater across our region.\n\nMr. Speaker, currently,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Speaker, I thank Mr. Williams, Mr. Tran, Mr. Van Drew, and Ms.  Goodlander for their bipartisan work on this bill.\n\nMs. VELAZQUEZ.  Goodlander).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge my colleagues to vote ``yes'' on  H.R. 832, and I yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687954/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…property a violation of home rule, it also delays and increases  the cost of public and private development in D.C.\n\nThis bill is an important step to increase home rule for D.C. I urge  my colleagues to support it.", "date": "2025-07-07", "source_url": "https://justfacts.votesmart.org/public-statement/1693244/introduction-of-the-commission-of-fine-arts-district-of-columbia-home-rule-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Carper Water Resources Development  Act of 2024.\n\nMr. Speaker, I thank the gentleman from Missouri (Mr. Onder) for his  leadership on this bipartisan legislation.\n\nMr. Speaker, I urge support for this legislation, and I reserve the  balance of my time.\n\nMr. Speaker, in closing, this legislation will help improve the  Federal Government's use of shared space…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…families of our veterans are  taken care of after their loved one passes away. This commonsense bill  would provide us with the data to help Congress do just that.\n\nMr. Speaker, I urge all my colleagues to support H.R. 970, and I  reserve the balance of my time.\n\nMr. BOST. Mr. Speaker, I urge all my colleagues to support H.R. 970,  and I yield back the balance…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…``Web 3.0.''\n\nTechnologies like NFTs can be used as tickets to events, identity  verification tools, and serve other real-world uses that will change  our digital economy.\n\nI urge my colleagues to see the bigger picture. The vote today is not  just about cryptocurrency as we know it. It is about enabling the next  generation of innovation enabled by blockchain.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693780/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Mr. RUTHERFORD. Mr. Speaker, today I rise in support of the fiscal  year 2026 Department of Homeland Security Appropriations Act and urge  my colleagues to do the same.\n\nThis bill champions public safety, and it refocuses the Department of  Homeland Security back on its fundamental mission that was really lost…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…pose, is necessary to securing our networks.\n\nI thank Representative Wittman, a great Member, for his leadership on  this bill, which passed last Congress by voice vote, and I urge my  colleagues to support this very important and necessary bill. I reserve  the balance of my time, Mr. Speaker.\n\nMr. BILIRAKIS. Mr. Speaker, in closing, I commend Representative…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690265/foreign-adversary-communications-transparency-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…also thank the gentleman from Arizona (Mr. Hamadeh) and the  gentleman from California (Mr. Obernolte) for championing the other  provisions of this language.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nMr. VAN ORDEN. Mr. Speaker, as chairman of the Economic Opportunity  Subcommittee, it has been a great privilege to get important bills…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…their lives.\n\nMr. Speaker, I thank our Health Subcommittee chairwoman for her  leadership on both issues. This bill is a fantastic idea that will save  veterans' lives, and I urge all of my colleagues to support H.R. 1969,  as amended.\n\nMr. Speaker, at the end of the fiscal year, the Fox Grant Program  expires. This bill will keep the Fox Grant Program…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…advancing this bipartisan effort. This  bill passed overwhelmingly in the last Congress,  and I am confident that this body will do what is right once again.\n\nMr. Speaker, I urge my colleagues to support this bill and fight for  life.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…what your education  level is. We want hard work, savings, and investment rewarded.\n\nMrs. Wagner, Mr. Gottheimer, and Mr. Meeks have delivered that in the  INVEST Act, and I urge a ``yes'' vote.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…targeted solution to the  challenges we face and ensures that American warfighters remain the  most prepared, most adaptable, and most resilient force on Earth.\n\nMr. Chair, I urge Members to support this amendment.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…people in this country demand that we  keep moving forward and fixing the problems that are holding them back  and holding more greatness for this country back.\n\nMr. Speaker, I urge everybody to vote ``no,'' but anybody who doesn't  want to vote ``no'' needs to understand what they are blocking and  understand what they are voting ``no'' on.\n\nThe rest of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…innovation and establishing best practices, this bill  positions the United States as a leader in  blockchain technology, driving economic growth and technological  advancement.\n\nI urge my colleagues to join me in passing this very good bill  primarily sponsored by my good friend Mrs. Cammack from the State of  Florida. Let's get this done.\n\nMr. BILIRAKIS.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…trust for the Pit River Tribe. The Tribe has attempted to pursue  this ask through administrative process, but it is time for Congress to  assist legislatively.\n\nMr. Speaker, I urge passage of this bill, and I yield back the  balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…recruitment and  retention of Indiana's finest soldiers. This amendment serves to equip  our next generation of guardsmen to protect our homeland both at home  and abroad.\n\nI urge my colleagues to support this amendment, and I yield back the  balance of my time.                    Amendment No. 8 Offered by Mr. Correa", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…manager of that  store, made it to his car, and fired at officers.\n\nMr. HIGGINS of Louisiana. Mr. Speaker, I appreciate the time yielded  and the indulgence of the chairman. I urge strong support of H.R. 5143.  It restores legitimate discretion to the police officers who actually  work the streets of D.C.\n\nMr. HIGGINS of Louisiana. Mr. Speaker, let me…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}]