[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…politics.\n\nToday, I want to share the story of Mike Friedman. I met Mike in  October, about 1 week before open enrollment began. He was working on a  Federal contract at the USDA National Finance Center in New Orleans but  lost his job in April because of Federal workforce cuts enacted by  Trump, Musk, and DOGE.\n\nHis family signed up for insurance through…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…fear and  instability in their lives and communities. One Federal worker, a  disabled combat veteran who served in Iraq and Afghanistan, was  recently fired from his job at the USDA. He summed it up perfectly when  he said: ``This is not the America I swore an oath to protect.''\n\nThat is the sentiment I know many of us in this Chamber share.  Federal workers,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…food and  nutrition programs at their South West Community Center. He spoke about  the record-breaking number of people coming to the food pantry every  month, especially when USDA let SNAP benefits lapse during the  Republican shutdown.\n\nWe also heard poignant stories from a few of QCAP's clients, Nisha,  Marybeth, Tanya, and Danielle. One noted that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699212/end-hunger-now-visit-to-quincy-community-action-programs"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…and collaboration with farmers. If that  weren't bad enough, the very people we rely on to protect our ag  industry and combat the spread of bird flu have been fired from the  USDA.\n\nThis chaos is only worsening the risk of disease spread and  threatening a hallmark industry in Delaware.\n\nAll of this has resulted in higher costs for farmers and higher…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…up.\n\nRepresentative Jill Tokuda from the great State of Hawaii introduced  an amendment trying to prevent the nutrition title of this bill from  taking effect, again, so the USDA can determine that the provisions of  this one big, ugly bill would not result in material economic harm to  farmers, ranchers, and producers. Mr. Speaker, as you know, Republicans…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Mr. Speaker, I am rising in support of the DOE and USDA Interagency  Research Act, H.R. 1326.\n\nI thank the gentleman from Oklahoma (Mr. Lucas), again, our former  committee chair, for reintroducing this legislation alongside the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688982/doe-and-usda-interagency-research-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…alarm as they see record-high demand  alongside very low unemployment.\n\nInstead of solving this dire hunger problem, the Trump administration  is now slashing critical funds to USDA.\n\nIt is rare to have a hat trick in public policy: a program that helps  our small  farmers, supports our food banks, and gets healthy food into schools.  Yet, this administration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691898/food-bank-cuts"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…of life. This is not  theory. It is science.\n\nInvesting in greener, healthier neighborhoods benefits Hoosiers and  Americans. These cuts undermine that very goal.\n\nI urge the USDA to reverse its course, and I call on our colleagues  to join us in demanding the restoration of these critical investments  in our communities.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…tangible data from the snowpack which       could be used to determine a community's yearly water budget.       I am completely heartbroken to have lost my position with the       USDA.\n\nMr. Speaker, these reckless firings are not just devastating to  dedicated scientists who have chosen to work in public service, they  also endanger Oregonians and people…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688208/fired-by-president-trump"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it is a moral outrage, one that Trump and Republicans  have made worse by ripping food assistance away from people so they can  give tax breaks to billionaires and canceling USDA's gold-standard  hunger report to bury the impact of their cruel cuts.\n\nMadam Speaker, this tour is about fighting back, and I hope you will  follow along as I keep fighting…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698923/end-hunger-now-tour"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and help our farmers by stopping these trade wars, and  putting our farmers back in charge of growing an economy for the  future.\n\nI hope that we don't cut ARS funding that USDA depends on. I hope  that we will give hope to our future constituents and the growth that  we need to grow our economy instead of cutting our opportunity.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…on  the table. The second tool is interchange authority that allows the  Secretary of Agriculture to use tariff funds to supplement the  contingency fund.\n\nBack in September, USDA's--the U.S. Department of Agriculture-- website noted that it planned to use the contingency funds in order to  make sure that SNAP was delivered in November, but then in October,…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…working people, families whose lives  hang in the balance.\n\nIn New Mexico, our farmers are being crushed under the weight of  these tariffs, losing export markets, watching the USDA programs, that  once purchased homegrown, healthy foods to put into our schools and  food banks, dry up.\n\nHere is another headline: ``Farmageddon. Many U.S. farmers are  warning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…proud to be the lead Democratic cosponsor to reauthorize and  improve this law.\n\nThis bill before reauthorizes annual appropriations for standard  development and maintenance, USDA's authority to collect fees for  supervision of inspections and weighing, an administrative/supervisory  cost cap and the Grain Inspection Advisory Committee. All important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…1 of 2,500 VA employees  who were fired by DOGE, putting the care of our Nation's veterans at  risk.\n\nTonight, I also welcome Tiffany Ramos from Rome, NY, who worked at  the USDA office in Syracuse and was fired from her job helping rural  farmers and businesses across Upstate New York. Tiffany is just one of  many USDA employees fired with no notice…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…amounts while also including  community project funding.\n\nThis bill provides critical funding support to America's farmers,  ranchers, and rural communities. It ensures both USDA and FDA can  safeguard our Nation's food and drug supply and fully fund nutrition  programs, including SNAP and WIC.\n\nAdditionally, the bill closes the hemp loophole that has…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Speaker, I rise to recognize Mr. Clark D. Thomas, a  special employee of the USDA Rural Development--Missouri State Office,  who recently retired after many dedicated years of service.\n\nMr. Thomas was a remarkable civil servant for nearly six decades and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699718/recognizing-mr-clark-d-thomas"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…take a moment to highlight a few provisions that I think will  make a difference. Section 104 and 105 of the bill works to rightsize  the environmental reviews on both HUD and USDA housing projects to  properly reflect their impact on the environment. This legislation  ensures that these environmental reviews are properly tailored to the  real impact of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``DOE and USDA Interagency       Research Act''.       SEC. 2. DEPARTMENT OF ENERGY AND DEPARTMENT OF AGRICULTURE                     JOINT RESEARCH AND DEVELOPMENT ACTIVITIES.\n\n(a) In General.--The…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…effectiveness of some of our most vital humanitarian aid programs.\n\nThanks to its extensive infrastructure and hands-on experience in  both domestic and international operations, the USDA is uniquely  positioned to manage Food for Peace. In February, I introduced a bill  with my colleague from Kansas Senator Marshall and our colleague from  North Dakota Senator…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…Congress by the former chairman of the  Financial Services Subcommittee on National Security, Mr. Luetkemeyer.\n\nThat section of the bill requires CFIUS to consider referrals from  USDA for reportable agricultural land transactions prior to the  interagency process that determines whether review of the transaction  is warranted.\n\nThese bills received unanimous…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…including emergency response plans, sterile fly production and  dispersal levels, as well as targeted initiatives in surveillance and  research. I have been working closely with the USDA and other  stakeholders to promote these efforts, and I have introduced  legislation to authorize funding to deal with these measures.\n\nFirst of all, the USDA is partnering…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…strengthen national security, and they are  going to enhance Nebraska's role in that.\n\nIn the agriculture and rural development funding bill, I secured $16  million for the USDA's Agricultural Research facility at the University  of Nebraska-Lincoln. This investment will support research that  benefits Nebraska producers and strengthens American agriculture.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…finally root  out waste, fraud, and abuse. Let the other party, Mr. Speaker, be the  defender of waste, fraud, and abuse in Washington, but we are cleaning  it up in this bill.\n\nUSDA has pointed out that there is about $10 billion a year in waste  just in the SNAP program because of fraud and improper payments. These  payments are not going to children that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…foods in my diet growing up.\n\nNow, I would like to talk a little bit more about eating, about  eating real food, and share the new nutritional guidelines released  yesterday by USDA, HHS, and FDA. Guess what their advice is. Their  advice is to eat real food, the same food that I was raised on.\n\nNow, what I am excited about is--look, America was so hungry,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…obstructive government regulations that prevent  and delay new construction. That is why I introduced the bipartisan  Streamlining Rural Housing Act.\n\nThis bill would require HUD and USDA to develop a joint environmental  review process for rural housing projects, cutting red tape and making  rural housing easier to build.\n\nIf we are to help more Americans achieve…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…hits the dirt  to build a new home, and builders often cannot build a home for less  than $250,000. This bill modernizes housing laws, improves coordination  between HUD and USDA, expands manufactured housing in rural  communities, reduces barriers for veterans, and increases access to  small-dollar mortgages.\n\nMr. Speaker, I was very pleased to support…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Department  of Natural Resources and led the Ohio Department of Agriculture for  several years in the late 1980s. For 16 years, he worked as State  Executive Director of the USDA's Farm Service Agency. Steve traveled  overseas extensively throughout his career to promote Ohio products and  expand our state's trade opportunities.\n\nA native of Carroll…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…as the director of  advocacy and government relations for the national FFA organization.\n\nHe would go on to serve in the first Trump administration as the  chief of staff of USDA's Office of Partnerships and Public Engagement  for almost 2 years before joining my team as my agriculture staffer,  legislative director, and deputy chief of staff.\n\nRiley…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "Mr. LUCAS. Mr. Speaker, I rise in support of H.R. 1326, the DOE and  USDA Interagency Research Act. This bill allows the Department of  Energy and the Department of Agriculture to work together to improve  how we grow our food, fiber, and fuel in…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688981/doe-and-usda-interagency-research-act"}]