[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…from considering two amendments that had  total support from Democrats and total rejection from Republicans in  the Financial Services Committee.\n\nThe first prohibits the use of taxpayer money to buy crypto. Trump  has already said he wants what he calls a strategic reserve of crypto.  If you vote against this rule, you are voting to allow him to buy…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…their day in court. While they wait, taxpayers pay the price.\n\nThat is why I have introduced the Justice Forward Agenda, a target,  results-driven plan to reduce crime and use taxpayer dollars more  wisely. The Community First Pretrial Reform and Jail Decarceration Act  helps local jurisdictions cut unnecessary pretrial detention and expand  proven alternatives.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690046/moving-justice-forward"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…There has to be a partnership. There has to be accountability.\n\nBut where FEMA's role is going to be better on this is on oversight  to make sure that there is the proper use of taxpayer, FEMA-authorized  money. But it is not going to micromanage local folks to death in the  name of oversight; it is going to empower the local folks to make those  decisions…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…people they  dehumanize.\n\nYou are seeing at home another powerful sign of a budding  authoritarianism--a growing authoritarianism--and that is the use of  propaganda, the use of taxpayer money for propaganda. You see banners  with the President's glowering face now on public buildings in  violation of law. You see Kristi Noem doing Hollywood-looking produced…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…laws--certainly require the apportionment  information to be published to the benefit of both the Congress and the  public, who deserve access to information about the use of taxpayer  dollars.\n\nFinally, I must speak out against the pattern of unlawful impoundment  that is being led by OMB Director Russ Vought, who insists that there  is somehow a loophole…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…rescissions package that will claw back nearly  $10 billion in wasteful spending. The American public expects their  government to be good stewards of taxpayer dollars and to use their  taxpayer dollars for programs that advance Americans.\n\nHowever, for years, billions of dollars have been shelled out for  ridiculous, wasteful programs like the $6 million to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…what has happened to the $17  billion that has already been spent and whether, perhaps, there might  be fraud at issue, or at least waste or a lack of diligence in the use  of taxpayer funds.\n\nI don't think it is any coincidence that, as these efforts ramp up,  the legislature is now considering a bill, which the Governor himself  provided language for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…years, across multiple administrations,  the balance of the Crime Victims Fund, or CVF, has plummeted,  jeopardizing Federal support for these victims.\n\nThis fund does not use taxpayer dollars. It is solely financed by the  fines, settlements, and other monetary penalties collected from Federal  criminal prosecutions. From 2017 to 2023, the balance of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…The minority wants the public to believe that Republicans are cutting  Medicaid, and we are not. We are making sure it goes to those people  who need it and that we use every taxpayer dollar wisely. That means we  are making sure that American tax dollars go to American citizens.\n\nThat means strengthening the system so care can get to those who need…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…garbage.\n\nHow on Earth can my Democratic friends possibly defend that? My  friends on the other side of the aisle would like you to believe,  seriously, that if you don't use your taxpayer dollars to fund this  absurd list of projects and thousands of others that I didn't even  list, somehow people will die and our global standing in the world will  crumble.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…government can you define ``separate'' as meaning  ``together.''\n\nSo we still have this one form of healthcare in America that violates  this 50-year-old compromise: We don't use taxpayer dollars and compel  Americans who actually value children to pay for the taking of the life  of a child.\n\nWe are still working on that. Ironically enough, there is still…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…taxpayer dollars that have been flowing to radical  gender ideology programs around the world. That is not the role of the  Federal Government, and that is not an appropriate use of taxpayer  dollars of American citizens.\n\nTaxpayer dollars should not be used to fund woke projects overseas or  bloated government programs at home. They should be funding efforts…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…has taken a couple of years, and I believe that we have a good,  bipartisan bill that addresses the issue at hand.\n\nMr. Speaker, let me close with this. Continuing to use our taxpayer  dollars to give the Chinese Communist Party a seat in the front row of  our universities' classrooms and research labs would be a catastrophic  mistake.\n\nIt has been…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…their lifetime and so the memorial can fold into the  broader America250 effort. The memorial's construction will be funded  entirely through private donations and won't use taxpayer dollars. The  amount of work and dedication the WWII Women's Memorial Foundation has  poured into this project clearly illustrates its importance.\n\nNot only will this memorial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697728/world-war-ii-womens-memorial-location-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…against the  people. These are dollars that are being used and wasted and sent  around the world for $32,000 for transgender comic books in Peru. That  is how they want to use taxpayer money.\n\nWe are over here trying to make sure we are saving that money instead  of having $6 million to fund tourism in Egypt or $2 million for sex  changes and LGBT activism…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…is why the President's budget included no  funding for NED this year.\n\nI requested the State Department inspector general investigate NED's  leadership conduct and the use of taxpayer dollars. Until that  investigation is complete--\n\nMr. SCHMITT. I would argue that if we are true to advocating the  democratic norms, accountability must come first in…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699440/consolidated-appropriations-act-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…These are  practical, locally requested projects that are transparent,  accountable, and focused on results.\n\nMr. Speaker, this conference agreement reflects a responsible use of  taxpayer dollars while strengthening public safety, water security, and  critical infrastructure. I am proud of the work we have accomplished,  and I strongly urge my colleagues…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…approximately $1  billion to build charging stations. Let's see. I think they built less  than 10. I don't know about other Members, but I don't think that is a  real good use of taxpayer money, so I am in support of clawing some of  that money back. I thank President Trump.\n\nMr. Speaker, moving on to the resolution, this resolution offered by  my good…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…must have taxpayer funding going to pay for  the education of illegal alien children. If you want to choose to do  it, that is for you to decide. We should not be forced to use taxpayer  dollars to do that. We should challenge that Supreme Court ruling. We  should stand up to defend our country.\n\nThe fact is you can't win a war that you are not willing…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…reforms to  begin the process of rightsizing the Federal Government's real estate  portfolio last Congress. This legislation continues that work of  ensuring a more efficient use of taxpayer resources.\n\nMr. Speaker, I urge support of H.R. 3426, as amended, and I yield  back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}]