[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I would like to use my time to  highlight the attacks currently being thrown at our Federal workers and  the unconscionable firings that are taking place.\n\nWe have heard baseless and callous criticisms…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I would like to use my time tonight to  talk, as well, about the first 100 days under this administration's  leadership.\n\nYou have heard my colleague already speak, and I concur with his  remarks.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…hearings so that we can discuss this as Members of Congress.\n\nOmar), who is an original cosponsor of this important resolution.\n\nMr. MEEKS. Mr. Speaker, the gentleman can use my time if he can  answer why the President of the United States pardoned major drug  dealers who were convicted and doing time. It was the little guys. I  will wait.\n\nAlso, if…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, Oregonians at home and colleagues in the  House often hear me talk about NOAA, but I want to use this time to  explain how this agency, the National Oceanic and Atmospheric  Administration, contributes to the economy and to our well-being.\n\nNOAA is not just a four-letter acronym…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…choosing to meet at 1  o'clock in the morning on something this consequential.\n\nMr. Speaker, I think the gentleman thinks it is a good idea. The  gentleman says that I will use my time and try to take every moment I  can to make my points. I can say to the gentleman: You bet your life I  will be. I am going to be fighting like hell for the people of this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…down the cost of groceries,  instead of debating legislation on making sure we can make this country  more affordable for working people, congressional Republicans want to  use this time to attack working families in the District of Columbia.\n\nOverturning this law will create chaos for D.C. families and  businesses at the start of tax filing season. The…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…worker, it is about  Republicans making good on their promise to deliver for Big Oil  billionaires destroying our planet.\n\nMy Republican colleagues decided that the best use of our time today  is to debate whether or not we should keep a commonsense rule that  protects Tribal resources, worker safety, and our Nation's history.  They claim we must do this…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…investigations, and  health, housing and human services across the Nation and beyond.\n\nIt takes a remarkable combination of arrogance and stupidity to think  that this is the best use of time for our intelligence officers, VA  workers, air  traffic controllers, FBI agents, and everyone else upon whom our Nation  depends to do their jobs well.\n\nIf this is what…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is the bottom line. No rationalizing  away what is happening here.\n\nThis is from the Cystic Fibrosis Foundation. I could give you so many  examples. I don't want to use up all the time. The Cystic Fibrosis  Foundation says:\n\nWhile people with chronic illnesses like cystic fibrosis       may be exempt from work requirements, we know exemptions for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…never wrong. Time is always what we make  it.''\n\nThen he concluded that he was coming to the belief that the people of  ill will in our society were making a much better use of time than the  people of good will.\n\nThen he closed saying that we are going to be made to repent not just  for the vitriolic words and actions of bad people but for the appalling…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…customary weapon by which free  governments are destroyed. The precedent must always greatly  overbalance in permanent evil any partial or transient benefit which  the use can at any time yield.\n\nOf all the dispositions and habits which lead to political  prosperity, religion and morality are indispensable supports. In vain  would that man claim the tribute…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…Shane lives in Cincinnati, so he has Cincinnati Children's Hospital,  but with these cuts, services at Children's will be undermined.\n\nShane told me recently: I want to use whatever time I have left to  help others with this and other rare diseases.\n\nI just wanted to come to the floor today to thank Shane. We are  fighting for him and we are fighting…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690573/shanes-story"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…then  sweeping in all of these other dangerous weapons.\n\nI am happy to yield to my friend if he wants to elaborate on that, or  I will reserve my time. Maybe he can use some of his time.\n\nMr. Speaker, there is another bit of business we need to clean up  here, and I would invite my distinguished colleague from South Carolina  to join me in this.\n\nWe…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…thought there that I have been thinking about all  day. King said that he was coming to the conclusion that the people of  ill will in our society are making a much better use of time than the  people of good will.\n\nMr. Speaker, I want us to think about that. Those people who came to  this building on January 6, 2021, did not have good will in their…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Stockton, your home does not have to be next.\n\nTrust me, my colleagues. Every single one of us in this body has  people dying every single day in our constituencies. We should use this  time to really protect our kids and not just act like we are protecting  them, while this Republican Congress does nothing about these tragedies  at all.\n\nMr. Speaker, I encourage…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…appropriate mechanisms to monitor and enforce compliance with       the reporting requirements of this Act and may utilize       existing reporting mechanisms in use at the time of enactment       of this Act.\n\n(b) Reports on Crashes.--\n\n(1) Employees.--Any employee of the Postal Service engaged       in the transportation of mail shall report…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…customary weapon by which free  governments are destroyed. The precedent must always greatly  overbalance in permanent evil any partial or transient benefit which  the use can at any time yield.\n\n``Of all the dispositions and habits which lead to political  prosperity, religion and morality are indispensable supports. In vain  would that man claim the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}]