[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…strengthen parity, I was excited to see the Biden-Harris  administration push to update the final parity rules which will allow  for greater access to mental health and substance use disorder care.\n\nThese regulations implemented an update in the law to close gaps and  improve compliance with parity, which is critical for the 84.5 million  Americans with these…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…AHA--somebody tell me  what that department is--organization and proposing a budget that kicks  nearly 14 million people off Medicaid.\n\nNearly half of those struggling with opioid use disorder rely on  Medicaid. In Pennsylvania alone, that is 100,000 people who may now  lose their only chance at life, at recovery, at treatment.\n\nI know the desperate hope. I know…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691500/gop-tax-scam-hurts-women-and-families"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…topics related to law  enforcement, community policing, mental health and addiction. I have  also had the honor of working with him through my Mental Health and  Substance Use Disorder Advisory Council, where his insights have been  invaluable.\n\nChief Tate's compassionate approach to policing is respected and  recognized by his peers. He has won numerous…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…programs, but I am furious that as we are having  this debate, making believe to the American people that somehow we are  on their side and that we are fighting substance use disorder, fighting  addiction and the opioid crisis, and that we are really serious about  this, while we are having this debate, the President of the United  States and this administration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…mental health and substance use issues.  Medicaid is the single largest payer in the country for behavioral  health services, covering 40 percent of all Americans with opioid use  disorder.\n\nAmericans with substance use and mental health issues will face new  barriers and red tape in signing up for and staying enrolled in their  health insurance. House Republicans…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…people where they were at, so she  created partnerships with schools, medical practices, law enforcement,  and others to facilitate more than 150 outposts for substance use  disorder care. She grew the Center's workforce by over 300 employees  and improved access to treatment for over 25,000 Coloradans in the  Front Range to ensure those in rural communities…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Chair, I will vote in support of H.R. 2483, the  Substance Use-Disorder Prevention that Promotes Opioid Recovery and  Treatment (SUPPORT) Reauthorization Act of 2025. This bill, which was  first signed into law in 2018, aims to fight the opioid…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692133/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…for  reEntry--launched in 2014, is a reentry court program that helps high  risk and high needs individuals returning home from prison overcome  challenges like substance use disorder that might lead them to  reoffend. In 2021, Rhode Island created the Deferred Sentencing Program  to offer a creative treatment and supervision program in place of  incarceration…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…ensuring outreach and vaccinations were  available during the pandemic; securing multiple sources of public  funding for a Center for Recovery and Wellness, a substance use  disorder outpatient center that  opened in October 2024; and numerous additional legislative  accomplishments.\n\nIn addition to some of the civic engagements already mentioned,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Hampshire AHEC offered continuing education to over 4,500  healthcare workers, improving treatment options for patients suffering  from diseases such as diabetes and substance use disorder. In addition  to working with providers, they also offer trainings on chronic  disease, chronic pain and diabetes self-management to patients in the  community. More than…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Colorado and what we have been  able to do to address the opioid epidemic. In Colorado, we were able to  utilize the 1115 waiver by proving that by covering substance use  disorder treatment, we could save money over time.\n\nWhat happened in the reconciliation bill was language that said you  actually had to prove that it was cost neutral up front…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…people, up from 13.5 million people, from  their healthcare, all to give tax breaks to their billionaire friends.\n\nMedicaid covers 40 percent of all Americans with opioid use disorder.  Gutting the program will leave millions of Americans without access to  lifesaving care. We can't just go back to business as usual after that  devastation was supported…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…operational stress, yet we face a readiness  crisis. Suicide rates remain high. One in four servicemembers suffer  from PTSD, and over 40 percent meet the criteria for alcohol use  disorder.\n\nMeanwhile, access to mental health support remains limited,  especially in key military regions. Recognizing the need to address  this reality is a step in the right…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…criminal justice side of it.  However, my friend from New Jersey is correct, what also has to be  addressed are the issues affecting people that are suffering from  substance use disorder. We did that in the SUPPORT for Patients and  Communities Reauthorization Act of 2025 where we had over, I think, 350  votes on the floor. It was broadly bipartisan on the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692351/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Madam Chair, I yield myself such time as I may consume.\n\nMadam Chair, I rise today in support of my amendment. In 2018, the  Substance Use-Disorder Prevention that Promotes Opioid Recovery and  Treatment for Patients and Communities, otherwise known as the SUPPORT  for Patients and Communities Act, was signed into law.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…recovery opportunities,  bolster prevention initiatives, and fight the fentanyl crisis.\n\nThis bill is about offering hope to those in despair, those battling  substance use disorder, their families and loved ones, healthcare  heroes, and first responders who need continued support to help save  lives.\n\nI thank Congresswoman Pettersen and all the Members…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Committee of the       Whole House on the state of the Union for consideration of       the bill (H.R. 2483) to reauthorize certain programs that       provide for opioid use disorder prevention, treatment, and       recovery, and for other purposes. The first reading of the       bill shall be dispensed with. All points of order against       consideration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…time as I  may consume.\n\nMr. Chair, I rise today in support of my amendment. More than 50  million American adults consider themselves to be in recovery from a  substance use disorder or mental health condition.\n\nIn order to ensure that more patients can reach recovery, we must  bolster treatment integration and wraparound services for patients  suffering…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691885/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…after subparagraph (A) the following:\n\n``(B) to conduct safety and prevention training that       addresses behavioral and physical health risks, to include       substance use disorder and worker fatigue, facing fishing       vessel operators and crewmembers; and'';\n\n(B) in paragraph (2)--\n\n(i) by striking ``, in consultation with and based on       criteria…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]