[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "The President has used the NEA to declare an energy emergency.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "We have had the first Democratic  mayor in Miami in 30 years--what used to be a Republican redoubt.", "title": "Affordability", "date": "2025-12-10"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "On the seas, NOAA's nautical charting and mapping services are used  by everyone, from recreational boaters to international shipping  companies.", "title": "National Oceanic and Atmospheric Administration", "date": "2025-02-26"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "So we got used to this 39 years ago when only the House had it and  the Senate thought it was too cool to do.", "title": "Senate Resolution 259--Recognizing June As the 39th Anniversary of C-Span Chronicling Democracy in the Senate", "date": "2025-06-02"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Since that day of his inauguration, he  has used that Executive order to actually create an emergency.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "The aircraft and parts could only be used for fire  suppression.", "title": "Aerial Firefighting Enhancement Act of 2025", "date": "2025-06-03"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Clyburn talked about the Tuskegee Airmen that,  yes, it was during World War II that First Lady Eleanor Roosevelt used  her platform as a military advocate to challenge segregation and to  elevate excellence in the Armed Forces.", "title": "Paying Homage to the Black Men and Women of the Armed Forces", "date": "2026-02-09"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Independent of whether a noncitizen is guilty of what they are being  accused, I fear these actions are setting a bad precedent that  undermine the American justice system, runs contrary to the letter and  the spirit of the U.S.", "title": "Letter to Secretary Noem and Secretary Rubio", "date": "2025-05-14"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Elizabeth suffered from sepsis caused by untreated  strep throat.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "This administration and the House majority are actually not just  taking away their boots but taking away the leather, the rubber, the  soles, and the labor that would be used to even make these boots.", "title": "Big, Backstabbing Bill", "date": "2025-05-13"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "We have the world's greatest military, but it is not  a toy to be used to glorify any one man's lust for an expanded control  of land.", "title": "Greenland", "date": "2026-01-13"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The CRA has never been used to go after emission waivers like the  ones in question today.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "The rule simply states that future surveys need to adhere to minimum  standards to be used for archeological reports.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Department of Transportation (DOT)       NOFO, which ``outlined the precise eligibility and selection       criteria for each program, as well as the types of projects       eligible to receive DOT funding under each one'' and changed       the criteria used to evaluate applicants and make award       decisions from a previous NOFO--including how certain       criteria were rated--was a rule subject to CRA.", "title": "U.S. Government Accountability Office Opinion Letter", "date": "2025-12-17"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "But I understand the words that were  being used today to spin an argument as to why there should be  justification for 40 million people to go hungry.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "The townspeople used their prosperity to built what has been called  ``the prettiest village in Maine,'' with handsome homes, churches, and  schools.", "title": "225th Anniversary of the Town of Strong", "date": "2026-01-28"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "The hostages have been subjected to inhumane conditions,  deprived of their basic human rights, and used as pawns in the cruel  game of manipulation.", "title": "Hamas", "date": "2025-03-04"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Over 31,000 patients received acute level care in their homes as of  October 2024, and studies show that hospital systems achieved savings  of 19 percent regarding these patients who required a shorter average  length of stay and used fewer unnecessary services.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "If we can continue to move forward  and build new plants and show how this new technology can be used, we  can then be the ones who are exporting it to sub-Saharan Africa and  India instead of having the Chinese exporting facilities and the  technologies that are from the 1960s and 1970s, instead of the  technologies that are available today.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Max Miller", "party": "Republican", "sentence": "This will ensure that the world- class tools and technologies at DOE are being used by the very  taxpayers who funded them.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Jim was an active member of the Kiwanis, his local VFW and American  Legion, and many other local organizations focused on improving his  community and aiding those in need.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "One group has publicly accused this chairman of the Judiciary  Committee of undermining that whistleblower.", "title": "Whistleblowers", "date": "2025-07-08"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "2270) to amend the Fair Labor Standards Act of 1938 to  exclude child and dependent care services and payments from the rate  used to compute overtime compensation, and ask for its immediate  consideration in the House.", "title": "Empowering Employer Child and Elder Care Solutions Act", "date": "2026-01-13"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(8) Following unrest in the region, in 2014, Chinese       authorities launched their ``Strike Hard against Violent       Extremism'' campaign, in which dubious allegations of       widespread extremist activity were used as justification for       gross human rights violations committed against Uyghurs and       members of other minority communities in the XUAR.", "title": "Uyghur Policy Act of 2025", "date": null}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "It found more than 29,000 Social Security numbers       in 2023 and nearly 68,000 in 2024 that were used to receive       more than one year's worth of insurance coverage with       subsidies in a single year--meaning the same Social Security       number was used by more than one person.", "title": "Affordable Care Act", "date": "2025-12-10"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Tens of thousands of Social Security numbers from dead people have been  used to siphon money away from this program.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Speaker, that we used to all agree on in  this Chamber, and now, unfortunately, it has become a partisan issue.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Fighter jets targeted military sites in the  eastern Bekaa Valley, which the Iran-backed militia used for training  purposes.''\n\nI include in the Record this Yahoo News report.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}]