[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…approach  of ``spheres of influence'' and ``might makes right'' is one that our  leading competitors and adversaries--China and Russia--have been  asserting themselves. We are using their language. President Trump's  adoption of this approach endorses and advances their world view, a  move that could have dangerous global consequences.\n\nHow will this administration…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…use this substance to take their own lives. Sadly,  according to data from the Centers for Disease Control and Prevention,  this has led to a sharp increase in self-poisoning using sodium  nitrite.\n\nBy banning the sale of high-concentrate sodium nitrite to consumers,  H.R. 1442 will make it less accessible to people contemplating suicide.  Experts have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690218/youth-poisoning-protection-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…telling the Trump  administration that their energy emergency, as they call it, is the  emergency for our country. Trump, Secretary Chris Wright--this whole  administration is using emergency authorities to make up a crisis that  is resulting in our electric bills going sky high all across our  country, and our clean energy jobs are going up in smoke.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…airport from  the parking lot and then must travel long distances from the airport  parking lots and transit stops to get to the TSA checkpoints.\n\nLetting employees clock in using cell phones and location data would  help alleviate the stress caused by irregular shuttles and the traffic  that is very unpredictable around the airport.\n\nThis is a sensible…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…supported. My colleague's partner Senator from his State, in committee,  said: I don't understand why we are not putting the test strips on  this. Why? Because kids who are using fentanyl right now don't know  that they are using this fentanyl analogue. Kids in your State and my  State think they are taking Adderall, not realizing that this has those…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Northern Kentucky, David has built not just a  farm, but a laboratory of ingenuity. Through hydroponic and aquaponic  growing systems, sustainable land management practices like using goats  to clear brush, and a deep commitment to mentorship, he is helping pave  the way for Kentucky farmers and farmers worldwide to build stronger,  more resilient farms.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…warrants, use excessive force when it wasn't required,  and ignore constitutional rights.\n\nThey are even weaponizing children in this country, kidnapping them  from schools and using them as weapons against their parents. It is  morally wrong, outrageous, and not who we are as a common people.\n\nThis is a Department that is out of control, going rogue, and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…that day, an employee from ICE made  one request: Stop politicizing us.\n\nIt is the White House that needs to hear this message most of all.  Trump and Secretary Noem are not using taxpayer dollars to keep  communities safe; they are using it as political theater. They dress up  in ICE jackets, parade through detention centers, and turn detainees  into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…trade  associations and the voice of professional roofing contractors  worldwide. NRCA has nearly 4,000 roofing company members representing  the entire roofing supply chain. Using its network of roofing  contractors and industry-related members, NRCA is responsible for the  installation of new construction and replacement roof systems on  commercial…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…healthier, and better supported, they are  better equipped to serve with professionalism and with empathy. Our  communities benefit when law enforcement agencies are operating using  data to improve practices rather than reacting to crises.\n\nYet, the Improving Law Enforcement Officer Safety and Wellness  Through Data Act isn't just about gathering data…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…concussion safety and management, including       training on the prevention, recognition, and academic       consequences of concussions and response to concussions; and\n\n(ii) using, maintaining, and disseminating to students and       parents--\n\n(I) release forms and other appropriate forms for reporting       and record keeping;\n\n(II) treatment plans;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…House,  Senate, and Presidency. They could have kept the government open with a  negotiated settlement, or in the same way they placed Mr. Gorsuch on  the Supreme Court, by using a majority rule rather than a 60-vote rule.\n\nI cannot support this corrupt and dirty CR, and I urge my colleagues  to oppose this legislation too.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…newspaper criticizing the Israeli Government. It is about ripping a  preschooler--preschooler--1,300 miles away from his home to sit in a  detention facility, and it is about using him as bait to get to his  family. That is happening.\n\nIt is about detaining a U.S. citizen at gunpoint, on that person's  front porch, without any warrant to go there and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…and  it happens, that is authoritarianism. It is also when the government  dictates what should and shouldn't be said on television and whether  they should be punished and using the power of the government to  suppress free speech.\n\nThe President then followed up and said that NBC should get rid of  two of its late-night shows. CBS has canceled their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…and ask them to reopen  the process.\n\nMr. Speaker, listen to the Tribes, listen to the American people, and  update  the resource management plan. That is the way it is done.\n\nUsing the Congressional Review Act to overturn the plan is the wrong  approach. I understand why it may seem easier for Republicans to just  bring the hammer down and use this blunt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to the rule,'' and the rule's       proposed effective date. CRA allows Congress to review and       disapprove rules issued by federal agencies for a period of       60 days using special procedures. If a resolution of       disapproval is enacted, then the new rule has no force or       effect.\n\nCRA adopts the definition of ``rule'' under the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "James Risch", "party": "Republican", "sentence": "…updating of       software, all on-board missile software is uploaded via the       LwCLU after mating and prior to launch.\n\n4. The missile is autonomously guided to the target using       an imaging infrared seeker and adaptive correlation tracking       algorithms. This allows the gunner to take cover or reload       and engage another target after firing…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…basically sit in this area.\n\nWhat would happen if our brothers and sisters on the left would  actually, instead of defending the inefficiencies, the distortions--I  despise using ``waste and fraud'' because I think everyone is against  waste and fraud. Even if you read the articles, the ProPublica and The  Wall Street Journal on the extortion of bad…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…propose to use it, which would be  communicated to all of the local users of the airspace, or, Mr.  Speaker, they could better and more effectively communicate when they  are using that airspace to other airspace users so the public would be  aware when the military needed the airspace and when the public had  access to that.\n\nIn fact, we have already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…for illegal immigrants with official State flyers, encouraging them to  use emergency services. That is pretty rich.\n\nI mean, think about it. They are saying they are just using their  State tax dollars. That is not the truth. They are promoting, with  taxpayer dollars, this push to have, again, other people pick up the  costs.\n\nThis is not some federalism…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…companies get richer and richer from American  investment, it is clear that restricting inbound investment is not  enough. We need to prevent the People's Republic of China from using  capital investments by the United States to gain access to and copy our  technological advances--most importantly, in certain critical sectors.\n\nAs of 2023, U.S. investors…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…more  transparency and oversight into our children's schools, to ensure that  our children are not being improperly influenced by foreign actors or  that foreign actors aren't using contributions to our schools to  benefit themselves.\n\nOne of our colleagues on the Education and Workforce Committee did a  whole hearing on the Chinese Communist Party back…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…used for  emergencies.\n\nICE officials were given access to data for the Nation's 79 million  Medicaid enrollees to be able to look at it and go find illegal aliens  that were using Medicaid.\n\nThe Interior Department announced today that all agency decisions  related to wind and solar energy must undergo strict reviews.\n\nThe Treasury Department announced…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…jurisdictions are unacceptable and are in defiance of Federal law.\n\nIn California, U.S. Attorney Bill Essayli has found a way to  circumvent effectively the sanctuary State using the powers of Federal  law enforcement, so we have come a long way toward ending the disgrace  of the sanctuary State in California.\n\nWhen it comes to California's failing…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…This makes it more difficult for law enforcement and  public safety officers to obtain and use these devices.\n\nFor starters, many States prohibit public safety officers from using  firearms. In at least 12 States, correctional officers are unable to  carry firearms in the course of their official duties. Many State laws  also prohibit or restrict the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…time we increase the Medal of Honor recipients' pension in  recognition of their heroic military service and their continued  service to our Nation. The bill is fully offset by using a bipartisan  offset related to older veterans and pensions, and I urge all of my  colleagues to support H.R. 695, as amended.\n\nMr. BOST. Mr. Speaker, I encourage all Members…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688213/medal-of-honor-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…couriers or shell companies. They now  exploit financial platforms, adopting increasingly sophisticated  approaches to fund acts of terrorism.\n\nThese organizations adapt quickly, using every loophole in the global  financial system to mask the origin and the destination of their funds.\n\nFortunately, the United States is home to some of the world's most  advanced…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…know some Republicans like the idea of taxing trade, but what if  there is a next President who is a Democrat who says: By emergency  rule, I decree there will be no gasoline-using cars. We will have only  electric cars.\n\nThat is what we are preparing ourselves for. Every distortion of the  checks and balances of powers gets worse. Every time a party…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…use dating apps and websites to make connections.\n\nFor many, online dating has made it easier to build relationships.  Unfortunately, there are countless stories of criminals using these  sites for fraudulent activity.\n\nWhile it is sadly common to see users lie about things like their age  and occupation, romance scammers use fake profiles to develop…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692729/romance-scam-prevention-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Medals, and both  the Expert Pistol Medal and Expert Rifle Medal.\n\nFollowing his retirement in July of 2004, Mr. McInnis continued his  commitment to service through education. Using a degree earned while on  active duty, he taught in Wisconsin's prison system and later, as  Education Director, led the introduction of an associate degree pilot  program…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}]