[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…in charge of administering IDEA. This is the man who disregarded  established science to advance policies based on conspiracy theories,  including claiming that Tylenol and vaccines cause autism and that  autism destroys families.\n\nThis agency should not be administering funding or providing guidance  to schools on educating students with disabilities,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…polio. They expect them  to share stories, not measles. They expect them to get smart, not  smallpox.\n\nThe reality is, this has been the case for decades because we have  had vaccines to safely and efficiently keep students protected against  these terrible, terrible diseases.\n\nUnfortunately, there is an extreme movement that relies on conspiracy  theories…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Since taking office, RFK Jr. has failed to recommend the measles  vaccine for children, even after the deaths of two children. He said  pregnant women should not receive COVID vaccines. He has pulled funding  for vaccines for diseases like bird flu and HIV. He has spread lies and  stigma about autism. Last week, he released a report citing research  that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692028/demanding-resignation-of-robert-f-kennedy-jr"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the Supreme Court's emergency  orders.\n\nState governments are joining compacts to protect access to public  health for citizens as this administration rips away access to  vaccines. Airports across America are refusing to play this  administration's propaganda videos. And perhaps most importantly,  millions of Americans from across our country have made…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…programs to treat mental health and  substance abuse will be deprioritized or eliminated in favor of  Secretary RFK, Jr.'s, pet projects, like destroying Americans' access  to vaccines. He is going to prioritize that, and not SAMHSA and  substance abuse treatment.\n\nCongress has received zero information from the Trump administration  about how this new office…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bills are through the roof. Meanwhile,  President Trump just illegally invaded Venezuela, and Secretary Kennedy  is putting children's lives at risk by restricting access to vaccines.\n\nThere is a lot this Congress could be doing this week, but the first  bill Republicans bring to the floor in 2026 is about showerheads. It is  almost impossible to believe.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…life insurance. That  is one in three children in Wisconsin's urban, suburban, and rural  counties who need Medicaid just to see a doctor to get regular checkups  or to get vaccines and to stay healthy.\n\nI have traveled across Wisconsin, meeting with constituents who are  terrified about what these cuts will mean for their families, their  finances, and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…of the first things he did right off the bat was fan the  flames of a measles outbreak by ignoring the science, peddling quack  treatments, and spreading falsehoods about vaccines. The result, no  surprise, was the largest measles outbreak we have seen in decades, one  that tragically took the lives of two children.\n\nDid that spark one iota of reflection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…just weeks on the  job. This week, the agency's vaccine advisory committee is considering  changes that could weaken or even eliminate requirements for lifesaving  childhood vaccines.\n\nIt is easy to forget the fear and devastation of measles and polio,  not because these diseases are harmless but because vaccines have kept  them at bay.\n\nToday, parents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695435/cdcs-dangerous-turn-on-vaccines"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…university researchers lose Federal funding, not because  their work lacks merit, but because their conclusions contradict  preferred political narratives.\n\nWe have seen attacks on vaccines and changes to our public health  system that have caused needless outbreaks of disease. This President  has most assuredly not made America great again, but he has managed…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…died, including two young  children.\n\nFor years, Secretary Kennedy, without an ounce of medical training,  has spread lies and conspiracy theories about safe and effective  vaccines--vaccines that literally prevent measles. A qualified HHS  Secretary would highlight the effectiveness of vaccines and urge people  to continue getting vaccinated. A capable…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…drug-resistant       TB and Ebola, to Americans livestock and plant farmers from       bird flu and plant diseases, and the increase in global       mortality from cuts to vaccines, HIV prevention, malaria,       maternal care, newborn care and water and sanitation       programs.                    top line impact of global health cuts\n\nOur 50-country…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…on hold or canceled. We deserve to know these programs will       be there for us. If Federal grants are limited, medical and       science research limited, including vaccines and disease       prevention, they will all be severely impacted. The United       States should be a world leader in healthcare and education       and scientific advancement.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to address the dangerous  actions of the Health and Human Services Secretary in regard to  vaccines.\n\nVaccines play a critical role in protecting our entire population in  the United States. They are the most powerful tool we have against  serious infectious diseases. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…children's health.\n\nLast week, against universally recommended guidelines, the Department  of Health and Human Services slashed the childhood immunization  schedule from 17 vaccines to 11. Among those removed are vaccines to  protect against RSV, COVID-19, and hepatitis B.\n\nAmericans deserve accurate information that is based on established  science to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698959/immunization-schedule"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…unless we  stand up, and unless we say never again.\n\nNever again will we allow the power of government to be rained down  upon the American people with mandates of masks and vaccines in the  name of fear and in the name of healthcare.\n\nNever again will we allow open borders to trample our community,  endanger our citizens, and filter dangerous narcotics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}]