[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…name after marriage. Republicans claim that this new version  will ``fix'' this problem by adding in a provision about affidavits to  prove identity. However, the bill remains vague, leaving the process up  to the states. Regardless, millions of women would face additional  burdensome steps to register to vote.\n\nI want to be clear; this bill is not simply…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Villegas  Gonzalez, a father of two, was killed by ICE on the side of a road in  my district after dropping off his kids at school. Right on cue, we got  the same script: immediate vague allegations by DHS, lies instead of  facts, no transparency, no accountability, and no respect for the  family left behind.\n\nThere was also Marimar Martinez, another constituent.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…abroad to  distract from the misery that they are causing at home.\n\nMr. Speaker, does anyone remember the last time a Republican  President misled the Nation about WMDs, using vague evidence to drag us  into a war in the Middle East? He stood under a mission accomplished  banner, and then we were at war for nearly a decade, and it cost  trillions of dollars…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…but got nothing of substance. I did everything  in my power to allow him to demonstrate some understanding of the basic  guardrails of NSA's authorities and got nothing but vague assurances  about following the law.\n\nThere were other topics on which General Rudd's responses were  disappointing. He wouldn't associate himself with NSA's previous  commitment…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…new one once the last one reaches this figure.\n\nThe bill also fails to establish clear safeguards for those       stablecoins that seek federal oversight, with the same vague       injunctions to regulators. As implementation of the 2010       Dodd-Frank Wall Street Reform and Consumer Protection Act       demonstrates, regulators were slow to implement…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…significant, but each action needs to be seen together as  something deeper and broader. It is the sum and substance of  totalitarianism--not at some distant point in the future, not a vague  storm cloud on the horizon, but the destruction of democracy here and  now.\n\nAs we approach our democracy's 250th anniversary, we can't afford the  luxury of defeatism or…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…resources--not minerals--and it directs  the DOE to conduct ongoing assessments to develop strategies to  strengthen critical energy resource supply chains--not minerals.\n\nAgain, this vague definition risks diverting resources away from  critical minerals actually and towards--and here is where we will yank  the curtain back on what this really is about. It is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…administration, the just-announced  decision to withdraw from UNESCO stands out.\n\nThe justification given by the State Department spokeswoman was a  recitation of outdated, vague, and inaccurate criticisms of an  organization that has seen dramatic reforms over the past 7 years under  the outstanding leadership of Director General Audrey Azoulay. Since…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Help Act. This bill will help taxpayers  better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that the  math error…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…redundant, overly broad,  or better left to the States, or are so obscure that the public has no  practical way of knowing that they even exist. In some cases, these  laws are so vague that even a reasonable person would struggle to  understand what conduct is prohibited.\n\nThis massive and unorganized body of Federal criminal law puts well- intentioned, law-abiding…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…post-award activity, prohibiting covered individuals from sharing  ``expertise'' with ``hostile foreign entities,'' or those affiliated  with them, for five years. This is vague, onerous, and impracticable.  Simply from an implementation standpoint, it is highly difficult for  any research agency, nonetheless one that has had its staff gutted, to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695251/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…cars, to arrest people? Doesn't that set the people up for  danger in America?\n\nThat is what the assassins in Minnesota were doing. They showed up,  dressed like some kind of vague police person without any law  enforcement insignia, and in an unmarked car. That sets us up for  danger.\n\nDoesn't my colleague think the law enforcement norm is for people…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…permitting  approval.\n\nTogether, these projects will bring in thousands of new megawatts of  power to consumers in New England, New York, and Virginia. Trump's halt  work order cited vague, nonspecific national security concerns as  justification for this antiworker, anti-ratepayer, and antigrowth  decree.\n\nLuckily, Mr. Speaker, we have a government of laws.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…few weeks. We want to do  everything we can to stop that.\n\nWe know that when you kick Americans off of their health insurance,  it hurts all Americans. Democrats know that a vague promise to fix it  in the future doesn't help us solve the problems of healthcare delivery  today. And we know that the problem is worse than we even imagined just  a few weeks…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…sweeping in respected organizations like the United Nations and the  World Health Organization. It creates a complex and punitive reporting  system that burdens universities with vague requirements and excessive  penalties, while assigning enforcement to the Department of Education,  which is understaffed and lacks national security expertise. The Trump…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689203/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Constitution and did great harm to our Nation.\n\nThe decision was not rooted in the text of the Constitution. Instead,  the Court invented a constitutional right grounded in a vague,  undefined concept of privacy that the Court itself struggled to  explain.\n\nRoe silenced voters, sidelined legislatures, and eroded respect for  the judiciary by turning judges…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…approach to be business as usual for  Congress and VA. Their bill would simply reauthorize the program for  longer and with more money. It would also oblige VA to provide more  vague reporting requirements and briefing, in other words, more money  and more bureaucracy.\n\nIf this program had been perfect, maybe this would be a good idea. I  think we can do…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…thousands of  criminalized regulations, but no one actually knows because Washington  has never bothered to count them. This is the very definition of  overcriminalization: vague laws, hidden laws, duplicative laws, and  regulatory crimes that nobody could reasonably expect an ordinary  citizen to find or understand.\n\nThe Federal code has grown so bloated…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…cede the war power so completely to the President?\n\nIt is as if a magical dust of soma has descended through the  ventilation systems of the congressional office buildings. Vague faces,  permanent smiles, and obedient applause indicate the degree that the  majority party has lost its grip and become eunuchs in the thrall of  Presidential domination.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "French Hill", "party": "Republican", "sentence": "…different products,  they don't just risk getting it wrong, but they guarantee it. The  digital economy is too important and evolving too quickly for blanket  policies built on vague definitions and rushed processes. We need  thoughtful, targeted oversight that reflects reality, not a one-size- fits-all mandate that will do more harm than good.\n\nMr. Speaker,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…that Agencies can no longer manipulate a cost-benefit analysis  to push their own agenda. It requires Agencies to prioritize data- driven, measurable economic benefits, not vague ideological  justifications.\n\nWhile some Federal employees complain about the new directives from  the Trump administration, they should take a moment to understand that  hard-working…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…markets.\n\nSecondly, the CLARITY Act protects good actors from government  overreach. By establishing clear rules, we limit the government's  ability to subjectively enforce vague statutes. These protections are  important to those entities like exchanges, brokers, and dealers, who  we require to register. Yet, in many cases, they are more important…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…words, what we're going to       be is unemployed miners and unemployed computer programmers       as well' '' he recounted.\n\nBut Psaki swatted away the criticism and made a vague       promise that Biden would put a jobs plan forward in the       coming weeks.\n\n``He has every plan to share more details on that plan in       the weeks ahead,'' she said…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]