[{"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…prison in El Salvador without a trial, without a hearing, and without a  shred of justice.\n\nThis isn't just cruelty, but it is lawlessness. It is a direct  assault on our values and the rule of law. He was abducted from his  home and sent to a foreign prison infamously known for human rights  violations. When the President defies the courts, he crosses…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gratitude to the patriotic men and women at the State  Department, many of them my constituents, for their decades of service,  and I affirm our enduring commitment to the values they have worked so  hard to advance.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693533/mass-state-department-layoffs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Tribal  sovereignty and return land to the stewardship of the people who know  it best.\n\nThis bill is straightforward, and it is long overdue. It aligns our  policies with our values, and it honors the community that has spent  decades repairing the damage caused by a Federal infrastructure that  was built without Tribal consent.\n\nAs someone who has the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Women and girls in  dozens of the poorest countries are depending on these commodities to  take control of their lives. Destroying them is antithetical to  America's long-held values and reputation of safeguarding public health  around the world.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…expanded King  County Metro with the launch of eight RapidRide routes and growing the  Link Light Rail network to 51 stations.\n\nDow's leadership has always been grounded in the values of equity,  public service and collaboration. His legacy will continue to inspire  future leaders to carry forward the work of building a stronger  community that serves all…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans who think it is okay to give Jeff  Bezos a tax cut and, at the same time, cut food benefits for struggling  families, let me say clearly that we don't share the same values.\n\nUnloading billions of dollars in new costs on States, money they do  not have, will force them to cut benefits and throw needy people off of  SNAP. It is a rotten thing to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…anti-semitism.\n\nGiven Director General Azoulay's success in focusing UNESCO on its  mission of promoting international cooperation and peace in a manner  consistent with democratic values and human rights and dignity, one can  only conclude that the administration officials behind this short- sighted decision never bothered to do their homework--or they were…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…second term,  President Trump has upended the international world order and America's  leadership on the global stage. He and his allies are working  decisively to erode the values that are central to our Nation. Notably,  retired diplomats, military leaders, national security experts, and  even former Trump administration officials have denounced these…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…its harshest criticisms for our allies rather than Russia, with war  criminal Putin, who started the war.\n\nThe document elevates strongman leadership models over democratic  values, something unheard of in America. It is focused on spheres of  influence and suggests that the strongest person in the region gets to  decide the rules. These are not American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697955/national-insecurity-strategy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…gave this:\n\nMarket use damages are the largest in absolute terms,       totaling global annual losses of . . . $1.66 trillion in       2100, followed by damages in non-use values amounting to . .       . $224 billion, and non-market use values adding up to $182       billion in annual losses. That sums to over $2 trillion a  year, and it is for sure…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…strongly believe, because of the attitude of this President and his  ability to just work outside of the boundaries of what most Americans  feel are in accordance with our values and our ethics.\n\nWhat happened today to Senator Padilla was outrageous. It was  violent. It is a scary thing to see happen in the United States of  America.\n\nAlex Padilla is…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…risked everything to seek  refuge right here. These actions not only violate our moral  responsibilities and our shared humanity, but they are in direct  conflict with the values upon which our Nation was founded.\n\nI am the proud daughter of immigrants from Iran. My parents came to  the United States fleeing the brutal revolution that led to the current…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…pulls back, our  adversaries like Iran, China, and Russia double down. They move in to  fill the void, rewrite the rules, expand their influence, and undermine  democratic values.\n\nThis bill helps ensure that American leadership, not authoritarian  influence, shapes the future.\n\nI know we know that we are currently operating under a 2024 budget.  Over…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Georgia, and like they were in Moldova.\n\nWe have to be clear-eyed about that in our interests. In Virginia's  Seventh District, my voters expect me to stand up for American values,  and that is exactly what I am doing by speaking out today.\n\nThat is why I will keep fighting for strong U.S. leadership all  around the world. That includes Ukraine's sovereignty,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…and his billionaire buddies are  trying to take away the very structure that ensures our kids get that  education in the first place.\n\nIt isn't about politics. This is about values. This is about who we  are as a country. Do we invest in the next generation or do we abandon  them? We are better than this. Our children deserve better than this.\n\nI cosponsored…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…landscapes and historic places. From our  forests and lakeshores to our battlefields and monuments, these sites  tell the story of our liberty, resilience, and shared civic values.\n\nThis is a simple, bipartisan bill that expands access to our public  lands, encourages public participation in the semiquincentennial, and  reaffirms the ideals that continue…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…these ideas are becoming increasingly  mainstream. At the same time, support for the free-market principles  that built our Nation has declined. This shift endangers the core  values handed down by our Founding Fathers: liberty, personal  responsibility, and limited government.\n\nWe cannot ignore these warning signs. We cannot allow the failures of  socialist…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…our hemisphere, our  neighbors in our own region. This bill changes that and provides  special emphasis to key partners in the Western Hemisphere who are  aligned with our values and our policies, such as Costa Rica, Panama,  Paraguay, Argentina, and the Dominican Republic.\n\nThis bill increases funding for counter-fentanyl and synthetic drug  programs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…soccer field and in student government. During his college years, he  pursued two internships on Capitol Hill, where his curiosity,  dedication, and love for our Nation's values stood out.\n\nBryan began his career in Washington as a Staff Assistant for Senator  John Cornyn and quickly earned a reputation for being a hard worker who  was quick on his…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…20 years, subject to valid existing rights, to protect and       preserve the fragile and vital social and natural resources,       ecological integrity, and wilderness values in the Rainy       River Watershed, the Boundary Waters Canoe Area Wilderness       (BWCAW), the Boundary Waters Canoe Area Wilderness Mining       Protection Area (MPA), and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…competed with a broken arm; and Ariana Jones,  with profound strength and courage, competed while mourning the recent  passing of her mother.\n\nThese young women embody the values of hard work, perseverance, and  grit. I am in awe of their determination and spirit. They have shown us  what true resilience looks like.\n\nWe are incredibly proud to have…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688401/congratulating-duchesne-high-school-girls-wrestling-team"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Horn, of Huntsville, Texas, with a Congressional Veteran Commendation.  His servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nRichard entered active duty at Camp Pendleton, California in May of  1966 at twenty-one years of age. He served with honor and heroism  during the Vietnam War, serving in…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…for its rich  historical heritage and robust rural spirit. Since its beginning 125  years ago, the community of Veblen continues to serve as a strong  example of South Dakota values and traditions.\n\nI offer my congratulations to the citizens of Veblen on its  quasquicentennial and wish them continued prosperity in the years to  come.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…undoubtedly made Cooke County a safer place for all who call it home.\n\nMr. Speaker, Mr. Ray Fletcher's contributions to his country and  community reflect the very best of American values. I am proud to  represent such a distinguished citizen in the 26th Congressional  District of Texas. On behalf of a grateful community, I thank him for  his selfless service…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Federal Land Policy and Management Act, which is implemented pursuant  to what we refer to as resource management plans, or RMPs.\n\nThese RMPs are designed to maximize resource values for the public.  The BLM is required to comply with a multiple use mandate, ensuring  that these combination of uses meet current and future needs of the  American people.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…issued PLO  2214, setting aside 8.9 million acres to establish the Arctic National  Wildlife Range for the purpose of preserving unique wildlife,  wilderness, and recreation values, withdrawing the lands from ``all  forms of appropriation . . . including mining but not the mineral  leasing laws.'' PLO 2214 intentionally left open the possibility of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…economy and offer recommendations for strengthening  international cooperation to monitor and counter these threats.\n\nOur top priorities should always be to defend Western values, promote  American interests, and hold bad actors accountable. This legislation  is a critical step in confronting the CCP's abuse of the financial  system head-on.\n\nMr. Speaker,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…to FLPMA, BLM established procedures for the       development, revision, and amendment of RMPs.\n\nThe objective of resource management planning is to       maximize resource values for the public through a rational,       consistently applied set of regulations and procedures which       promote the concept of multiple use management. An RMP       generally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…walks in without food,  resources, or fuel can receive immediate assistance. Their generosity  has provided critical support to veterans in crisis and has exemplified  the values of honor, service, and community.\n\nPhil and Laurie Davis represent the very best of what it means to  serve. Their decades of dedication have strengthened our community and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697105/recognizing-phil-and-laurie-davis-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…maintain a loving demeanor and greet each client with a  warm smile and conversation (and sometimes a hug). The Center's clients  feel welcomed and cared for because of the lived values of love,  respect, compassion, and family centeredness that is regularly  displayed by these dedicated volunteers. The benefit to the community  is great and the impact far…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}]