[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…butts get thrown out a window. Trailer chains can spark on a  rock. Sometimes campfires get mismanaged. These things happen where we  can get with a car or a truck, so roads vastly increase the probability  of wildfires rather than reducing them.\n\nThe roadless rule specifically allows for the removal of fuels that  promote unnaturally intense wildfire.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…world. The pace of change has never been this rapid--AI, drones,  counterdrones, all manner of different technologies. We have got to get  those in the hands of the warfighter vastly more quickly and vastly  less expensively than we currently do, and the focus in this bill is  absolutely right to deal with this.\n\nWe also continue to prioritize quality-of-life…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…managing the river without  regard to political boundaries.\n\nAs a result of these commissions, water quality on the Delaware,  Potomac, and Susquehanna Rivers has, in many ways, vastly improved, but  threats such as population increases, land use changes, and the growth  of impervious surfaces, chemical contaminants, and nutrient and  sediment enrichment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…identifiable information, and classified material;  and three, termination of government employees under false pretenses  and in violation of civil service laws.\n\nThese actions have vastly exceeded the terms of the formal executive  orders purporting to create DOGE under the direction of a U.S. DOGE  service administrator, an office which remained vacant for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…up 8 percent nationwide since a year  ago, 14 percent in my home State of New Jersey, in part due to  increased exports of liquefied natural gas. Both of these figures are  vastly outpacing inflation, which is already sky high, thanks to the  President's tariffs and the healthcare and housing crisis.\n\nLet there be no mistake that Republicans and President…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…world-leading  facility studying the inner properties of nuclei, such as the quark and  gluon structure of protons and neutrons. The research conducted at this  facility has vastly improved our understanding of the fundamental make- up of matter and is actively supporting collaborative research globally  in medium energy physics. Currently, numerous PhD…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…million Btu of primary energy.\n\nThe United Kingdom generates almost 350 million Btu, almost twice as  much as we generate. The Danes generate over 500. Their economies are  vastly more efficient at turning energy into wealth than the United  States is--vastly more, like twice as efficient.\n\nImagine if we were so bad at turning labor into wealth as our…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and  treatment for diseases they may have been exposed to as a part of their  service. However, I must note that the context in which we are  considering this legislation is vastly different than the last time the  bill was considered by the House just under 7 months ago.\n\nIn fact, under Secretary Kennedy's leadership in the past week, the  CDC, or Centers…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…forward with a package that isn't perfect, but it is one that we can  all support.\n\nWhile there are certainly some things that I would change about these  measures, they are both vastly superior to yet another continuing  resolution or a lapse in funding, either of which would afford the  Trump administration greater leeway to abuse the budget process, which…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…costs for consumers.\n\nIn Trump's first term, he redefined ``showerheads'' to allow them to  use significantly more energy and water. Showerheads with multiple  nozzles could vastly exceed the current limits. For example, a  showerhead with eight nozzles could use up to 20 gallons of water per  minute under Trump's 2020 definition.\n\nThink about this, Mr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…write on my own. But they do mark significant improvement  over the status quo where Trump and his Agency heads can rewrite parts  of the budget without Congress, and they are vastly better than the  Trump budget plan, which was full of cuts and extreme policies.\n\nSo I will continue to work with my colleagues to make sure that the  programs that protect…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…advance the far- left agenda.\n\nDuring the same period, the United States has become the premier  energy-producing nation, while home appliances have simultaneously  become vastly more efficient.\n\nDuring the 4 long years of the Biden-Harris administration, however,  the Department of Energy used EPCA authorities to regulate a host of  everyday products…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…organ from which the traffickers make a       significant profit. The `donor' is left without medical care       and with significant health risks.\n\nIn China the situation is vastly different. For years, the       Chinese Communist Party (CCP) has systematically harvested       the organs of prisoners of conscience, primarily Falun Gong       practitioners,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…1967. We shouldn't be allowing California to constantly ratchet  up and then dictate to the rest of the States.\n\nI was just a kid back in 1967, but I was alive. The world was vastly  different even inside the United States. At that time one State doing  something didn't have the impact or the ripple effect that it has today  across the country.\n\nI think…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hair on fire comments that people  said that mathematically had no basis? They are not actually in the  budget documents. Let's understand the size of these committees are  vastly different, but the one people were focusing on, E&C, the Energy  and Commerce Committee, still has 96 percent of its spending authority  within its jurisdiction. That is going…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…an inconvenient reality for isolationists and restrainers, but  for a tiny percent--a tiny percent--of our defense budget, we helped a  smaller military resist invasion by a vastly larger one and degrade a  major U.S. adversary.\n\nAs with Israel, Ukraine is fighting an adversary of the United  States. Our support does not entangle us in a far-off foreign…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…take a data-based  approach to instruction, they can get tremendous results for students.  We see examples like KIPP or Success Academy. These are charter  networks that have vastly outperformed other public schools, despite  serving students who are well below the poverty level in many cases.\n\nIf Success Academy were its own district, it would rank at…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]