[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…be doing this.\n\nThese tariffs are attacks on groceries bought by every American.  Canada is the largest exporter of meat to the United States, while 77  percent of fresh vegetables are imported from Mexico and 11 percent are  imported from Canada. So costs are going up on every American who is  buying, and that means they will also buy less.\n\nThe tariffs…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Epstein's best friend  in the White House, is that the cost-of-living is out of control. Rent,  home insurance, and electric bills are all soaring. The cost of beef,  coffee, and vegetables just keep climbing.\n\nPeople are really struggling to get by, yet Donald Trump continues to  block SNAP benefits to 42 million struggling seniors, parents, and  veterans.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…those markets are shut off to them and those countries  respond to these unnecessary tariff wars provoked by President Trump,  they don't stop consuming. Whether it is fruit, vegetables,  electronics, or otherwise, they just find somewhere else to get it.  When those other countries, those other markets, find a replacement for  their supply, they are not…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…construction workers and roughly 42 percent of our agricultural  workforce.\n\nFarmworkers help feed our Nation and allow grocery stores to stay  stocked with affordable fruits and vegetables. Unfortunately, this  reality is not what my colleagues on the other side of the aisle want  to admit.\n\nOn Monday I offered an amendment to the budget resolution so we can…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…kitchen gets       delivered here and turned into compost which is used for the       farm's agriculture,'' Guerrero said. Those food scraps       contain vital nutrients for vegetables that would otherwise       rot away in a landfill. ``By throwing those nutrients into a       compost pile and into that kind of system, we can re-collect       the nutrients…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…week, the President adjusted some tariffs, but nothing he  did is reshoring American reinvestment here in our country. Our Nation  imports three-quarters of our fruits and vegetables. We need  agricultural reinvestment here in the good old USA.\n\nNAFTA caused the cataclysmic outsourcing of U.S. manufacturing in  autos and trucks. The President should focus…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the edge--what a horrible story to hear.\n\nCan you imagine those beautiful redheaded kids? And they have to  decide who is going to get the eggs, who is going to get the  vegetables, because she doesn't have enough money, and SNAP doesn't  give her the food she needs to feed her family.\n\nSo here is what I say to you, Donald Trump: If you are serious…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to see a spike in their healthcare premiums,  just like they have seen electricity rates going up at double the rate  of inflation, just like they have seen the price of vegetables go up by  39 percent, just like they have seen shortages of lumber and labor.\n\nWe have an opportunity to do something because our Republican  colleagues--at least some of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…bill provides many welcome investments.\n\nIt fully funds SNAP and WIC, replenishes the SNAP and WIC contingency  funds, and fully funds cash value vouchers for fruits and vegetables  for women and children.\n\nIt also helps rural America by providing $1 billion in single family  direct home loans, $120 million over the House level, and funding water  and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…higher prices on berries,  bell peppers, and . . . beer. Target CEO Brian Cornell told CNBC . . .  that tariffs on Mexico may force the company to raise prices on fruits  and vegetables.''\n\nThe Wall Street Journal said all of these things, Mr. Speaker. I  couldn't have said it better myself.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…The United Way of New York City  is anchoring one produce prescription project, Connect2Food, that  provides hungry people with $80 per month to purchase fresh fruits and  vegetables.\n\nThis innovative work is teaching us that increased investments make  it a little bit easier for families in need to make healthier choices,  while also supporting local…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to them.\n\nThe Netanyahu government cannot be allowed to, once again, turn on  and off the supply of food and medicine and use it as a military tool.  Withholding fruit and vegetables and other food from a million hungry  kids is not a military response; it is a collected punishment.\n\nNext, Mr. Netanyahu must finally--finally, once and for all--stop the…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…report made no mention of the administration's  drastically insufficient budget request for WIC or the need to fully  fund vouchers issued to participants for fruits and vegetables.\n\nHouse Republicans must do more than pay lip service to the goal of  making healthy food available to children and families. They must fund  WIC at the Senate's proposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…foods.\n\nThis is me being a little critical of people saying they are MAHA-- Make America Healthy Again--and then immediately cutting kids' access  to fresh, healthy fruits and vegetables.\n\nI love this doctor. It is almost like you are doubling down on the  injury to our children. We are cheapening highly processed and sugar- filled, nutritionally empty foods,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…make stuff cheaper. It says it right there: Lots of good ideas on  how to make stuff cheaper.\n\nGood idea number one: Get rid of tariffs, which are a tax on bananas,  coffee, vegetables, pasta sauce, pasta, televisions, automobiles, and  burgundy, a fine French claret for my Republican friends over there.\n\nNumber two: Stop canceling generation projects,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…about the water issues in California.\n\nThis is an issue that is important to our whole country. It is not  just important to California because most of the fruits, nuts, and  vegetables grown in this country are in the Central Valley of  California. Without water, you can't grow any of them.\n\nIf we are taking water away from the Central Valley for unnecessary…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…promised, in the  campaign and recently in an address to all of us here in Congress, to  make America affordable again; to deal with the high prices of  groceries, of fruits and vegetables, of housing, of housing supplies,  of energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out of frustration about high…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…atmosphere,  the Wagon Wheel quickly became a place where neighbors, friends, and  families gathered year after year. Over time, southern dishes like  fried squash, fresh seasonal vegetables, and homemade dinner rolls  became favorites on the menu, but it is the welcoming atmosphere and  care in every detail that kept people coming back.\n\nThe Katergaris family…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…diet-related chronic condition and is food-insecure or refers       such a veteran to receive a benefit, including a voucher or       debit card, for the purchase of fruits and vegetables to       improve a diet-related chronic condition.''.                                  ______\n\nBy Mr. DURBIN (for himself and Ms. Murkowski):\n\nS. 3707. A bill to provide…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and craft as a  Master Gardener are enjoyed by students and appreciated by staff.  Affectionately called Gardener Bob, he brings the art of growing one's  own fruits and vegetables to the Cypress Elementary Cubs. As part of  the school's 4th Grade Science Lessons, students learn the farm-to- table concept by preparing the soil, planting seeds, nurturing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…those facing time constraints,  frozen food offers an affordable, easy way to enjoy balanced meals.  Nearly every American household relies on frozen foods, whether it is  vegetables, fruits, breakfast items, or even complete meals.\n\nThis March, let's take a moment to recognize the hard work of our  Nation's frozen food producers and the critical role…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…milk for breakfast and for lunch and for  supper. We had bacon and eggs in the morning. For lunch, we would have  one of the other proteins: turkey or chicken or ham--but vegetables  from our garden. That was it. Fresh vegetables, and we had, I think,  four or five different fruit trees: a pear tree, a peach tree, several  others. So we would have fresh…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}]