[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…for many of our residents in  Detroit who have been living out of hotels for weeks after a massive  water main break flooded their neighborhood, their homes, and even  their vehicles. Now they are going to have to be paying more for their  water.\n\nThe Trump administration is already slashing every critical support  program that the most vulnerable in our…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that ``[h]uman activity is the principal cause'' of this  warming. That is what NASA scientists say.\n\nNASA scientists are pretty good. We are driving remotely controlled  vehicles around the surface of Mars that got sent there by NASA,  driving around collecting data and sending images back to Earth from  Mars. When you can pull that off, you are a…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…their faces from the world and even hiding their  identification, terrorizing communities across the Nation, smashing car  windows and dragging mothers and fathers from their vehicles in front  of their kids--in front of their kids--often taking those kids and  separating them from their parents, breaking down doors, and detaining  citizens and noncitizens…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…they are, but now they're lapping us-- especially in batteries where they control 85 percent of the global  market.\n\nFurther, the Chinese automaker, BYD, is making electric vehicles that  cost as little as $8,000, and they are gobbling up the global market  share.\n\nEven more troubling, BYD and another Chinese firms have announced  that they will soon…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Massachusetts-07, my Chelsea constituent Kenia and  her three children were driving to a Mother's Day church service with  her husband, Daniel, when ICE agents in unmarked vehicles ambushed  them, broke the passenger side window, forcefully extracted Daniel from  the car, and slammed his face on the hot sidewalk while their three  children watched on…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…go beyond the treaty's limit in a misguided pursuit of geopolitical  advantage.\n\nThird, there is no nuclear strategic gain from deploying more  warheads on more delivery vehicles. Our massive, largely invulnerable  nuclear arsenal is more than sufficient for deterrence.\n\nFourth, increasing our strategic forces might incentivize China to  accelerate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the  Judiciary Committee, immediately.\n\nMeanwhile, across the country, camouflaged and masked Federal  immigration agents continue to deploy Black Hawk helicopters, armored  vehicles, and a variety of chemical agents, including near schools,  playgrounds, apartment buildings, and churches.\n\nAnd the Department of Homeland Security refuses to provide  information…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…they represent real consequences for  real people: higher grocery bills and more expensive everyday  essentials.\n\nFor instance, Canada, Illinois's top export market for oil, vehicles  parts, and agricultural products, has already signaled retaliation,  threatening our supply chains and manufacturing sectors. A similar  pattern occurs with China, where…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…for telling the Nation's story, does not serve the American  people. Commercial films and photographs of the Capitol, the seat of  our democracy, are perhaps the best modern vehicles for telling the  Nation's story and showcasing its democratic system of government.\n\nI urge my colleagues to support this bill.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699181/introduction-of-a-bill-to-permit-commercial-filmmaking-and-photography-on-the-grounds-of-the-us-capitol"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…core, a President who has declared war on American  cities and flooded the streets with untrained, unqualified, and  unidentified agents.\n\nWhen agents show up in unmarked vehicles wearing masks without  warrants, without body cams, targeting people based on their race or  the sound of their voice, and detaining people without cause, that is  not law…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699018/history-is-watching"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…billions of dollars, not through government  but through the private sector--hundreds of thousands of jobs. New  factories went up around the country. Battery technology, clean  vehicles, energy-efficient products for businesses and homeowners--it  was already bringing down energy costs for consumers.\n\nIn terms of the global arms race for clean energy jobs…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…of American foreign policy.\n\nNow, Mr. President, I will finish with this because my colleague from  Maryland is going to add some remarks.\n\nI admit that these are imperfect vehicles. It is all part of the same  story. Trump would not be moving forward with these arms sales if he  wasn't getting what he wanted personally from these two countries. But…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…enforcement leaders and secured those  resources--and after a 6-month operation, 39 people across 4 criminal  networks were arrested, 67 firearms were confiscated, 15 stolen  vehicles were recovered, and more than $350,000 in drug money was  seized. That is the power of an effective partnership.\n\nNow that his term as our United States Attorney has ended,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Big Balls decides to delete a line of  code--Elon Musk is getting massive new government contracts including  an $8.5-billion contract for Tesla from the GSA for electric vehicles;  a $2.4 billion contract for SpaceLink--which was originally meant for  Verizon but which was canceled and mysteriously then transferred over  to SpaceX which happens to…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…manages motor vehicle use within the Glen Canyon National  Recreation Area. It is a commonsense rule that this resolution targets,  and it outlines where cars and off-road vehicles are allowed to travel  within the boundaries of the national recreation area. It shouldn't be  controversial. It shouldn't be political.\n\nThe Glen Canyon National Recreation…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…This waiver was granted in the waning moments of the Biden  administration, and I believe it was shortsighted and misguided.\n\nTo be clear, I am not an opponent of electric vehicles, and I  consider myself an environmentalist, but I feel strongly that my  constituents ought to have the ability to buy for themselves the  vehicle that will best meet their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "John Thune", "party": "Republican", "sentence": "…with stakeholders for their  input on an alternative clean water rule.\n\nThe EPA is also now working to terminate the Biden electric vehicle  mandate. The switch to electric vehicles that the Biden administration  envisioned was unwelcome, unworkable, and unaffordable for a lot of  Americans and, as I said, threatened to put an incredible new strain on…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…direct the United States Postal Service to issue  regulations requiring Postal Service employees and contractors to  report to the Postal Service traffic crashes involving vehicles  carrying mail that result in injury or death, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…mid-October, a semi-truck driver in California, in the United  States illegally, with an immigration detainer notice, was accused of  being intoxicated when he slammed into multiple vehicles, killing three  people and injuring several more.\n\nSadly, incidents like this are becoming far too common, and we must  ask why. The answer lies in failed policies.\n\nUnder…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and logistical facilities in both combat  and noncombat zones.\n\nCurrently, our military is forced to rely on an outdated and an  unreliable fleet of trucks. Upgrading these vehicles will provide our  servicemembers with up-to-date safety features such as blind spot  detection, collision avoidance, and antilock brakes that are common in  most modern vehicles.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…aid. There will be no more  tax dollars to fund DEI programs in Serbia. There will be no more taxes  to fund DEI musicals in Ireland and no more tax dollars to fund  electric vehicles in Vietnam.\n\nTaxpayers, Mr. Speaker, have said enough is enough. I say enough is  enough. Let's pass this bill, Mr. Speaker, and let's go get them.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692531/rescissions-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…every day to needy children. Instead, what we are  learning is they weren't providing those thousands of meals; they were  spending your hard-earned tax dollars on luxury vehicles and on pricey  real estate.\n\nAnd yet millions more were stolen by a single woman who paid parents  to enroll their children in her fraudulent autism therapy program even…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…any illusions as to what this means. We know that the goal is to  effectively end the sale of internal combustion engines.\n\nNow, I am not here today to disparage electric vehicles, and I am  certainly not here to discourage the manufacturing and the purchasing  of EVs either. What I am concerned about is the Federal Government  dictating which cars…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…was a registered voter in  Maryland despite his illegal immigration status and long criminal  record. It was a criminal record filled with narcotics trafficking,  driving vehicles he shouldn't have been driving, unauthorized  possession of a firearm, and other crimes.\n\nYet we act like this isn't occurring. I have dozens of other examples  right here…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…world to the Grange Fair. The Grange Fair has served as a  home away from home for families who, for a period of over a week, live  in a thousand tents and 1,500 recreational vehicles. It is a testament  to our unique and enduring spirit that the Grange Fair stands as the  only remaining tenting fair in the Nation.\n\nThis weeklong celebration encompasses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694934/recognizing-centre-county-grange-fair"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…several other States decide to join them, although still in a minority,  the manufacturers have to look at that and say: Are we going to  manufacture two different types of vehicles for each class, or are we  just going to follow what California has done?\n\nDe facto, this is a regulation on the Nation as a whole. De facto,  this decision by the EPA is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "James Risch", "party": "Republican", "sentence": "…portable, shoulder-launched, fire and forget, anti-tank       system for infantry, scouts, and combat engineers. It may       also be mounted on a variety of platforms including vehicles,       aircraft, and watercraft. The system weighs 49.5 pounds and       has a maximum range in excess of 2,500 meters. The system is       highly lethal against tanks and…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Democrats out of their own decision--their own  decision--to make this COVID-era spending temporary so that they could  give Green New Deal tax breaks to the wealthy for electric vehicles and  solar panels.\n\nThey had the option. They had the option to make it permanent twice,  whether it was in the American Rescue Plan or the Inflation Reduction  Act. Instead,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…reliable sources  of power and the most expensive. Nobody would use them, and nobody  would produce them, if they weren't subsidized by your tax dollars. It  funds zero-emission vehicles that only the wealthy can afford and  depends on supply chains dominated by China.\n\nIt actively promotes divisive concepts like energy equity and  environmental justice, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…instance.\n\nFirst, I would like to offer a little bit of background about how we  got here. Typically, the Clean Air Act stops State laws that regulate  emissions for motor vehicles in favor of a national standard by the  Environmental Protection Agency. This allows automakers to build the  same vehicles for use by drivers all across the country.\n\nSince…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}]