[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…4429, the  Developing and Empowering our Aspiring Leaders Act, or DEAL Act, which  is a critical bill to support innovation, entrepreneurship, and capital  formation.\n\nThe venture capital industry provides vital funding for early-stage  startups at points in their life cycle when they are generally deemed  to be too risky for traditional bank financing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…core engine of our economy has always been the entrepreneurs who  take the risk of starting their own company. By implementing key  changes to the legal definition of a venture capital fund, H.R. 4429  will make it easier for capital to flow into American small businesses.\n\nMr. Speaker, I urge my colleagues to support this bill, and I yield  back the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697193/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…too often, they can't get a fair shot at investment.\n\nRight now, our capital markets suffer from an extreme geographic  imbalance. The data is stark. Nearly 70 percent of venture capital  flows to three States, Mr. Speaker: California, New York, and  Massachusetts.\n\nThis leaves entire regions of the country struggling to access  funding. It leaves communities…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…university, or other institution of higher       education;\n\n(C) a nonprofit organization;\n\n(D) an angel investor group;\n\n(E) an incubator or accelerator;\n\n(F) a venture forum, venture capital association, or trade       association, other than an association created solely for the       purpose of sponsoring an event described under this       subsection;…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…DAVIDSON. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 4431) to amend the Investment Company Act of 1940 with  respect to the definition of qualifying venture capital funds, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 4431…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…added  challenge.\n\nAccording to the Center on Rural Innovation, 12 percent of U.S.  businesses are located within rural areas, yet they receive less than 1  percent of venture capital funding.\n\nMany of the communities that I represent have populations of under  500 people. It places them among this underserved group. These  overlooked people and places…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692758/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…(H.R. 4429) to require the Securities and Exchange Commission to  revise the definition of a qualifying investment, for purposes of the  exemption from registration for venture capital fund advisers under the  Investment Advisers Act of 1940, to include an equity security issued  by a qualifying portfolio company and to include an investment in  another…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…legislation.\n\nFar too often, access to capital depends not on the quality of a  business idea but on where that business is located. Data shows that  the vast majority of venture capital investment flows to companies in  just three States: California, Massachusetts, and New York, leaving  entrepreneurs in other regions at a disadvantage.\n\nThis bill takes…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Newcomers Act, also known as the ICAN  Act.\n\nI am proud to partner with my colleague Representative Brittany  Pettersen on this bipartisan legislation that expands access to venture  capital far beyond our Nation's traditional financial hubs.\n\nH.R. 4431 updates the qualifying venture capital fund exemption by  raising the capital cap from $10 million to $50…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697243/improving-capital-allocation-for-newcomers-act-of-2025"}]