[{"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Americans cannot afford that first rung of  the American Dream. This is an existential failure of the wealthiest  Nation on Earth.\n\nWith this big, ugly bill, Republicans are on the verge of moving that  dream further out of touch. They are making people sicker and poorer.  We hear the message. If Americans do not have great wealth, they do not  matter to the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693173/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…rely on deterrence  alone. Existing nuclear arms control treaties are either no longer  adhered to by Russia or the United States or, as in the case of New  START, are on the verge of expiring.\n\nThat represents a colossal failure of leadership by both the United  States and Russia. There is no greater threat to humanity than a  nuclear war, yet there…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…real issues of climate change,  outdated infrastructure, and competing water allocations. Furthermore,  this smelt is a critical part of the foodweb in an ecosystem on the  verge of collapse. H.J. Res. 78 would not only overturn the current  listing of the longfin smelt but prevent it from ever being listed in  the future, no matter how much the threat…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Cup and the Olympics when they are being  attacked by the Federal Government and when we are not providing them  the support that they need to get ready?\n\nHere we are on the verge of the third set of receipts, a funding  shutdown, which is imminent and can be stopped by the party in power,  the Republicans.\n\nThe Republicans have to make a decision. Are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…what it means  is these standards that were crafted in legislation here--I am sure  broadly and intensely debated--and said no, it has to be a rebellion or  it has to be on the verge of a rebellion and the understanding of what  that would look like--and to say it is a rebellion just because the  President says there is one and there is nothing, like that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…million Americans who are  about to lose their health insurance, the 1 million children who are  about to become uninsured, the hundreds of hospitals that are closing  or on the verge of closing, or the 24 million people who are staring  down premiums they simply cannot afford.\n\nIt does nothing to solve a crisis that the Republicans have inflicted  on the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698376/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…vary, it is believed  that there were more than 300,000 Native Hawaiians prior to the arrival  of Captain Cook, but by 1920, that number had fallen to just under  24,000, on the verge of losing bedrock cultural practices such as hula,  traditional chanting called oli and the Hawaiian language itself due to  mass population loss and laws preventing the teaching…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…no clarity over whom we  were supposed to be negotiating with. Was it Senate Republicans? Was it  the White House?\n\nAnd, in fact, it wasn't until last night, literally on the verge of  the shutdown, that we got our first offer of text from the White  House--far too late to be able to engage in any compromise before the  deadline.\n\nSo I wish we weren't…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…article I provisions making claim that the United States should not be  at war without a vote of Congress. Yet the news of the day suggests  that we are potentially on the verge of a war with Iran.\n\nWhen I was elected to the Senate in 2012, having served as a Governor  from 2006 to 2010 during a tremendous upsurge in the two wars in Iraq  and Afghanistan,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…happened, what deals were cut, what occurred in  the back room?\n\nIt will all come out one way or the other, Mr. Speaker.\n\nIt is incredible to me that this Congress is on the verge of ripping  food out of the mouths of children, veterans, and seniors as a result  of this one big, ugly bill in order to reward billionaires with massive  tax breaks and exploding…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it.\n\nGuess what. Nothing.\n\nWe are debating phony bills on appliances, on stupid stuff, when  people are hurting every day because they can't afford the basics.\n\nWe are on the verge of going to war, and this is what we are doing?  This is what we are doing, appliances?\n\nGive me a break.\n\nMr. McGOVERN. Mr. Speaker, may I inquire as to how much time I have…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…existing laws already provide but that this  administration is ignoring, and it increases the penalties to ensure  accountability.\n\nMr. Speaker, the Supreme Court is on the verge of overturning 80  years of precedent, stripping away independent agencies of the power to  say ``no'' to a President. When that happens, the guardrails will  disappear.\n\nMr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697854/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…already spent to  purchase them. At the time of this incident, three African countries  had reportedly already run out of contraceptives completely, and 13  more were on the verge of running out due to President Trump's and Elon  Musk's reckless destruction of USAID and cuts to foreign aid.\n\nSeeking to destroy safe, lifesaving contraceptives is emblematic…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…They are going up. Inflation is on  the way up. Life has gotten more expensive. Electricity bills are  skyrocketing and out of control. Now, healthcare premiums are on the  verge of increasing by thousands of dollars a year for 20 million  Americans unless Republicans choose to join us and act with respect to  the tax credits that will expire at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…have to  deal with hypertension and other chronic diseases that lead to a high  maternal mortality rate.\n\nWe saw health outcomes improve. We saw hospitals, which were on the  verge of closing because of the high number of uninsured, overcome that  risk.\n\nDuring the summer recess, I visited a dental clinic in far southwest  Virginia in Abingdon. Before…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Everstine, Brian: Aviation Week; Ewing,       Giselle: Politico; Fahlberg, Audrey: National Review; Faler,       Brian: Politico; Farah, Niina: E&E News; Feiner, Lauren: The       Verge; Feldscher, Jacqueline: Arkaea Media Group; Ferguson,       Brett: Tax Notes; Fertig, Natalie: Politico; Fields,       Ashleigh: The Hill; Fitzpatrick, John: Bloomberg Industry…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the leadership of President Trump,  America and the world are safer today than we were a week ago. Iran,  the world's leading state sponsor of terrorism, is no longer on the  verge of obtaining a nuclear weapon. They have agreed to a ceasefire  with Israel. President Trump is fulfilling his campaign promise of  promises made, promises kept to make America…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Communist Party characteristics. We need to protect the core  principles that make this country exceptional: liberty,  limited government, and the right to privacy.\n\nWe are on the verge of the next game-changing technological  evolution, and we must embrace this push for a more developed digital  economy. In doing so, we cannot jeopardize who we are as Americans,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…From everything we know so far, it is appallingly clear that event  attendees were deliberately targeted. And two young Embassy employees-- tragically, two employees on the verge of getting engaged and starting  a life together--were murdered in the attack.\n\nI am grateful that the suspect is already in custody and for the help  the Capitol Police provided…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691633/capital-jewish-museum-shooting"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…progress abruptly ended with the takeover  by the theocratic despots who introduced a reign of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green  Movement, they looked to the United States for support but got only  silence.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}]