[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…offices were warned that       seniors were reporting receiving emails from accounts       pretending to be linked to Social Security. The messages       asked recipients to verify their identity to keep receiving       benefits.\n\n``Sounds like scammers are jumping on this press release to       trick the elderly,'' one Social Security staffer wrote to…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…group Parents  Defending Education, which makes these allegations, offers speculation  rather than verifiable incidents or actual influence.\n\nHowever, even if we are able to verify that China poses a credible  threat to our K-12 schools, this bill, as written, does nothing to  actually address any national security threats. Instead, it seeks to  punish…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…rules did not relate to agency management or personnel.       For example, in B-329916, we concluded that an Internal       Revenue Service (IRS) announcement that it would verify       health insurance coverage requirements at the time taxpayers       filed their individual tax returns rather than after their       returns were accepted did not constitute…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…here today.\n\nThis bill would make it tougher than it has ever been in American  history to register to vote at a time when we have the technological  ability to be able to verify election eligibility, but we don't want to  do that. We want to make it tougher for people to actually get  registered to vote, and that is not what we should be doing. We…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690003/safeguard-american-voter-eligibility-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…administration claims, they should be released immediately.\n\nI am calling for the full conversation to be shared with Congress so  that we can fulfill our oversight role and verify the administration's  accounting of events. If the administration truly believes no lines  were crossed, no war plans discussed, and no classified information  shared, then…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689071/protecting-details-of-ongoing-military-operations"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…force of his  power in office.\n\nHe was facing an election in just a few weeks, and I told him at that  time that, if he did not have international observers at his election  to verify that it was an honest election, the world would not believe  the results. He ignored my advice, which was no surprise. He went ahead  with the election and had a disputed result.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…hurricanes who will go without the services of  FEMA, the veterans who will lack many of the helping hands in the VA,  the recipients of Social Security who will be unable to verify their  cards or perhaps receive payments that they have been denied, and  others--millions of other Americans--who unnecessarily will be hurt,  perhaps people who depend on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…include every single  college in China.\n\nBecause this is a new definition that is not shared with any other  Federal agency, universities would be required to independently verify  that their Chinese counterpart institutions do not meet this broad  definition just to cooperate on activities as simple as study abroad  programs. The University of California…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…being penalized.\n\nThe harm isn't limited to businessowners. The bill creates a new set  of compliance burdens that SBA lenders are not equipped to handle.  Banks will have to verify the citizenship status of every owner down to  the last percentage point, something they have told us could expose  them to legal risk under civil rights laws like the Equal…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…step for Congress to take, but President Trump is  squandering American leadership and taking us backward.\n\nMr. Speaker, H.R. 1724 calls on the State Department and USAID to  verify they are not funding any programs or projects that unwittingly  use goods or materials made using forced labor in Xinjiang. This is a  preventative measure to ensure that America's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690653/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…has been  stagnant, even as the costs of housing, goods, and services have risen  over the past 20 years.\n\nThis bill ensures that these programs are reviewed periodically to  verify their value sufficiently and to make sure they are updated to  the current CPI or Consumer Price Index.\n\nMr. Speaker, I urge my colleagues to support this bill. I thank my…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the accuracy of the Death Master File,  improve data sharing across Federal agencies, and ensure that benefits  programs have the timely, reliable information they need to verify  eligibility, and a pulse, before payments go out the door.\n\nThe results, Madam Speaker, speak for themselves. The Treasury  Department recently announced it recovered $31…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…is say that when they are giving out SBA  loans, they have to require age verification and citizenship status  verification. That is it. How complicated and drastic is that? Verify  age and citizenship status, that is it. It is codifying an important  executive action that is already taking place.\n\nIn recent months, it has been discovered that under the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…meant to stop the  waste, fraud, and abuse of your hard-earned taxpayer dollars.\n\nIn 2024, the Joe Biden administration scrapped a rule that required  childcare centers to verify that kids actually attended their  facilities in order to receive Federal funding. Think about this: They  removed the provision that says you have got to tell us you are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Delivering On  Government Efficiency in Spending Act, DOGE in Spending Act.\n\nThe war on waste, fraud, and abuse begins today by requiring the  Treasury Department to simply track, verify, and cross-check payments.  That is what the DOGE in Spending Act will do.\n\nMr. Speaker, the American people deserve accountability and  transparency. I urge all my colleagues…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692480/accountability-and-transparency-in-government"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…after we sent fictitious documents or no documents to resolve       issues with our applications. Further, in July 2017, we found       that CMS did not design processes to verify eligibility for       APTC, including preventing duplicate coverage.\n\nYou asked us to review issues related to fraud risk       management in APTC. This report is based on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…that is, we in the Congress, in this body, have the  constitutional authority to set certain rules of the road nationwide.  The SAVE America Act merely creates a mechanism to verify that State  elections comply with existing law.\n\nNow, there are other electoral reforms that are also necessary and  critical, including Senator Hagerty's proposed Equal Representation…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…One accusation I find particularly ironic from our friends across the  aisle has been this idea that we have somehow added redtape to Medicaid  by requiring recipients to verify their eligibility for the program two  times a year.\n\nPeople come in and out of the Medicaid Program based on that means  testing, based on their earnings threshold. So checking…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Services told my office they have sent evidence of  this fraud to law enforcement.\n\nAs these records indicate, the Trump administration has created new  DNA testing policies to verify sponsor parents. Now any sponsor of a  migrant child claiming to be a biological parent should undergo DNA  testing to confirm they are actually related.\n\nSadly, these stories…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…national file  that identifies the death of individuals throughout the country. This  access will allow Federal agencies to have the updated, complete death  data necessary to verify benefit eligibility and prevent erroneous  overpayments.\n\nWe are well aware that the Federal Government has a major spending  problem, and we face a massive problem continuing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…room, and someone  else who made the exact same amount of money didn't have to pay a dime  because they either lied on the application or maybe they no longer did  a check to verify what their income was? That is not fair.\n\nHowever, the good news is that with this new bill, there are  incentives to get back into the workplace. The latest numbers that came…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…motive.\n\nYou have to show an ID to board a plane, to buy alcohol, to cash a  check. You have to show an ID to buy cold medicine for God's sakes. Why  should people not have to verify their citizenship to register to vote?  I say to register because my friend over here keeps pointing out that  women in every single congressional district will have to provide…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…ObamaCare exchange and insurance brokers.       Nearly all of its invented people were able to enroll in       subsidized plans despite submitting false or no records to       verify their identities and incomes.\n\nOf GAO's 24 applications, 23 were approved. Eighteen       enrollees were still covered as of September, suggesting that       the exchange and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the Republican  proposal being insulting, is insulting.\n\nAnd then these fake applications that were approved without any  income verification--the law says you have got to verify somebody's  income. Under the law, the amount of money that a person would get, in  terms of bonuses, is supposed to be based on income. In one case, the  fake applicant's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…the type and appropriateness of the Fund's activities,       including what kind of information will inform the board's       decisions and how the board will collect and verify this       information; and\n\n(E) a description of what controls have been put into place       to ensure funds are not diverted to or misused by the Taliban       or other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and Immigration Service announced improvements to their voter  verification system. Now, States can use a program named the Systematic  Alien Verification for Entitlements to verify that only citizens are  voting in the Federal elections. This is welcome news.\n\nSo here is why it is welcome news: During the 2024 election, Iowa's  election official, Secretary…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}]