[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Tim Hauser as the  Champion of the Week for Ohio's 13th Congressional District.\n\nTim was recently named the Veteran of the Year by the Veterans  Service Commission of Summit County. He is a Gulf War veteran and  founder of the Veterans Assurance Network, which provides advocacy,  support, education, services, and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today in full support of the  Successful Entrepreneurship for Reservists and Veterans Act, otherwise  known as the SERV Act. This bill would study the barriers that veterans  face when starting or owning a small business.\n\nStarting a small business is not a…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…The ANCHOR Act passed out of committee with bipartisan support, and I  urge my colleagues to vote to get it over the finish line.                            Betraying Our Veterans\n\nMs. McBRIDE. Mr. Speaker, earlier this month, I joined veterans,  families, and care providers to celebrate 75 years of service at the  Wilmington VA Medical Center, a facility…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…in  the history of that program has a payment been missed, but the actions  of DOGE are disrupting that very agency.\n\nThere is also a very palpable fear in my constituents. Veterans who  are 100 percent disabled are concerned and fearful that they may or may  not be able to continue to receive their medical care.\n\nThis is a serious and profound moment.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…order terminating  collective bargaining rights for Federal police officers, firefighters,  nurses, food safety inspectors, and so many more.\n\nThe nurses who care for our veterans, the flight safety inspectors at  the FAA, nuclear power plant safety workers, and countless others lost  their right to have representation in the workplace. This is unfair,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…number of the bills negotiated in committee make  significant reversals of DOGE's horrible cuts. Of particular importance  are the reversals these bills make to DOGE's cuts to veterans programs,  which were so vicious and so mean and hurt so many veterans. And it  also makes reversals on other important Democratic priorities.\n\nWe will see how Republican…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…are choosing, again, to give tax breaks for the  wealthiest on the backs of working Americans.\n\nOne in six community members in my district rely on SNAP. Seniors,  children, veterans, and people with disabilities will go hungry. Food  stamps aren't a handout. SNAP helps veterans who served our country and  neighbors with disabilities. It feeds seniors…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…for the men and women who will be sent to  fight this war--will engage in it--is going to cause problems.\n\nHe has shown us he could care less about the Iraq and Afghanistan  veterans who are screaming from the rooftops right now not to make this  mistake again. If we allow this to continue, I will have to look into  the eyes of young men and women in Arizona--working-class…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698605/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Kansas. Mr. Speaker, I thank the gentlewoman from New  York (Ms. Velazquez) for yielding.\n\nI rise in support of the bipartisan Successful Entrepreneurship for  Reservists and Veterans Act, or the SERV Act, which I introduced  alongside Representatives Alford and Conaway. This bill honors our  veterans' service by helping them succeed as entrepreneurs and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…going to constitute the largest  cut in food assistance in history. People are going to see their  nutrition benefits reduced, which will impact children, senior  citizens, veterans, and those with disabilities.\n\nIt is relevant to what we are talking about here today because in  this rule you provide the authority to immediately bring the budget  reconciliation…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, I rise to express my support for H.R. 3123, the Ernest  Peltz Accrued Veterans Benefits Act, as amended.\n\nIt is no secret that our offices get a lot of calls about casework on  veterans' benefits. Sometimes these calls are a simple matter of  getting…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…access to SNAP  benefits for 40 million Americans, including at least 32,000 of our  neighbors in Minnesota.\n\nMillions of children, seniors, people with disabilities, and veterans  are at risk of going to bed hungry if this bill passes.\n\nThe deeper you dig into this bill, the more ugly, cruel, and  completely avoidable consequences you'll find.\n\nIt…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise to speak in support of the  bipartisan Housing Unhoused Disabled Veterans Act, which I introduced  today.\n\nLet me begin by expressing my sincere appreciation for veterans and  members of our Armed Forces who have answered the call of duty and  sacrificed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690059/by-mr-padilla-for-himsmcelf-mr-cormick-mr-gallego-mrsthank-senators-gallego-cormick-and-britt-for-introducing-this"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…World War I, the Korean war,  and the Vietnam war.\n\nToday, Oscar is a proud member of the Greater Gary AMVETS Squadron  Post 6 where he can frequently be found supporting veterans throughout  northwest Indiana as they return home from service.\n\nIt is because of the sacrifices of veterans just like Oscar that we  are able to live in a free, democratic…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…came back from service  after World War II, including my father-in-law, and what they found was  an America that was still deeply violent, deeply racial.\n\nIn fact, one of the veterans who came back who had served in the  military and fought in World War II had his eyes gouged out when he  came back, an act of violence that shocked the country, but didn't…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and fails to provide a rational       explanation for retaining those withdrawals other than for       the limited purposes of selection by Alaska Native Vietnam-      era veterans.\n\nThe 2024 Central Yukon RMP violated the National       Environmental Policy Act (NEPA) in adopting a new alternative       not made available to the public for review and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…I now urge my colleagues in the Senate to support this legislation  and deliver on the promises that we made to the American people.                             Supporting Veterans\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, the House will vote on our  2026 appropriations bill for the military construction and veterans  affairs programs.\n\nOur Active-Duty…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…currently serves  as Director of K9 Acquisition and a Certified Dog Trainer with more  than 20 years' experience at K-9 Partners for Patriots. Jeanne's  dedication to matching Veterans with the perfect rescue dog goes far  beyond expectations. She has an encyclopedic understanding of dogs and  their behaviors and serves multiple roles from training to K9…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I thank Chairman Bost for yielding me  time today to speak in support of my bill, H.R. 1228, the Prioritizing  Veterans' Survivors Act.\n\nSince being elected, I have heard from military servicemembers and  surviving family members about their struggles accessing VA benefits.\n\nIn my district,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…American servicemember  home. With a heavy but hopeful heart, I continue to pray for all those  who await answers about lost servicemembers and thank America's  servicemembers, veterans, and their families for their extraordinary  commitment to our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…that Trump is the worst President in history for children. They have  said that Republicans are to blame for the fentanyl crisis, that  Republicans shouldn't take photos with veterans. January 6, of course,  they mention that. They have said Republicans are corrupt. They have  said that Republicans are starving kids.\n\nWhat they haven't said is the one thing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696720/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Throughout the month of May, Americans nationwide acknowledge  and honor the dedication of the brave men and women who have served  this Nation.\n\nIdaho is home to over 115,000 veterans and 8,700 service members. I  am deeply grateful for the heroes who protect our freedom and am proud  to support our military families and veterans in our great state.\n\nMilitary…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Mr. BENTZ. Mr. Speaker, I rise today to recognize the Korean and  Vietnam War veterans from Oregon's Second Congressional District who,  are visiting their memorials and the WWII Memorial, because of the  efforts of the Honor Flight of Southern Oregon. Whenever…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Business Committee for Main Street America.\n\nI rise today, Mr. Speaker, because as a Member of Congress, it is our  duty and responsibility to protect and support our Nation's veterans.\n\nBack in 2023, it was my distinct pleasure to have Commander Taylor  Burks of Missouri's Fourth Congressional District testify at a Small  Business Committee hearing on veteran…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…General study on Coast Guard efforts to reduce                prevalence of missing or incomplete medical records and                sharing of medical data with Department of Veterans                Affairs and other entities. Sec. 604. Comptroller General study on Coast Guard training facility                infrastructure. Sec. 605. Comptroller General…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the bill  (H.R. 3767) to amend title 38, United States Code, to provide for a  time frame for the employment in the Department of Veterans Affairs of  participants in the Health Professionals Scholarship Program, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Federal housing  dollars are spent.\n\nFor years, the Department of Housing and Urban Development, HUD, has  administered programs that touch millions of families, seniors, and  veterans in communities across our Nation. These programs are critical.  They support affordable housing development, combat homelessness, and  help communities recover after disasters.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…volunteered  extensively in the base and local community, including youth programs  and church education.\n\nFollowing her military retirement, TSgt. Ybarra continued her service  to veterans as a National Service Officer for the Military Order of the  Purple Heart. By 2007, she had a solo office at the Waco VA campus,  where she assisted veterans, spouses, and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service, and community. He now resides in Beverly Hills,  Florida, where he remains an active and respected member of VFW Post  10087, continuing to advocate for his fellow veterans and keep the  memory of their sacrifices alive.\n\nLewis and his beloved wife, Ellie, are shining examples of American  patriotism and community spirit. Together, they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…38, United States Code, to modify the  criteria for approval of certain independent study programs for  purposes of the educational assistance programs of the Department of  Veterans Affairs, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1458\n\nBe it enacted by the Senate and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}]