[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…been too silent.\n\nLast week we were here, and we had hearings in the Committee on  Foreign Affairs, Committee on the Judiciary, Committee on Small  Business, Committee on Veterans' Affairs, Committee on Natural  Resources, in those committees and in others.\n\nI don't know if many of these discussions or outcomes from these  committees have made it into the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Chair, I rise today to express my continued and  resolute opposition to the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations Act in its  current form.\n\nI represent a district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to thank Rebecca Sawyer  Smith of Lakewood, Colorado for her 38 years of service within the  Department of Veterans Affairs and congratulate her on her retirement.\n\nRebecca began her federal government career as a graduate student at  The George Washington University in Washington, D.C., when…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 695, the Medal of  Honor Act.\n\nTo join the armed services is an act of profound selflessness. On the  Veterans' Affairs Committee, we recognize the sacrifice and service of  every servicemember who, in the face of uncertainty and danger, took  the oath and chose to commit themselves to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…earned in service to  our Nation.\n\nIndiana's First Congressional District is home to nearly 40,000  veterans. Every single day, I fight to ensure that the Department of  Veterans Affairs fulfills its sacred promise to those who wore the  uniform. That means making sure the VA has the staffing, resources, and  funding necessary to deliver the high-quality…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692946/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…I thank Ranking Member McGovern for yielding  to me.\n\nMr. Speaker, I rise in opposition to this resolution. I am here as  the ranking member of the House Committee on Veterans' Affairs to  represent the interests of our Nation's veterans when they are  callously being targeted.\n\nWhile our colleagues across the aisle are determined to shift the  public…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. GOTTHEIMER. Mr. Chair, I rise in support of the en bloc package  which includes three amendments I offered to the FY 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  bill.\n\nMy first amendment requires a resident advocate in every veterans  home across the country. This advocate will be a direct…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…Act, Section 851 of the NDAA will only  apply to contracts subject to the Federal Acquisition Regulations  System--that is the Department of Defense and Department of Veterans  Affairs. This means that while Medicare and commercial-plan  beneficiaries will be able to access  the drugs captured by the BIOSECURE Act, veterans and service members  could…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698004/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…(Ms. Wasserman Schultz), my very good friend and author of H.R.  2701. She serves as ranking member on the House Appropriations  Subcommittee on Military Construction, Veterans Affairs, and Related  Agencies.\n\nMs. WASSERMAN SCHULTZ. Madam Speaker, I thank the ranking member for  his indulgence in yielding time to speak in support of my bill, the  Fallen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…or impound appropriated funds to dozens of Federal agencies, including  the National Institutes of Health, the Federal Aviation Administration,  and the Department of Veterans Affairs. By impounding congressionally  appropriated funds, Donald John Trump and DOGE have not only violated  the law but have negatively impacted the American people by cutting…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…following votes, but had I been present, I would have voted no on  rollcall vote No. 458, On the Motion to Invoke Cloture, Cheryl Mason to  be Inspector General, Department of Veterans Affairs. I missed the  following votes, but had I been present, I would have voted no on  rollcall vote No. 461, On the Nomination, Confirmation: Cheryl Mason,  of North Carolina,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695340/vote-explanation"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, this past December, the Department of  Veterans Affairs released a proposal to cut 25,000 openings nationwide  for much-needed nurses and medical staff.\n\nIn the New York City area, this would mean a loss of approximately  380…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699027/scrimping-on-veterans-medical-care-is-un-american"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Compensation benefits to be on par with other  Federal survivors' programs.\n\nWe have Republican Members like Richard Hudson, who has introduced  the Love Lives On Act, with Veterans' Affairs Committee member  Representative Kelly Morrison, that would repeal the ridiculous  penalties survivors face when they choose to remarry.\n\nMy hope is that we can consider…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…government a force for good, one that  drives progress and innovation and provides exceptional care to our  Nation's veterans.\n\nFor nearly 20 years at the Department of Veterans Affairs (VA),  Maryam brought her expertise in science and the law to the VA's senior  leadership. As a Staff Attorney for the VA's Office of General Counsel,  Maryam was in charge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to follow good practices when becoming a landlord,  such as using a written legal lease agreement, and this legislation  does provide instruction for the Department of Veterans Affairs to work  with the Department of Justice to provide resources on  landlord-tenant practices and securing vacant property.\n\nHowever, nothing in this bill removes the requirement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Authority............................................           0.514           2.570           3.598     Outlays.....................................................           0.514           2.570           3.598 Veterans' Affairs     Budget Authority............................................         231.668       1,334.594       3,081.121     Outlays.....................................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…Americans left behind.\n\nMy bill is an embodiment to that promise. This isn't partisan  posturing. This is about doing right by America's warfighters. The  House Committee on Veterans' Affairs agreed. They voted for my bill by  voice vote without opposition. There was zero dissent. There was  complete consensus and stakeholder support. It is now time for the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…tabular material on the same.\n\nMr. ALFORD. Mr. Chair, I yield myself such time as I may consume.\n\nI am honored to present the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations bill to the House  today. This bill supports our troops, their families, and our Nation's  veterans.\n\nThe bill includes nearly $18…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…served admirably and  honorably in our military. He continued a lifetime of public service.  He applied for his accrued veterans pension benefit, and the Department  of Veterans Affairs approved it while he was still alive.\n\nI even got a call from his family as Ernest Peltz was on his death  bed, that he was asking to make sure the VA benefits would be…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…they deserve in a  timely and efficient manner.\n\nMr. Speaker, I urge my colleagues to support this bill. I also thank  Chairman Bost and his staff at the Committee on Veterans' Affairs for  their work on this very important issue.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Prioritizing veterans and troops says everything about our  values, and that is exactly what this first fiscal year 2026  appropriations bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, 2026, is a testament to caring for those who have  selflessly worn America's uniform, their families, and the defenders  who…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…district, I started a Veterans Advisory Council, and we often  discuss this very topic to find ways to better this situation. I am  always looking to ensure that Department of Veterans Affairs leaders  hear the concerns of veterans' loved ones.\n\nFrom its creation, the Office of Survivors Assistance, OSA, was meant  to serve as the principal adviser to the VA…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…constantly  working to grow membership and expand community outreach.\n\nIn addition to his work in the VFW, Walt's passion for supporting  Veterans continued in his role as a Veterans Affairs Caseworker for the  United States House of Representatives. In this capacity, Walt worked  tirelessly to assist Veterans and Servicemembers in navigating the  complexities…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…OF DISABILITY COMPENSATION AND                     DEPENDENCY AND INDEMNITY COMPENSATION.\n\n(a) Rate Adjustment.--Effective on December 1, 2025, the       Secretary of Veterans Affairs shall increase, in accordance       with subsection (c), the dollar amounts in effect on November       30, 2025, for the payment of disability compensation and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696763/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, pursuant to House Resolution 936,  I call up the bill (S. 1071) to require the Secretary of Veterans  Affairs to disinter the remains of Fernando V. Cota from Fort Sam  Houston National Cemetery, Texas, and for other purposes, and ask for  its immediate consideration in the House.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 3494) to authorize the Secretary of Veterans Affairs to  carry out an information technology system and prioritize certain  requirements to manage supply chains for medical facilities of the  Department of Veterans Affairs,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Virginia, to       be Administrator of the Federal Highway Administration\n\nExecutive Calendar No. 180, Donald Bergin III, of Virginia,       to be an Assistant Secretary of Veterans Affairs       (Congressional and Legislative Affairs)\n\nExecutive Calendar No. 185, John Squires, of Florida, to be       Under Secretary of Commerce for Intellectual Property…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Department of Justice, the Department of Labor,       the Department of State, the Department of Transportation,       the Department of the Treasury, or the Department of Veterans       Affairs, or any other individual who occupies a position       designated by the President as a Cabinet-level position.\n\n(7) FAA.--The term ``FAA'' means the Federal Aviation…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 877) to amend title 38, United States Code, to expand the  authority of the Secretary of Veterans Affairs to provide or assist in  providing a vehicle adapted for operation by a disabled individual to  certain eligible persons, by paying expenses associated with the  delivery…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…ACTIVE DUTY AIRCREW IN THE ARMED FORCES.\n\n(a) Agreement.--\n\n(1) In general.--Not later than 30 days after the date of       the enactment of this Act, the Secretary of Veterans Affairs       shall seek to enter into an agreement with the National       Academies of Sciences, Engineering, and Medicine (in this       section referred to as the ``National…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}]