[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…location.\n\nI certainly understand why Vietnam war veterans would be concerned  about their exposure to this disease and believe we should do  everything possible to ensure veterans have access to care and  treatment for diseases they may have been exposed to as a part of their  service. However, I must note that the context in which we are  considering this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…entrepreneurs  face.\n\nThe SERV Act is one such initiative. It would enhance outreach and  promotion of existing veteran-focused small business programs, ensuring  that veterans can access all available services, resources, capital,  and credit.\n\nThis bill would provide a report on the availability of veteran and  reservist small business owners' access…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3951, the Rural Veterans'  Improved Access to Benefits Act of 2025, as amended.\n\nThere are few things we on both sides of the aisle agree on  completely, and I am happy to report this bill highlights one of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695497/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…themselves.\n\nYesterday, we learned the Trump administration is canceling more than  800 VA contracts.\n\nDo you know what these things fund, Mr. Speaker?\n\nGetting toxic exposed veterans access to their records to prove their  claims, cancer care for veterans, and calibrating radiation detection  equipment. I could go on and on.\n\nIt is a betrayal to attack veterans'…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688314/staffing-cuts-at-the-va"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…challenges head-on, ensuring veterans  have the resources that they need to thrive. At a time when harmful  Federal worker layoffs at the VA are making it harder for veterans to  access support, this legislation is more important than ever. By  strengthening SBA programs, we are investing in our veterans, creating  jobs, and boosting our local economies.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…going to construe this Congress' decision to en masse  disapprove of a resource management plan that did provide for the  allotment for Alaska natives who are Vietnam-era veterans to access  these lands.\n\nI understand the chairman is making the case here on the floor. He  made it during the debate on the Rules Committee. I remember this back  in July. He…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…support and incurs no cost. I thank Mr. Davis for his work  on veterans' issues during his time in Congress. I am proud of his work  to open doors at the VA for more veterans so they may access the  benefits they have earned through their service.\n\nMr. TAKANO.  2625.\n\nMr. DAVIS of North Carolina. Mr. Speaker, I thank Chairman Bost and  Representative Takano…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…prescribers' authority to prescribe controlled substances via  telehealth, if and when DEA and HHS end the temporary authority.\n\nTelemedicine has helped VA to greatly increase veterans' access to a  variety of types of care, providing a critical lifeline for veterans,  especially those who may have difficulty leaving the house or who live  in extremely rural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…staff on their campuses and in their district  because they have seen firsthand the impact a VSOC can have. By  expanding who can fill that role, we will give more student veterans  access to the program and help enable them to access their earned  benefits.\n\nWhile I do have concerns that section 4 of the bill requires VA to  adjudicate extension requests…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…been through.\n\nHis work saves lives. It is that simple. This bill helps him and  thousands like him do even more. It also includes my Veterans SPORT  Act, which ensures veterans can access adaptive prosthetics for sports  and physical activity.\n\nRecovery isn't just about prescriptions. It is about purpose. Whether  it is walking a golf course or playing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…kinds.\n\nBy incorporating new consideration for DOE to evaluate the potential  for transitioning servicemembers into the workforce as part of H.R.  3638, we can ensure our veterans have access to good-paying jobs.\n\nMr. Chair, having served in the military, I know in the military we  get specific skills. We can be diesel mechanics. We can be all these  different…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…action plan to improve outreach to veterans and inform them of  available resources that directly apply to their unique needs.\n\nWe must work together to ensure that our veterans have access to the  tools necessary to start or grow their businesses. I urge my colleagues  to support our veterans and pass the SERV Act.\n\nMr. WILLIAMS of Texas. Mr. Speaker,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…proud to lead with Chairman Bost and  Representative Budzinski, the ranking member of the subcommittee that I  lead on Chairman Bost's committee, will make it easier for veterans to  access the care and benefits they have earned by making significant  improvements to our overly complicated claims process.\n\nMr. Speaker, you have already heard from other…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689676/clear-communication-for-veterans-claims-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…suffered by military pilots and their air crew are related to  their chemical and toxic exposures.\n\nThe VA needs robust medical research to streamline military air crew  veterans' access to disability compensation, and VA needs it fast, for  today and tomorrow's veterans. My friend from Texas' bill would ensure  that research gets done and that our military…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Chair, I am here to speak on my amendment No. 21. This  is something that we have dealt with here in Congress before.  Specifically it relates to veterans' access to cannabis.\n\nThe story that I will tell in advance of this is simply this: I woke  up in Walter Reed Army Medical Center not too far from here a number of  years ago,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…gentlewoman from Iowa (Mrs. Miller-Meeks), recently  hosted a hearing to discuss improving care for women veterans. This  bill builds on our work to ensure this population of veterans has  access to the modern care that they have earned.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, I have no more speakers.\n\nMr. BOST. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…supporting veterans who  struggle with PTSD, survivors' guilt and other mental health  challenges. Having been diagnosed with PTSD himself, Scott felt the  call to help other veterans access essential support such as medical  treatments, PTSD therapy workshops, employment opportunities, and  veterans' benefits. His non-profit has successfully helped over 1,500…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the cancers suffered by military pilots and aircrew are related  to their chemical and toxic exposures.\n\nVA needs robust medical research to streamline military aircrew  veterans' access to disability compensation, and VA needs it fast for  today's and tomorrow's veterans.\n\nThis bill ensures that research gets done and that our military  pilots and aircrew…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today in support of my bill, H.R.  3951, the Rural Veterans' Improved Access to Benefits Act of 2025.\n\nThis bipartisan bill aims to ensure rural veterans have access to  quality and timely physician examinations so that they are able to  receive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…faced when  starting a business.\n\nThis bill will commission a report on the outreach and promotion of  existing veteran-focused small business programs to make sure that  veterans can access all the available resources, the capital, and the  counseling that they need to succeed.\n\nMr. Speaker, this legislation also mandates the Interagency Task  Force on…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}]