[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…lawlessness is  understanding the importance of the War Powers Resolution.\n\nIn this very Chamber 53 years ago, Senator Javits, in debating the  overturning of President Nixon's veto of the War Powers Resolution,  called the power to bring America into war the ``most awesome power in  the possession of any sovereignty.'' This resolution, he said, is about…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…power today as Republicans unanimously voted  for water projects for poor people in Colorado and for a Native  American Tribe in Florida, reversed themselves and sustained his veto.  They voted for these two measures before. That is how immense his  influence is. The question is: Will he get seven Republicans to do  something right for the American people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…of polluters. This bill is a  good example of that.\n\nThis bill would elevate the Federal Energy Regulatory Commission  above any other Federal agency, give it unprecedented veto power, and  transform it and the North American Electric Reliability Corporation  into political actors. That is a world away from the independent  agencies that they are now…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…which attacked tax credits and programs designed to  strengthen our supply chains.\n\nH.R. 3616 would grant the Federal Energy Regulatory Commission (FERC)  unprecedented power to veto or demand changes to any federal agency  action, including environmental rules.\n\nH.R. 3632 would force old, expensive power plants to stay online for  up to five years after…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…an effort to do a balanced budget amendment. It  fell one vote short here in the Senate Chamber. It needed 67 votes; it  only got 66.\n\nThen there was: We will do a line-item veto--and that was passed. But  that gave the power to the President to strike down any line.\n\nThe Supreme Court said: No, you can't do that. You can't delegate the  power of the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…communities, unfortunately, the President has taken a different  path.\n\nNow, we are going to talk about the merits of this bill today, I am  sure, but we all know that this veto has nothing to do with fiscal  policy, nothing to do with the merits. There has been extensive  reporting that raises broader concerns about the administration's  posture toward…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…22 years later, along comes a moment when you  have a Republican Senate and a Republican House. And the Republicans  said: Do you know what, we like this idea of a line-item veto, so they  passed it. Fine. But the Supreme Court said that is unconstitutional  because the Constitution says the power of the purse lies with  Congress, not with the President--something…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…war  for personal gain without any public consent.\n\nCongress overwhelmingly reaffirmed this key constitutional provision  when it passed the War Powers Act in 1973 over the veto of then- President Richard Nixon.\n\nUnder the law, the President has the authority to approve military  attacks as a response to an imminent threat or with the expressed  authorization…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…vetoed H.R. 131, the Finish  the Arkansas Valley Conduit Act, a bill that passed both Chambers of  Congress unanimously with broad bipartisan support. The President did  not veto this bill for any substantive objection. He did so out of a  desire to punish the State that he believes didn't support him  politically.\n\nIn my opinion, this is the last reason…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…pay attention.\n\nPutin has made clear that he wants effective political control in  Ukraine and other free nations that used to be part of the Soviet  Union. Putin also wants a veto over defense measures being taken in the  former Warsaw Pact states that want to remain free. Putin doesn't want  that. This means he wants to dictate the fate of many of our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Colorado is so critical, a project 60 years in the making.\n\nI support it because, as was noted, there are no cogent issues with  this bill as were purportedly articulated in the veto message from  President Trump. Far from it, this bill will cost taxpayers virtually  nothing as was referenced. It makes good on a promise to the people of  rural Colorado.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…bipartisan legislation I cosponsored with Senators  Wyden, Kaine, and Paul that nullifies Donald Trump's trade war. To  nobody's surprise, the President has already threatened to veto this  bill.\n\nSenate Republicans who know how bad tariffs are for their States  should join us to nullify Donald Trump's trade war and ignore his veto  threat, and, if necessary,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…legislative days, it can be brought  to the floor and it can be overturned by the House and the Senate and  that if it is vetoed, well, then the House and Senate can overturn the  veto, if they have enough votes--but all about rules; no mention of  waivers.\n\nBoth the Government Accountability Office and the Senate  Parliamentarian said the Congressional Review…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that a majority of  Senators voted to rein in this President's reckless actions. But if we  want to put an end to this warmongering, we need to keep pressing until  we have a veto-proof majority. Today's vote is not the end of the line.  So I urge all my colleagues to join us in asserting our authority and  continuing to send President Trump a simple…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the National Appliance  Energy Conservation Act.\n\nNow, I am going to be honest with you, Ronald Reagan vetoed it the  first time because the oil and gas industry wanted him to veto it. And  that law ultimately did pass, and it covered 13 major appliances-- kitchen refrigerators, dryers, air conditioners, and, yes, commercial  refrigerators. And since then,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…majority will vote to say: This is wrong- headed, and the emergency should end. It would have to go to the House.  But even if we were successful in the House, the President would veto  it. It would take a two-thirds vote in order to stop an emergency. That  is such a burden that we need to consider reforming the emergency  powers and reversing this.\n\nI think…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…to obstruct  interstate projects. These States have stood outside the FERC-led  National Environmental Policy Act process and used their section 401  authority as a one-State veto of a multistate project of national  significance. This has been detrimental to the development of critical  pipeline infrastructure.\n\nI want to be clear: My bill would continue…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…costs for  American families and businesses.\n\nWe have had hearings on pipeline safety this past summer.\n\nFor too long, States have used section 401 authority as a one-State  veto of multistate projects with national significance.\n\nAgain, the facts speak for themselves. Mr. Speaker, if you want to  look at the top 12, it is New England, New Jersey, and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…recently testified in a Senate hearing and said:\n\nOur decisions are not dispositive on the Congress--they're       advisory.\n\nBut Democrats now want to give the GAO staff a veto over the Senate's  use of the CRA to disapprove rules submitted by Federal Agencies.\n\nThe Senate has given GAO the authority in the CRA process in the past  to protect the legislative…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…been put in on this legislation. I also thank my  colleagues in the Senate for their work on this important bill.\n\nMr. Speaker, I urge my colleagues to vote in favor of today's veto  override to ensure my bill, H.R. 131, becomes law.\n\nIn December of last year, this commonsense, bipartisan, and bicameral  bill passed both the House and Senate unanimously.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…highlight section 12 of H.R. 3898. Section 12 is  the language of my bill, the Reducing Permitting Uncertainty Act.\n\nSection 404(c) of the Clean Water Act allows the EPA to veto a  dredge-and-fill permit. However, under Biden, the EPA took it upon  itself to proactively reject permits and retroactively take away  permits.\n\nIn a country of due process,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, I rise today to urge my colleagues  to vote to override the President's veto of H.R. 131, the Finish the  Arkansas Valley Conduit Act.\n\nThis is not a symbolic vote. It is not messaging. It is not partisan.  This is a test of whether Congress keeps its…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the Biden  administration.\n\nUnion bosses love this bill for one reason: It protects their  telework perk. It also shields them from accountability and gives them  effective veto power over a duly elected President with a mandate to  clean up a bloated Federal bureaucracy.\n\nSpecifically, this legislation would nullify President Trump's  executive order…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…President Trump for his contribution to funding the government.\n\nPeople forget around here that he has to sign the bills. If he  doesn't sign them, believe me, he can sustain any veto he cares to  cast. He has used his influence and his power constructively to bring  us together across partisan lines and to pass what are bipartisan,  bicameral bills. I am…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…President Trump will not sign it. I am not saying  someone is right or somebody is wrong. President Trump does not  consider Senator Paul to be part of his MAGA agenda, and he will veto  it. Then we are right back to square one.\n\nSo, for that reason, I can't substitute his for mine because his is  going to be as dead as fried chicken here in a few days, and…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…creating,  through the War Powers Act, 535 Commanders in Chief. The Members of  Congress sit in judgment over the Commander in Chief, and under the War  Powers Act, they have a veto under the law. I think that violates the  constitutional structure that has been around since the founding of the  Republic.\n\nNow, what can Congress do?\n\nIf Congress doesn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…natural gas imports and exports and puts decisionmaking authority back  where it belongs--with FERC, not some bureaucrats using climate reviews  or climate change as a backdoor veto.\n\nSome of you have seen that even the Microsoft founder, Bill Gates, is  now backing up on his climate claims. This is ridiculous.\n\nThis bill restores certainty for developers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…American company remains right at home  in Pennsylvania.\n\nBy ensuring that U.S. Steel retains an American CEO, an American- dominated board, and allows the U.S. Government to have veto power over  critical business decisions, President Donald J. Trump has fully  protected our national security.\n\nThis merger will be a huge benefit for the Pennsylvania economy…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…2023, as well as residential tank-filled water heaters in  April 2024, neither of which could be overturned by the Congressional  Review Act because it was unlikely to achieve a veto-proof majority in  the Senate. Through rulemaking, the Department of Energy should write  new rules to address this regulatory imbalance, whereby traditional  tank water heaters…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690091/hj-res-20"}]