[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…President in  2017 was to impose a ban on people entering the country if they were  coming from countries that were predominantly Muslim in nature. It  wasn't based on the vetting of an individual to determine if they posed  a problem. If you are a Muslim, if you come from a country that was  predominantly Muslim, you are banned--the very essence of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…ban to stop parents who have completed every step of the  adoption process from bringing their new babies to the United States.\n\nThe administration has claimed this is about vetting immigrants to  protect public safety. But tell me: Does it make sense to deny entry  for a baby for vetting reasons?\n\nWhat the President has done to bring down the hammer…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…evasive  answers. I would need to see some evidence before accepting her word on  a case such as this.\n\nIf we are being asked to enact such drastic measures without proper  vetting or a thoughtful process, then we need more than her assurances.  We need evidence. We need real facts, not fabricated ones, to back up  these accusations.\n\nRepublican support…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…bill's impact on the program and consumers as is our typical  practice for legislative hearings.\n\nStill, I believe this legislation will help address critical gaps in  the vetting of high-cost recipients and will curb waste, fraud, and  abuse in the program, so I urge our colleagues to support H.R. 2399.\n\nMrs. DINGELL. Mr. Speaker, I have no further…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…the mask. These DHS  agents have no identifying factor. From all their botched raids and  officer-involved shootings, I have to ask: What is their training like?  What is the vetting? Is Secretary Noem recruiting January 6  insurrectionists?\n\nI was one of the last Members of Congress to escape the House gallery  on January 6. I remember hiding on my hands…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…applications of the children  of Filipino World War II veterans. This would allow them to gain green  cards once their applications are processed and approved, including  careful vetting in line with existing immigration standards. This will  not only assist these veterans in their senior years but also provide a  fitting recognition of their critical service…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Commerce weighed in  requesting significant changes to the provision that are unfortunately  not included in the Act we will consider today. As such, this bill  merits further vetting and input from the Department of Commerce.\n\nThis bill needs to be changed to address these concerns. Until that  happens I must regretfully oppose this legislation in its…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693613/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…elderly or mentally ill, they are at greater  risk for financial abuse and theft of benefits than the population at  large. Unfortunately, despite the VA's best efforts at vetting proposed  fiduciaries, bad actors do arise from time to time. When that happens,  theft or misuse of benefits can financially devastate veterans.\n\nOn top of the financial…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…accountability  for his role in this tragedy. Only 7 months earlier, the Trump  administration granted asylum to the assassin.\n\nBig unanswered questions for the President: What specific vetting was  done with regard to the 3 years that this assassin lived here in  America? Was his post-traumatic stress from his prior violent work  considered? Was the caseworker who…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697312/attack-on-two-national-guard-members"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…individual, and they sent back women--yes, Trump tried to  disappear women to their all-male torture prison in El Salvador. If  anyone wants to try and pretend this was some careful vetting process,  please explain that to me.\n\nIt is not like El Salvador can't send people back. They have already  done that.\n\nThe administration should be making clear, one, these…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…In the recent 4 or 5 years, we have had lots of cases where the lives  of these children aren't protected because the Department of Health and  Human Services isn't properly vetting the adults these children are  placed with.\n\nSo once again, I am here to give you some updates on my concern about  that and an update today on investigations that I have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…colleagues, and the American public about the failure to vet  Afghan evacuees. Unfortunately, the Biden administration was not honest  with the American people about the program's vetting vulnerabilities.\n\nI asked then-Director Wray about the program's national security, and  I asked the same, this year, of Director Patel of the FBI.\n\nThis year, Director of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 2399) to require the Federal Communications Commission to  establish a vetting process for prospective applicants for high-cost  universal service program funding.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690153/rural-broadband-protection-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…information if they continue to meet applicable standards.       The section also requires the Director to assess the       feasibility and advisability of applying continuous vetting       to inactive clearances and to report the findings to the       appropriate congressional committees within 120 days of the       date of enactment of the Act. Section…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Bank;\n\n(B) the Afghan Fund's board of trustees, including how the       Fund's trustees were vetted and selected, and what United       States agencies were involved in the vetting and selection       process;\n\n(C) the conditions necessary for funds in the Afghan Fund       to be released to Da Afghanistan Bank;\n\n(D) how the Afghan Fund's board of trustees…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…separation program for victims of alleged                sex-related offenses. Sec. 530. Policy and program to expand prevention of sexual misconduct. Sec. 531. Continuous vetting of security clearances. Sec. 532. Training and education programs for covered misconduct                prevention and response. Sec. 533. Requirement to report sexual offenses.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…while something  happens today, tomorrow, it is something new. But it is important that  we not allow the mistakes that were made by the Biden administration  when it came to vetting Afghan nationals to be forgotten. We cannot  ignore the reality that Sarah Beckstrom was another victim--an  unnecessary victim--of President Biden's careless immigration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…will report the bill by title.\n\nThe senior assistant legislative clerk read as follows:\n\nA bill (S. 98) to require the Federal Communications       Commission to establish a vetting process for prospective       applicants for high-cost universal service program funding.\n\nMr. HUSTED. I know of no further debate on the bill.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693056/rural-broadband-protection-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…previous administration dismissed and  failed to answer my oversight request.\n\nFor years, the Biden administration hid from the American people  known vulnerabilities in the vetting process that goes under the names  of Operation Allies Welcome and Operation Allies Refuge. The Department  of Homeland Security inspector general eventually exposed those…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693254/afghan-evacuees"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…country. How many more were among the 2 million known  gotaways is anybody's guess. How many more are among the 190,000  Afghans allowed into this country with minimal or no vetting is also  anybody's guess. We found out last week that one is far too many.\n\nUnder the Biden administration, Hamas terrorists didn't even have to  sneak in across the border.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ultrasounds? If  you take that scan and attach it to someone's phone, then it becomes  portable. Now, our original number--I am having trouble believing it  because it needs more vetting--was like $20 billion to $25 billion a  year. What if it is a quarter trillion over 10 years? Is that a cut in  services, or is that using technology to make it more modern,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…an existential threat to Western civilization.''\n\nSo what do the Democrats think? Well, on Sunday, on ``Face the  Nation,'' CBS asked the junior Senator from Virginia if the vetting  process should be strengthened after the shooting. Now, that is exactly  what President Trump is doing. The Senator refused to answer that  question. Instead, he told a national…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…wasn't our men and women in uniform.\n\nUnfortunately, the extreme misuse of funds wasn't their only slight  to the American public. The Biden-Harris administration relaxed vetting  standards for those who claimed to sponsor alien children. DNA testing  was scrapped, and background checks were watered down. There were no  public records checks required…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…would eliminate HHS funding provided in the bill--which the  Trump administration actually requested in their budget--that will  allow the Agency to drastically improve sponsor vetting for  unaccompanied children, ensuring that they are no longer released to  human traffickers.\n\nThe Biden administration spent 4 years creating this problem, and  while the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699430/consolidated-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…like this. I am going to make some people  mad. As a matter of fact, I am not even going to bother with that one.  I will walk us through the straight number.\n\nWe are still vetting the number because we are doing predictions. All  of this could mean nothing if the Supreme Court tomorrow changes its  rules on the President's authority to  do the enhanced…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]