[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…Church in the  world and the leader of over 1 million Greek Orthodox in the United  States, including many of my constituents in the State of Michigan.  Michigan is home to a vibrant Greek Orthodox community, whose presence  in the State stretches all the way back to the late 1800s with the  arrival of the first Greek immigrants to Michigan. Today, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695682/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…country are still grieving people who should be alive.\n\nLet's be clear: Border communities are not war zones. Border towns,  like Nogales, which I represent in Congress, are vibrant, binational  communities where families live, work, and thrive.\n\nInstead of listening to local leaders, this administration keeps  choosing militarization, fear mongering,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…agriculture, and industry--serving as a vital link       in both Ohio's past and its future; and\n\nWhereas, its 406.8 square miles of rich farmland, flowing       rivers, and vibrant towns have been home to generations of       Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…communities in       Somerville, across the Commonwealth of Massachusetts, and       throughout our nation.\n\nThe Haitian community in Somerville and across       Massachusetts is vibrant, thriving, and essential to who we       are as a Commonwealth. Since 2010, TPS has been a lifeline       that allowed Haitian families to find safety in the United…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Small       Business Majority strongly supports uplifting immigrant       communities working in good faith to obtain U.S. citizenship.       These bills will lead to less vibrant communities and fewer       Main Street business opportunities for many in search of the       American Dream. Congress should do all it can to support       America's job…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…arrival of  other recognized Pacific peoples in their homelands. By the time of  first Western contact with Captain Cook in 1778, Native Hawaiians had  developed a complete and vibrant culture with their own language,  religion, values and sophisticated systems of governance, agriculture  and navigation.\n\nYet, like so many other indigenous peoples, post-contact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…O Senate                                By Jace Miles       Shall I compare thee to a session day?      Divided it is and together they come,      A place vibrant and unique in every way.      Jacks of all trades but mastered by one.      They call it antediluvian,      Some say it is great.      I will admit it is not arcadian,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…short-lived Republic of the Rio Grande, the  Republic of Texas, the Confederate States of America, and ultimately,  the United States. Each chapter reflects the complex and vibrant story  of a city shaped by shifting borders and strong people.\n\nToday, Laredo and its sister city, Nuevo Laredo, form the Dos  Laredos--creating the largest inland port in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…city they are located in or what party they belong to.\n\nRather than driving economic growth, this legislation would strip  essential resources from some of our Nation's most vibrant and diverse  communities. This would hurt the livelihoods of hundreds of thousands  of businessowners. If the New York office were to close, the effects  would spill over…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Pough wrote and  recorded her debut song entitled ``Jesus Reigns Forever,'' earning  national spotlight on NBC, CBS and Fox News in 2020.\n\nTill this day, Mrs. Pough remains a vibrant and active member of her  community, enjoying gardening, bowling, reading her bible and  worshipping at the Living Word Christian Center, in Forest Park  Illinois. Above all…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…alarm bell about what these cuts will  do for Michigan and what this means.\n\nFrom growing up and from my upbringing, I saw this story of what it  means to have a strong and vibrant manufacturing economy. It is  intertwined with the Nation's scientific research enterprise and  appropriated dollars.\n\nI have visited my friends in over 250 unique small businesses,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…office named Evergreen in the  foothills of western Denver. Since then, Evergreen has grown from a  small ranching and logging village only accessible by wagon roads to  the vibrant mountain community that it is today. Originally inhabited  by the Native Ute, Cheyenne, and Arapaho people, the town has grown  alongside the state of  Colorado, boasting…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…canceled grant awards that  helped refugees and other aspiring Americans who came to the United  States through legal pathways to assimilate and contribute positively  to our vibrant communities and the economy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today to share the story of Adriana  Smith.\n\nAdriana Smith was a 30-year-old nurse from Georgia and the mother of  a vibrant 5-year-old boy. She started to experience debilitating  headaches, and she sought medical care. She was discharged and her pain  was dismissed, as is so often the case for…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise to recognize the Puerto Rican  Alliance of Northern Virginia for hosting and organizing their third  annual festival.\n\nVirginia is home to a vibrant Puerto Rican community, and the  festival celebrates the community's culture and contributions. It  brings in vendors, volunteers, music, and a vibrant community.\n\nThe festival…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692244/recognizing-the-puerto-rican-alliance-of-northern-virginia"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enhancing quality of life, and fostering a  welcoming atmosphere for residents and visitors alike. From its early  days as a fishing and boating hub to its present role as a vibrant city  with a growing economy and engaged citizenry, Port Richey has held  tightly to its roots while embracing the promise of the future. Its  waterfront parks, thriving local…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…public safety through police and fire departments, essential  infrastructure support via a robust public works department, access to  clean water and sanitation utilities, and vibrant recreational and  library services. These offerings reflect the city's deep commitment to  enhancing quality of life for its residents.\n\nFruitland Park's natural beauty, small-town…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of New Hope, during his many years of dedication to  public service.\n\nMayor Keller has long been a committed civic leader in New Hope, a  historic river town known for its vibrant small businesses, tourism,  and strong sense of community. Throughout his time in public service,  Mayor Keller has worked diligently to preserve the character of the  borough…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…internet teaching your child how to take their own life, and your  child, in a moment of vulnerability, listening to them.\n\nThat's exactly what happened to Kristine Jonsson, a vibrant sixteen- year-old from Hilliard, Ohio whose life was cut tragically short in  September 2020.\n\nKristine was open with her parents about her mental health struggles,  but it…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…the supportive, community-based framework  that has helped generations of seniors age with dignity and give back  to their communities and families, all while living rich, vibrant  lives. The Older Americans Act continues to impact more than 10 million  older Americans a year by promoting social connection and contributing  to programs aimed at supplying…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693849/recognizing-the-60th-anniversary-of-the-passage-of-the-older-americans-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…economic growth and shared prosperity. This remarkable network of  business leaders, entrepreneurs, and professionals exemplifies the  Chamber's enduring mission: to build a vibrant, connected, and thriving  local economy.\n\nThroughout its history, the Chamber has been a steadfast advocate for  small businesses, providing valuable resources and opportunities…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to be a reference to the ``Jocelyn Nungaray       National Wildlife Refuge''.\n\nMr. WESTERMAN.  1596, the bill now under  consideration.\n\nMr. Speaker, Jocelyn Nungaray was a vibrant 12-year-old girl from  Houston, Texas, whose life was tragically cut short on June 16, 2024,  when she was murdered by two Venezuelan nationals who illegally entered  the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…a staple  of Lancaster County's heritage. As Root's Country Market celebrates 100  years in business, I thank the family and their stand holders for  making our community a vibrant place.\n\nCongratulations to the Root's Country Market, and I wish them another  century of success.    Congratulating Constituents Named 2025-2026 Pennsylvania FFA Officers…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…cooperation with Israel and the United States. This is from  1950, where Ben-Gurion--the first President of Israel--is talking to an  Iranian diplomat in Israel. Iran had a very vibrant Jewish population.  So it has not always been this way.\n\nSo what happened? They had a revolution. In 1979 to 1981, there was  an uprising in Iran that led to the installing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…significant milestone offers an opportunity to reflect  upon the city's rich history, enduring spirit, and the generations of  citizens who have shaped Brooksville into the vibrant community it is  today. For 170 years, Brooksville has stood as a testament to  resilience, civic pride, and a deep respect for tradition, while  continually embracing progress…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Association to  address the Members.\n\nMs. EDWARDS. I want to add my congratulations to FMC's past  presidents and to thank them for their role in creating this incredibly  important vibrant and impactful organization, which is a perfect  transition to the next part of our agenda focused on FMC's work in 2025  and our vision for 2026.\n\nWith that, the Chair, again,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…restoring beloved menu items including a throwback menu  featuring The Original Mountain Burger, a culinary emblem of community  heritage.\n\nToday, The Waterville Hotel stands as a vibrant hub, serving hearty  fare from burgers and fries to vegetarian dishes, complemented by local  craft beers and wines. The interior is filled with photographs spanning  generations,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…and celebrate the 100th Anniversary of the Town of Howey-in-the-Hills,  Florida.\n\nFounded by William John Howey and incorporated on May 8, 1925, as the  Town of Howey, this vibrant community officially became known as Howey- in-the-Hills in 1927. The name pays homage to the picturesque  topography of the regions, which Mr. Howey fondly referred to as…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Smith, as well.\n\nMadam Speaker, I rise today in support of the Haiti Economic Lift  Program Extension Act.\n\nIn my Hudson Valley district just north of New York City, we have a  vibrant Haitian community. It is actually one of the largest Haitian  diaspora communities in the country, and it has been an honor  representing these great people and working with…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…town after  President James K. Polk and increasing the population with new  construction of oil rigs.\n\nToday, Polk City is home to approximately 2,000 residents and remains  a vibrant small town with a strong sense community and rural charm. It  is known for the General James. A. Van Fleet Trail and beautiful lakes.  As we commemorate this centennial milestone,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694002/recognizing-the-100th-anniversary-of-the-city-of-polk-city-florida"}]