[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…doesn't sound  like he is willing to admit he got it wrong. He told Time magazine that  if tariffs are at 20 percent or even 50 percent a year from now, that  would be a ``total victory.'' So, once again, no one can tell what his  administration wants or what the end game is.\n\nI believe it is hard to see how any foreign country right now would  make concessions…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Gainesville High School Baseball Team\n\nMr. SUBRAMANYAM. Mr. Speaker, I also rise today to recognize the  Gainesville High School baseball team's historic State championship  victory.\n\nIn just their fourth season--they have only been a high school for 4  years--the Cardinals won their first State title, capping off the  season with a 23-5 record.\n\nThe…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the Braddock district, where he has continued to be a  powerful advocate for his community.\n\nHe resides in Fairfax County with his wife, Yvette, and his son,  Mateo. With his victory in this week's special election, I know he will  make an outstanding addition to our delegation and this Chamber with  his steadfast commitment to the 11th Congressional District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…autonomy, and their democracy.\n\nPeace between Ukraine and Russia must not come at Ukraine's expense.  We want peace. Ukrainians desperately want peace, but it cannot be a  Russian victory. In order to have a just and lasting peace, we must  return Ukraine to its 1991 borders. Ukraine must also have serious  security assurances from the U.S. and NATO so that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…honest election, the world would not believe  the results. He ignored my advice, which was no surprise. He went ahead  with the election and had a disputed result. He claimed victory, which  others said didn't happen, and he did it again a few years  later. So he discredited himself in the eyes of the world community,  and his country continued to suffer.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…support of Ukraine. I thank the gentleman so much for  representing the State of Illinois and the thousands and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania, Congresswoman Madeleine Dean.\n\nMs. KAPTUR. Mr. Speaker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…billions of dollars and  countless lives, and it has not solved the problem.\n\nAs we expand this military operation in South and Central America, we  have to ask: What does victory look like? How do we know when this  mission is complete?\n\nI know when many of us considered the Iraq war, I think many failed  to ask the fundamental question: What happens…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Eagles volleyball team on this  historic achievement.                     El Monte High School Eagles Football\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize the amazing  victory of the South El Monte High School Eagles football team in the  2025 CIF Division 14 championship game. The team claimed the school's  first-ever championship in a nail-biting…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, I rise today to celebrate a stunning,  dominant victory by the UConn women's basketball team yesterday over a  very good University of South Carolina team by a margin of 23 points,  which actually is lower than really where it…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Congressional District.\n\nOn the biggest stage in Texas high school football, the Mustangs  earned a state championship through discipline, preparation, and belief  in one another. This victory marks the program's sixth state title and  a return to the top, reaffirming North Shore's tradition of excellence.\n\nThis championship reflects months of hard work, and a season…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…survive that kind of conduct; that is not America; and urging  every one of our constituents, as I am going to quote George Washington  in just a minute, to honor democracy in victory and in defeat.\n\nAl Gore lost a Presidential election 5-4. When the Supreme Court said  that the election was over, by a vote of 5-4, Al Gore did what real  patriots do. He…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise today on behalf of New Mexico's Second  Congressional District to celebrate a long-awaited victory for rural  America, the imminent passage of the bipartisan Secure Rural Schools  Reauthorization Act.\n\nI preface my remarks by thanking Representatives LaMalfa and Neguse,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…signed in his first term.  The U.S. willingness to ignore its treaty obligations, even with  friends, won't make other countries eager to do deals. Maybe Mr. Trump  will claim victory and pull back if he wins some token concessions, but  if a North American trade war persists, it will qualify as one of the  dumbest in history.''\n\nContinuing with The Washington…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for the lost, press on for the left behind, press on for the rule of  law, press on for the American way of life, and press on for democracy.\n\nWe are going to press on until victory is won.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…brought  home their first-ever division championship. Thanks to their strong  defense, aggressive offense, and dedicated coaching staff, the  Colonists again earned a well-fought victory.\n\nMr. Speaker, I congratulate Anaheim, which has again made us proud.                     Recognizing Max Madrid's Retirement\n\nMr. CORREA. Mr. Speaker, today, I rise to celebrate…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…who made the       ultimate sacrifice for our country. American-Jewish       servicemembers served with honor and bravery, playing a       crucial role in winning the Allied victory. They deserve to       be remembered with dignity and accuracy.\n\nThe United States has a solemn duty to ensure every fallen       servicemember is honored correctly Enacting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…have built a true championship tradition.\n\nMr. Speaker, I congratulate each runner, their coaches, their  families, and the entire Parry McCluer community. Their three-peat  victory is a testament to perseverance, teamwork, and excellence, and  it continues to make the city of Buena Vista, the Sixth Congressional  District, and the entire Commonwealth…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…Final.\n\nLast month, our State--the great State of Florida--along with loyal  fans nationwide, came together to cheer on the Florida Panthers as they  fought hard to secure a victory and bring home the cup to Florida.\n\nAnd they cemented their place as back-to-back champions. This  incredible effort marks the second cup won  by the Panthers in franchise…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…without risk. And it is worth making the clear case to the  country.\n\nI appreciate the administration's willingness to brief Senators on  the sensitive details of a tactical victory. But they owe it to the  American people--and, frankly, the long-suffering people of Venezuela-- to lay out the path to strategic success in much greater detail.\n\nIf the aim…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…career.\n\nWinning the Class 3A boys' tennis doubles championship is an  exceptional achievement for Hempfield's Cooper Lehman and Braylen  Garcia, and I congratulate them on their victory. May they hoist their  medals high with great pride in their efforts. I look forward to seeing  what these students accomplish next.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…and kept their  determination to win. Everything turned around for the Thunder in the  sixth inning when Emma Lee crushed a three-  run homer and this team sailed to a 3-1 victory.\n\nTrine University women's softball has continued to make Indiana's  Third District proud, as this is their second national title in 3  years. Their perfect post-season is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693078/trine-university-2025-womens-softball-champions"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…piece of the Denver Broncos' offensive line.\n\nFrank's dedication and commitment paid off this weekend, as he scored  an iconic touchdown that was key in the Broncos' 33-30 victory.\n\nPlease join me in recognizing and celebrating the hard work and  successes of Wyoming's Frank Crum.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…but the next best time to act is  today. This fight to address outbound investment transparency has been  going on for many years, but I look forward to finally declaring  victory when President Trump signs the National Defense Authorization  Act into law, which I hope is very soon.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…great pride to recognize  and congratulate the Manchester Squires on an extraordinary  achievement: winning the Class 2A basketball State championship this  past weekend.\n\nThis victory marks a historic milestone because it was the first  boys' basketball State championship title in the school's history.\n\nThe journey to a championship is never easy. It requires…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…leadership of President Donald Trump, Secretary of State Marco  Rubio, and Ambassador Mike Huckabee, Americans will not stop until we  bring home every hostage and achieve victory over the Iranian regime  and its puppets.\n\nThe people of Iran can be inspired by the courageous patriots of  Syria who liberated Damascus on December 8. Additionally, the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…First       Sergeant Lomell's valiant acts along with General       Eisenhower's decision to invade on June 6, 1944, as the most       significant actions ensuring the Allied victory on D-Day.\n\n(11) Following World War II, Second Lieutenant Lomell was       appointed as the First Director of the newly organized Ocean       County Veteran's Service Bureau,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, it is March Madness. With America  currently fixated on basketball, I recognize today the Palm Bay girls'  basketball team on their recent statewide victory. The team made  history by capturing the State's Class 4A State championship here in  Florida. The Pirates overcame a tough American Heritage squad where  they rallied from…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…call with  the steady hands and a nurse's calm demeanor, holding the line not with  a rifle but with a lifesaving skill and unwavering resolve.\n\nShe earned the World War II Victory Medal and the American Theater  Ribbon, continuing her service to our Nation until her medical  discharge in 1953.\n\nAt 106 years young, Hazel is not a page in our history…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…2020, before  there was a congressional office or a seat in this Chamber, Nate took a  leap of faith and helped build a campaign from the ground up. Together,  we delivered a victory many said was impossible, defeating an incumbent  in a district with a 2-1 Democratic enrollment advantage. That race was  the foundation for everything that has followed.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…that is a snow machine race, longest, toughest  snow machine race in the world, was won by--that is done in kind of  tandem--Robby Schachle and Bradley George, their second victory of the  Iron Dog snow machine race.\n\nThings are starting to thaw, as I mentioned. It is beginning of the  summer tourism season, right around the corner. The first cruise…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]