[{"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Smith was…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Ms. Jami Frazier has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Gavish was…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Noble was…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Verosic was…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mr. Mike Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Phillips was…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Hoffland…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Phillips…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Life Style Church has made to  our community in the aftermath of Hurricane Milton. In addition to  providing countless hours of direct support to neighbors and flood  victims, he helped coordinate the collection and distribution of  emergency supplies, meals and donated services to help those who needed  help. He and his wife also provided cash assistance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Ms. Lynn White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. White was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Mr. Jason Chase has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Chase was…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Arnold was…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Ms. Ashley Porter has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Porter was…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690135/recognizing-ashley-porter"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Mr. Harry White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. White was…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}]