[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…real people who were burned half to death by a terrorist 7 days ago.  The least you can do is list the right number.\n\nMr. Evans' resolution also says that ``reportedly one victim was a  Holocaust survivor.'' She is not reportedly a survivor. She is a  Holocaust survivor. There is no doubt to that. There is no allegation  to that. I know because she…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Planned Parenthood Federation of America, Positive       Women's Network-USA, Power to Decide, Public Justice,       Reproaction.\n\nReproductive Freedom for All, Rocky Mountain Victim Law       Center, SIECUS: Sex Ed for Social Change, Stop Sexual Assault       in Schools, Tahirih Justice Center, The Pregnant Scholar at       WorkLife Law, Transgender Law…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…offensive, and it is unacceptable.\n\nSenior scams have more than doubled since 2020. These senior scams  cost older Americans more than $36 billion a year, with the average  victim losing $34,000 from these crimes annually, not to mention the  pain you can't put a dollar amount on. What is worse is that the  majority of cases of elder exploitation are…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…following their sworn  oath to care for patients or facing criminal charges. It caused trauma  and suffering that cannot be undone.\n\nIn fact, Mr. Speaker, a 10-year-old rape victim was denied the care  she needed and was forced to flee the State  to get the care that saved her life and her future.\n\nYet, despite all of this, the people of Ohio did what…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…appeared fresh'';\n\nWhereas, NBC4 Washington also reported that the Metropolitan Police  Department identified Representative Cory Mills as the significant  other of the alleged victim of assault--which alleged victim was a 27- year-old woman who was not the wife of Representative Cory Mills--and  that the alleged victim ``let officers hear Subject 1 [now…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Mr. Speaker, yesterday ICE murdered an American citizen.  Renee Good was a wife and a mother who has now become ICE's latest  victim. To those at DHS and in this Chamber who have created and  rewarded a culture of murder, I ask the same question that God asked  Cain:\n\nWhat have you done? You have slain your…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…find a fair path forward, but  that willingness has not been matched.\n\nAcross the U.S., the Department of Education is dismantling public  schools. New Jersey is the latest victim.\n\nI will continue working with our district school officials to use  every single tool available to restore this funding and to fight to  support public education. I will not…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…on because of the  obstacles that they face as a consequence of the crimes that they were  forced to commit, victims and survivors often return to their  traffickers or fall victim to new predators. We cannot allow this cycle  of trauma, criminal exploitation, and victimization to continue in the  lives of so many untold victims.\n\nWhile all but three…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…accelerating. Thousands  more have died under bombs and bullets at aid sites themselves.\n\nAt the time, I held up this picture of Jinan Iskafi. She died in her  parents' arms, the victim of a military blockade on infant formula.\n\nHere joining Jinan are children suffering from famine conditions that  exist right now, this month--Amer, Maryam, and Shamm.\n\nThere…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…administration that       truly cared about public safety would not have rescinded       hundreds of millions of dollars in federal grants for gun       violence prevention, victim services, and community-based       safety programs.\n\nWe urge Congress to reject these attacks on D.C.'s       autonomy. Allowing such federal overreach would set a       dangerous…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to projects of hostility instigated  by pride, ambition and other sinister and pernicious motives. The peace  often, sometimes perhaps the liberty, of nations has been the victim.\n\nSo likewise, a passionate attachment of one nation for another  produces a variety of evils. Sympathy for the favorite nation,  facilitating the illusion of an imaginary…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…cultural exchange programs. Actually, our schools would be the victims  of the undue foreign influence, but instead of deterring the bad  actors, the bill seeks to punish the victim and, in effect, punish our  students. The bill is, therefore, poorly written, poorly  tailored, misdirected, and ultimately counterproductive and not a  targeted national security…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Ms. CLARK of Massachusetts. Mr. Speaker, this should be an easy vote.  This is about justice for the victims and survivors of Jeffrey Epstein.  This is about every victim of trafficking and sexual abuse, monstrous  crimes that thrive in secrecy and fear.\n\nYet, instead of shining a light on that darkness, just moments ago,  Donald Trump defended…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696821/epstein-files-transparency-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…has done in rallying the troops to do the right  thing. I thank her very much for taking care of our victims and making  sure they have these provisions. I, too, have been a victim, so I thank  her personally.\n\nMr. Speaker, I rise in support of H.R. 909, the Crime Victims Fund  Stabilization Act of 2025.\n\nEstablished by the Victims of Crime Act of 1984…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Trump, to refuse to let the President of the United States dictate  the terms of their speech, their business, their defense of the rule of  law.\n\nI don't want to make the victim the perpetrator. This is all Trump's  fault, what he is doing to extort political loyalty from universities  and law firms. But instead of there being collective action on…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…to reverse the course  that this country was on for the last 4 years. To hear you all talk all  of a sudden about disenfranchisement for females, you are always  playing the victim card. Seventy-seven million people rejected that.\n\nNow, on the proxy voting, every one of our friends in the back  listening had to show up here. Every one of them had to physically…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…13,842 in the first  half of 2024 to 23,593 in the same period in 2025. This rapid growth is  disturbing, and it is unacceptable.\n\nChildren are especially vulnerable to falling victim to sextortion,  with boys aged 14 to 17 most often being targeted. Tragically, this  exploitation has led some young people to take their own lives in an  attempt to prevent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…guilty and as  responsible as the predators who created them.\n\nI am talking to Snapchat, to Instagram, and to TikTok. All of them  will have to comply within 48 hours when a victim calls and demands and  tells you that you have to remove those images. There are no more  excuses. You, Big Tech, have to take it down.\n\nLet's talk to the bullies, to the predators,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…investigations, ensuring the  safety of New York City and its residents, this, in spite of the  political winds in New York which have favored the criminal instead of  favoring the victim.\n\nFrom his roles as special operations sergeant and platoon commander  to integrity control officer, Mr. Camhi has continuously demonstrated  the core  mission of the New York…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…According to the Office  for Victims of Crime, the Crime Victims Fund ended fiscal year 2024  with a balance of just $1.2 billion, a 90 percent decline since 2017.  As a result, victim assistance programs nationwide face a $600 million  funding shortfall. For organizations serving survivors of domestic  violence, child abuse, and sexual assault, including…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…relating to sexual misconduct and                other misconduct. Sec. 503. Consideration of request for transfer of a cadet at the Coast                Guard Academy who is the victim of a sexual assault or                related offense. Sec. 504. Designation of officers with particular expertise in military                justice or healthcare. Sec. 505.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…should denote serious  consequences.\n\nFurther, if a person is here illegally, commissioning and being  convicted of a felony is not a victimless crime. All felonies have a  victim.\n\nEnough is enough.\n\nIn the current state of the law, we must wait for an American to be  harmed before significant punishments are issued to those who are here  illegally.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…citizen'' means an individual over the age of 65.\n\nMr. Speaker, I rise in support of H.R. 1469, the Senior Security Act.\n\nAccording to the FBI, over 100,000 seniors fell victim to fraud and  exploitation just last year. Their total losses were over $3 billion.  Just last year, a senior citizen from my home State fell victim to an  investment scam…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…native, pleaded guilty in 2019 to selling drugs over a period of 3  years and possessing firearms. He had been charged with shooting a man  in the chest during a burglary of the victim's home.\n\nThese are the kind of folks that Joe Biden was commuting as he exited  stage left. We had another situation where he commuted the sentence of  a gentleman who left…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…there were 13,524 alcohol-impaired driving fatalities.  In 2020, drunk driving crashes led to nearly 400,000 injuries.\n\nThose crashes do not discriminate, Mr. Speaker. The victim could be  me, it could be you, it could be anyone in our families or in our  communities.\n\nThis issue hits close to home for me. There was a newlywed couple  from my hometown…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…transplanted into Communist Party cadres, leaders and members alike.\n\nThese crimes against humanity are unimaginably cruel and painful.  Between two and six internal organs per victim are extracted. It is  murder masquerading as medicine.\n\nEthnic groups targeted include Uyghurs, who suffer from Xi Jinping's  ongoing genocide, and the Falun Gong, whose peaceful…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…against me. It had a massive  story about a rape in 1987, which didn't happen, and accusations of  improper conduct, which did not happen. It also came forward with an  alleged victim. It was all malicious. It was all made up. It was all a  lie. Yet Gemma even generated fake links to fabricated news articles to  support the defamatory claim, and, of course,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…appeared fresh;\n\nWhereas NBC4 Washington also reported that the Metropolitan Police  Department identified Representative Cory Mills as the significant  other of the alleged victim of assault, which alleged victim was a 27- year-old woman who was not the wife of Representative Cory Mills, and  that the alleged victim let officers hear Subject 1--now identified…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…mistakes that were made by the Biden administration  when it came to vetting Afghan nationals to be forgotten. We cannot  ignore the reality that Sarah Beckstrom was another victim--an  unnecessary victim--of President Biden's careless immigration policies.\n\nThe man who committed this heinous act was an Afghan national whom  President Biden allowed to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…of a Miami Teenager\n\nIn April 2022, Michelson Romelus and Bendjy Charles       allegedly filmed each other on video while they forcible       raped and sodomized the teenage victim in Miami. Several       weeks later, the footage was allegedly edited and uploaded to       OnlyFans.com where the footage was allegedly sold as part of       a monthly subscription.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}]