[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…despair?\n\nI rise tonight not just for myself as a legislator, but for all of  those who never made it to this mike, for all of those who did not have  the opportunity to be viewed as full human beings in our great country,  for those who marched in the dust, for those who bled on the bridges,  for those who faced the dogs and the batons right here in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Johnson from the oil rich State of  Texas. Thousands of conscripted U.S. soldiers were unloaded off ships  to fight in that undeclared conflict. Many deboarded vessels, as they  viewed and reported huge oil derricks operating in the South China Sea  ringing the coasts of Vietnam, and adjacent countries. Many came home  from that confusing deployment wondering…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Congress and I  have publicly called for them to cease because I believe them to be  unlawful extrajudicial killings.\n\nThe footage of the strike on September 2, 2025, which I have viewed  in a classified setting, is deeply alarming and calls into question the  Trump administration's respect for the laws of armed conflict. I have  called on Secretary Hegseth…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…because of the rumors that we  hear of the flirtation with making the Fed just a handmaiden of the  Presidency. It would be wrong to do. It would be wrong to do, and we  would be viewed disrespectfully if we were ever to go down that path.\n\nNow, this comes at a time when we are observing the 15th anniversary  of the Dodd-Frank Wall Street Reform and Consumer…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…to lay out any  detailed plan for the future of IDEA.\n\nI have serious concerns about moving services for students with  disabilities to HHS because then they are only being viewed through a  medical lens. They would only be diagnosed and would not be seen as  students first and given the resources they needed to survive.\n\nToday, I would like to elevate…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Affordable  Care Act, it has gotten only more popular. Support for the ACA  consistently polls at or above 60 percent. In September 2025, in fact,  64 percent of the people viewed the ACA favorably.\n\nMaybe support for it is so overwhelming because the ACA extended  coverage to millions and millions of Americans, and its provisions help  everyone, including…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…Mr. Speaker, one of the problems I think that many people  have with DEI programs--which is one of the same problems they had with  affirmative action, if you recall--they viewed it as two parallel  lines, where you took a person who was less qualified and you elevated  him to the level of somebody who was more qualified.\n\nThat is not DEI. That was…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…a shortage  of electricity. Why? First, they have ideology against solar and wind.  Trump has a particular idea about wind and golf courses and birds or  whatever. But they viewed, 10 years ago, solar as a kind of ideological  project, as like a nice to have, United Nations, utopian view of the  world.\n\nWell, listen, solar is the most pragmatic thing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is halted and that researcher is forced to move  on to topics that don't rely on NIH funding.\n\nIt is worth remembering, for many of our rare, deadly diseases, cures  are not viewed as a payday for private investors, which makes NIH not  just the best hope for finding a cure but the only hope for desperate  patients, at least before Trump came along and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…researcher  found that the number of nonconsensual pornographic deepfake videos  available online has increased 900 percent--900 percent--since 2019.  Such videos have been viewed almost 4 billion times--4 billion.  According to the National Center for Missing and Exploited Children,  the number of AI-generated child sexual abuse images increased from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…forth the War  Powers Resolution--because if it is a military operation, it should go  through Congress because our Constitution says so.\n\nIf we go back to how the Founders viewed this situation, we can turn  to James Madison, who wrote to Thomas Jefferson and said:\n\nThe constitution supposes, what the History of all       Governments demonstrates, that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…issues that are unique to her experience as an African  American woman, but that still resonate with people from all  backgrounds. Her work is important and will doubtless be viewed as one  of the premier artistic vehicles for social change in the modern era.\n\nI had the distinct pleasure of welcoming Ava DuVernay to Capitol Hill  when she visited Washington,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…boundless, and we wish them every happiness in the years  ahead.\n\nSteny has been a leader to us and a mentor to many. He has really  been an example of leadership and can be viewed as one of the most  substantial, respected Members of Congress in the history of this body.\n\nMr. Speaker, I thank Mr. Hoyer for his leadership.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…would be left to whittle away at home 7 days       a week with no community interaction. She is learning       prevocational skills in a manner that she is validated and       viewed as a person with strengths.\n\nThank you, Mary.\n\nAllison:\n\nI am my daughter's caregiver in New Jersey. Medicaid-funded       programs allow her to remain an active part of our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…our team members--colleagues who live and work in these       communities, providing this life-saving treatment.\n\nAt MSH, we focus on building strong health systems. Viewed       from this perspective, the recent terminations are even more       concerning. The elimination of foundational programs like       maternal health or health worker training…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…talks, Vladimir Putin  has repeatedly taken the lives of noncombatant civilians and pummeled  residential neighborhoods with bombs. Every statement Mr. Putin makes  should be viewed through that lens.\n\nPresident Trump is right. Too many people are dying, and that  includes the Russian people who are also suffering.\n\nThe Russian people do not deserve to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…protections, but then the 2022 plan rejected that,  closing off 8.3 million acres to any new infrastructure.\n\nThe 2020 plan was well received by most Alaskans because it was  viewed as balanced. BLM crafted a plan that was, as the Agency wrote at  the time, ``suitably specific for broad-scale management decisions. . .  . Additional site-specific analysis…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…even the  Founding Fathers did not know whether liberty would prevail.\n\nFor far too long, Mr. Speaker, the American people have felt the same  uncertainty, years of what many viewed as America last policies that  left families struggling, dreams deferred, and our Nation asking  itself: Are we on the rise or decline?\n\nTo answer that question, we need to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…slavery, but  there has never been an abolition movement in Islam. The Koran and  hadith even contain rules for slaves and the slave trade.\n\nSharia prescribes inhumane punishments viewed as normative. Stoning  to death for adultery is common, as are public beatings of women, the  amputation of the hand of a thief, and the execution of Christians and  Jews in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…news  again, in an effort to remove not just any person here illegally but  somebody who had broken the law, an abuser, somebody who under normal  circumstances would not be viewed favorably.\n\nWe had a judge in Wisconsin stop the hearing. Oh, let's not worry  about putting this guy in jail. Let's let him sneak out the back door  so he is not removed from…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…as we  face difficult national issues. As we reflect back in 2 years, we will  have a celebration of 250 years of the greatest country in the world.\n\nThis time capsule, when viewed 250 years from now in 2276, may it be  a reflection that, at the midpoint then, which will be today, we  navigated these challenges that we faced with great courage and great…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…civilian locations,  including Christian churches.\n\nWhile the military ruling class pledged open and fair elections, the  sham process that took place last month should be viewed as a rigged  farce and nothing more. Make no mistake, these mass atrocities will not  stop until the current regime is crippled.\n\nWith the support of the Trump administration,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…rental units as the  population needs, while competition keeps rents low and demand keeps  units plentiful.\n\nWhat has happened? Government decided to solve what socialists viewed  as problems.\n\nTo solve suburban sprawl, the socialists began imposing severe limits  and costly fees on construction permits. Builders could no longer  profit from building…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Washington completed his two terms as our indispensable  first President. He was first in war, first in peace, and first in the  hearts of his countrymen.\n\nEvery step of the way, he viewed his actions through the lens of the  precedent it would set for the Presidency and for future Presidents:  his dress, his decorum, his relationship with Congress, his decisions…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…war,'' a complete reversal of  his previous positions.\n\nSenator Murphy told CNN on Sunday that Venezuela, he said, is ``not a  security threat'' to the United States. He sure viewed it differently  in the past. Evidently, they were all for it before they were against  it. That is what we see with these Democrats: something they are for,  President Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…military indefinitely.\n\nUnfortunately, early reports suggest that this risk may be real and  that the NDS may turn out eerily similar to the rhetoric of Obama-era  officials' who viewed their remit as managing America's decline amid a  transition to a multipolar world.\n\nIf the NDS ignores the importance of maintaining American primacy,  fails to account for…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. Mr. President, having just viewed a video of my friend and  colleague Senator Alex Padilla being manhandled, thrown to the ground,  and handcuffed after identifying himself as Senator Alex Padilla and  attempting…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…any other computer-generated or       technological means, including by adapting, modifying,       manipulating, or altering an authentic visual depiction,       that, when viewed as a whole by a reasonable person, is       indistinguishable from an authentic visual depiction of the       individual.\n\n``(C) Identifiable individual.--The term `identifiable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}]