[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…16 years and marked the end of one of the longest  streaks without such an accident in U.S. history.\n\nThis devastating accident is a stark reminder that we have to remain  vigilant in our pursuit of aviation safety. More can always be done to  make air travel safer. We owe it to the victims, to their families, and  to the flying public to leave no stone…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…safety, our rule of law, and our  democracy.\n\nThose who do not join in that condemnation are either pro-crime or do  not care. It is another reminder the American people must be vigilant.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…small footprint.''\n\nHe has been straightforward with me since he arrived on the ground in  Minnesota, straightforward with our chiefs, and we appreciate that. But  we must be vigilant in making sure there is a real and thorough  drawdown. We need transparent, objective investigations and justice for  Renee Good and Alex Pretti and the many others who had…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…refused to allow their  contributions to ever be forgotten.\n\nThis is a testament to the enduring power of truth and justice and a  reminder that each American must remain vigilant in protecting both  truth and justice. As we honor Harold Brown today--and he never wanted  honor. The entire community, most of whom were Caucasian like myself,  came out.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…voting  ability, and voting rights across the country. We have disagreements, I  suppose, with our Republican colleagues about some of that, but we need  to make sure we remain vigilant and keep working hard to protect those  rights.\n\nI had a chance over the weekend to do a couple of things. Friday,  Saturday, Sunday, and Monday, I had a chance to visit churches…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…benefit. Whether it is through communications equipment,  the networks themselves, or social media, we have seen these operations  time and time again, which is why we must stay vigilant to minimize  these risks or avoid them altogether.\n\nFortunately, today, we are taking additional action to address these  and future threats. H.R. 906 would require the Federal…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, first let me thank our great Senator from  Virginia Senator Kaine. He has been the most vigilant watchdog against  over-encroachment of the military. He has been the most rigorous  watchdog in making sure Congress's power to make war and engage in acts  of war are upheld.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Constitution.  More than 140 brave officers were injured, and several lost their lives  defending this institution. Their courage deserves not just remembrance  but that we remain vigilant in upholding the rule of law.\n\nThe attack on January 6 was the result of a President who chose  division over truth, grievance over governance, and chaos over  accountability.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698551/january-6-attack"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…collective action towards a future       characterized by fighting racism and bigotry with       understanding and equality; and\n\nWhereas, it is imperative that we remain vigilant and       proactive in opposing Jew-hatred to ensure that the painful       history of the past is not forgotten or repeated;\n\nNow, therefore, be it proclaimed, That I, Representative…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…some of  the violent criminals President Trump has let out of prison.\n\nThe threat to our democracy that we witnessed 5 years ago has not  lessened, and our obligations to be vigilant in its defense and  steadfast in our pursuit of a more perfect Union is as important as  ever.\n\nThe Constitution that binds this country together is a sacred  document that…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…our  constituents and restored this crucial funding.\n\nMr. Speaker, this fight is far from over. The Trump administration is  waging a war on science and women. We must stay vigilant, and we will  fight back.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…undermine, discredit, and even erase the evidence  of Black patriotism and Black servicemembers who have faithfully served  our Nation.\n\nAgainst this backdrop, we must remain vigilant against these attacks  on Black servicemen and veterans, recognize their valor and sacrifice,  and work diligently to offer them the promise of this country that they  deserve.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Act of 2025.\n\nMr. Speaker, at a time when our country is working to achieve peace  and de-escalate military conflict in multiple locations around the  world, we must remain vigilant about the ongoing threats posed by some  of our long-term adversaries.\n\nIran has a well-established record of destabilizing the Middle East  and threatening its neighbors.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…piece of  intellectual property that they aren't willing to steal, so by hook or  crook, they are going to try to outcompete us, and we need to maintain  our diligence and be vigilant when it comes to this threat.\n\nChina is aggressively investing resources towards winning this race  for artificial intelligence, and we cannot aid them in winning the race…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Mr. Speaker, I thank Mr. Correa for his support, and I urge my  colleagues to support this sensible legislation.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, we have a duty to be vigilant about potential terrorist  threats to the homeland. This bill ensures that the Department of  Homeland Security will do just that.\n\nI urge my colleagues to support the bill,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…countless families and individuals living with the scars of that day.  It is our duty to honor their memory and ensure that attacks like this  never happen again.\n\nWe must remain vigilant against the threats posed by extremist groups  and continue to champion freedom and democracy around the world. We  must also work to strengthen the Abraham Accords, push…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…similar attacks.\n\nWe thank all of those who serve our Nation, both as civilians and  servicemembers, in the fight to secure our homeland.\n\nDespite this success, we remain vigilant in the face of continuing  threats against our country. That means continuing to analyze our  tactics, refine our strategies, and ensure that critical information is  efficiently…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…have put their lives on the line to fight  the two wildfires in Pennsylvania's Michaux State Forest.\n\nMore than 170 firefighters have responded to the emergency, including  Vigilant Hose Company No. 1 in Shippensburg, Pennsylvania. While their  work is yet to be finished, these brave men and women have already  contained more than 90 percent of the Hammond's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…children.\n\nThe CCP remains a threat to American interests. I have no doubt that  they would still like to indoctrinate American children and teachers,  and that is why we must be vigilant and pass these bills.\n\nH.R. 1049, the TRACE Act, sends a clear message: Parents have a right  to know what their children are learning, especially when curricula are  funded…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…I believe that this legislation goes hand in hand  with the previous legislation that this body just took up and passed.  It is an important step as we continue to remain vigilant and as we  continue to do what the American people elected us to do.\n\nThey elected us to keep them safe. They elected us to make sure that  the communities in which they live…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…percent of their  GDP for the protection of Europe as America shifts its focus to the  Indo-Pacific region. The CCP has made significant advances in warfare,  and we must remain vigilant while also building up our defense  industrial base in order to be prepared for any scenario.\n\nAmerica must not remain idle while our adversaries are advancing  their capabilities.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…near Fairbanks is pivotal in  space situational awareness and missile defense. This facility is  crucial for tracking objects in orbit, ensuring that America maintains  a vigilant eye on potential threats and space debris that could  endanger critical infrastructure. These efforts are vital to protecting  our Nation's interests and maintaining a leading…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}]