[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…DURBIN. Madam President, I want to thank my colleague from  Hawaii. If he can spare 30 seconds, I would like to tell him a story.\n\nYears ago, I went to India to the dusty villages--not the big  cities--just to see what USAID was doing. I heard about it. I wanted to  see it. The most graphic example I can remember from that experience  was when they…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688339/usaid"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…people and the need for refugee  rights. We know that thousands of Palestinians were ethnically cleansed  in 1948, and nearly 800,000 were violently removed from over 400  villages, completely erased. Many of them carry their keys to this day,  Mr. Speaker, hanging them on the wall of their new, temporary homes in  hopes that one day they will be able…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…field  and artillery and air support units in the sky. When he was later  transferred to the 173rd Airborne, he served as a liaison officer,  bringing aid and support to local villages.\n\nHe received several medals recognizing his courageous service over  four campaigns in Vietnam, including the Bronze Star, the Army Air  Medal, and the Army Valorous Unit…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Tribe's way of life has been challenged  through forced relocation, damage to wetland drainage projects, and the  need to acquire special use permits to reside in their own villages.\n\nIn 1998, Congress established the Miccosukee Reserved Area, granting  the Tribe rights to much of their ancestral lands within the park while  supporting environmental restoration.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Klallam Tribe. These are lands once tied to the Federal  hydroelectric project, lands acquired during the dam removal process,  lands that include cultural sites, historic villages, and ecological  areas directly connected to the Tribe's stewardship of the Elwha River.\n\nPlacing these lands into trust is not just a procedural act. It is a  promise fulfilled.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…issue.\n\nIn fact, law enforcement agencies are already utilizing       firearm-classified less-than-lethal devices in every state at       every level: states, counties, towns, villages, townships,       and even correctional facilities have already deployed them       and many more are moving to adopt them. Moreover, even in       states with use of force…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Tanana Chiefs Conference in opposition to this  resolution.\n\nWho is this conference made up of, you might ask, Mr. Speaker? It is  made up of 37 federally recognized Tribes and villages across the Yukon  River Basin. These Tribes served as cooperating agencies in the RMP  development process working to ensure protection for critical salmon  habitat and other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…the covenant of federalism, and they said: We are going to make you pay  taxes on the taxes you have already paid to your States, to your  cities, to your towns, to your villages, to your school districts. We  are going to tax you on the money you have already paid in taxes at the  State and local levels.\n\nThat caused some people's taxes to go up,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…promised under the Alaska Native Claims Settlement  Act.\n\nAfter more than 50 years, Cape Fox Corporation, representing the  village of Saxman, is among the last southeast villages still waiting  for a full land entitlement.\n\nH.R. 2815 fixes that. The bill authorizes a simple strategic land  exchange, about 180 acres, to finally connect two Cape Fox…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to be held over a 10-year period, Congress  had previously mandated energy leasing in the area, an action that has  the support of local North Slope communities and Native Villages.\n\nLast Congress, we held a bipartisan legislative hearing on H.R. 6285,  ``Alaska's Right to Produce Act,'' where we heard from Tribal  representatives, including Inupiat…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Native people in my State serve at higher rates in the  military than any other ethnic group in the country--what I refer to as  special patriotism. You go into Alaska Native villages, you ask how  many veterans are there, and almost everybody raises their hand. It is  remarkable. It is patriotic. It is incredible. If the rest of the  country were like…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…jet fuel industry in Burma is a  key and important target for sanctions because it directly enables the  junta's unlawful airstrikes against civilians, places of worship,  villages, hospitals, IDP camps, and schools.\n\nDepleting the government's ability to control and profit from  aviation fuel imports and distribution will inhibit the junta's ability…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…grounded in rights, not repression, but grounded in  freedom.\n\nMr. Speaker, that spirit is alive today in the streets of Tehran,  Shiraz, Isfahan, and more than 1,000 towns and villages across Iran.\n\nWe often talk about the American Revolution, but we rarely pause to  recognize what it really was: a movement of ordinary people who refused  to accept that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…The Miccosukee Tribe is currently located in the Greater Everglades  in southern Florida. Following Federal recognition of the Tribe in  1962, the Miccosukee's northernmost villages within what became  Everglades National Park were managed under a special use permit until  1998, when Congress placed that permit framework with the MRAA,  authorizing the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…America. It is deeply  ingrained in Alaska's culture, the ability to make this art. It also  provides important economic opportunity for our artists in many of  these remote villages, artists who rely on the ability to sell these  works to Alaskans and the hundreds of thousands of people who come to  my great State to visit who want to take home a piece…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…timberlands and substantial sand and gravel material resources that are  essential for roads, airstrips, and other infrastructure. Local access  to these materials allows rural villages  in this region to avoid costly imports that contribute to the high cost  of living in these communities.\n\nImportantly, the area also contains the Dalton Highway and the right-…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Arctic Circle that represents roughly 10,000 residents. The       Borough's jurisdiction includes the entire National Petroleum       Reserve-Alaska (NPR-A) and the eight villages within it. In       1972, the North Slope Inupiat formed the Borough, in part, to       ensure our communities would benefit from oil and gas       development on their ancestral…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]