[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…courts under Article III  of the Constitution.\n\nSpecifically, he has done the following:\n\nDirected and permitted his subordinates and attorneys at the  Department of Justice to violate their oath to uphold the Constitution,  laws of the United States, and the rules of professional ethics by  adducing misleading and willfully false representations to the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Padilla  and Senator Whitehouse, a very simple change in the law--four words--so  that Federal agents have the same kind of legal responsibility and the  same liability, if they violate rights, that any local cop would have.\n\nSection 42, United States Code 1983--I think it was passed in 1871-- says that ``Every person who, under color of any statute, ordinance,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Republican bill gives billions more to Immigration and Customs  Enforcement (ICE) when their unidentified, masked agents are abusing  their power with dangerous sweeps that violate due process and create  human and economic destruction. These indiscriminate raids do not make  our communities safer--and often have the opposite effect when done in  sensitive…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…deliberately enacted by the Council for the       benefit of all District residents.\n\nH.R. 2096 would repeal several efforts by the Council to       ensure that police officers who violate the law and       contravene public safety are appropriately disciplined. The       bill would strip the Chief of the Metropolitan Police       Department (MPD) of the authority…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…these things behind the curtains.\n\nThomas Jefferson is quoted embarrassingly in this resolution for the  proposition that to take property from one to give to another is to  violate arbitrarily the first principle of association. This is a  bizarre argument, not only because Thomas Jefferson died in 1826, a  decade before the word ``socialism'' even existed…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and unorganized body of Federal criminal law puts well- intentioned, law-abiding citizens definitely at risk. Legal scholars  suggest that everyday Americans may unknowingly violate multiple  Federal crimes without ever being made aware of it. Yet, we cannot  meaningfully address the consequences of this bloated system until we  fully understand the scope…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…disapproval resolution in the first place, they both strongly oppose  this disapproval resolution. Their letter states that this disapproval  resolution, if enacted, not only would violate D.C.'s right to self- government but ``would have major and immediate impacts on tax  administration in the District.''\n\nMr. Speaker, I finally include in the Record a letter…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…much more than a law enforcement action. It was an action of war and  regime change in another nation.\n\nThis country is powerful enough to do almost everything, but you  can't violate the Constitution. That is different.\n\nCan Secretaries Hegseth and Rubio give us examples of other so-called  law enforcement actions that have cost U.S. taxpayers billions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…right here at home. Our laws  are clear. You can refuse illegal orders. You can refuse illegal  orders. You must refuse illegal orders. No one has to carry out orders  that violate the law or our Constitution.''\n\nOn November 20, 2025, in response, President Trump called for their  execution. In one social media post, he wrote: ``It's called SEDITIOUS…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…My bill changes that. The Qualified Immunity Accountability Act  lowers the standard for prosecution so Federal law enforcement officers  can be held accountable when they violate an individual's civil rights.  It makes clear that no Federal agent, ICE included, is above the  Constitution, and when rights are violated, there will be real  consequences.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…deliberately enacted by the Council for the       benefit of all District residents.\n\nH.R. 2096 would repeal several efforts by the Council to       ensure that police officers who violate the law and       contravene public safety are appropriately disciplined. The       bill would strip the Chief of the Metropolitan Police       Department (MPD) of the authority…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…and not tactics that local law  enforcement engage in. Our local law enforcement follows the law. They  wear body cameras. They are subject to disciplinary actions if they  violate due process rights.\n\nICE is completely unaccountable and totally out of control. We have  seen them assault citizens. We have seen them assault elected  officials, including…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…United States should never be responsible for sending people to  face persecution, especially those who have risked everything to seek  refuge right here. These actions not only violate our moral  responsibilities and our shared humanity, but they are in direct  conflict with the values upon which our Nation was founded.\n\nI am the proud daughter of immigrants…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…when its actions are  unconstitutional and have a broad national effect. If a federal judge  can no longer issue a national injunction, the Administration could  continue to violate the rights of the American people until the case  reaches the Supreme Court. This bill is designed to drastically limit  federal judges' ability to prevent unconstitutional…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…now of more  than 200 combatants, with U.S. troops injured, with an armada arrayed  around, a naval interdiction of oil, and a blockade of this country's  economy, it would violate every reasonable meaning of this term, and to  pretend otherwise would weaken the respect that this institution should  aspire to.\n\nFinally, to my colleagues, there has been…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…subsections       (b) and (c) of section 206 of the International Emergency       Economic Powers Act (50 U.S.C. 1705) shall apply to a person       that violates, attempts to violate, conspires to violate, or       causes a violation of regulations promulgated to carry out       this section to the same extent that such penalties apply to       a person…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…this       section, the President shall submit a copy of the license to       the appropriate Members of Congress.\n\n(2) Penalties.--A person that violates, attempts to       violate, conspires to violate, or causes a violation of this       section or any regulation, license, or order issued to carry       out this section shall be subject to the penalties…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…partisan. It should be common  sense. However, under the Biden administration, the Federal Government  decided to abandon common sense. It allowed men to enter women's spaces  and violate their privacy and dignity.\n\nUnder President Trump, the government has restored basic biological  truth: men are men, and women are women. I applaud the President for  his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…political witch hunts.\n\nI guess I am just absolutely shocked by my colleague on the other  side who believes that the Federal Government has the right to invade  the privacy and violate the Fourth Amendment rights not only of sitting  U.S. Senators but the 340 million people in this country. He apparently  believes that the Federal Government has the right…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696923/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of my colleagues on the other side of the aisle said  that the defund the police movement is one of reimagining the current  police system to build an entity that does not violate us, while  relocating funds to invest in community services.\n\nAnother colleague said that the defund movement isn't new. Folks are  just finally listening.\n\nDefund the police,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…about how  ridiculous it was that, on both sides of the aisle, there were blatant  abuses of this trust that the American people put in the people who  represent them not to violate that trust by trading securities for- profit on the very issues they are supposed to be voting on objectively  to benefit the United States of America. Yet, that is precisely…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…admits more legal immigrants  under our laws than any nation on the planet and will continue to do  so, but that does not give license to millions of foreign nationals to  violate those same laws.\n\nThat is the simple truth the Democrats refuse to acknowledge.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…to reduce Russia's access to these semiconductors by  authorizing sanctions on any foreign adversaries that materially  support Russia's military and intelligence services, violate U.S.  export laws, and steal U.S. intellectual property.\n\nIt further requires a report on whether China is providing  significant support to Russia's military and updates…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…introduce legislation to stop the abuse of universal injunctions that  we are seeing all across the country--all of this to stop the Trump  agenda.\n\nUniversal injunctions violate the words of the Constitution that we  agreed that the courts can only hear ``case or controversy.'' And that  is a requirement of article III of the Constitution because…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…and  regulatory crimes that nobody could reasonably expect an ordinary  citizen to find or understand.\n\nThe Federal code has grown so bloated that a person can unknowingly  violate a regulation they have never heard of and the government can  still throw the book at them.\n\nEven former Harvard University Professor Harvey Silverglate estimates  that the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the       International Emergency Economic Powers Act (50 U.S.C. 1702       and 1704) to carry out this section.\n\n(2) Penalties.--A person that violates, attempts to       violate, conspires to violate, or causes a violation of       subsection (d)(2)(A) or any regulation, license, or order       issued under that subsection shall be subject to the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enforcement action on, or execute a consent       order based on, practices that are alleged to be inconsistent       with any such guidelines, unless the practices allegedly       violate section 2.       SEC. 4. DEFINITION OF COVERED DEVICE.\n\nAs used in this Act, the term ``covered device''--\n\n(1) means a consumer product, as defined by section 3(a) of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the       International Emergency Economic Powers Act (50 U.S.C. 1702       and 1704) to carry out this section.\n\n(2) Penalties.--A person that violates, attempts to       violate, conspires to violate, or causes a violation of this       section or any regulation, license, or order issued to carry       out this section shall be subject to the penalties…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…opportunities for American students to learn in China.\n\nHowever, this funding comes with strings attached. These teachers  could also be terminated if the CCP deems that they violate Chinese  laws or go against the national interest of China.\n\nThe CLASS Act combats this foreign interference by preventing our  public schools from accepting these funds.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…that began in January and picked up speed  in the spring caused alarm and concern by many of us in the Senate that  we have an OMB Director and an administration willing to violate  bipartisan agreements from the last Congress, commitments to spend  money, and contracts and agreements with partners and allies around the  world and across many different…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}]