[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…is the misuse of the military at home and abroad. When a  President begins to use a military for unpurposeful purposes, when a  President deploys American forces in violation of the law to American  cities, when a President assembles top leadership--flag officers,  generals, admirals--and tells them that our cities are to be military  training grounds,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…missions for his chaotic and violent mass deportation  campaign. He has federalized and deployed National Guard troops in  American cities against our own citizens in violation of the law.\n\nThat is why just last Friday the Ninth Circuit Court of Appeals  ordered National Guard troops off the streets of Los Angeles, ruling  the deployment was unlawful.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…supporting unhoused jobseekers. In  Harrington, they are guiding caregivers through pages of red tape just  to access basic support.\n\nThis isn't just morally wrong. It is a violation of the law. Congress  appropriated these funds. This administration is not only defunding  vital community programs. It is defying the will of the American  people.\n\nWith just…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690588/cutting-lifeline-of-institute-of-museum-and-library-services"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…to Trump's dangerous rhetoric.  Instead, we should be considering the resolution introduced by  California's Democratic delegation, which condemns anyone engaged in  violation of the law, violence, or vandalism. Most importantly, it  stands up for our constitutional rights to due process and free  expression and shows our appreciation to local law enforcement…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693142/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…is saying about the violation of the foreign emoluments  clause, but let's let a court decide. Let's bring it to a judge on the  Federal court--because in my view this violation of law is so abjectly  and obviously clear that it demands an answer from the courts.\n\nAccordingly, in a moment, I will ask for unanimous consent to pass a  resolution that would…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Guard to the District of Columbia,  Los Angeles, Memphis, and Chicago and has attempted to deploy the  National Guard to Portland. These deployments are a flagrant violation  of U.S. law, including the Posse Comitatus Act, as noted in recent  court decisions. Not only have these deployments created chaos in  American cities and communities, they have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…officer and unit of government in violation of the sovereignty thereof;  and terminated and purged career Department of Justice attorneys  without reasonable cause and in violation of the law in retaliation for  their legitimate investigatory and prosecutorial  work under prior administrations, including in relation to the January  6, 2021, attack on the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…experience, to  deliver accountability.\n\nThe administration did not stop there. By cracking down on sanctioned  oil shipments and seizing illicit tankers operating in violation of  U.S. law, President Trump sent a clear message: Sanctions will be  enforced. Criminal profits will be cut off. Rigged systems will be  dismantled. When you stop the money, you…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…supporting this initiative. It was completely untrue. I never did  anything of the sort. I didn't transfer any money to it. Even if I had,  it wouldn't have been a violation of the law.\n\nYet, Ms. Ravel had a brief stint as chair of the FEC herself, and she  has since turned this into sort of a gig where she can make partisan  claims and give them a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Department of Justice opinion also says, in part, that an  employee is provided whistleblower protection ``when the employee  reasonably believes that the disclosure reveals a violation of law or  rules or exposes serious wrongdoing as defined by statute.''\n\nThrush, Feuer, and Goldman's opinion piece fails three ways. They  misled the public by creating a false…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(d) Savings Clause.--No provision of this section or the       amendments made by this section shall be construed to permit       a review of conduct that was not in violation of law or       policy at the time of the alleged conduct.       SEC. 526. INCLUSION AND COMMAND REVIEW OF INFORMATION ON                     COVERED MISCONDUCT IN PERSONNEL…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…FLPMA, and neither does it align with Congress' multiple use mandate.\n\nThe Biden RMP is instead very clearly a mineral withdrawal enacted by  climate activists in direct violation of the law.\n\nThe Biden administration's decision to terminate mining in Wyoming's  PRB is not only irresponsible and harmful but downright illegal, a  mechanism used by the governing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…government, which, in  my view, based on what we saw and what we are seeing as the facts  continue to come in from the Arctic Frost investigation, there was  clearly a violation of the law and a law that needs to be strengthened  and clarified so protections are in place for future Members of the  U.S. Senate.\n\nAgain, I would argue, someday, probably,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "James Risch", "party": "Republican", "sentence": "…problem.\n\nWhen you are in the business of flying drugs into the United States-- drugs that kill our children and hurt our country and destabilize our  hemisphere--in violation of U.S. law, and when you invite Russia,  China, and Iran to set up shop right in our backyard and do the things  that they are doing, there is going to be a price to pay. Maduro…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…19. When it is determined by the Chair and Ranking Minority       Member, or by a majority of the Subcommittee, that there is       reasonable cause to believe that a violation of law may have       occurred, the Chair and Ranking Minority Member by letter, or       the Subcommittee by resolution, are authorized to report such       violation to the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}]