[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…chaos, and to silence dissenting voices in our communities, at our  colleges, in the courts, and, in fact, even in Congress.\n\nThese actions are lawless, a complete violation of our constitutional  rights to due process, and void of common sense and compassion.\n\nKnow this, for those of you watching at home who might be tempted to  think that this is not…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…person  shall be deprived of life, liberty, or property without due process of  the law.\n\nIn his conduct of the Office of the President of the United States,  and in violation of his constitutional oath to faithfully execute the  Office of the President of the United States and to the best of his  ability preserve, protect, and defend the Constitution of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…psychological terror.\n\nAgain, we are talking about a U.S. citizen here. When we say this can  happen to any of us, this is what we are talking about. This kind of  violation of our constitutional rights is how leaders use terror to  intimidate us into silence.\n\nI don't want to hear about how everyone is going after the violent  criminals in this country…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694000/cbp-turns-houston-airport-into-trap"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Presidential Power by Calling for the Execution  of Members of Congress.\n\nIn his conduct of the office of President of the United States,  Donald John Trump, in violation of his constitutional oath to  faithfully execute the office of the President of the United States  and, to the best of his ability, preserve, protect, and defend the  Constitution…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…American citizens and to protect all of us from wrongful deportation  and wrongful detention.\n\nThis administration does not seem to care about this complete and  total violation of our constitutional rights, a right that we are all  entitled to, regardless of status.\n\nUnder Trump, ICE and DHS have become a means to carry out political  arrests and to silence…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…allowed him to be the special counsel. But he goes to great lengths to  make certain that we could never find out about this deep invasion of  our privacy and the violation of our constitutional rights. So he went  to an Obama appointee, Judge James Boasberg, who signed nondisclosure  orders--or you may call them a gag order. They did this to ensure that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}]