[{"senator": "Al Green", "party": "Democrat", "sentence": "…line. This is the line. This is the solution.\n\nWe are in a countdown to impeachment. I intend to bring Articles of  Impeachment to remove this President, who is normalizing violations of  the Constitution. He could care less about due process. Due process,  the notion that you ought to be able to at least raise your hand and  say, hey, you have got the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…because of a head injury, and her arms,  her wrists, might be suffering permanent damage. This was a citizen, a  citizen, mind you.\n\nThis is the worst case of mass civil rights violations by the Federal  Government in recent history.\n\nMr. Speaker, 2 weeks ago, Minnesota stood up to call out these  illegal abuses by masked Federal agents, and a citizen, a mother…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…numbers show that 73 percent of  those who have been detained have no criminal record and the vast  majority of the remaining 27 percent have minor convictions, like  traffic violations.\n\nPeople are detained in horrific conditions. Facilities are  overcrowded, and people are sleeping on the ground next to toilets.  Folks are denied medical care. If the private…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…eighty-two-year history       had a president fired the bureau's director before his ten-      year term was up--and in that case, the move was in response       to clear ethical violations and enjoyed bipartisan support.\n\nThe Comey firing was not President Trump's only assault on       referees who refused to come to his personal defense. Trump       had attempted…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…separation of budgetary powers and creates a  private right action for individuals, States, and local jurisdictions  that have been harmed by the administration's repeated violations of  the ICA.\n\nPOCCA would also hold accountable any public official with  decisionmaking authority who knowingly and intentionally violates the  ICA, such as Elon Musk.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…the D.C. Metropolitan       Police from 2015 to 2021. Thirty-seven D.C. Metropolitan       police officers were fired for allegations criminal conduct,       civil rights violations, and officer conduct violations.       These dangerous officers were reinstated, on average, 8 years       later, and 36 of those officers were paid $14.3 million in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…illustration of democratic backsliding,  parliamentary elections were held in the fall of 2024 that were neither  free, nor fair, and tainted by numerous and serious electoral  violations.\n\nThis legislation is a response to the deteriorating democratic  situation in Georgia. It will let the Georgian people know that we  stand by them in their quest for democracy,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and arrest U.S. citizens, as well as undocumented immigrants, without a  judicial warrant, in violation of the Fourth Amendment. And that  violation is only one of many violations of constitutional, explicit  guarantees that we have seen repeatedly in Minneapolis, but around the  country.\n\nMs. Martinez is from Chicago. Mr. Rascon is from California.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…after  economist has warned us.\n\nMr. Speaker, that is not what I am here to talk about today. I rise  today to speak about the Trump administration's egregious Hatch Act  violations and also Congress' failure to hold Donald Trump and his  administration accountable for these gross violations of law.\n\nThat is, of course, a theme that we have seen. Trump…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Abu Dhabi-backed investment from MGX bought  $2 billion of Trump's coins to make an investment in Binance, a company  that had been under investigation for numerous legal violations. Trump  and his family will make tens of millions of dollars just on that  transaction from the interest earnings alone. That is Abu Dhabi's  money.\n\nMore concerning, by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…terrorizing  communities and shredding the Constitution.\n\nWe are watching masked, armed agents force their way into homes  without judicial warrants. We are seeing blatant violations of the  Fourth Amendment. We are witnessing agencies act with impunity. We are  hearing about kids getting kidnapped on their way to school and  grandparents dragged from…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…is not the question for today. That  is not the question for right now. Right now, we need to take  immediate, commonsense steps to stop the worst of the violence and the  violations that Americans are suffering.\n\nSo, to be clear, I will not vote for any funding for DHS, if we do  not take action to stop this emergency unfolding in my State.\n\nAnd I truly…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, it has been 365 days of Trump 2.0, 365 days of terror,  abuse, and violations of our rights.\n\nAfter infusing $150 billion into DHS and ICE, people in this Chamber  have chosen to give them even more money, even after seeing what DHS  does with its…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…answers.  It is imperative that Congress receives the information needed to  conduct the necessary oversight. We must ensure no taxpayer dollars  contribute to human rights violations or anyone's death--most  especially an American abroad.\n\nAs an American, Ms. Abu Akleh was entitled to the full protections  afforded to U.S. citizens living abroad. As Members…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…government employee of the  White House Office, in violation of the statutory authorization and  restrictions of such designations. This false claim has also been used  to commit violations of the ethics, disclosure, and conflict-of- interest laws applicable to government officers and regular employees.\n\nContrary to the government's claim in court, Mr. Musk…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…119-299)  to accompany House Resolution 722 should have included in its waivers  of all points of order against consideration of H.R. 5371 a disclosure  of the following violations:\n\nSection 303 of the Congressional Budget, which prohibits  consideration of legislation providing new budget authority, a change  in revenues, or a change in the public…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696091/report-h-rept-to-accompany-h-res-722"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…at the  time, in 1960, had the highest per capita income in the Western  Hemisphere.\n\n* * *\n\nMs. SALAZAR. Mr. Speaker, I am asking for unanimous consent to  withdraw the violations of the rules and continue with my speech, which  is that there are many people on this floor that have--\n\nMs. SALAZAR. Mr. Speaker, there are many people on this floor who…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "John Rose", "party": "Republican", "sentence": "…letter urging Attorney General Pam Bondi to launch a  criminal investigation into the activities of Special Counsel Jack  Smith and to consider possible Fourth Amendment violations during  Operation Arctic Frost.\n\nThat deserved scrutiny. That deserves answers. It doesn't merit  restitution paid for by hardworking waitresses, truck drivers, and  small…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…2011, our forces aided the  rebels to oust Muammar Qadhafi. The result was a brutal 6-year war that  saw the proliferation of jihadist groups and widespread human rights  violations, including the resurgence of slavery. Weapons were spread  throughout Africa. Our intervention helped spur mass migration into  Europe and contributed to widespread instability…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…preceding year. Reported       below is the information describing the Committee's       activities in 2025 in the categories set forth in the Act:\n\n(1) The number of alleged violations of Senate rules       received from any source, including the number raised by a       Senator or       staff of the Committee--181. (In addition, 5 alleged       violations…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proxies and led to Hamas's October 7 attack on Israel.\n\nIran's ejection of the International Atomic Energy Agency from its  facilities marked the latest in a long chain of violations of Iran's  nuclear commitments. These actions confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…between religions. Throughout his tenure, he has remained on the  forefront of meeting the rising challenges our global community is  facing. Be it climate change, wars, violations of human rights, His  All-Holiness is undaunted and unwavering in his commitment to  alleviating suffering and championing justice.\n\nDuring this chaotic time in our world,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…programs, and policies only go to  companies that can certify their supply chains are free from this  abuse.\n\nAmerican consumers should not be complicit in human rights  violations. American businesses should not profit from forced labor,  and our government, our tax dollars, must never enable oppression.\n\nMr. Speaker, I urge strong support, and I reserve…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…targeting criminal rings, and the Trump  Administration isn't ignoring fraud as Governor Walz had done for  years. They are targeting that criminal ring for immigration  violations, just as they have done elsewhere.\n\nNot long ago, ICE agents arrested more than 150 illegal alien sex  offenders during a major enforcement surge across the State of Florida.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…without  the assistance of an attorney and is attempting to use a civil action  known as quo warranto to remove Senator Wyden from office for alleged  State campaign finance violations in the 2022 election. This suit  challenges the Senator's right to be seated in the Senate, an issue  which the U.S. Constitution commits exclusively to the Senate.\n\nThis…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Health and Human Services, Robert F.  Kennedy, Jr., to ask for an investigation into what happened in  California, into how this was allowed to happen and to any illegal  violations that may have occurred. Specifically, I am asking Secretary  Kennedy to investigate whether Covered California violated  HIPAA or any other laws, who authorized the use of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…enterprise. It is an  illegitimate manipulating of price and supply and demand.\n\nHow else can prices be affected besides supply and demand? Well, you  can have antitrust violations. If all the makers of microwave ovens get  together in a back room over cigars and a sip of whiskey and say they  are going to fix prices at a certain price, they can run…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…legislation has workable compliance deadlines. It allows trading  in broad-based index and mutual funds and requires real enforcement. It  has teeth with substantial penalties for violations. As public  servants, we should hold ourselves to a higher standard, Mr. Speaker,  and avoid the mere appearance of corruption and impropriety.\n\nUnfortunately, too many Members…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…2023 alone, China supported the transfer of nearly $300 million worth  of semiconductors to Russia, including for use in missiles and drones.\n\nThe CCP's actions are blatant violations of U.S. export controls and  detrimental to our ongoing peace efforts. China's economic and  industrial support for Russia is a critical lifeline for the Russian  military.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…example is that of Mario Obdulio Orellana in Texas, a 57- year-old El Salvadoran national, who was indicted by the Department of  Justice on Federal immigration and voter fraud violations.\n\nNow, I could go down and give more and more examples. The fact is,  yes, these are good examples in which we have been able to intervene  and stop this voter fraud and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]