[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…legislation not because they care  about public safety. If Republicans cared about reducing crime, then  they would tell Trump to stop delaying funding for community violence  prevention programs that already were passed with bipartisan support.\n\nIf Republicans cared about victims, then they would stop making cuts  to the crime victims fund so that people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…comprehensive. Let me just give you  a handful of the ways in which the Trump administration is trying to  make our communities less safe.\n\nFirst, they closed the Office of Gun Violence Prevention. This was  something the Biden administration set up to try to better implement  the Bipartisan Safer Communities Act. This wasn't a terribly political  office. It was…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…overwhelming.\n\nExcuse me, but if we are going to sit here and talk about protecting  our kids, if my colleagues are really willing to do that, then they  should bring up gun violence prevention legislation. They should bring  up policy that really does the very thing that they are pretending to  do through this bill: Protect our children.\n\nThere is no greater…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of gun  violence. I thought there would be bipartisan support for that. To a  certain extent, there was.\n\nI championed investment in the creation of a Firearm Violence  Intervention and Prevention Fund with Delegate Marcia Price from  Newport News when I was in the State senate. This program and fund  would provide a pathway to research demographics and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…criminalization--and they save taxpayer dollars by shifting       scarce resources away from mass incarceration and toward       education, housing, mental health, and violence prevention.\n\nH.R. 5107 and H.R. 5214 would undo this progress. By       stripping away essential police accountability measures and       re-imposing wealth-based pretrial detention,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…informed practice, health and behavioral health prevention  and intervention, human trafficking and human rights, social economic  policy and development, trauma and violence prevention, and many more.  Its students contribute countless internship hours to institutions  across Georgia. And alumni of its Athens and Gwinnett campuses, as well  as its…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…from the  University of Chicago's Community Violence Intervention Leadership  Academy. This distinction highlights her as a local and national leader  when it comes to violence prevention.\n\nAs the executive director of the Cleveland Peacemakers Alliance and  in her current role as the administrator of the Cuyahoga County Office  of Violence Prevention,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…programs.\n\nPresident Trump is actively making gun violence worse. He froze  funding allocated to community violence intervention organizations,  shut down the Office of Violence Prevention, and made it easier to buy  guns.\n\nGun violence is a public health issue, but the CDC has been stripped  of medical experts and leaders.\n\nLet's be truthful about the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694900/national-guard-deployment"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…administration has cut services at Social Security, fired medical staff  at VA hospitals, and withheld aid to food banks, children's health  programs, and community violence prevention efforts. They have waged a  political war against universities and scientific research, and  illegally froze over $400 billion in congressionally appropriated  funds,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…save drivers money at  the pump.\n\nNo. 9, unleashed ICE at schools and hospitals and churches to  threaten children and families.\n\nNo. 10, disbanded the Office of Gun Violence Prevention, which  championed the first Federal gun safety legislation in more than 30  years.\n\nNo. 11, repealed the Biden administration's AI protections for  minority communities…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…administration is making this much harder. This White House  has worked to unwind the very protections that are designed to keep us  safe. They have cut critical funding for gun  violence prevention programs at the Department of Justice and have  weakened the ATF, making it easier for guns to fall into the wrong  hands and for gun crimes to go unsolved. They even…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…American people. Yet, every day that  we delay, lives are lost.\n\nI urge my Republican colleagues to join House Democrats, the  Congressional Black Caucus, and the House Gun Violence Prevention Task  Force in advancing meaningful, commonsense reforms that will save  lives, reduce violence, and protect all Americans.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…trying to buy a home and yet another generation locked out of  building wealth.\n\nLet's talk about public safety. While they are cutting afterschool  programs and community violence prevention, they are pouring millions  of dollars into militarizing police departments. They are criminalizing  our communities while stripping away the very resources that keep…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…checks in my State. In  the wake of the shooting at Club Q, we raised the age to purchase a  firearm from 18 to 21. This year, Governor Polis signed three  commonsense gun violence prevention laws restricting the sale of  certain semiautomatic firearms, requiring retailers to keep ammunition  locked, and setting age limits for gun shows.\n\nColorado is making…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and disease  outbreaks.\n\nHe has perpetuated distrust in vaccines, while we see the highest  number of measles cases in more than three decades.\n\nHe has decimated gun violence prevention research while 10,000 people  have been killed by gun violence, and that is just so far this year,  including Georgia officer David Rose, who was shot and killed while…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695085/commending-myesha-cooper-and-robert-johnson-south-fulton-police-officers"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…established under       subsection (c).\n\n(4) A description of the role of the Coast Guard       Investigative Service with respect to sexual harassment and       sexual violence prevention, response, and recovery at the       Coast Guard Academy.\n\n(5) A description of the role of support staff at the Coast       Guard Academy, including chaplains, with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]