[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…illegal tariff policy is making  that worse.\n\nI heard concerns from providers and patients about the impact that  Medicaid cuts are going to have on hundreds of thousands of Virginians.  I heard from State legislators and local government officials about the  concerns they have about shifting costs on their budgets. That is why I  oppose the energy appropriations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694882/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…families buying gifts, clothes, or shoes for  their children does not sound very golden to me,\n\nTo the young constituent who wrote to me, I will fight to lower costs  for all Virginians and all Americans and to keep Tariff Bear where he  belongs, which is in hibernation.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692923/lowering-costs-for-all-virginians"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…talking about, inevitably we have to look at Medicaid, Medicare, and  Social Security.\n\nWe look at the fact that in Virginia, just eliminating Medicaid  Advantage is 660,000 Virginians. We see that 46 percent of the children  in America receive their healthcare through Medicaid. When we look at  Medicare, it is beyond belief what that would do.\n\nI am looking…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…skyrocket, and  kids across the country will suffer.\n\nAmericans on Medicaid are your grandparents, your neighbors, your  friends, and they are at risk because of these cuts. Virginians, in  particular, are vulnerable because even if 1 percent of Federal funding  of Medicaid is cut, 600,000 Virginians will lose their  Medicaid expansion coverage. This means…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690296/medicaid-is-americas-healthcare-safety-net"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…attack on their faith or their culture.\n\nThis rot--this un-American activity--has been in this country a long,  long time.\n\nJust the other week, I was sitting with a group of Virginians who  happened to be Muslim Americans. One of the individuals I have known a  long time, has been a community member and well-known business guy,  and happens to also be Muslim.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…premiums increase by $4,675. A 60-year-old couple  earning $82,800 a year will see their premiums increase by $11,968.\n\nMy State legislators have predicted at least 60,000 Virginians will  have to cancel their insurance coverage. Who are some of these people?\n\nWe have heard stories, at least under the Medicaid cut debate, we  heard Speaker Johnson say,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, Virginians are already paying the price  for the one big, ugly bill.\n\nTwo small-town clinics and one regional urgent care center in  Virginia just closed as a direct result of the bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…cooperation,  prevent last-minute crises, and ensure that lawmakers are putting the  American people first.\n\nThis budget is an unserious proposal that guts healthcare programs  that Virginians count on. I won't vote for a bill that will lead to  kids, veterans, and seniors losing the care they need.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688714/members-of-congress-should-show-up-to-work-without-pay-during-a-shutdown"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…this country?\n\nI know what the American public thinks about this. There was a poll  that was released today, and this is completely consistent with what I  have heard from Virginians. And Virginia is one of the most pro- military States in this country. I am on the Armed Services Committee.  One out of every eight Virginians is a veteran. That is not…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…annual premiums increase $2,571. A 60-year-old  couple earning $82,800 a year will see their annual premiums increase  $11,968. That is a 174-percent increase. That is what Virginians are  facing if we can't find common ground to solve this problem, even  temporarily.\n\nOur former colleagues in the General Assembly have predicted that at  least 60,000 Virginians…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Mr. Speaker, while we will miss him, we are grateful for his service  to Virginia's Seventh Congressional District and wish him every success  in his next endeavor serving Virginians.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…myself, I thank the crews operating  out of the new Aldie Fire Station for their service and dedication to  our community.                   Effects of Big, Ugly Bill on Virginians\n\nMr. SUBRAMANYAM. Mr. Speaker, the big, ugly bill the House passed is  actually far worse than we thought for Virginians.\n\nA new report shows that the red tape this bill…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…who was  just put on a 30-day leave with no promise to keep their job.\n\nThis agency helps keep 364,000 of Virginia's seniors out of poverty,  supports over 181,000 disabled Virginians, and upholds the American  promise that if you spend your life paying into a system, the next  generation will have your back.\n\nThis agency is already understaffed, only…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688274/cuts-to-social-security-administration"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…youth program that teaches kids coding and how to fly  and operate drones, provides mentorship, and brings communities  together.\n\nAs camp director, George encourages young Virginians who are  interested in pursuing technology-based careers as their pathway to  success.\n\nGeorge's dedication to STEM education is contributing to the future  of learning and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698648/recognizing-george-hinckley"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…this solve my problem? It  creates more.\n\nI spent the August recess mostly in my district, but I spread out a  little bit beyond my district because I am one of only two Virginians  on the Energy and Commerce Committee. Healthcare, in particular, has  been very important to me. I spent time talking to my constituents, and  listening, more importantly,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Congressional District, my friend, Rick  Grizzell, from Goochland County, Virginia.\n\nAfter Hurricane Helene swept through the Carolinas, Tennessee, and  Virginia last year, Virginians across the Commonwealth answered the  call.\n\nRick formed a team of Virginians, in conjunction with the Goochland  County Tea Party, to collect donations and take them to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690844/recognizing-rick-grizzell"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…California, DC, and 11 other States can impose  an electric vehicle mandate that will take away consumer choice, drive  up prices, and eliminate jobs across the country.\n\nWest Virginians don't want California's climate policy. West  Virginians don't want California's EV mandate. And I am confident that  most Americans don't want these things either. That…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and serve. As  Sheriff Foster begins this next chapter, we offer him our heartfelt  thanks for his decades of service and his unwavering protection of his  fellow Southwest Virginians.", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694755/recognizing-the-dedicated-service-and-leadership-of-sheriff-charles-foster-of-wythe-county-virginia"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…recognize  National Family Caregivers Month and to honor the more than 63 million  Americans who selflessly care for their loved ones. That includes more  than 1.5 million Virginians who step up every single day for their  parents, spouses, and family members.\n\nAs a Navy veteran, a nurse practitioner, and someone who has seen  firsthand the challenges…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696931/recognizing-national-family-caregivers-month"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…member of my team. His pride for the 1st District extends into  everything he does. Not only is Joe passionate about his work, his  commitment to bettering  the lives of Virginians and Americans alike is unparalleled. Joe is  unwavering in his effort to go above and beyond to serve constituents  and support his fellow staff. For example, his work as…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700090/recognizing-joe-schumachers-25-years-of-dedicated-public-service"}]