[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Annual Korean American National Sports Festival to  North Texas underscores his commitment to cultural celebration and  civic engagement.\n\nWe honor Mr. Kim for his service, his vision, and the inclusive  spirit he brings to our region.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…they get sicker, there  are longer wait times, hospital visits rise, and costs skyrocket for  families and the entire system.\n\nHouse Democrats are fighting for a different vision. We are fighting  to make sure that if you work hard, you and your family should have  healthcare and should be able to afford to see a doctor, fill a  prescription, and get…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize and applaud Amy  Zhang of Morrison, Colorado, for winning Best in Show in the 2025  Congressional App Challenge.\n\nAmy built EnAct: AI Guides, Vision-Impaired Act, an assistive  technology app for seeing impaired individuals that describes the  user's environment, helping them avoid pathway collisions. Her  application uses…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…today does  not mean we should decimate a critical part of our innovation ecosystem  by keeping these programs closed. In May, I introduced a 52-page bill  with my long-term vision for the programs. I want to provide small  businesses with the certainty they deserve by making the programs  permanent, ensuring we do not watch the clock hit zero like this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…public perceptions, and promote the  full inclusion of people with disabilities in American life.\n\nAs she celebrates 80 extraordinary years, I recognize Anita Altman  for her vision, her integrity, and her unwavering belief that all  people deserve to live with dignity, visibility, and respect.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…administration.\n\nThis isn't governing. It is greed. It is corruption and cruelty  masquerading as policy. The American people deserve a hell of a lot  better than this dark vision. The idea that you could take healthcare  away from people is unconscionable and that you will do so with a  straight face is unconscionable.\n\nThis big, ugly bill is a disgrace.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…measures in the West Bank, which empower the  Palestinian Authority contingent on the PA embracing and implementing  real reforms. He should not be enacting an annexationist vision while  the plague of settler violence runs rampant.\n\nThe alternative, Mr. Speaker, is a stark and disturbing picture. This  week, Tom Friedman wrote in The New York Times that:…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…She has been a  transformational advocate for the people of Skagit County.\n\nMr. Speaker, it is an honor to commend Commissioner Janicki for her  outstanding leadership and vision, dedication to serving her community,  and the enduring legacy she has helped to cultivate. I ask my  colleagues to join me in expressing our deepest gratitude for her  service.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…there is, in fact, a  large, bipartisan majority in Congress that continues to believe our  investments abroad are smart and make America safer.\n\nThis bill rebuffs Trump's vision for a smaller America in a more  chaotic world. It provides $19 billion more in funding than President  Trump requested and includes $9.4 billion for global health programs,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Hipocampo Children's Bookstore, Henry Padron-Morales  has created a space that celebrates culture, diversity, and the power  of literacy. Rooted in his Puerto Rican heritage, his vision and  leadership have fostered a love of reading while amplifying voices that  too often go unheard. Through this work, Henry has become a trusted  advocate for inclusivity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…D.C. school system, residents who  have raised families and who call themselves proud Washingtonians since  birth.\n\nThis bill, H.R. 5143, would impose the President's twisted vision of  justice on D.C., overriding the autonomy of this city and hurting the  people who live here.\n\nEnabling deadly vehicle pursuits of suspects in the city, as a former  councilwoman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Virginia. Under his guidance, NOVA Parks  made significant efforts to illuminate the forgotten stories of the  many communities that helped shape Fairfax County. Mr. Gilbert's vision  ensured that NOVA Parks was not only protecting natural landscapes but  also honoring the diverse communities and stories that helped shape  Northern Virginia.\n\nMr. Gilbert's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…action,  bringing together a group of Latina activists to chart a new path  forward by creating Latinas Unidas. Today, the organization stands as a  powerful testament to her vision of uplifting Latina women, connecting  them with the tools and opportunities needed to thrive, and celebrating  the enduring richness of their cultural heritage.\n\nDaisy's leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695836/recognizing-daisy-rivera-algarin"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…costs, we are in a healthcare crisis.  Instead of addressing the affordability crisis, they are trying to pass  laws to siphon funds away from needy families and offer a skewed vision  of what a pregnant student should hear from her university. Republicans  are using this moment to remind us just how little they respect women's  lives or our choices.\n\nAs…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…more inclusive, and more responsive  to the needs of all people.\n\nLet us take the inspiration from their dedication. The strength of  our Nation rests in the courage and the vision of its youth.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Cole for his leadership in getting this bill to the  floor quickly. The Defense Department cannot afford another 1-year CR.\n\nMr. Chair, I also thank Chairman Calvert for his vision and  commitment, and I thank the subcommittee staff, on both sides of the  aisle, for their hard work in crafting this legislation in a very short  time.\n\nThe bill before us…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…shared by President Trump, congressional Republicans,  and millions of Americans. Importantly, this appropriations package  ends Biden-era policies enacting a more conservative vision, all while  cutting fiscal year 2026 spending by nearly $2 billion, delivering  significant savings for taxpayers. Let me repeat that: Passing full  year appropriations ensures…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…creating American jobs while doing that, creating more  American jobs and more wealth while we refine those ores into metals  and then manufacturing from that.\n\nThat is what our vision is. We want to see Americans use American  resources to promote American security and American economic growth. I  wish we could all agree on that, but that is what this bill…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…implementation of a  new enterprise resource planning platform to modernize operations and  meet future workforce demands.\n\nCentral Illinois is fortunate to have had a leader whose vision,  professionalism, and dedication to expanding educational opportunity,  have strengthened our region for many years. Dr. Quirk-Bailey's  unwavering commitment to student success…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…he  became the youngest treasurer of a Jewish Community Center in the  United States when he assumed that role at the Fort Worth Jewish  Community Center. His leadership and vision led him to soon become  president of the Center as well as Treasurer of the Fort Worth Art  Museum, now The Modern, setting a high bar for service at a young age.\n\nMarshall's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that he will be tough on China. He has to be.\n\nWe need a strong leader like David Perdue at the front of our fight  with the Chinese Government to execute on President Trump's vision, and  I hope my colleagues will join me today in supporting Mr. Perdue to be  Ambassador to China.\n\nMr. President, I would ask unanimous consent that we commence the  vote…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "John James", "party": "Republican", "sentence": "…thank the gentleman from Texas whose  devastating good looks are only exceeded by his patriotism and sense of  humor.\n\nMr. Speaker, I rise today to advance a transformative vision for our  Nation's energy future through my bill, the Securing America's Critical  Minerals Supply Act.\n\nThis legislation is a bold and necessary step to ensure that the  United…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…development, improved access to  health care, and an enhanced quality of life for countless families and  businesses.\n\nTombigbee Electric Cooperative has demonstrated that when vision,  leadership, and commitment to community are combined, meaningful  progress can be made.\n\nThis accomplishment serves as a reminder that rural America must  never be left behind.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…country's political life. He was honored to serve as  a delegate for Presidents Richard Nixon and Ronald Reagan, playing a  meaningful role in advancing their principles and vision during pivotal  moments in our Nation's history. His decades of support demonstrate not  only his loyalty to the values he holds dear but also his deep belief  in civic duty…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695832/recognizing-edmund-good-on-the-occasion-of-his-100th-birthday"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…was carried  forward by R.C. Hoskins' daughters, Dudley Hoskins Bostic and Molly  Hoskins Scarbrough, who continue to lead the business today with the  same dedication and vision that their father demonstrated nearly a  century ago. Their hard work and dedication have ensured that Hoskins  Drug Store remains a beloved part of the community, staying…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…stewardship at The Corning Museum of  Glass. Since joining the Museum in 2011 and becoming president and  executive director in 2015, Dr. Wight has guided the institution with  vision and distinction, advancing its mission and inspiring countless  visitors through her deep expertise in ancient artwork.\n\nDuring her tenure, Dr. Wight curated landmark exhibitions,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697880/recognizing-dr-karol-b-wight-on-her-retirement"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…experience as a cadet in the Civil Air Patrol.\n\nI extend my deepest gratitude to Colonel Swain for his service and  congratulate him on his retirement. Without his strategic vision and  leadership, Civil Air Patrol would not be the venerable organization  that it is today.             Honoring Late U.S. Air Force Veteran Rick N. Parsons\n\nMs. TENNEY. Mr.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Corporation, the Cross Ell Ranch Corporation, the Permian Basin  Regional Planning  Commission, and the Texas Department of Transportation and their  commitment to making this vision a reality. On behalf of the 19th  Congressional District of Texas, I want to extend a heartfelt thank you  to all involved in this project for their dedication to our community.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…the City of Mobile, Alabama. Since his election in 2013,  Mayor Stimpson has demonstrated an unwavering commitment to public  service, fiscal responsibility, and the shared vision of building  Mobile into a city that is safer, more business-friendly, and more  family-friendly for all.\n\nUnder his leadership, Mobile has achieved major financial reform,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…charitable giving of time, talent and treasure as seen in his  involvement with Boy Scouts of America, Leadership Council, St.  Baldrick's Children's Cancer Research, Hope for Vision, and Serving HIM  (Healthcare International Ministries). A devoted man of faith, Tom  attends Holy Cross Catholic Church The Colony with his wife, Karen,  where he serves as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}]