[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Black people have not contributed to the vitality and  success of our country.\n\nAs chair of the Congressional Black Caucus, I am proud that as our  caucus has grown from 13 visionary members in 1971 to a historic 62  members in the year 2025, 4 of whom serve in the United States Senate,  we have continued fighting to dismantle barriers, create opportunities,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Center to her service on Manhattan's Community  Board 7, Anita has been a tireless force for equitable development,  healthcare access, and community empowerment.\n\nAnita's visionary leadership at UJA-Federation transformed the  landscape of aging and disability services in New York. She was  instrumental in launching the state's first programs for Naturally…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…for her tireless  commitment to strengthening the region's non-profit sector.\n\nMr. Speaker, Kerrie Wilson's retirement marks the culmination of  nearly a quarter-century of visionary leadership that has transformed  and strengthened an institution central to the well-being of our  region. I ask my colleagues to join me in thanking Ms. Kerrie Wilson  for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Henry, and Williams Counties, as well as territory once       disputed by the State of Michigan; and\n\nWhereas, the county was named in honor of Robert Fulton,       visionary inventor of the steamboat, reflecting the       pioneering innovation and transportation legacy of the       region; and\n\nWhereas, Fulton County was one of the last counties…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…elected official on the Zone 7 Water Agency Board of Directors.\n\nThe Naismith Basketball Hall of Fame has rightly recognized Michelle  Smith-McDonald as a trailblazer and visionary whose work has broadened  opportunities and raised the profile of women's sports. As a resident  of the Bay Area for over three decades, Michelle also has celebrated  and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…legacy of Mr. Rick Cotton, one of the most impactful  transportation leaders New York has ever known. His profound career  reflects an unwavering commitment to public service, visionary  leadership, and the belief that infrastructure can, and should, improve  the lives of millions.\n\nMr. Cotton earned an Artium Baccalaureus from Harvard College and a  Juris…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…New York delegation, to honor the  memory of former Congresswoman Carolyn McCarthy from New York's Fourth  Congressional District.\n\nShe was a trailblazer in Congress and a visionary leader who turned  an unimaginable tragedy into a lifelong mission to protect others.\n\nCarolyn was a tireless advocate for the South Shore of Nassau County  on Long Island…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…honorably served this community for decades through  numerous challenges, and he has been widely regarded as a mentor and a  friend to many. Throughout his career, he was a visionary leader who  always put people first, and his lifesaving leadership across Colorado  will not be forgotten.\n\nOn behalf of the people of Colorado's 7th Congressional District,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695834/recognizing-fire-chief-david-ramos"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Speaker, I rise today with profound sorrow and deep  thanksgiving to honor the life and legacy of Bishop Dr. Frederick  Williams, Sr.--a faithful servant of God, an apostolic visionary, a  devoted husband and father, and a tireless advocate for justice,  healing, and transformation. His transition from labor to reward marks  the close of a life lived in…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…not only  commendable but inspiring.\n\nWe would also like to offer a special thank you to Charlotte Mather- Taylor, CEO of the Area Agency on Aging of Broward County, whose  visionary leadership and deep commitment to service have elevated the  Agency's impact throughout our community. Her dedication ensures that  our seniors continue to receive the respect,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and recognize their  outstanding contributions.\n\nBusinesswoman of the Year--Monika Mueller: Monika's journey to  becoming Chief Strategy Officer is a true testament to her visionary  leadership, relentless innovation, and deep commitment to empowering  others. Over the past several years, she transformed multiple  departments, drove major revenue growth,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…During his tenure as  Executive Director, Mr. Gilbert remained steadfastly dedicated to  public service in land acquisition, conservation, and management.\n\nUnder Mr. Gilbert's visionary leadership, NOVA Parks completed 22  major land-acquisition transactions totaling over 1,800 acres of  parkland, 15 new parks, and 3 expanded parks. These acquisitions  increased…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…embrace the birthdays of two people: February 12, the  birthday of Abraham Lincoln, and February 14, the birthday of Frederick  Douglass. That is why it was done.\n\nThanks to the visionary leadership of President Gerald Ford--maybe  Gerald Ford was a woke President. It was Gerald Ford who decided that  we should have Black History Month. He made that decision.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Speaker, I rise today to honor Mr. Paul Redman, the  visionary leader behind the world-renowned Longwood Gardens, which is a  fixture of my community in the Philadelphia area.\n\nSince 2006, Paul's masterful leadership has helped Longwood…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691475/recognizing-paul-redman"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…extraordinary woman who lived a remarkable life, and I  will always be grateful that I had the immense privilege of knowing  her. She was a devoted mother, compassionate friend, visionary thinker,  and dear friend. She will be forever missed by her children Nakisa  Asefnia and Bardia Asefnia, her siblings Sofey Saidi and Taher Saidi,  and her many friends…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…legislature. I have always appreciated her  professionalism, wisdom, kindness, and generosity that she brought to  her role as the chamber's chief executive officer. Robin's visionary  leadership has made a lasting impact on the Rocklin Area Chamber of  Commerce and the Rocklin community at large.\n\nTherefore, on behalf of the United States House of Representatives,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…organization, nearly doubling annual fundraising to $2.8 million by  2023 and expanding its focus from three to eight critical areas of  community needs. Under Charles's visionary guidance, UWPC rose to the  challenges of the COVID-19 pandemic with swift aid innovative action.  He launched Operation Feed Pasco, which not only supported 19 local  restaurants…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…opening its doors in 1967, the Alhambra has brought Broadway to  Florida's First Coast, hosting a wide variety of shows, musicals,  comedies, and tribute acts.\n\nUnder the visionary leadership of my good friend, Managing Partner  Craig Smith, the Alhambra has evolved into a unique destination where  art, entertainment, and culinary excellence converge…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…but three members of the exceptional team were recognized  for their leadership and their dedication.\n\nCindy Nellis was named the 2025 Director of the Year, honoring her  visionary leadership and steadfast commitment to the network's mission.  Cindy's guidance has empowered both her team and the entrepreneurs that  they serve.\n\nJeanne Best received…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…this process.\n\nOur Vice President, JD Vance, helped us navigate so many dire straits  along the last several weeks through the House and the Senate, and of  course, our bold, visionary, fearless President, Donald J. Trump.\n\nPresident Trump is the creator and the champion of the America First  agenda. We will deliver upon that today. We have come a long…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…banking centers and three loan production offices,  Forcht Bank continues to serve Kentuckians and Bluegrass businesses.\n\nMr. Forcht's role has allowed for the enhancement and visionary  leadership of Forcht Bank to celebrate this 40th anniversary signifying  exceptional dedication and service to Kentucky communities.\n\nI consider Terry Forcht a close friend,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…profound and enduring impact on  communities in Pennsylvania and across our Nation.\n\nThe Foundation carries forward the extraordinary legacy of Dr. Philip  Jaisohn. He was a visionary leader, physician, journalist, educator,  and the first Korean-born naturalized citizen of the United States. Dr.  Jaisohn dedicated his life to strengthening democracy,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…our region's most precious resources: water. Formed by local voters in  response to declining groundwater levels, the Agency has grown into one  of the most respected and visionary water management organizations in  our state.\n\nAs one of California's original State Water Project contractors, the  Mojave Water Agency was instrumental in bringing imported…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…office in 2002 during one of the most  challenging periods in Colombia's modern history, a time marked by  violence, narco-terrorism, and instability. Through his bold and  visionary ``Democratic Security'' policy, President Uribe restored law  and order, dismantled the strongholds of terrorist organizations like  the FARC, and reestablished the authority…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…close-knit  community, academic excellence, and commitment to fostering  intellectual curiosity and character in young people.\n\nSolebury School was founded in 1925 by four visionary educators,  Laurie Erskine, Julian Lathrop, Robert Shaw, and Arthur ``Doc''  Washburn, who shared a dream of creating a new kind of educational  environment. As the school's…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…later, while still south of the  Arabian Peninsula, those aboard the USS Enterprise watched in horror as  the tragedy of 9/11 unfolded.\n\nIn that moment, Commander Fecht's calm, visionary leadership shone  through. He made sure his squadron was prepared not just for what came  next but for whatever would follow. That readiness was tested when the  call came.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…(UAV), setting a global precedent for how drone technology can  serve humanity.\n\nThe drone delivery was made possible through an extraordinary  collaboration among several visionary partners:\n\nFlirtey, a pioneering startup in commercial drone delivery (including  co-founder and chief executive officer Matthew Sweeny; co-founder and  chief operations…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize David  Sparks for his outstanding contributions and visionary leadership in  the pharmaceutical industry.\n\nAs the previous CEO and current chairman of the board at the  Professional Compounding Centers of America, PCCA, Mr. Sparks has…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…served as the University of Georgia's 21st  president, transforming our State's flagship university into one of the  Nation's most prominent public institutions.\n\nUnder his visionary leadership, enrollment grew from nearly 30,000 to  35,000 students, Federal research expenditures nearly tripled, and the  endowment more than doubled.\n\nDr. Adams oversaw…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…in space  exploration. Utah, known for our pioneering spirit, is poised to play a  critical role in shaping the future of space. From producing cutting- edge technology to visionary companies, Utah is helping propel humanity  into the next frontier.\n\nUtah is also the proud home of the Dugway Proving Ground in the west  desert, which has become a prime…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}]