[{"senator": "George Latimer", "party": "Democrat", "sentence": "…nurse practitioners,  representing the interest of the over 431,000 licensed nurse  practitioners in the United States who are delivering care in nearly 1  billion patient visits per year. As President of AANP, Dr. Ferrara has  played a pivotal role in amplifying the voice of nurse practitioners at  the national level. He has worked to ensure that policymakers…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…most from these deep funding cuts.\n\nIf my colleagues want to talk about fiscal responsibility, cuts to  Medicaid will mean less preventative care, more costly emergency room  visits, and much higher costs for treating preventable diseases and  illnesses. That will increase premiums and costs for every single  American, even those with private insurance,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…their birth certificate  matching a current ID. There are no exceptions for the 70 million  American women who changed their married name.\n\nThis bill also mandates in-person visits to register to vote,  disenfranchising potentially tens of thousands of deployed  servicemembers, as well as Native Americans in rural areas like  northern Arizona. This is…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690056/opposing-legislative-voter-suppression"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…am urging my colleagues to pass the CONNECT for Health  Act and make telehealth coverage permanent. This is common sense. It  lowers costs, and it means less emergency room visits. Everyone wins.\n\nWe must save telehealth coverage and pass this bill before the end of  the month.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…allowing them to  purchase their own insurance.\n\nFamilies, sadly, are going to be forced to make impossible choices.  They will be forced to delay care. They will skip doctor visits. They  will cut their medications in half. They will cut those pills or give  themselves half a shot of insulin to make ends meet. These choices are  real. They are real for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…California arrived in New York to be honored by the society       for his beneficence, only to be arrested--and later       convicted--instead. During his occasional visits, the good       doctor had been pocketing rarities worth about $1 million: a       gold coin of the Roman Emperor Hadrian here, six gold coins       of the Visigoths there.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Congressional Gold Medal in the Rotunda, where he delivered an address  that remains a touchstone in the history of religious freedom and  international dialogue. Through subsequent visits under both Democratic  and Republican administrations, the Ecumenical Patriarch has been  received with the highest honors by our Nation's leaders.\n\nFor more than three decades…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…nonprofit providing free lawn care to elderly individuals,  veterans, people with disabilities, and families in need.\n\nThrough his hard work and generosity, Steve has completed 30 visits  to care for the homes of Nancy Kinkaid and Bill Orzechowski, two  neighbors facing serious health challenges.\n\nHis service not only maintains their yards, he has given them…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…up, magically  the detainees got their first shower they had in a while. Also  magically, they got one of their first actually good meals. It just  shows why the unannounced visits are so important. It is to see how  things really are. Mr. Speaker, I have to tell you, a clean cage is  still a cage.\n\nAt the end of the day, in this facility we have 32 men…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…reinforcing the values that unite us.\n\nNick's efforts extended far beyond the day-to-day responsibilities of  diplomacy. He played a pivotal role in coordinating and supporting  visits by Prime Ministers, Cabinet Ministers, Members of Parliament,  and Members of the Royal Family to Washington and across the United  States. His meticulous attention to detail…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…its heavy-duty omnibus plan will rob Americans of  over $23 billion of health benefits through 2050 and increase premature  mortality, hospitalizations, and emergency room visits.\n\nThis resolution is a waste of our time because, as I have said on the  other two, both the GAO and the Senate Parliamentarian have concluded  that this waiver is not a rule…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Michael:\n\nI need Medicaid because it provides me the ability to get       my anxiety medication and to afford my therapist. I use       Medicaid for medical, dental, and visual visits. I wear       glasses. Without Medicaid, I am unable to live or function in       this world.\n\nRobin:\n\nCourtney is my 35-year-old daughter with severe       disabilities. From…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Overall, the big, ugly bill will take away healthcare coverage from  16 million people. When people lose coverage, they get sicker, there  are longer wait times, hospital visits rise, and costs skyrocket for  families and the entire system.\n\nHouse Democrats are fighting for a different vision. We are fighting  to make sure that if you work hard, you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…knows history, and they already have an edition of the  People's Daily, their leading newspaper, already printed up as a gift  for the President's trip home when he surely visits shortly. The  headline of People's Daily in Mandarin reads: Peace in Our time.\n\nThose are the unavoidable broader stakes of betraying Ukraine today.  I know my Republican colleagues…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "Mr. KEATING. Mr. Speaker, I rise today in honor of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, as  he visits the United States to receive the Templeton Prize.\n\nBorn Demetrios Arhondonis on the island of Imvros, known today as  Gokceada, Turkey, Patriarch Bartholomew was elected the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…Templeton Prize, an award that has been  garnered in the past by great historical figures such as Mother Teresa,  the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits to the United States, His All Holiness has had  visitations with five Presidents, he has spoken to both houses of  Congress and has been awarded the Congressional Gold Medal;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…teamwork. They sort through all donations,  retain those appropriate for a pregnancy center and then share other  serviceable items with community partners. Ms. Furlong also visits the  Center each weekend when the facility is closed to check the donation  box and bring donated items inside to ensure they reach the intended  recipients. When volunteers…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…complete his compulsory military  service. After the military, he went to work for a chemical company in  Spain. He and Nancy continued their relationship via letters and  visits.\n\nAs Nancy neared completion of her degree at University of California,  Berkeley, he asked her to marry him. They were married in California in  1961 and moved to Barcelona…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…grants and awards to companies openly trafficking illicit fentanyl  materials and other synthetic narcotics. There are even examples of  some of these companies enjoying site visits from provincial PRC  Government officials, who complimented them for their impact on the  provincial economy.\n\nThe CCP holds an ownership interest in several PRC companies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…representative of       memory'' to someone who enables carrying on painful memories       which are bound to exact a heavy price on the living.\n\nThe Israeli military delegations' visits do have a       commendable educational purpose and value, binding a       torturous not too remote past with present able military       personnel of a proud Jewish state.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…incentives for illicit maritime                drug trafficking. Sec. 273. Report on condition of aids to navigation. Sec. 274. Feasibility study on supporting additional port visits and                deployments in support of Operation Blue Pacific. Sec. 275. Study and gap analysis with respect to Coast Guard Air                Station Corpus Christi…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…agriculture elective that  introduces students to FFA and Supervised Agricultural Experience (SAE)  projects. Her class includes hands-on lessons about dairy and beef  cattle, visits to local farming operations, and a variety of  experiences designed to connect students to agriculture. Michelle also  has a deep passion for photography, which has inspired…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698441/recognizing-michelle-nuckols"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the Government of the People's Republic of China should       immediately open the Xinjiang Uyghur Autonomous Region (XUAR)       to regular, transparent, and unmanipulated visits by members       of the press, international organizations including the       Office of the United Nations High Commissioner for Human       Rights, academic and human rights…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…base's  groundbreaking on a $27 million Child Development Center and the 82nd  Training Wing's overhaul of the Air Force's Wartime Training Plan. Mr.  Woodward also supported visits to Sheppard, including from the  Secretary of the Air Force and Air Force Chief of Staff, Air Education  and Training Command leadership, and foreign dignitaries. As the  Director…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…past 5 years, the  CONAN website has become an invaluable resource to individual citizens,  schools, libraries, and, of course, Congress.\n\nIt has received more than 28 million visits since it was created and  features hundreds of pages of constitutional analysis and content. The  site is publicly accessible, easy to search, provides links to Supreme  Court…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Trucking and She Trucking. Her  employer, McKee Foods, recently recognized Karen as a Road Team Captain  with the Tennessee Trucking Association. As a Road Team Captain, Karen  visits local schools to teach students how to share the road safely  with big trucks and promote the professional truck driving profession.  Karen is a role model for young adults,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this month, I have had the privilege of  welcoming two groups of South Dakota veterans to Washington during  Honor Flight visits. I went simply to say hello and to thank these men  and women for their service to our country. This is something I have  done for many years, and it is always an occasion…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…accomplish great things.\n\nMost importantly, Nicole is a friend to us all, not least of all my  kids, who will always remember her scavenger hunts during their Junior  Congresswoman visits in Washington, D.C. We are grateful for her  service with our team and wish her success as she returns to the Great  State of Iowa, and all the victories Iowa State football…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Vessel Safety Checks to ensure recreational  boaters have all the safety gear they need to be legal and safe and  conducted more than 175 Recreational Boating Safety Program Visits to  boat equipment stores, marinas, and harborages to improve public  safety. Flotilla 11-1 Clearwater operates under the leadership of Karen  Miller, Commander, and Betsy…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the childcare centers were actually empty. There were no  children; there were no cars in the parking lot. Usually--not even any  staff to come answer the door. These were visits that were made during  the day when one would assume that children and their caretakers would  be present in the facility.\n\nWe know and what we are learning is that this childcare…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}]