[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…a division of the Library of Congress.\n\nThe Library of the Year award recognizes libraries that excel in  providing accessible reading materials and services to those with  visual, physical, or print disabilities. Libraries receiving this award  have a strong effectiveness in reaching these individuals through a  wide range of accessible formats, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…dedicated their careers to serving veterans  and their Nation, and all have been indiscriminately and illegally  terminated.\n\nThese short headlines tell a story, and so does this visual from  Springfield, MA:\n\nDue to abrupt and unplanned staff shortages, we are not       able to greet you at this time. If you have a scheduled       appointment, your counselor…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…actually abuse the child and create  an image of the abuse.\n\nThe Howard decision narrowed the scope of section 2251(a), holding  that the mere physical presence of the minor in a visual depiction of  sexually explicit conduct does not automatically violate the statute.  To obtain a conviction for production of CSAM in the Seventh Circuit,  the child in the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you.\n\nMichael:\n\nI need Medicaid because it provides me the ability to get       my anxiety medication and to afford my therapist. I use       Medicaid for medical, dental, and visual visits. I wear       glasses. Without Medicaid, I am unable to live or function in       this world.\n\nRobin:\n\nCourtney is my 35-year-old daughter with severe       disabilities.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…lot of  chatter of little children--Ms. Jasko noticed that my head was bowed.  She brought me up to the classroom board, and she saw clearly that I  was a child with an acute visual impairment. She kissed me on my  forehead and asked me to sit by her desk where I sat for the rest of  the year. She understood me. I did not have to fight for the right to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…practicable and about best practices       for the use of a pictorial (as defined in section 2(a) of the       Consumer Review Fairness Act of 2016 (15 U.S.C. 45b(a)))       visual representation of the information to be disclosed.\n\n(d) Tailored Guidance.--A manufacturer of a covered device       may petition the Commission for tailored guidance as to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…satellite broadband capabilities  that improve precision agriculture. Earth-imaging satellites also  provide important information which helps farmers and ranchers identify  visual trends that may require immediate attention.\n\nIn order to ensure our regulations maximize these opportunities, our  bill would require the FCC to look at its current satellite…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…paragraph (7) the following:\n\n``(8) knowingly distributes, offers, sends, or provides, in       or affecting interstate or foreign commerce, a threat to       distribute--\n\n``(A) a visual depiction of a minor engaging in sexually       explicit conduct, or\n\n``(B) a visual depiction of a person the defendant believes       is a minor engaging in sexually explicit…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…intended routes.\n\n(E) Recommendations for enhancing navigational safety for       mariners who rely exclusively on, or supplement electronic       systems with, traditional visual aids to navigation.\n\n(F) A cost-benefit analysis of the continued maintenance of       physical aids to navigation, and the projected consequences       of their removal, including--…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…region, principally Doyon and the State of Alaska.  The Central Yukon RMP designated 21 Areas of Critical Environmental  Concern spanning 3.6 million acres and reclassified Visual Resource  Management areas in ways that hinder infrastructure development.\n\nSection 1326 of ANILCA provides clear and unambiguous restrictions on  executive branch actions…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``significantly restrict subsistence uses for'' certain       communities.\n\nThe 2024 Central Yukon RMP fails to fully consider       potential impacts of designating certain lands as Visual       Resource Management (VRM) Class II and redesignate them as       VRM Class III or IV.\n\nThe 2024 Central Yukon RMP improperly ignores the long       history of BLM's calling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Regional Championship.\n\nThe Bobcats broke the program's record for the highest score in a  regular season show. They also brought home the highest score in music  performance, visual performance, general effect, and percussion  performance.\n\nI also congratulate them on coming in as State silver medalists at  the Arizona Marching Band Association's State…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699071/catalina-foothills-high-school-boys-swim-team-wins-d2-state-championship"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the bank to pay for all the promises we made as part of  that insurance coverage.\n\nLet's have at it, Mr. Speaker. I keep bringing this chart because it  is a really simple visual. Think of the people who almost attack us in  our hallways and say: How can you want to cut spending?\n\nWe show them this chart that says baseline spending. It is $86  trillion…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…support interactive, digital, and cloud-based tools       enabling applicants to edit documents and collaborate with       relevant Federal agencies in real time;\n\n(vii) support visual features, including video, animation,       geographic information system displays, interactive maps, and       three-dimensional renderings;\n\n(viii) provide for the exchange…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…go a little bit faster  here and see if I can get to some of the points that would help make  sense.\n\nI was just saying this a moment ago, but maybe it is easier with the  visual. This is baseline. This is our baseline. Almost every dime of  this growth from the baseline spending is the growth of interest and  Medicare.\n\nToday, we borrow $6 billion…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (S. 146) to require covered platforms to remove nonconsensual  intimate visual depictions, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                   S. 146\n\nBe it enacted by the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}]