[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to recognize the South El  Monte High School Lady Eagles volleyball team on their first-ever CIF  Southern Section Division 9 championship.\n\nIn a hard-fought match, the Lady Eagles fell behind two sets to one  before rallying back with determination…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today with great pride to  congratulate South Side High School's girls' volleyball team on winning  the New York State Class A girls' volleyball championship.\n\nOn behalf of Nassau County and New York's Fourth Congressional  District, I want to take this opportunity…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698103/congratulating-south-side-high-school-girls-volleyball-team"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and a freshman at Indiana University's Kelley School of  Business. He was known for his joyful smile and ability to inspire a  sense of community wherever he went.\n\nAs a volleyball team captain and a STEM competition coach, Nihaal was  always attuned to the needs of those he led. Whether mentoring a  teammate  through a difficult challenge or calmly navigating…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I rise today to recognize a momentous  achievement by the men's volleyball team at Southern Virginia  University in Buena Vista, Virginia, which has brought home the  school's first-ever NCAA Division III National Championship victory.\n\nOn Monday…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the  Tiffin Calvert Catholic High School girls volleyball team have  represented their school ably on their way…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…They have made their  school and our community very, very proud.\n\nNighthawks, enjoy this victory. You have earned it.\n\nCongratulating Salpointe Catholic High School Girls' Volleyball Team\n\nMr. CISCOMANI. Mr. Speaker, I rise today to congratulate Salpointe  Catholic High School's girls' volleyball team for winning the 4A State  championship for the first…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the Avon  High School girls volleyball team have represented their school ably on  their way to achieving the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…her career. She boasts a .332  on-base percentage and has driven in over 40 runs.\n\nBeyond her success on the softball field, Katie is also a member of  the Lady Trojans volleyball team. In 2024, she was named first team  all-conference as she logged 42 kills. Katie's athletic achievement  reflects her God-given talents and all the hard work she has put…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691899/recognizing-katie-ankrom"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…sacrifice so much to preserve our experiment in  self-government.\n\nAll of America thanks Master Sergeant Holliday.    Recognizing University of Cincinnati Clermont Women's Volleyball Team\n\nMr. TAYLOR. Mr. Speaker, I rise today to recognize the University of  Cincinnati Clermont women's volleyball team. The Cougars defeated Kent  State Tuscarawas to win…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate the Manheim  Central High School boys' volleyball team on winning the PIAA Class 2A  State championship on Saturday, June 14, 2025.\n\nThe Manheim Central Barons cruised through the regular season, the  District Three championship,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}]