[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…math tells us  that it takes 60. It takes bipartisan cooperation. Unfortunately,  Republicans have been chipping away at that cooperation, especially  with the rescissions vote last week.\n\nBut, to be clear, if Republicans continue cutting bipartisan deals  with more rescissions, that is not cooperation. If Republicans try and  jam through another slush-fund…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Madam Speaker, we are witnessing yet another shameful  attack on the fundamental rights of millions of Americans.\n\nHouse Republicans are forcing a vote this week on the so-called SAVE  Act, a bill that does nothing to stop inflation from driving up grocery  prices, nothing to end Donald Trump's trade war that is pummeling the  stock…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…But they continue to be a model for  our Nation of courage, compassion, and conviction.\n\nI could not be prouder of my state and its people.\n\nAnd so that brings me to my vote this week.\n\nI strongly oppose combining Homeland Security funding with the other  important Appropriations bills in this package. I wish that it had not  been tied to funding for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…voted no.\n\nNow with the previous question, I will give the entire Republican  Conference another chance to vote to release the Epstein files, the  only other chance to vote on it this week. As I just said, the  resolution Republicans just voted on in the Rules Committee is a  glorified press release. It is nonbinding.\n\nThe Republicans are pretending to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Columbia's Comprehensive       Policing and Justice Reform Amendment Act of 2022 (CPJRAA).       This includes H.R. 5107/S. 2687 (the CLEAN DC Act), which is       up for a vote this week, and H.R. 5166, Sec. 827 (the       Financial Services and General Government Appropriations Act       rider blocking CPJRAA implementation).\n\nTogether, these bills would…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…is his strategy? Where is the plan?\n\nI am the proud cosponsor of a bipartisan solution to this crisis, but  Speaker Johnson refuses to put any bill on the floor for a vote. Next  week is our last legislative week of the year and our last chance to  preserve access to lifesaving care for our constituents.\n\nMr. Speaker, on behalf of the people of North…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698079/healthcare-crisis-in-north-carolina"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…On behalf of SEIU's 2 million members       and worker leaders, I write to urge you to vote NO on a slate       of ``labor'' bills expected to come to the floor for a vote       this week. The bills Republicans are bringing to the floor do       not represent serious attempts by Speaker Johnson or the GOP       to help working people or working families.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…knew that it was corrupt but that there was nothing that could be done  and that the system didn't work.\n\nRepublicans are the system, and House Republicans promised a vote on  this next week as a standalone bill. There is no guarantee that the  Senate will act. In fact, they probably won't act. The majority has the  power to join us in righting this wrong…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696698/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senate.  It will take him  a few years to catch me, and I am sure he will. But of the 9,000 votes  in that period of time, how many do you actually remember? A handful.  This vote last week was one of those votes.\n\nWhy will I remember this? Because nongovernmental organizations,  charities, and humanitarian aid groups around the world have told us  that taking…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…American people.\n\nAfter all of the majority's procedural shenanigans last year, my  resolutions ending President Trump's harmful tariffs on Canada and  Mexico are due for a vote this week. But the Republicans couldn't let  that stand. They are trying to change the rules again and again and  again and again to do what? They are trying to change the rules…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Dear Representative: On behalf of the AFL-CIO, I am writing       to urge you to oppose two bills on crypto currency that may       soon be up on the House floor for a vote this week. The       GENIUS Act, (S. 1582) and the CLARITY Act (HR 3633) pose       risks to both retirement funds and to the overall financial       stability of the U.S. economy.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…new and higher premiums.\n\nSenator Thune promised a vote, and I believed--he told me  personally--he would keep his word, and I believe he will. I think we  will have a vote this week, but a vote is not enough if we can't come  to an agreement.\n\nWe need 13 Republicans to join us in a bipartisan effort to extend  this tax credit so that millions of Americans…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Beautiful Bill did important things to change the face of healthcare in  the United States, and we are only now just starting to feel the  effects.\n\nSo if you want my vote next week or in the next couple of weeks, we  are going to have to talk about the significant Medicaid cuts that you  made, the ending of a bunch of subsidies for the marketplace,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…resources to support our Nation's Federal, State, and  local law enforcement in their shared mission to keep America safe.\n\nThe package that we will debate and discuss and vote on this week  makes targeted investments in the Federal Agencies and Departments that  conduct critical scientific research, bolster economic growth, promote  U.S. energy independence,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…for violating  workers' rights, and allow for free, fair, and safe union elections.\n\nMr. Speaker, in addition to the slate of partisan bills that  Republicans want us to vote on this week, which lower overtime pay for  workers, cut workers' wages, give corporations more loopholes to  mistreat workers without consequence, and mess with workers' retirement…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…region, and end the conflict with Israel.                         Promises Made, Promises Kept\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, my colleagues in the U.S.  Senate will vote this week on President Trump's One Big Beautiful Bill  Act, moving President Trump's agenda one step closer to being signed  into law.\n\nThis is critical legislation that will prevent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…cost because they view the subsidized and regulated plans       as a way-station to a single-payer system. Senate Minority       Leader Chuck Schumer plans to tee up a vote this week to       extend the pandemic-era subsidies, which have been an       inducement for fraud.\n\nRepublicans would be wise to remind voters that Democrats       sold ObamaCare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to speak on the  importance of the SAVE America Act, which will come to the House floor  for a vote this week.\n\nAt the heart of our democracy is a very simple promise: Every  eligible citizen gets one vote, and every vote counts equally. That  promise is only sustainable when the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}]