[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…mandates?\n\nFor these reasons, H.R. 1005 does nothing to improve our schools and  everything to bog down schools in administrative red tape. I strongly  recommend a ``no'' vote.\n\nMr. Speaker, I inform the chairman that I have no additional  speakers.\n\nMr. Speaker, this bill is not limited to China. This bill says  ``foreign source,'' and under the definition…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…eligibility.\n\nRepublicans call this voter ID. This is voter suppression. When they  can't win on ideas, they try to win by blocking the ballot and taxing  our right to vote.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this attack on  our democracy.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…paid for? It was paid for. Later, when  we decided that we could extend the tax credits further so that more  people could have more access to care, did anyone vote for that? No.\n\nMr. Speaker, all they have done is try to eliminate access to  healthcare in our country. The public is catching on to them.\n\nYou might tell them: If a woman is born with…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…people you were sent to Washington to represent. It is a ``hell  no'' vote for us because we are standing up on behalf of the American  people. It should be a ``hell no'' vote.\n\nMr. Speaker, these are the words of Senator Murkowski. She says:  ``This was one of the hardest votes I have taken during my time in the  Senate.'' And then she keeps it real. As…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…bridges,  for those who faced the dogs and the batons right here in the United  States of America, for those who met the fire hoses just to try to  claim their right to vote.\n\nMr. Speaker, both of my grandfathers served in World War II.  Oftentimes, when I look at Union Station, I remember that my  grandfather, having fought the Nazis in World War II,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…That is why this bill is so toxic.\n\nAgain, the SAVE America Act tells millions of Americans: You have to  show up in person and jump through hoops just to register to vote. Mr.  Speaker, you can file your taxes online, you can pay your bills online,  and you can get your medical results online, but if this bill passes,  you can't fully register to vote…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…permanent for the very  richest Americans, but now that we have a bipartisan discharge petition  ready to vote on today, you can't find the time to do it.\n\nWe are ready to vote, Mr. Speaker. You have the power to bring that  to the floor today.\n\nLet the will of the people be the will of the people's House. Let's  stop the premium hikes, extend the ACA tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698376/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…R. Lewis Voting Rights Advancement  Act and the Freedom to Vote Act, would stop these attacks on our  democracy and ensure every American is able to cast a meaningful vote.\n\nMr. Speaker, when the American economy is on the precipice, why are  my Republican colleagues focused on making it more difficult to vote?\n\nWhile I possess no special insight into…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…keep our promise to veterans. It provides a million-dollar  jackpot to eight Senators. It fails to protect Congress' power of the  purse. I encourage my colleagues to vote ``no.''\n\nMr. Speaker, I have the honor of yielding 1 minute to the gentleman  from New York (Mr. Jeffries), our distinguished Democratic leader.\n\nMs. DeLAURO. Mr. Speaker, on that I demand…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…passport, and  our driver's licenses, even the REAL ID, don't prove citizenship.\n\nThis resolution could force Georgians to pay more than $700 million  just to register to vote.\n\nMr. Speaker, that is a poll tax, plain and simple, and it is blatant  voter suppression.\n\nMs. WILLIAMS of Georgia. Mr. Speaker, voter suppression by any other  name is still voter…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689998/safeguard-american-voter-eligibility-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…States have adopted, overriding federalism  and State control over elections.\n\nThis bill is part of a long-term effort by Republicans to literally  make it harder to vote.\n\nMr. Speaker, I urge my colleagues, when this bill comes up, to vote  ``no'' because it will be a disaster for America and a disaster for  democracy.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689430/disenfranchising-voters"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Speaker. You notice this when we are voting. It is 435 people packed  here on the House floor. There is staff. It is sometimes hard to move  around. You have to get your vote in, Mr. Speaker. You can't get too  entranced in the conversation, or you miss a vote.\n\nMr. Lewis came up to me, and he tapped me on the shoulder. He said to  me that he heard my words…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…this week as countless  women suffer and die under extreme Republican abortion bans. Their  priorities are clear and profoundly misguided.\n\nI urge my colleagues to vote ``no.'' Mr. Speaker, I reserve the  balance of my time.\n\nMs. CHU. Mr. Speaker, I would like to point out that the previous  speaker said that these clinics have trained staff, but many…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…box, not restrict it. Congress should be considering H.R. 14,  the John Robert Lewis Voting Rights Advancement Act to ensure that  every American can freely and fairly vote.\n\nMr. Speaker, this is very personal to me. I am not only the  Representative of America's civil rights district, but I am also the  proud daughter of Selma, Alabama. It was in my…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690004/safeguard-american-voter-eligibility-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…transparency and zero respect for this institution or the  Members here. Just close your eyes and vote for it. That is what Trump  told Republicans to do: Close your eyes and vote for it.\n\nMr. Speaker, the American people deserve a hell of a lot better than  this rushed, reckless process. They deserve leaders who work for them,  not for the billionaires.\n\nMr. Speaker,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their networks.\n\nThis legislation has a strong history of bipartisan support in the  Committee on Energy and Commerce and passed the full committee in April  by voice vote.\n\nMr. Speaker, I urge my colleagues to support H.R. 2037, and I reserve  the balance of my time.\n\nMr. LATTA. Mr. Speaker, I have no further speakers, and I am prepared  to close at…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…noncitizens from voting  in Federal elections by requiring States to obtain documentary proof of  U.S. citizenship in person when registering an individual to vote in  Federal elections.\n\nMr. Speaker, you are sure to hear from my colleagues on the other  side that noncitizen voting doesn't exist or that it rarely happens so  we don't need to do anything…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…taxes to go up because they know in this bill the income  groups that get hit the hardest. If a ``no'' vote prevails--and we have  heard them, they are all going to vote ``no,'' Mr. Speaker. But if a  ``no'' vote prevails, the income groups that could get hit the hardest  are the lower- and middle-income groups of America. They know that.  They are watching…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…process, making it  easier and faster for victims to get relief.\n\nThis piece of legislation was passed favorably out of the Ways and  Means Committee with a strong bipartisan vote. Mr. Speaker, now it is  time to act in a bipartisan manner to support Americans whose Social  Security numbers fall into the wrong hands.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…pass  on to our next generation.\n\nThe importance of that vote is even more underscored when you  recognize that, yes, there have been times where people have stolen  your vote, Mr. Speaker. That veteran who was talked about deserves the  right to vote. If somebody votes illegally, Mr. Speaker, they are  stealing that veteran's vote. They are stealing your…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…for  American citizens. Specifically, it amends the National Voter  Registration Act to require States to obtain proof of citizenship when  an individual registers to vote.\n\nMr. Speaker, let me be clear. This legislation does not prohibit  married women from voting, and the absurd narrative of this has gotten  out of control.\n\nMr. Speaker, when someone…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…method. It broadens the  ability of people to vote when they cannot be here to vote. We have had  situations where we have had people rolled in on gurneys to be able to  vote.\n\nMr. Speaker, this is a much fairer way to do this in the way that we  are doing it now.\n\nI also remind my colleagues who are speaking against or saying we are  not dealing with the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]