[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise to join my CBC colleagues in getting  into some good trouble as we voice our very strong opposition to the  Republicans' voter suppression bill, the so-called SAVE Act.\n\nAs a daughter of Selma and the Representative of Alabama's civil  rights district, the fight for voting rights is very personal to me.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…kicker, the bill mandates that every State turn over their voter  rolls to DHS and Kristi Noem.\n\nMr. Speaker, this bill is an outrage. This is election rigging. This  is voter suppression.\n\nThe American people aren't going to stand for it, and nobody should  vote for it.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700018/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…California's Third District do not have a  passport. The cost to them for getting one is $34.8 million.\n\nJohnson), my friend.\n\nThe SAVE Act is, to put it nicely, the most severe voter suppression  bill ever considered at the Federal level.\n\nCoupled with President Trump's recent antivoter executive order, the  SAVE Act would end the voter registration process for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…were  blocked from registering. Zero noncitizens were found because election  officials had already verified their eligibility.\n\nRepublicans call this voter ID. This is voter suppression. When they  can't win on ideas, they try to win by blocking the ballot and taxing  our right to vote.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this attack…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…about suppressing citizens' rights rather than empowering and honoring  citizens' opportunity to participate in our government. And they have  this bill that is all about voter suppression.\n\nWell, we have gone through some serious voter suppression. Some of it  was written into our original Constitution. Despite the lofty goals, we  didn't allow people…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…time.\n\nThe history of this country has been every time we make progress  towards the ideal, there is backlash, and it involves three things:  violence, propaganda, and voter suppression.\n\nMy great-grandfather lived through the first backlash. He was a man  born on a plantation. His parents were enslaved. He exercised his right  to vote after he was given…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…This resolution could force Georgians to pay more than $700 million  just to register to vote.\n\nMr. Speaker, that is a poll tax, plain and simple, and it is blatant  voter suppression.\n\nMs. WILLIAMS of Georgia. Mr. Speaker, voter suppression by any other  name is still voter suppression. This resolution violates the 14th  Amendment, 19th Amendment,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689998/safeguard-american-voter-eligibility-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…million Americans  who live in rural communities to drive up to hundreds of miles to prove  their eligibility in person. That is not election security. That is  actually voter suppression.\n\nIt is important for the American people to understand that this  Republican effort to jam the SAVE Act through--as they call it--isn't  happening in isolation. There…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise in strong opposition to Trump's voter  suppression bill. In recent months, President Trump's attempts to  interfere in the midterm elections have become more brazen and alarming  day by day.\n\nWe have seen State legislators…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…``selectivity.'' When they  say, ``integrity,'' what they actually mean is ``inequality.''\n\nLet me be clear. We don't have a voter fraud problem in this country.  We have a voter suppression crisis. We have polling places shutting  down in Black neighborhoods. We have long lines in indigenous  communities that stretch around the corner and throughout the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I thank the gentleman for  yielding.\n\nMr. Speaker, I rise in opposition today to the Republicans' voter  suppression act. This bill is not about election integrity. This is not  about ensuring that only citizens vote. This is about making it  impossible for people and new voters to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…vote.\n\nWho asked for more red tape? Did Jim Crow call?\n\nI mean, that is what this bill is about. It is not about voter ID. It  is about voter registration, and it is about voter suppression.\n\nWe always tell people to vote, make their voices heard, participate  in our democracy, right? Those are supposed to be good things.\n\nWhy are Republicans passing a bill…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…today, House Republicans betrayed their  mothers, their sisters, their daughters, and every woman in their life.\n\nThe so-called SAVE Act is an antiwoman, antidemocracy, voter  suppression bill cloaked in lies about election integrity.\n\nWith this vote, House Republicans have jeopardized access to the  ballot box for nearly 70 million American women. That…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690040/voter-suppression-bill-cloaked-in-lies-about-election-integrity"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Americans would face an  additional burden to register to vote simply because they changed their  last name after marriage. Simply put, this Republican bill is about  voter suppression.\n\nIn 2012, Minnesotans rightly rejected a state constitutional  amendment that would have imposed voter ID requirements. Each election,  Minnesotans turn out at the highest…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…LATIMER. Mr. Speaker, I thank Mr. Morelle for yielding me the  time.\n\nMr. Speaker, the American people in my district and in my State have  spoken clearly. This bill is voter suppression, pure and simple.\n\nIt is brought to us under the guise of stopping illegal voting. When  we analyze voting in Westchester County, where I was the county  executive for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690010/safeguard-american-voter-eligibility-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…nationals in the  Capital of our Nation.\n\nGeorgia's own Senator John Ossoff, who once said that voter ID was  right and appropriate, now supports his party reframing it as voter  suppression.\n\nThe law didn't change. Public opinion didn't change. What changed was  he and other Democrat politicians like him realized that illegal  immigrants could no longer…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…guide, at least at first, is only  going to be available online and such that there will be fewer polling  places and vote centers for people to actually vote in.\n\nIt is voter suppression through and through in an attempt to reverse  the clearly articulated and repeatedly expressed view of the California  electorate.\n\nThat is not all. For those voters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…friends, if an 80- 20 issue such as this cannot get 60 votes in this 100-person Chamber,  something is amiss.\n\nNow, some of my colleagues have raised concerns regarding voter  suppression. They warn that many U.S. citizens do not have a hard copy  proving their citizenship. The SAVE America Act directly addresses this  concern. It puts in place alternate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Arizona, we have to show proof of citizenship to register to vote. We  can't do it for the President, though. How absurd is that?\n\nWe have had no problems. There has been no voter suppression. They  want to make it an issue because they don't want that proof, and we  need to have that proof. Every rational American knows it is not  suppression. It is common…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…the exception.\n\nMy Democratic colleagues claim that requiring a photo ID to vote is  too burdensome. Some say it is too difficult for rural Americans and  will lead to voter suppression. I grew up in rural America.\n\nThe reality is that Americans use photo IDs every day to carry out  basic tasks like opening a bank account, boarding a flight, checking…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]