[{"senator": "Cleo Fields", "party": "Democrat", "sentence": "…preamble to the Constitution, my grandmother, in Louisiana.\n\nI finally got her to register to vote, and she voted until she  passed.\n\nThey gave them tests like citizen tests, voucher tests. They had to  get other people to vouch for them. In Louisiana, we had something  called all-White primaries, which meant Blacks could not even vote in  primary elections.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…families deserve more.\n\nWe need this bill to offer more children a fighting chance. The Give  Kids a Chance Act would reauthorize the Food and Drug Administration  Priority Review Voucher Program to allow pharmaceutical companies to  expedite FDA review of more profitable drugs in return for developing  treatments for rare pediatric diseases.\n\nSince 2011, 53…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…of this country.\n\nThe administration is trying to dismantle Tribal schools, which were  created because of our trust and treaty responsibilities, trying to  turn them into a voucher program and school choice. There are no  choices in many of our rural and Tribal communities. The choice is to  keep our Tribal schools open, which provide multicultural programs,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…housing equity in Illinois and beyond.  His work with the Illinois Fair Housing Coalition led to the passage of  a State law prohibiting discrimination against housing choice voucher  holders.\n\nEric co-led the Partnership of Just Housing, a national coalition  that improved housing access for people with arrest and conviction  histories. As a trusted counsel…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…removes many of the hurdles and barriers  to researching treatments for rare pediatric diseases. It restores FDA  incentives through the Rare Pediatric Disease Priority Review Voucher  Program, encouraging companies to develop drugs for rare childhood  diseases. The PRV program has already helped develop new treatments for  200,000 patients spanning nearly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…schools and using it to make investments in private schools.  Mrs. McMahon and others have tried to sell this as ``school choice,''  but we know--we know--that it is basically a voucher program that will  ultimately give private schools the ability to hand pick students and  close their doors to everyone else. Private schools have no requirement  to serve…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…exacerbate workforce shortages in professional fields such  as teaching, behavioral health, and social work. Instead of investing  in public education, this bill enacts a federal voucher scheme that  redirects tax dollars to unaccountable K-12 private schools. This  disproportionately and negatively affects rural communities and can  violate the separation…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Secretary provides a benefit to a veteran who has a       diet-related chronic condition and is food-insecure or refers       such a veteran to receive a benefit, including a voucher or       debit card, for the purchase of fruits and vegetables to       improve a diet-related chronic condition.''.                                  ______\n\nBy Mr. DURBIN…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…muscular atrophy. We are curing hemophilia and blood  cancers. These cures are just a few of the success stories attributable  to the FDA's Rare Pediatric Disease Priority Review Voucher Program.\n\nThe PRV program is a powerful incentive that spurs the development of  treatments for rare pediatric diseases, providing a lifeline for  patients who require specialized…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…due upon the submission of a human       drug application under section 505(b)(1) or section 351(a) of       the Public Health Service Act for which the priority review       voucher is used. All other user fees associated with the       human drug application shall be due as required by the       Secretary or under applicable law.''.\n\n(c) GAO Report on…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Regulations Adopted by the Committee on               Rules and Administration on December 11, 2025\n\n1.0 Scope--These regulations detail the permissible       expenditures and voucher process a Member shall use to       procure personal security devices, physical security       enhancements, and personal security services for the Member's       safety and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…funding and decisionmaking back in the hands of States is just one  piece of the puzzle.\n\nIf we truly want to improve student outcomes, we must embrace school  choice and voucher programs, something my home State Governor's office  in Pennsylvania still refuses to do.\n\nSchool choice States have flourished. Florida, Indiana, Utah, and  Ohio now rank…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…for somebody to get  free rent, and then the vouchers are given to a property developer or a  syndicate that is going to wind up owning the building, and they wind  up with a voucher as well. It is kind of hard to believe it is  developed that way, but it has developed that way.\n\nI had always wondered before hearing about these things why sometimes  low-income…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…``(ii) each dwelling unit in such housing is occupied by a       low-income family;\n\n``(iii) no dwelling unit in such housing is refused for       leasing to a holder of a voucher under section 8 of the       United States Housing Act of 1937 (42 U.S.C. 1437f) because       of the status of the prospective tenant as a holder of such       voucher;…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…direct  companies to study those same drugs and therapies in children, as well.\n\nIt will also reauthorize my Creating Hope Reauthorization Act, which  created a pediatric review voucher program within the FDA. It was the  first-ever market incentive for pharmaceutical companies to develop  childhood cancer treatments. Prior to that, there were none.\n\nSince…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}]