[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Joining Feinstein and Harris on the resolution are Senators Merkley (D-Ore.), Durbin (D-Ill.), Blumenthal (D-Conn.), Van Hollen (D-Md.), Booker (D-N.J.), Klobuchar (D-Minn.), Hirono (D-Hawaii), Markey (D-Mass.), Jones (D-Ala.), Duckworth (D-Ill.), Menendez (D-N.J.), Wyden (D-Ore.), Sanders (I-Vt.), Murray (D-Wash.), Bennet (D-Colo.), Baldwin (D-Wis.), Peters (D-Mich.), Smith (D-Minn.), Brown (D-Ohio), Cortez Masto (D-Nev.) and Stabenow (D-Mich.)."}, {"senator": "Catherine Cortez Masto", "party": "Democrat", "sentence": "Booker (D-N.J.), Dianne Feinstein (D-Calif.), Debbie Stabenow (D-Mich.), Richard Blumenthal (D-Conn.), Dick Durbin (D-Ill.), Patrick Leahy (D-Vt.), Amy Klobuchar (D-Minn.), Bernard Sanders (I-Vt.), and Michael F."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Markey (D-MA), Sheldon Whitehouse (D-RI), Kamala Harris (D-CA), Mazie Hirono (D-HI), Chris Van Hollen (D-MD), Jeff Merkley (D-OR), Gary Peters (D-MI), Bernie Sanders (I-VT), Sherrod Brown (D-OH), Cory Booker (D-NJ), and Patrick Leahy (D-VT)."}, {"senator": "Patrick J. Leahy", "party": "Democrat", "sentence": "Senate came back into session this week after the Christmas break, Senator Patrick Leahy (D-Vt.) cosponsored three resolutions aimed at preventing further U.S."}, {"senator": "Mark R. Warner", "party": "Democrat", "sentence": "Warner (D-VA), Bernie Sanders (I-VT), Doug Jones (D-AL) and Richard Blumenthal (D-CT) released a proposal to establish a \"Paycheck Security' program to cover the wages and benefits of employees of affected businesses and non-profits until the economic and public health crisis is resolved."}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "This provision must be repealed.\"\n\nJoining Whitehouse and Brown on the bill in the Senate are Senators Tom Carper (D-DE), Patrick Leahy (D-VT), Bernie Sanders (I-VT), Tom Udall (D-NM), Richard Blumenthal (D-CT), Dick Durbin (D-IL), Jeff Markey (D-OR), Chris Van Hollen (D-MD), Angus King (I-ME), Elizabeth Warren (D-MA), Kamala Harris (D-CA), Amy Klobuchar (D-MN), Chris Coons (D-DE), Jack Reed (D-RI), Chris Murphy (D-CT), Kirsten Gillibrand (D-NY), and Cory Booker (D-NJ)."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "Hirono (D-Hawaii), Senator Robert Menendez (D-N.J.), Senator Bernard Sanders (D-Vt.), Senator Patrick J."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "This legislation was also co-sponsored by Senators Richard Blumenthal (D-CT), Sherrod Brown (D-OH), Dick Durbin (D-IL), Dianne Feinstein (D-CA), Mazie Hirono (D-HI), Bob Menendez (D-NJ), Jeff Merkley (D-OR), Gary Peters (D-MI), Brian Schatz (D-HI), Bernie Sanders (I-VT), Jeanne Shaheen (D-NH), Kyrsten Sinema (D-AZ), Debbie Stabenow (D-MI), Chris Van Hollen (D-MD), Mark Warner (D-VA), Elizabeth Warren (D-MA) and Ron Wyden (D-OR)."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "The bill is sponsored by Democratic Leader Chuck Schumer (D-N.Y.) and Senators Richard Blumenthal (D-Conn.), Elizabeth Warren (D-Mass.), Bernie Sanders (I-Vt.), and Kirsten Gillibrand (D-N.Y.)\n\n\"It is our responsibility to help our fellow American citizens living in Puerto Rico who are recovering from a string of natural disasters and a downward spiraling economy worsened by the effects of the COVID-19 pandemic,\" said Sen."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Repealing this giveaway will free resources needed to help those truly in need.\"\n\n \n\nJoining Senators Warren and Whitehouse and Congressman Doggett to unveil the bill were Senators Sherrod Brown (D-Ohio), Tom Carper (D-Del.), Patrick Leahy (D-Vt.), Bernie Sanders (I-Vt.), Tom Udall (D-N.M.), Richard Blumenthal (D-Conn.), Dick Durbin (D-Ill.), Edward J."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Markey (D-MA), Jeff Merkley (D-OR), Patty Murray (D-WA), Bernie Sanders (D-VT), Chris Van Hollen (D-MD) and Elizabeth Warren (D-MA)."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "I started out with saying that I want the conservatives in America to  be listening because as of now, GovTrack  had me down as the most conservative Member of the U.S."}, {"senator": "Mike Lee", "party": "Republican", "sentence": "Patrick Leahy (D-VT) and Mike Lee (R-UT) released the following comment:\n\n\"We have been working to reform our nation's surveillance authorities for years, and, as we predicted, this damning initial report makes clear our work is not done."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Patrick Leahy (D-Vt.) saying:\n\n\"Witnesses would not fill the holes in the Managers' case."}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "His duty stations include USS  O'Bannon (DD-987), USS Lexington (CVT-16), USS Dwight D."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Senator Jerry Moran (R-Kan.) applauded Thermo Fisher Scientific, a Lenexa manufacturer, after their announcement of a new federal contract \"to provide highly specialized viral transport media (VTM) for COVID-19 sample collection.\" The public-private partnership between Thermo Fisher and the U.S."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Sponsored by Senator Patrick Leahy (D-VT), the legislation improves certain provisions of the original, bipartisan Voting Rights Act of 1965, which were determined to be unconstitutional by the Supreme Court in 2013."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Rob Portman (R-Ohio), Maggie Hassan (D-N.H.), Susan Collins (R-Maine), Ron Wyden (D-Ore.), Kelly Loeffler (R-Ga.), Bob Casey (D-Penn.), Mitt Romney (R-Utah), Sherrod Brown (D-Ohio), Cindy Hyde Smith (R-Miss.), Tom Carper (D-Del.), Todd Young (R-Ind.), Patty Murray (D-Wash.), Angus King (I-Maine), Dianne Feinstein (D-Calif.), Gary Peters (D-Mich.) and Bernie Sanders (D-Vt.)."}, {"senator": "Sam Graves", "party": "Republican", "sentence": "On any  given day, her functional activities could be as diverse as FAA  Temporary Flight Restrictions, novel electric vertical takeoff and  landing aircraft (eVTOL) certifications, promoting new sustainable  fuels, right down to real-time advice to a pilot at a distant Signature  Aviation base on how to unsnag a challenge clearing customs."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Markey (D-MA), Patrick Leahy (D-VT), Bernie Sanders (I-VT), Bob Menendez (D-NJ), Sherrod Brown (D-OH), Joe Manchin (D-WV), Kirsten Gillibrand (D-NY), Chuck Grassley (R-IA), Amy Klobuchar (D-MN), Joni Ernst (R-IA), Elizabeth Warren (D-MA), Jerry Moran (R-KS), Tim Kaine (D-VA), and Tom Cotton (R-AR)."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senators Dianne Feinstein (D-Calif.), John Cornyn (R-Texas), Patrick Leahy (D-Vt.), Joni Ernst (R-Iowa), and Chuck Grassley (R-Iowa) today introduced a bipartisan resolution in support of National Sexual Assault Awareness and Prevention Month."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Harris (D-Calif.), Mazie Hirono (D-Hawaii), Tim Kaine (D-Va.), Angus King (I-Maine), Amy Klobuchar (D-Minn.), Jeff Merkley (D-Ore.), Jacky Rosen (D-Nev.), Bernard Sanders (I-Vt.), Chuck Schumer (D-N.Y.), Kyrsten Sinema (D-Ariz.), Debbie Stabenow (D-Mich.), Elizabeth Warren (D-Mass.), and Ron Wyden (D-Ore.)."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "Senate according to GovTrack, a wholly independent entity."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Richard Blumenthal (D-CT), Sherrod Brown (D-OH), and Bernie Sanders (I-VT)."}]