[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid, she is totally at risk. Cutting Medicaid to give tax  cuts to wealthy billionaires is not only cruel and unethical,'' Sharon  writes, ``but it puts vulnerable people, including children, at risk of  severe mental and physical health problems. Do the right thing and  rescind the drastic cuts to Medicaid for vulnerable people with serious  physical…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…primary source of health coverage.\n\nMedicaid is not just a health program; it is a lifeline. It       provides access to care for those who need it most--poor and       vulnerable children, pregnant women, elderly adults, and       disabled individuals in our Nation--while ensuring their       dignity. Their dignity.\n\nHere is the Partnership for Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Speaker, we have heard how the recent DOGE cuts  are impacting Federal employees, seniors, and veterans, but these cuts  are also impacting our children, particularly vulnerable children.\n\nRecently, the Department of Justice announced the termination of  Federal grants to support court-appointed special advocates, known as  CASA programs.\n\nCASA programs…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…healthcare  is critical, medically necessary, and often lifesaving.\n\nThe President and my Republican colleagues have spent the year  scapegoating a very small group of very vulnerable children because  they have no solution to strengthen the economy, reduce healthcare  costs, or make our communities safer. This legislation is just the  latest attack.\n\nMs.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…colleagues to work with us to stop these  indiscriminate, illegal layoffs and funding cuts which threaten to  undermine the good bipartisan work we have done on behalf of vulnerable  children.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…ready to learn. Gutting it directly harms over 1  million parents who rely on Head Start to work, over 800,000 children,  and tens of thousands of workers--undermining vulnerable children and  communities.\n\nFor K-12 education, Trump's actions jeopardize key programs that  improve educational success for low-income students and students with  disabilities.…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…offering an amendment to protect Florida's ability to fund  Medicaid. I refuse to stay quiet and silent while this body attempts to  rip away healthcare from our most vulnerable children who need it.\n\nI also introduced another amendment to protect south Florida's small  businesses and the workers they depend on. Immigrants are the economic  engine of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…only serves to intensify the massive affordability crisis  that New York and the rest of the country continue to face. Playing  politics with people's lives, let alone vulnerable children and  families, is unacceptable.\n\nWhile this administration continues its cruel and vengeful behavior,  my Democratic colleagues and I remain committed to protecting…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…our part.\n\nI urge the administration and my colleagues to do the right thing.  Restore the funding for emergency food aid. Keep America's promise to  the world's most vulnerable children. We do not have another day to  waste. This is a moment of urgency.\n\nThat is why starting today, I will take to the floor of the House  every single day to call to anybody…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this authority to expire. So, by passing  this bill, we are merely maintaining the status quo. We must also  address how this poison gets into the hands of the most vulnerable: our  children. Too often, fentanyl is peddled in the open on some of the  world's largest social media platforms.\n\nWhen the Senate Judiciary Committee marked up the HALT Fentanyl…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…2022, The New York Times revealed the existence of online suicide  forums that don't just discuss suicide, they promote it. Anonymous  users on these platforms encourage vulnerable children and young adults  to end their lives, and they often suggest using this chemical to do  it.\n\nNow, most Americans have never heard of sodium nitrite, but for  families…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690216/youth-poisoning-protection-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…of dollars in earmarks going  to so-called gender clinics and hospitals that push puberty blockers,  cross-sex hormones, and even perform life-altering surgeries on  vulnerable children.\n\nThis is not healthcare funding. This is not healthcare. It is  promoting an ideology that harms children, sidelines parents, ignores  common sense, and contradicts…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Madam Speaker, I yield 2 minutes to the  gentleman from North Carolina (Mr. Harris).\n\nMr. HARRIS of North Carolina. Madam Speaker, bad actors often prey on  the most vulnerable: our children. It is our job to stand up for them.  That is why I rise today in support of the Coercion and Sexual Abuse  Free Environment Act introduced by my colleague and friend,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, as a father of four, I believe that every  child deserves a safe and loving home.\n\nUnfortunately, many vulnerable children in our foster care system  lack a family that they can call their own due to the shortage of  foster families.\n\nThis must change, and that is what this bill does.\n\nMy…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688407/recruiting-families-using-data-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Services which illustrate the dire consequences of weak Biden  administration vetting policies. These records show terrible cases of  fraud and exploitation involving vulnerable children, and the public  needs to know that this is probably just the tip of the iceberg.\n\nI will give you three examples.\n\nOne sponsor allegedly applied to take in two migrant…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…opportunity should  come with responsibility. Republicans are standing up for what works  and what is right.\n\nWe are saying Medicaid must remain a lifeline for the truly  vulnerable: children, seniors, people with disabilities, and low-income  parents.\n\nHowever, for able-bodied adults without kids, yes, you should try to  work, just like in the 1990s, just…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…the  world, second to only that of drug trafficking. Human trafficking  generates an estimated $150 billion a year and enslaves nearly 50  million people. The most vulnerable are our children and young adults.  They are being targeted and exploited through their phones, through  their computer systems, through gaming systems, and through social  media.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]