[{"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…united during the strike so  employers could not break the union.\n\nHe was a trustee of Local 2897 from 1934 to 1936, where he pressured  leaders to pay Black dockworkers the same wages as their White  counterparts.\n\nErnest Charles Tanner passed away in 1956 at the age of 66. He  achieved what many seek when they join a union, the recognition of the  dignity…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…to be paid education act. Yes, I said that.\n\nThis disastrous bill would be a blueprint to commit wage theft on a  silver platter.\n\nI know what it is like to be cheated out of wages. That happened to  me, unfortunately, when I was a younger man. The rules that are set up  are there to protect those who had the least ability to protect  themselves.\n\nA fair…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…reducing the       overtime rate for employees will spur a widespread       willingness of employers to offer reimbursement for child or       elder care. Workers need both decent wages and access to       affordable child and elder care. There are ways to achieve       the latter without attacking the former.\n\nH.R. 2312, the Tipped Employee Protection Act,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…return to work to pay for the house he and his brothers had       purchased.\n\nThrough this period, George had to take payday loans.       Between those loans and his weekly wages, he attempted to pay       back the money he owed the hospitals.\n\nHe learned that because of his medical debt, his credit       rating was destroyed by credit agencies who…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Protection Act, would  change Federal wage law to allow employers to treat almost any worker  as a tipped employee, even if they receive small or occasional tips.  This means lower wages for everyday Americans who are struggling daily  with higher costs.\n\nMr. Speaker, think of a restaurant worker who both waits tables and  covers with some back-of-the-house…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…Sportsmen's Alliance  estimates that in 2022, recreational hunters alone generated $133  billion in economic output, created 1.3 million jobs, and supported  more than $80 billion in wages alone. And this is part of a larger  pattern. The Bureau of Economic Analysis calculated that the economic  output of outdoor recreation in 2023 was over $1 trillion.\n\nIf the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…home  State of Oregon, but also across the country, will lose the jobs they  just started. Jobs in solar, wind, battery storage, clean  manufacturing, those are jobs with good wages and benefits that are  supporting their families.\n\nRipping away these credits means that instead of finishing  construction on clean power plants, Republicans will abandon…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…consumer spending,  so obviously something is out of whack. Despite this reality, House  Republicans are attempting to pass three bills this afternoon that  would cut workers' wages.\n\nThis bill, H.R. 2262, would relieve employers of the obligation to  pay employees for training outside of their regular working hours.\n\nUnder the Fair Labor Standards Act,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…enforcement on the people with the least power.\n\nH.R. 2312 makes this even worse. It would massively expand employers'  power to treat far more workers and far more hours as tipped wages.\n\nOregon does this differently. Tipped workers' wages are higher.  Poverty rates are lower, and the restaurant industry still thrives. For  workers, that means a slow night…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698948/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…mortgage?\n\nYou see, my parents worked their lives in this country and my father  today has Medicare and my mother up until a year ago had Medicaid  because, unfortunately, the wages that she worked were not large  enough, were not equitable enough. They weren't living wages, but the  Medicaid system that we have that we know isn't working for everyone,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…together to lower costs for them. That is  why I introduced the No Tax on Tips Act alongside Senator Ted Cruz from  Texas, which would eliminate Federal income taxes on tipped wages.\n\nFor so many service and hospitality workers, tips aren't extra; it is  part of their income that they use to make ends meet. Tips are how  Nevadans pay their rent, cover…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…strengthening worker protections, as well. We are  becoming a country that is not looking out for the average worker, and  we are talking about times where workers are seeing their wages  flatten, and lower if you take into account inflation, and the increase  in income inequality as a result of it.\n\nPeople are fed up, and they understand that part of the reason…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…fairness, they believe in permitting, they believe that we need all of  the power generation we possibly can make, why do they stand idly by  while the Trump administration wages war on a clean energy power  source? Many of them are already permitted and constructed.\n\nIn April, the administration issued a stop-work order for the Empire  Wind offshore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…So CHC, the Congressional Hispanic Caucus, is in support of Dreamers,  farmworkers, and keeping families together.\n\nLatinos voted in favor of lowering costs and increasing wages. The  budget passed last night only gives billionaires tax cuts and funds  indiscriminate raids in our city, all paid for by working-class  families.\n\nAgain, Mr. Speaker, CHC…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…years ago, when labor protections barely existed. The  leadership, dedication, and great sacrifices made by APWU Chicago Local  0001 empowered postal workers to negotiate fairer wages, establish  safer workplaces, and secure far better health benefits. Simply put,  APWU Chicago Local 0001 has been instrumental in advancing postal  workers' rights, safety…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698928/recognizing-american-postal-workers-chicago-local-0001"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…their guaranteed deduction of $30,000  won't be cut in half and that their child tax credit won't be slashed  from $2,000 to $1,000.\n\nFollowing passage of the Trump tax cuts, wages increased by 4.9  percent, the fastest 2-year growth in real wages in 20 years. Mr.  Chair, 5 million new jobs were created. More than 6 million people were  lifted out of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of those  are real, except, in the scale of the spending, they are just not that  much. It is just the insanity of what is going on.\n\nLook, I am trying to help you understand wages.\n\nLet's back up.\n\nTax receipts are up. Spending is up dramatically more, but most of  the tax receipts that we are gaining are almost all capital gains. So,  of the increased…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…control, it becomes a powerful and dangerous tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially restrict how Americans spend their hard-earned wages.\n\nRecently, we have seen alarming examples of this kind of overreach,  from the Chinese Communist Party using its digital currency to track  and control citizens to Prime Minister…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…extraordinary woman, a true pillar of our community, whose life has  been defined by service, resilience, and an unwavering commitment to  others--Diane Reitz.\n\nEven as she wages a courageous battle against stage IV pancreatic  cancer, Diane continues to give of herself--to her family, her  neighbors, her country, and, above all, to the veterans of…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…not. I don't know. But if they decline to join with us, then  through reconciliation, which is how we passed the One Big Beautiful  Bill, we can pass these measures to increase wages for the American  people with a majority vote. We won't need Democratic votes. That is  what we did with the One Big Beautiful Bill, and we can do it two more  times before…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…trade  relationship and trade agreement with our two biggest partners, Canada  and Mexico, which was known as NAFTA. Then, we had USMCA, and our trade  activity and our jobs and wages in agriculture and manufacturing have  gone up since, and we had overwhelming bipartisan support.\n\nI have seen President Trump in action. I believe this will be not  just a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…wage, as well as a separate minimum wage, for  tipped workers. This recognizes the reality that tipped workers have a  higher earning ceiling when tips are combined with base wages,  representing an employee's total compensation.\n\nThere is no limit to the amount one can earn as a tipped worker, so  long as the employer is not forced to cut jobs or close…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…bill, this  is what I understand took place. When they had a corporate tax rate  decrease, they have shown me their books, and the areas that they  prioritized were to increase wages for their frontline workers. They  said every single person at the firm got a pay increase. They grew real  wage growth without massive inflation that takes place sometimes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…important, and I will continue pushing for a  fiscally conservative, 5-year farm bill that reflects the priorities of  our producers who feed, fuel, and clothe the world.\n\nWhile real wages are rising and inflation is nearing a 5-year low,  there is more to be done to lower costs for families and small  businesses. Washington regulations often hit Americans hardest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump and grocery store as  their wages are going up and opportunities are increasing. In our  schools and military, the emphasis is, once again, on merit instead of  discriminatory DEI standards. In America, success…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Federal budget.\n\nYou walk through saying: Okay. Can I show you? Well, you gave money  to corporations. Yes, but we can show you that the vast majority of  that actually went to wages.\n\nPeople forget many of the things we did to force the repatriation  back of capital, intellectual property, expensing, and R&D expensing.  As a Republican, don't ever tell…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…will benefit from the One  Big Beautiful Bill Act.\n\nBy extending and improving the TCJA, working-class families in my  district will pay $10,900 less in taxes and see increased wages of  $7,200 on average. It contains my bipartisan legislation to make  research and development expensing permanent, a jobs provision ensuring  America continues to lead the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693193/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…destruction. If you want productivity--because I  am going to show in these charts where we are demographically, if we  don't have an explosion of productivity, we can't make wages go up.\n\nIf you are a working person in this country today--particularly like  in my Phoenix-Scottsdale area, if you are a working person today and  you haven't had about a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…say it is the bee's knees. What is the buzz?\n\nBasically, it brings better jobs, bigger paychecks, and booming  communities. The One Big Beautiful Bill Act is about boosting wages,  backing small businesses, bolstering border security, and it brings tax  relief.\n\nMr. Speaker, I recently sat down with manufacturers from my district  in northeast Florida…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693038/buzz-from-break-rooms-to-backyards"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…wall and the removal of millions of illegal aliens that the  Democrats allowed into our country.\n\nUnder Biden, most of the new jobs were snapped up by foreigners, and  real wages fell. Under Trump, most jobs are going to Americans, and  real wages for Americans are rising again, as employers are forced to  pay a market rate for labor.\n\nThe Democrats'…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}]