[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in the whole audience.\n\nYesterday, when my wife and I went to Lou Mitchell's for breakfast  before church, I had conversation with another person who is on their  staff, a waitress. She is a manager as well, and she has been working  at this job for years. She is 63 years old.\n\nHer husband just qualified for Medicare, and she felt relieved that  that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…only impact is with patients  who are ruled ineligible and kicked off Medicaid because they were  drowning in paperwork. What a way to run a country.\n\nHere is an example: A waitress with diabetes misses a paperwork  deadline because the forms were sent to her old address. She loses her  Medicaid coverage and can't access her medications and is forced…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, I rise today in opposition to the  rule and H.R. 2312, the Tipped Employee Protection Act.\n\nWhen I was a waitress in 1983, the tipped wage was exactly the same  as it is now. It is $2.13 an hour. Your ability to budget, to cover  rent, to buy groceries, and to pay for gas depends on how…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698948/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…were actually engaged in crime, as Ghislaine  Maxwell was, as Epstein was, then they should be charged with every  element of due process.\n\nIf they happen to be a waiter or a waitress who worked at an event,  they are not guilty of anything. That is what due process is, we are  able to sift through and figure it out.\n\nHowever, your rush to judgment isn't…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…I grew up going to union halls and picket lines and with  my father fighting to elect proworker candidates. Naturally, I became a  member of UNITE HERE Local 26 as a union waitress during the AIDS  crisis, where fellow union members had the dignity of healthcare and  death benefits when they needed them because we belonged to a union. I  am proud to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…NEAL.  Chu).\n\nMr. NEAL. Mr. Speaker, may I inquire as to how much time I have  remaining.\n\nMr. NEAL.  Salinas).\n\nMr. NEAL.  I can't wait for the  Republican Party to meet that waitress who is making $32,000 a year and  tell her in this tax bill the Republican Party just gave her 68 cents  more a day because that is the reality of what this tax bill is about.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…what they pay today. The average family  of four will see nearly $11,000 more in their pockets each year. Real  wages for workers will rise by as much as $7,200 a year. A waitress  working for tips will keep an extra $1,300. A lineman working overtime  after a storm will keep an extra $1,400.\n\nWhile Democrats defend illegal immigrants, fraudsters, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…that.  They are watching this vote. You can say billionaires all day long, but  do you know what the new tax cuts in this bill are? There are new tax  cuts. For the waiter and waitress who are working maybe two, three  shifts at a restaurant, at a diner, barely getting by, that is the new  tax cut that we are putting in this bill.\n\nYou would say, well, then,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…individuals. The individual who lives on their  Social Security will have more money in their pocket because they won't  have to pay taxes on that--we exempt taxes--or the waitress in Glasgow,  Kentucky, who won't have to pay taxes on her tips; or the farmers in  Owensboro who will be able to pass their family land down to their  family because of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…spoke to a small business owner in Monroe who will now be able to  invest more in his operations and grow his family business due to the  progrowth policies.\n\nI talked to a waitress in Cassopolis who called this legislation  life-changing because she will be able to pocket more of her hard- earned money thanks to no tax on tips and overtime.\n\nAs I travel…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "John Rose", "party": "Republican", "sentence": "…tax on tips, no tax on overtime, and support for small businesses, so  what does the D.C. Council do?\n\nThey voted to deny their own residents these benefits. This means a  waitress working in a Washington, D.C., restaurant gets taxed on her  tips on her D.C. tax return while her counterpart in Virginia doesn't  get taxed on their Virginia tax return.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699677/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…overtime pay. Around 22 percent of all employees in  Utah regularly work overtime and could benefit from this tax break.\n\nThe bill also cuts taxes on tips. Whether you are a waitress earning  tips or a nurse working overtime, this legislation will make sure that  your hard-earned money stays where it belongs: in your pocket.\n\nThe legislation also benefits…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…to increase yearly take-home  pay by more than $1,400.\n\nThe bill also eliminates Federal taxes on up to $25,000 of tips for  America's 4 million tipped workers. As a former waitress, I know how  valuable this provision would be. This applies to all tips, whether  they are tips that are cash or on credit. All tips qualify for the no  tax on tips. This…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…backstory of where the idea came from.\n\nHe said he was sitting at a hotel in Las Vegas, getting ready to go  to his rally, and he said he was having lunch there. And he said a  waitress came by, and he said: She was beautiful; she was beautiful-- which I believe him. And he said she was complaining about the burden  and the paperwork of paying taxes on tips…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}]