[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…and  extremism. That is what we saw with the growth of ISIS and the regrowth  and reconstitution of the Taliban.\n\nAnd in the long run, the country essentially just decides to wait you  out. They knew in Afghanistan we were going to tire at some point and  leave. So will the kleptocrats in Venezuela. They will play ball with  us, but at some point the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Girls Club, which provides programming  for youth in the community. The club is a central part of the community  but faces challenges in accepting new members and a growing wait list  due to the need for renovations and expansion of facilities.\n\nMr. Speaker, H.R. 1276 would remove the National Park Service's deed  restriction, allowing the city of Paducah…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…of war and  famine, but instead, it sits in a warehouse benefiting no one.\n\nWe need the funding that this Congress provided to go through now  because starving children can't wait. To make matters worse, the  administration's fiscal year 2026 so-called skinny budget completely  eliminates funding for the Food for Peace program, a bipartisan program  that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…time yielded is for the purposes of debate only.                                General Leave\n\nMr. Speaker, all I can say is, it is about damn time. I mean, we have  had to wait months while the Republican leadership of this House  dragged their feet, all so we could take up a simple vote on whether to  stop people's healthcare premiums from doubling…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…have eviscerated the National Institutes of Health. They have cut  back on the Centers for Disease Control and billions of dollars for  Medicaid for a tax cut for the wealthy. Wait till you see what is  coming to America's hospitals after the next election. It is so  contrived they waited until after the election to implement it.\n\nMr. Speaker, 24 million…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696736/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and the decimated medical system in Gaza could not  provide him the care he needed to survive.\n\nNow her daughter, Lana, who suffers from the same kidney condition,  is on the wait list for medical evacuation. Each day that goes by  without adequate treatment, Lana's life is in danger.\n\nHadeel is no different from the parent in Boston who clutches their…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…already doing and wiping our hands  and saying, ``We did great things,'' was saying, ``We didn't have  time'' because of this artificial deadline.\n\nSo I am down here to say: Wait a minute. Let's do the temporary  extension and take time to do bipartisan bills.\n\nBut don't take my word for it. Take the word of the Republican  witnesses who came to our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…for it. There are too many Americans who go to bed at  night wondering, is that lingering cough something that I need to go to  a doctor for today? Can I afford it, or do I wait until I can't breathe  and I am in the emergency room?\n\nThat is what is at stake. It is not a game about will Democrats or  Republicans win. It is a question about  whether…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…bipartisan bill to  restore dignity, fairness, and economic security to people who earned  it the hard way. They worked hard.\n\nFor too long, Delphi retirees have been asked to wait, to be patient,  and to accept less than what they were promised and worked for and  earned. Many are now well into their retirement years. It almost seems  like a conspiracy…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…this mean these  patients will no longer need care, or their illnesses will just  magically go away? We all know that doesn't happen. This means that  uninsured patients will wait to see a doctor until they are so sick  they have to go to the ER, which costs more. This will lead to  increased costs across the board.\n\nSpecifically, it is estimated that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…their  increased costs. Those increased costs are often related to automated  farm machinery that they can get only from outside of the United  States.\n\nThey don't have time to wait and see if, possibly, domestic  manufacturing will occur. They need help now.\n\nAs my colleague stated before, it is under our purview as Congress.  Article I, Section 8, gives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…also been stalled. There are  so many heartbreaking stories, like one hopeful couple in my office who  has been trying to plan their wedding but remain separated while they  wait. There is another person who has not been able to unite with their  sons or daughters.\n\nThese delays have been putting people's lives on hold indefinitely  without any sort…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Speaker, open enrollment ends on January 15. The new premiums,  without the enhanced premium tax credits, take effect for 22 million  Americans on January 1. Do you know who can't wait 6 months for a  healthcare fix? The 5 million Americans who are estimated to find they  can no longer afford their health insurance premiums when the premium  goes up.\n\nI don't…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…provide it to those millions of Americans who will find healthcare  insurance unaffordable is unacceptable, and that is why we are taking  this stand and why America can't wait for Donald Trump to tell them  that they are sick enough now to be given this subsidy, which they  deserve.\n\nI am here to urge my Republican colleagues to stop rolling over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…legislation rips food from the  tables of those in need to pay for tax breaks for the most wealthy.\n\nI have seen the need firsthand: miles-long lines on 61st Avenue as  families wait for the food bank to open. My community is hurting, and  this cruel policy is a betrayal of our most vulnerable.\n\nI urge my Senate colleagues to reject this harmful legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692186/slashes-to-snap-benefits"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Border Patrol the ability to  effectively seize these drugs. This will result in harsher penalties  for the criminals who are responsible for this epidemic.\n\nOur Nation cannot wait any longer as we lose thousands of Americans  every day to this poison.\n\nMr. Speaker, I look forward to supporting this legislation on the  floor, and I encourage all of my…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…country, we passed a law saying you can't get it  anymore.\n\nWell, look, I thought that was a huge injustice, so I worked on a  bill during President Trump's first term to say: Now, wait a minute, if  you were overseas serving your country, and you missed your ability to  apply for a Native allotment, you should get your ability to do that.\n\nThat law passed.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…They look for power from countries like Russia, like China, and like  India to use their coal-powered, generated plants to support their  grid. However, in America, we cannot wait to put coal factories out of  business. Just like in my district, with the Sammis factory, Joe Biden  couldn't wait to celebrate putting 800 jobs in the garbage and putting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of your groceries to  go up and cause your electronics to go up, no one is going to help you;  you will just pay higher prices. If you think the cost of eggs is high,  just wait until the tariff hits.\n\nTariffs will raise the price of a car between $5,000 and $15,000.  Despite arguments to the contrary, Americans know that tariffs are a  tax they will…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…on  tips and no tax on overtime. To our seniors, I have good news for you,  too. With the new deduction, you are not going to pay any tax on Social  Security benefits.\n\nBut wait, there is more, Mr. Speaker. We have unleashed American  energy, restored our independence, and brought down costs at the pump.\n\nDo you know why we don't hear why eggs cost…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…one has  gotten broadband.\n\nThe Tribal president of the Navajo Nation and a number of the  communities called chapter houses basically said screw this. I am not  willing to wait another 20 years. You know what they did, something  just crazy? Instead of being patient and waiting for us to spend  billions of more dollars and run a piece of wire, they…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "John James", "party": "Republican", "sentence": "…in 1 hour, Mr. Speaker. If you show up at the ER,  though, Mr. Speaker, bring a book and a sandwich because you are going  to be there for a while.\n\nMichigan has the longest wait times on average of any State in that  immediate region and some of the longest wait times in the country. If  you want a flat-screen TV, Mr. Speaker, you can have one delivered…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…very unfortunate that we are seeing this hardship and stress  placed on the intended recipients who have had to endure seeing their  checks being stolen and then they have to wait months to sometimes see  their replacement check also stolen.\n\nThis is not just happening with IRS tax refunds. It is also happening  with Social Security and other benefits…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…33- percent reduction in their premium in the form of a refundable tax  credit that would go straight to their premium payment at the time it  is due.\n\nHurricane season won't wait on those who need flood insurance.  Americans in my State and across the country need relief now. If we  really want to put Americans first, we can start by making the National…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "…able-bodied individuals are added to Medicaid, truly needy  and disabled Americans are being displaced from priority services.  700,000 disabled Americans are stuck on Medicaid wait lists while able- bodied adults above the poverty line have access to taxpayer-funded  healthcare.\n\nThe goal of social programs should never be to gain able-bodied  enrollees,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690831/medicaid"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…he was  surprised about the indictment. It is another example of who in there  thought this was a good idea?\n\nNow, because it is a current investigation, we will just have to wait  and figure it out after they either proceed with an indictment or they  decide to dismiss it.\n\nThen the final thing is, I am in a position now, without question, to  say that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…postpones the filing and payment deadline for  taxpayers impacted by a natural disaster. Understandably, some  taxpayers living in a disaster area choose to file their taxes and wait  to pay the tax bill at a later date, freeing up resources to instead  help replace the items that they have lost. For the average taxpayer  who requests a filing extension,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…anymore, and that wasn't always the case. Our colleagues are  addicted to a tax-and-spend formula that has been bankrupting our  government.\n\nBut we won't stand idly by. We won't wait on Democrats to take their  heads out of the sand or wake up from this woke-induced coma. We are  taking bold action at every level and in every facet of the Federal  Government…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Further, somebody said earlier, Mr. Speaker, that we were stripping  away critical regulations. I would say, Mr. Speaker, if it was so  critical, why did the Biden administration wait until November 29 with  less than 2 months left in their term? If it was so critical, why did  the EPA in 2020 find that there was an ample margin of safety in the  regulations…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the Solidify Iran  Sanctions Act, which would eliminate the upcoming 2026 sunset from the  Iran Sanctions Act.\n\nWe need to send Iran a clear and simple message. They cannot wait out  our sanctions. Our sanctions will not expire on some arbitrary date.  The only way to make U.S. sanctions go away is to stop the sanctionable  conduct and not threaten…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}]