[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…but that is why the fossil fuel  industry has launched an all-out assault on California's rules.\n\nI will give you just one example. If you happened to be reading the  Wall Street Journal this past January, you might have picked up the  paper to find an op-ed with the headline ``Biden's EPA Tries to Put One  Over With EV Mandate.'' That kind of sounds…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…share with you what was on an article from The  Washington Post: Trump's tariffs are causing untold harm to America.\n\nLet me read another story. This story is from The Wall Street  Journal, ``The Dumbest Trade War in History.'' The Wall Street Journal  said that.\n\n``President Trump will fire his first tariff salvo on Saturday  against those notorious American…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…gaining speed about veterans not deserving the benefits provided to  them or of defrauding the compensation and pension system en masse:  Project 2025, The Economist, The Wall Street Journal, and The  Washington Post.\n\nWe have even heard this from some veterans themselves at recent  congressional hearings that somehow veterans' benefits make them lazy  and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…morning, I am going to do everything I can  to elevate the voices of Republicans because this is not intended to be  a partisan speech.\n\nFrom the Cato Institute to the Wall Street Journal, to nonpartisan  groups, to the Congressional Budget Office, everyone is pointing to  what is happening as not normal, not what the President says it is, as  something…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…headline yesterday in The Washington Post read: ``Long waits, waves  of calls, website crashes: Social Security is breaking down.''\n\nNext to me is a poster board from The Wall Street Journal. Some  people may say that The Washington Post is always critical of President  Trump, but this is The Wall Street Journal, an impeccable, center-right  newspaper whose…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…protect the perpetrators. Why? Because the man in the Oval Office, Mr.  Trump, told us he wants us to protect those files, does not want them  public.\n\nOn July 17, the Wall Street Journal reported on a letter allegedly  written by Trump to Epstein as part of a birthday book for his 50th  birthday in 2003. The letter is signed at the bottom ``Donald.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…years (see Figure 1)       and natural gas producers say they will struggle to meet LNG       growth demand.\n\nPrices are already increasing. The November 13, 2025 Wall       Street Journal story ``Natural Gas Prices Hit Highest Level       Since Invasion of Ukraine'' reported that natural gas prices       reached their highest levels since December…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the Republicans are trumpeting the dawn of  a golden age of economic growth. However, this week, The Wall Street  Journal had an editorial, ``Trump's Tariffs Whack Trump Voters'' with a  subhead of ``Whatever happened to GOP concern for the working class?''\n\nThe Wall Street Journal said:…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the  United States this decade, citing the early phaseout of the Federal tax  incentives and regulatory shifts under this administration.\n\nMr. President, I ask that the Wall Street Journal article titled  ``IEA Cuts U.S. Renewable Energy Growth Outlook on Trump Policies'' be  printed in the Record.\n\n7, 2025]      IEA Cuts U.S. Renewable Energy Growth Outlook…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…longstanding issue that Citi had after they went through a series of  mergers in the 1990s.\n\nWhen the 2020 fine of $400 million was imposed, there was an article  in The Wall Street Journal that explained how mergers harm the bank.  They wrote: ``Regulators have long fretted that the hodgepodge of  systems, a legacy of a string of deals in the 1990s that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…because his administration's reckless tariffs and disastrous trade wars  have increased manufacturing job losses not just in our region of Ohio  but across our Nation.\n\nThe Wall Street Journal documents that, over the last year,  manufacturing  unemployment has risen in our country by 68,000 more unemployed  workers. You can't Make America Great Again unless…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to be an  opportunity for us to sit down and say: All right, what do we need to  consider to do to make the Affordable Care Act better?\n\nThere is an editorial in the Wall Street Journal this morning. I  don't usually buy that newspaper, but I am glad I did. There is a long  list of things they raised questions on when it came to fraud in the  Affordable…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Inquiring minds would like to know.\n\nMr. NEGUSE.  Sanchez).\n\n``U.S. Manufacturing Is in Retreat and Trump's Tariffs Aren't  Helping,'' February 2, 2026, headline, The Wall Street Journal.\n\nApparently, The Wall Street Journal has Trump derangement syndrome,  too, according to my colleague from New York. American consumers must  also. Everyone apparently…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…speech, Congress is going to shut down until September because  House Republicans want to avoid voting on releasing the Epstein files.\n\nWhy? I will tell you why.\n\nThe Wall Street Journal just confirmed that in May of this year the  Department of Justice told Donald Trump to his face that he is in the  unreleased Epstein files.\n\nHouse Republicans are…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694127/release-the-epstein-files"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, 65 percent of the people who have  been taken by ICE since this administration began had no criminal  convictions at all.\n\nThat is why we read articles in The Wall Street Journal about small,  rural towns that voted for Donald Trump. They are up in arms and are in  an uproar because people who have done nothing wrong and are pillars of  the community…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…many protesters did you have in  your office this last couple of days? ``You can't review. You can't go  after waste and fraud and Medicaid.'' Medicare Advantage, The Wall  Street Journal has done a five-part series that, if you add it all up,  is $1 trillion to $2 trillion of waste and fraud over 10 years. ``That  is hard. You can't actually talk about…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…H.R. 758, which requires U.S.  Postal Service employees and contractors to report to the Postal  Service traffic crashes that result in injury or death.\n\nIn 2023, The Wall Street Journal published an article alleging that  the Postal Service contracted with low-cost trucking companies that did  not follow highway safety regulations.\n\nThey also reported…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…allow States like California and other  States to game the system, to get Federal dollars sent back in a money- laundering scheme, as has been reported widely by The Wall Street  Journal and others? They are openly and knowingly doing it. Why  wouldn't we fix that?\n\nWhy wouldn't we apply eligibility rules and work requirements,  combined with lowering…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are these programs? Well, let's just take a look at the  headlines.\n\nMonday's Wall Street Journal: ``ObamaCare Is a Mecca for Fraud.''\n\nThe Democrats must be in favor of all this fraud because that is what  they want to do. They want to continue it for 83 billion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things that actually reduce spending and  modernize.\n\nI do want to sort of start with this. We have spent time since last  summer working on pieces of legislation. The Wall Street Journal series  and the ProPublica series came out about the scale of bad acts that  were happening in what we call Medicare part C, which is Medicare  Advantage for most of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us for more spending. Don't they have kids? Don't they  even care about their own retirements? It is the absolute vacuousness  of immortality.\n\nI grabbed this from The Wall Street Journal. I can't imagine anyone  here has had protesters and people showing up in their office about  Medicaid, which is supposed to be our safety net for indigents and the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…standing committees,  which have gone years and years and not been able to actually provide  improvements, redesigns, and modernization, be able to look at things  like The Wall Street Journal's five-article series and also the ones  this weekend on Medicare Advantage?\n\nMr. Speaker, one of their headlines said--I think it was actually  more than a single-year…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…happening. They get a 90 percent rate for that expanded  population, then layer on top of that, and this is what you are now  dealing with.\n\nThe gentleman's chart that The Wall Street Journal did, where you  have the provider taxes, you have this high rate that they are able to  collect, and they are juicing it using the provider taxes. They get  this 90…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…insurance companies.\n\nIn 2024, 87 percent of the revenue made by insurance companies  selling ACA exchange claims came from taxpayer dollars.\n\nTo quote an article from The Wall Street Journal, Democrats sold  ObamaCare on the false pretenses that it would make healthcare  affordable. Let me say that again: false pretenses. Extending the  subsidies would perpetuate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with the MedPAC reports. I don't know if  anyone ever bothers to read them, but you go through there, and it  should light your hair on fire. For the last year, The Wall Street  Journal has done a series of articles basically showing hundreds of  billions of dollars of waste, fraud, misallocation, just misalignment  incentives in something we call Medicare…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and a  week from today is Thanksgiving. I know that most of the people that I  represent are deeply thankful to be Americans and to be Texans. Every  Thanksgiving, The Wall Street Journal runs an editorial called, ``The  Desolate Wilderness.'' To the best of my knowledge, I think it has run  every year since 1960 or 1961. It goes like this:\n\n``Here beginneth…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the MedPAC report--and this is the  roomful of people that specialize in this and, I hate to say, my own  joint economic economist, the CMS data and HHS data, and The Wall  Street Journal, everyone else looks into this--it is coming in at 120  percent of fee for service.\n\nWhy this is a big deal is when Medicare Advantage was designed--it  really came…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things we could do to offset. The deal was, okay, go  ahead. See if you can get anyone to sponsor it and vote for it.\n\nWe have been chasing for over a year. Go read The Wall Street Journal  articles, the MedPAC report--the amount of fraud, waste, misalignment.  Some of it is perfectly legal misalignment. We are the idiots that  screwed up the law in Medicare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…match  rate to provide funds to illegal aliens and for their general budget to  game the system at what best can be called money laundering, as was  editorialized in The Wall Street Journal last week. When that is what  is happening, when you have people on Medicaid who are getting a higher  subsidy than people on Medicare, who have paid into it their entire…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on Monday, the Wall Street Journal  editorial board published an article titled ``ObamaCare is a Mecca For  Fraud.''\n\nIt articulates the waste, fraud, and abuse in the ObamaCare Program,  so I am going…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}]