[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…industry was going kaput to say  it lightly. There was a massive foreclosure crisis. There was a run on  banks like in equity firms like Lehman Brothers. They had this whole  Wall Street endeavor that the Bush administration alongside the House  of Representatives had to engage in.\n\nThere was this hanging issue around our auto industry and the fact  that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…hoax. Just last week, he said plainly: ``I don't  want to drive housing prices down. I want to drive housing prices up. .  . .''\n\nThat tells us exactly whom he is fighting for: Wall Street  speculators and billionaires, not our families living on Main Streets  and in our barrios. He is not even trying to hide it anymore.\n\nMeanwhile, utility bills are surging;…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans losing their healthcare coverage, all so Republicans can give  giant tax breaks to billionaires and big corporations. The only group  that wants these tax breaks is Wall Street, not the average American.\n\nMr. Chair, if Republicans pass this resolution today, we will be  forced to cut a minimum of nearly $1 trillion from Medicaid, our  Nation's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…stablecoins, which are  representations of dollars recorded on a blockchain.\n\nThe GENIUS Act could be the most significant banking bill that  Congress has considered since the Wall Street reform legislation that  passed after the 2008 financial crisis. There are a number of, I  believe, fundamental problems with the GENIUS Act in terms of national  security,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is going to be an  opportunity for us to sit down and say: All right, what do we need to  consider to do to make the Affordable Care Act better?\n\nThere is an editorial in the Wall Street Journal this morning. I  don't usually buy that newspaper, but I am glad I did. There is a long  list of things they raised questions on when it came to fraud in the…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…burdens that  disproportionately impact them.\n\nThis package of 22 bills is fundamentally really a pro small business  bill focused on addressing the affordability crisis and not a Wall  Street deregulatory bill.\n\nMr. Chair, 16 of these bills have passed the House nearly unanimously  in this Congress, and I supported every individual bill when we  considered…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…gentleman understands what it means for manufacturing and what it means  for communities who saw these jobs not leave but be taken away. They  were taken away by this ideology on Wall Street and the politicians  around here who helped them, which says that all that matters is  chasing the cheapest labor, the weakest labor rules, and nonexistent  environmental…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…launch. Video screens, hundreds of employees, and a full  color, smiling portrait of former President and oil man George Bush  Senior--probably 5 feet by 6 feet plastered on the wall of the secure  entryway. So, another U.S. President also from Texas supported another  crude, dirty oil kingdom war in the complex Middle East political array  of undemocratic…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…need to draw the line and say this is enough.\n\nI couldn't agree more.\n\nToday, the day has been a really hard time. I was on a TV program  earlier, and there were a lot of major Wall Street traders--Jim  Cramer--who are experts on Wall Street, and they talked about what a  devastating day this has been. This was actually the toughest day, the  biggest tumble…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…only justification for this invasion is  to get control of their oil, it should worry you more that now the plan  is not just to seize the oil for the purposes of enriching Wall Street  and the oil industry, the purpose is to seize the oil so the United  States can manage and run the country of Venezuela.\n\nWhy should regular Americans care about that?…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…surrogate mother for the phalanx of people who always walked       through her front door. Speaking for my cousin Nina and I, we       so wish we could have been flies on the wall at one of those       legendary gatherings.\n\nIt is said that there's a special place in heaven for the       father of three girls. I remember seeing that written on a…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…anything. Mr. Speaker, 65 percent of the people who have  been taken by ICE since this administration began had no criminal  convictions at all.\n\nThat is why we read articles in The Wall Street Journal about small,  rural towns that voted for Donald Trump. They are up in arms and are in  an uproar because people who have done nothing wrong and are pillars of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…to do, and we  would be viewed disrespectfully if we were ever to go down that path.\n\nNow, this comes at a time when we are observing the 15th anniversary  of the Dodd-Frank Wall Street Reform and Consumer Protection Act. As  some of us here know who served with Barney Frank, he was the chair of  the then Financial Services Committee and a master of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…386: Ronald A. Parsons, Jr., of South       Dakota, to be United States Attorney for the District of       South Dakota for the term of 4 years.\n\n19. Calendar Number 387: Kurt Wall, of Louisiana, to be       United States Attorney for the Middle District of Louisiana       for the term of 4 years.\n\n20. Calendar Number 388: David Charles Waterman, of Iowa,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…let me finish with this. I still have in my office a  quilt that my kids in my preschool made for me on the very last day I  taught preschool. It is hung prominently on the wall of my biggest  meeting room. It is a beautiful patchwork of squiggles and smiles drawn  in bright, messy crayon. When I look at it, I remember the little hands  that made each…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…support of H.R. 758, which requires U.S.  Postal Service employees and contractors to report to the Postal  Service traffic crashes that result in injury or death.\n\nIn 2023, The Wall Street Journal published an article alleging that  the Postal Service contracted with low-cost trucking companies that did  not follow highway safety regulations.\n\nThey also…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…home safely to the warm embrace of  their families. Today, their names are hauntingly etched into the two  faces of black granite in our Nation's Capital known simply as The  Wall.\n\nA replica of this very wall, almost 300 feet long, will be on display  in my district from April 17 to April 21, 2025, at the Northeast  Florida Fairgrounds in Nassau County,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…that something significant happened here.\n\nAnd it is not just about what happened on that day, May 31, into June  1 of 1921. It is what it was like before, when it was Black Wall  Street, a thriving community. It was like what it was like afterward,  when people stayed and rebuilt a community. It is like what it  is now. It is people with great pride…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on Monday, the Wall Street Journal  editorial board published an article titled ``ObamaCare is a Mecca For  Fraud.''\n\nIt articulates the waste, fraud, and abuse in the ObamaCare Program,  so I…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Thursday and a  week from today is Thanksgiving. I know that most of the people that I  represent are deeply thankful to be Americans and to be Texans. Every  Thanksgiving, The Wall Street Journal runs an editorial called, ``The  Desolate Wilderness.'' To the best of my knowledge, I think it has run  every year since 1960 or 1961. It goes like this:\n\n``Here…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, in 2023, dozens of Members of Congress  beat the S&P 500, while only 40 percent of Wall Street pros were able  to pull that off. I think that has got Americans asking: What does  Congress have, a secret strategy?\n\nThe sad part is, they did. It is called insider…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…my colleagues on the other side of the aisle  won't even say their names.\n\nWe never read their stories in glossy front page cover essays or saw  their names plastered across wall-to-wall coverage by the national  press. When their families were honored by President Trump in his  address to Congress last year, many Democrats refused to even applaud.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and that hurts Americans.\n\nTo the contrary, Mr. Speaker. Allowing healthy mergers to prevent  bank failures allows for healthy financial institutions to compete with  the big Wall Street banks. If you want more competition for big Wall  Street banks, you should support this resolution of disapproval because  you are going to create stronger competitors…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…military academy civil preparatory school\n\nEthan Hunter Hayward, Allen TX.                    u.s. naval academy preparatory school\n\nTrystan Rohan Hutchison, Sachse TX; Tyler Aiden Wall Sr.,       McKinney TX; Benjamin L. Yost, Princeton TX.                 u.s. naval academy civil preparatory school\n\nMcKenzie Kendall Quigley, McKinney TX.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…countless Americans dedicated their lives to stopping  the spread of repressive ideology.\n\nIn 1987, President Reagan famously called on Secretary Gorbachev to  ``tear down this wall'' at the Brandenburg Gate. A few short years  later, the Berlin Wall fell, the Soviet Union collapsed, and democracy  gained ground across the globe.\n\nIn the years that followed,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Washington Post; Amiri, Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones; Anglin, Tara: New York Times;       Aoyama, Ryo: Asahi Shimbun; Appelbaum, Binyamin: New York       Times; Appleby, Julie: KFF Health News; Aratani,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Next year, for every dollar of tax collections, we are going to spend  $1.43. Let's say you are the most liberal Member here. Do you have any  understanding when this hits the wall, the devastation, the crushing of  poor people? How about if you are the most libertarian or free market?  Do you understand the crushing of the economic system, which has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Act, we gave our law enforcement  agencies the tools and resources they need to help secure the border.  We allocated more than $46 billion to finish President Trump's border  wall and ensure that our borders have a physical barrier to keep bad  actors out. We invested in the CBP workforce, equipping the agency to  hire more personnel to keep our borders…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…romantic fantasies with underage users, even carrying on explicit  discussions of sexual acts with children. They know this is happening.\n\nIn one case that was reported in the Wall Street Journal last month,  a chatbot emulating an adult man told a test user--this was a reporter  who was a test user for the Wall Street Journal for the story on these  chatbots.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Congress, how many protesters did you have in  your office this last couple of days? ``You can't review. You can't go  after waste and fraud and Medicaid.'' Medicare Advantage, The Wall  Street Journal has done a five-part series that, if you add it all up,  is $1 trillion to $2 trillion of waste and fraud over 10 years. ``That  is hard. You can't actually…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]