[{"senator": "Tina Smith", "party": "Democrat", "sentence": "…am a police  officer. And they leave her alone.\n\nThis is about people dialing 911 because an ICE agent is at their  home, and they are so scared about what to do.\n\nSo I want to be clear: We are pro-public safety in Minnesota. We have  worked often with Federal authorities to catch bad guys and lock them  up. But we need ICE out of Minnesota. What is really…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…spent on average well  over $1,000 more because of Trump's cost-raising tariffs. He was  supposed to lower prices on day one. Well, we are a lot further than  day one.\n\nI want to be clear about what these tariffs really are. They are an  additional tax on hard-working families, and they increase prices  across the board. Just look at housing. Due to Trump's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…BILL.''\n\nYou know, I appreciate it. I am a '90s kid. He also tweeted a picture  of ``Kill Bill,'' a Quentin Tarantino reference. We all know where Elon  is coming from.\n\nI want to be clear: I am not a fan. I think we all know that.\n\nWe have tried to subpoena you several times to come testify in front  of the Oversight Committee. You have been giving yourself…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Palestinian freedom; a just, peaceful, and swift end to the war in  Gaza; and an eventual, viable, and negotiated two-state solution.\n\nThe situation in Gaza today is dire. I want to be clear. The war in  Gaza began with Hamas' brutal attack on innocent Israelis on October 7,  the bloodiest day in Jewish history since the Holocaust. For many in  the Jewish…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…they even got to their  thirties and forties and fifties in life, were out there as great  patriots fighting for this Nation.\n\nI rise today in an unusual manner, and I want to be clear and explain  that. But I just want to tell you what John Lewis said. It is a quote  so many people know. He really spoke not to Members of the Senate or  the Congress;…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…enforcement.\n\nIn the very last clause, it specifically expresses gratitude to law  enforcement including ICE for ``keeping our communities safe in the  face of danger.''\n\nI want to be clear. I commend local law enforcement, including the  Orange County Sheriff's Department, which I represent, for their  professionalism and courage. It is a tough job, and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…who is going to oversee what,  so that consumers can be protected. I can't say that enough.\n\nDo we want this to continue to be the Wild West with uncertainty, or  do we want to have clear rules of the road to protect consumers? Do we  want to do something or nothing? Is it perfect? As you have heard  today, no, it is not perfect. Few pieces of legislation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…colleagues.\n\nIt will explode the deficit. It will also hurt every single person in  this country by making the biggest cuts to Medicaid and to food  benefits ever.\n\nI want to make clear, as I talk about this, how reckless it is and  that even people who do not rely on Medicaid themselves will be  impacted by this. I am outraged. We are talking about…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…moments after the shots were fired, DHS  officials jumped to the claim that Mr. Pretti was a domestic terrorist  and an assassin who wanted to massacre law enforcement.\n\nI want to be very clear on this. Those statements are lies. They are  lies used to justify the unjustifiable actions of some DHS officers.\n\nThe blatant lies of DHS leadership and misconduct…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…simply setting a stricter  standard for itself; it's setting a new national standard.''\n\nOr California's ``emission standards would become de facto national  ones.''\n\nSo I want to be clear. California has not and cannot force our  emission standards on any other State in the Nation. As much as I may  love that authority, that does not exist.\n\nBut, yes, over…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to allies  and partners across the globe, including those in the Indo-Pacific and  Eurasia who are working to counter Chinese influence and Russian  aggression.\n\nNow, I want to be clear: This bill is definitely not the bill that I  would have written if it were up to me. There are steep cuts to really  important programs, and we are asking our diplomats…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…from somebody named Jeffrey Epstein, as I  had my team dig in very quickly: Mitt Romney, the NRCC, Lee Zeldin,  George Bush, WinRed, McCain-Palin, Rick Lazio.\n\nI just want to be clear: If this is the standard that we are going to  make, just know we are going to expose it all, and just know that the  FEC filings are available for everybody to review.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…proposal, if you can even call it that--to the floor: the  Cassidy-Crapo hodgepodge of half-baked ideas, whose fundamental core  idea has failed over and over again. I want to be very clear about what  this Republican bill represents: junk insurance. Let me tell my  Republican colleagues that it is dead on arrival. The proposal does  nothing to bring down…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…information about the intelligence supporting  these strikes, the legal framework governing these strikes, or the  strategic objective they are meant to accomplish.\n\nI want to be clear about something at the outset: I have spent years  advocating for stronger action against drug cartels that poison our  communities. I have consistently voted to provide…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to keep Americans' energy bills high to keep the  profits flowing for oil and gas, Republicans have started peddling the  falsehood that clean energy isn't reliable. I want to be clear: There  is no such thing as a perfectly reliable power plant. They all can run  into problems. Renewables depend on wind and the Sun. Coal and gas  often have issues in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…flag violates  our House rules by flying any other flag but the American flag.\n\nMr. MILLS. Mr. Chair, simply not waving the flag represents--\n\nMr. MILLS. Mr. Chair, I want to be very clear in this. They on the  other side may think we can out-pronoun our enemies, and that will keep  our adversaries at bay. We can ``he,'' ``him,'' ``they,'' ``them,''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…fuel  marketers; and National Automatic Merchandizing Association, which  includes vending machine operators.\n\nMr. Speaker, I urge my colleagues to oppose this.\n\nI just want to be clear. I don't have anything in my family business  in any of these businesses, but I will tell you what we look at is do  we get a return on investment and can we serve our…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…authority as a one-State veto of a multistate project of national  significance. This has been detrimental to the development of critical  pipeline infrastructure.\n\nI want to be clear: My bill would continue the safeguards of the  environment. We have some of the strongest environmental laws on the  planet. This legislation protects those laws while…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…of $26,000 per  vehicle--I said $26,000 per vehicle--for noncompliance attempt to  reshape auto manufacturing and take away consumer choice all across the  country.\n\nI want to be clear, I have no problem with electric vehicles.  Consumers should be able to purchase the vehicle of their choice. But I  do have a big problem with electric vehicle mandates…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…bare minimum, can do  no harm, and literally that is what we are begging for, when we are  trying to fight for $1.5 trillion in spending reductions, not even  cuts. I want to be clear. I will remind everybody about Medicaid.  Medicaid, there it is. It is going up 25 percent in our budget, for  better or worse. I can make arguments, but it is going up.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…negative impacts on the Colorado River system, as the Basin Fund  is the primary source of funding for operations and maintenance of the  system's critical infrastructure.\n\nI want to be clear: H.R. 1001 does not prevent bypass flows. It does,  however, require the agencies to fully cooperate to minimize the  impacts of these flows on the grid and its customers.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…taxpayer  dollars anymore.\n\nThis rescissions package is only the first step, and I urge my  colleagues to support it.\n\nMrs. McCLAIN.  Mace).\n\nMrs. McCLAIN. Mr. Speaker, I want to be clear. These rescissions  should get bipartisan support. We, as elected officials on both sides  of the aisle, have been entrusted with the hard-earned tax dollars of  the American…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this  important topic.\n\nRight now, the average American family is getting crushed and is  unable to afford healthcare because Democrats broke our healthcare  system.\n\nI want to be very clear: Democrats knowingly chose to break the  American healthcare system 15 years ago. We told the world what would  happen, and it has come true.\n\nAmerican families and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and protect our national security.\n\nWe don't have time to waste. It will require cooperation to ensure we  can keep making progress as the end of the month approaches. I want to  be clear that January 30 means January 30. We can't afford another  extension. As soon as we finish, work will begin on the next  appropriations cycle, starting with the President's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Arizona is talking about is so central to everything we are trying to  deal with right here, right now, in Congress, and if we don't fix that,  then we will have failed.\n\nI want to be clear to my Republican colleagues: If we do not fix this  scheme, this scam--the gentleman didn't misspeak. It is a scam. If we  don't fix that, we will have failed.\n\nLet me…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…specific policies to achieve the administration's agenda.\n\nThere has been a lot of political rhetoric about what this upcoming  budget resolution does and does not do, and I want to be clear about  where I stand.\n\nAs a Representative of one of the most agriculturally rich districts  in  the country, it is my constituents who are responsible for putting food…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]