[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…healthcare is still  too expensive.\n\nThat is a fact. But imagine, if there were no help in paying the  premiums, what families would be doing with these increased costs.\n\nDo you want to know one of reasons that the health insurance is so  expensive? I have asked Blue Cross Blue Shield in Chicago, and they  tell me it is pretty simple.\n\nDid you ever see an ad…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…starts right at kindergarten and goes all the way up to wherever  she wants to go, whether that is through high school, into a trade  school or to higher education. All of us want to know that if our child  can get into a college that we can afford to send them there.\n\nSo many Americans worry, can I pay for my child's education? So many  people in my district…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment and this congressional court of last resort,  Congress is where the court of last resort lies.\n\nI am familiar with impeachment. I understand the process. I want you  to know that it is imminent. A vote takes place with this grand jury  that I called to your attention, which would be the Members of  Congress. We need but only a majority of…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Americans are simply trying to survive, thanks to Republican  policies, while President Trump and his billionaire boys' club thrive  in the economy.\n\nIt is simple. People want to know why Members of Congress can't  simply exclude the President and the Vice President. Why do they keep  them in both of the bills as owners of crypto? Why did they avoid my…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…colleague,  Dan Kildee, worked closely with Representative Feenstra to introduce  this bipartisan bill, which is based on solid research and the  fundamental principle that if we want to know what is best for foster  youth and their families, we should ask them.\n\nThe result was this bill, which would require States to create a new  family partnership plan to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…about whether or not we protect our borders against fentanyl and also  whether or not we protect the American people.\n\nThe President has said this is liberation day. I want to know whom we  are liberating. Are we liberating the billionaires who benefit from  these tariffs that allow the tax cuts or are we really fighting for  middle-class people?", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…did not do for the least of these, you  did not do for me.\n\nMr. Speaker, I hear some of my friends on the other side of the  aisle, including Mr. Speaker who says if you want to know my political  philosophy read the Bible. I did. I did. I grew up reading it, and that  is the verse that has been sticking in my mind for the last 2 weeks,  particularly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…response, grid- enhancing technologies, and regional and interregional coordination  that can provide reliability at a lower price with less pollution.\n\nRepublicans also don't want us to know that, while this bill gives  FERC more responsibilities that it cannot meet and does not want, the  Trump administration has been busy gutting the agencies that are  already…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…If Donald Trump and his       anti-immigrant crusade are successful, more than 350,000       Haitian nationals will lose their legal status on February       3rd. I want everyone to know that this Congresswoman is       fighting tooth and nail to stop this from happening. Since       being elected to Congress, I've stood shoulder to shoulder       with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…person he ever met, without a redeeming bone in his body.\n\nI agree people can say different things, but Jeffrey Epstein, to me,  disgraced himself. In any event, people want to know what were the  contents of that conversation. Why was Ms. Plaskett doing that? I am  sure she has a good explanation. We are talking about a distinguished  lawyer and Federal…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is what he believes.\n\nI believe that we have to do what I am about to do, and I trust that  there will be others who will join in. However, if no one else does,  then I want you to know, Mr. Speaker, that while I am censured, I am  not silenced and that this is only the genesis of this process.\n\nThe revelations are yet to come, and in the revelations,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…is about fear,  scapegoating immigrants, and gaslighting the American people into  believing that Los Angeles is some so-called hellscape. If it is such a  hellscape, I want to know why Republican Members of Congress have been  flying into Los Angeles over the past few weeks attending fundraisers.  Nobody is showing up in a hazmat suit or combat gear.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Will the gentleman yield?\n\nMr. GREEN of Texas. Mr. Speaker, if I may, I want to let people know  this not just for the Honorable Chip Roy, but I have relationships with  people across all lines in this Congress. When he comes to the floor  and says that he wishes…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693109/tax-cuts-and-spending"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…family lives. They illegally evict  Palestinian families, Mr. Speaker, demolish homes, and deny  Palestinians basic human rights.\n\nWe honor those all around the world and want them to know that former  Congresswoman Cori Bush and I see them. We know the suffering. We know  that there are lasting harms of settler colonialism, as well as ethnic  cleansing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…service, to thank them for their commitment, to thank  them for what they do to keep us safe and to keep us free, and for the  sacrifices that they are making. And I also want them to know that the  people at home are thinking about them and know that they are a long  way from home and caring for all of us.\n\nTo me, they are heroes. They wear the uniform…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…solicitor in South  Carolina who is not doing her job, who is lying to South Carolinians,  and that is Solicitor Scarlett Wilson of the Ninth Judicial Circuit.\n\nScarlett, I want you to know that I am watching. When you leak  evidence, when you politicize rape, when you leak evidence of rape  victims, and when you leak evidence of victims who are being stalked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695274/warning-to-scarlett-wilson"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…this end of the building has said yes, and things are  getting stuck over on the other side. And rather than point fingers and  call names, I want to unstick things. I want to have us know that we  can move these bills that are important in our communities and in our  regions and they don't get taken hostage, if you will, by the other  body as they are…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…hostage taking.\n\nTo the families of these hostages, we grieve with you. We share in  your pain, and we share in your hope as well.\n\nTo the hostages still in captivity, we want them to know they are not  forgotten.\n\nThe world is watching, and we will not rest until justice is served  and you are safely returned home. God bless you all.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…agencies using language  that was based on legislation that I worked on in a bipartisan way with  the senior Senator from Michigan.\n\nWe should all look forward, but I want you to know that I look  forward to working further with my colleagues this year to support  police in a bipartisan way. We are very fortunate that this type of  legislation is mostly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…When I looked up, he was standing there in the aisle with an  outstretched hand. He leaned over, and he quietly said to me: Tom, I  know this is a hard day for you, and I want you to know that my prayers  are with you and Lori.\n\nYou see, that was the fourth anniversary of my dear wife Lori's  death, and how he knew that, remembered it, and offered such…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and $1.8 billion of Federal revenue, $800 million for the taxpayers of  Minnesota. Every single school district in the great State of Minnesota  benefits from mining.\n\nYou want to know why I am passionate? These are my constituents that  will be mining these critical minerals with the best labor standards  and the best environmental standards in the world.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talking about because we make crap up, once again, because everything  is about the money.\n\nThe last board and the one that always seems to upset people because  they don't want to know the truth, the Congressional Budget Office-- this one is a year out of date. The numbers are actually apparently  worse, but we haven't had the update yet. The Congressional…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…threatened water security. My amendment promotes recharge efforts on  Federal lands, giving States the tools to capture and store water  before it is lost.\n\nMr. Chair, I want you to know, in the 18 percent of land, we lead the  world in recharge. We lead the world in recharge, and when you can  recharge underground aquifers, Mr. Chair, you save lives and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…illegal aliens released under Biden forced her  under a bridge and forced her to take off her clothes before she was  savagely killed in Houston, Texas, my home State.\n\nDo you want to know what? Their lives mattered. Those individuals'  lives mattered. My colleagues on the other side of the aisle, whether  they are in this Chamber or in the other Chamber or…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…did, you know, we are, I guess, a bunch  of crooks.\n\nNow let's talk about me and enrichment. The Democratic majority  leader, Senator Schumer, signed off on this. I want the world to know-- and the world is paying no attention because it is blowing up right  now--that this provision was coordinated between Senators Thune and  Schumer because a lot of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in which  foreign companies, Chinese companies, have been enriched because my  colleagues on the other side of the aisle wanted to pursue their  radical agenda.\n\nDo you want to know why the price of energy is going up? It is  because of Democratic policies and mandates, EV mandates, and mandates  about solar panels and wind farms that are far less efficient…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…those deportations will continue, and there is  nothing you can do about it.\n\nNow, if you want to make a proposal to stop that, put it on the  floor. You will lose, but I want them to know and also my colleagues  that I am 100-percent committed to this. It is central to the idea of  being a sovereign country. No sane country in the history of the world…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are having real trouble selling the  debt on the long end of the curve. Do not pay attention to some of the  debt markets over the last month or two. Mr. Speaker, do you want to  know why? We are in extraordinary measures. We are up against the debt  ceiling. We are not issuing new debt. We are only issuing refinance and  what comes due within the cap.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}]