[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…lifeline and a life-changing experience for many of  our families and has anchors all across the country and communities. It  has helped our young children for decades.\n\nI do want to bring a story from my district. Alex, a public school  speech therapist in Dearborn Heights, said that several of her students  are directly impacted by threats to Head Start…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…a Member of this body.  There are 435 of us, and the petition process exists so that the other  434 of us have a little bit of power so that if there is an idea that  we want to bring to the Chamber, one person can't stop it.\n\nThe petition process is about us. It is about the Members, but people  are feeling all sorts of kingly these days in D.C. It…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689406/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…gaps, this  administration wants to turn back the clock and undo the progress that  we have made over decades of disability work. As my colleagues have  mentioned, they even want to bring back the cruel, outdated policy of  allowing employers to pay disabled workers less than minimum wage,  often pennies on the dollar. How  disgusting for someone who is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and defend Republican and Democratic Members of  Congress.\n\nNow we have got a law which says put the plaque up in honor of these  officers, and they can't do it, but they want to bring a totally  partisan resolution to the floor deploring violence thousands of miles  away, and you have got Members of Congress from California saying that  they are not…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…of the aisle often discuss  wanting to return to something we call regular order. We decry full- year continuing resolutions, or CRs, and government shutdowns. We say  we want to bring appropriations bills to the floor. This isn't a  pipedream, and I reject the idea that the appropriations process can't  work anymore. More often than not, we pass appropriations…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…leadership is operating here is that, again, we  don't debate serious proposals on the House floor. They don't want to  have votes. They don't want to have debates. They just want to bring  things to the floor under a closed process and tell people to take it  or leave it. Then they do this other thing of sneaking things in the  rules so we can't even have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…They want a  Congress that makes it easier to buy a home, raise a family, and build  a life. Instead, we get a bunch of absurd bills that nobody asked for.\n\nRepublicans want to bring up legislation addressing foreign influence  in our kids' classrooms. How about they start addressing foreign  influence in the Oval Office? How about Qatar gifting a new…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are the most important thing in the world, fine. They can bring them to  the floor. But let us offer amendments and respect us and, by the way,  other Republicans who want you to bring more important matters to the  floor. Whether it is votes on war and peace or votes on affordability  or votes on the tariffs, we ought to have those debates on the floor.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…PROTECT Our Kids Act? It does absolutely  nothing. My Republican colleagues are deflecting over and over again  against the real crimes against our children. Today, they want to bring  to this floor a bill that will do absolutely nothing to protect our  children.\n\nThe real way to protect kids is to keep them safe from unnecessary  gun violence. That…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…this. You  want to continue these policies. You don't think they are a problem. I  want to end them. Let's have a vote, a debate and a vote. You bring up  any amendment you want to bring up about making ICE better, defund it.  Whatever you want to bring up I will vote on, but you are denying me a  vote today on the root cause of the problem because you…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this legislation because they know the truth.\n\nThey know the truth that the American people know, which is that, as  much as my colleagues on the other side of the aisle want to bring up  the DMV, the American people know that the DMV is very good at giving  driver's licenses to illegal aliens because we know it to be true. We  know that there are people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…is as  important as this continuing resolution, to do it now? to do it  yesterday? to do it tomorrow?\n\nWe can't pass a continuing resolution because there are those who  want to bring other issues into the bill. Could those other issues not  be considered at a later time?\n\nIt seems to me that appropriating, passing appropriations bills,  keeping the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…purposes by my colleagues on the other side of the aisle. The  fact is that has left us with a current situation that is even worse.\n\nI will go through a few more. Then I want to bring my colleagues into  this conversation.\n\nHere behind me, after all of the eruption over what has occurred in  Minnesota, where there has been a lot of vitriol directed at…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…simple. If you came here illegally, then the only thing you are allowed  is a ticket out of here.\n\nLet's be honest about immigration. This is about the rule of law. I  want to bring in a lot of folks. I want to have an immigration system  that works and they actually sign up, they get online, and we find out  who these folks are. Just like they check…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…one and Alaska  Native patriotism in the other are going to be UC'd. I know my  Republican colleagues have already passed on these.\n\nSo the first piece of legislation I want to bring up is what we call  the Alaska's Right To Ivory Sales and Tradition. The acronym on that is  the ARTIST Act.\n\nNow, let me give you a little bit of background on this. For…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Hawaii to be able to speak on this same issue because he has also  worked very hard on rules and trying to be able to make this Senate  work.\n\nMr. LANKFORD. Mr. President, I want to bring a unanimous consent  request, but I would say I represent--every single Republican is in  agreement to this. Every single Republican was ready today to be able  to move…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…another.\n\nThere is a small group of people in this building who apparently feel  the number one problem we have is that State and local taxes are not  high enough, and they want to bring back a deduction for State and  local taxes. Right now, we have a low deduction in there, so they are  aiming things at not the poor or middle class. They are really aiming…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Paul has objected to that bill; is that  correct?\n\nMr. KENNEDY. To my bill to say Congress isn't paid during a shutdown;  is that correct?\n\nMr. KENNEDY. Mr. President, I want to bring up my second bill. It is  called the Withhold Member Pay During Shutdowns Act.\n\nRemember, my first bill that Senator Paul objected to would have said  Members of Congress…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]