[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…triage now. Let's do  something to help these people keep their health insurance. I have  spoken with my colleagues on both sides of the aisle and have made it  clear we want to help Americans pay for these bills. I want to join  them. It should be done on a bipartisan basis, and we should waste no  time.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and bent knee to  this administration or to any administration and maintain its  credibility when it comes to news.\n\nSo they have a terrible challenge that they face. I want to help them  find a solution. I think America would be poorer and less free, and  there would be less information available to people in our country if  we allowed this to go forward.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…speaking with a senator and representatives to share her       story.\n\n``A lot of it, I think, is just to put a face to the number       or the story,'' she said. ``Because we want to help increase       funding or continue it, especially at a time when a lot of       medical research is getting cut. . . I'm looking forward to       all of it. Sometimes it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…get money from other sources, there is no  reason not to accept it. For some reason, current law prevents us from  accepting even a donation from a nonprofit that would want to help us  with the issue.\n\nMr. Chair, I say let's get out of the way. H.R. 1948 passed out of  the House on suspension in June of this year, and I hope to see it  become law on…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…energy efficiency standards would be a gift to China.  People are already suffering, paying more because of tariffs on some  household appliances and supplies. If we really want to help consumers  save money, why don't we do something to get the tariff revenue back to  hardworking Americans?\n\nA lot of the big businesses now are saying to the Trump  administration…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…opposition to H.J. Res.  87, H.J. Res. 88, and H.J. Res. 89.\n\nMr. Speaker, I wish I was here to speak about different policies,  policies that the American people actually want to see to help them pay  their bills and to lower the cost of living that is choking millions of  American families.\n\nInstead, in this administration's first 100 days, I have seen…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…slowing down business.\n\nThese guys don't care. They don't care. They just go along to get  along. They don't want to tick Trump off.\n\nI guess my question is: If Republicans want to help small businesses,  why are they blocking a vote to overturn the tariffs? Why have they  refused to let Congress vote on the tariffs for months and months, even  though it…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…families. It is not  right.\n\nI heard Mr. Pallone say that he had a townhall. A lot of the  Democrats are having townhalls. I had a townhall back in the Tampa Bay  area. They want help with hurricane recovery. Do you know what they are  having to replace right now? Appliances. They want an appliance that is  the most modern, the most efficient, the most…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…to study. The  result of that was, international students from all around the world  who are the top of the line, doing outstanding work, this is the next  generation we want to help and have them come. Many of them come to the  United States from other places, and they like it here so much they  stay. They build their careers.\n\nIn fact, many of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…speech, and everybody  gets to express their opinion whether you agree with them or not.\n\nPBS does an exceptional job. Thank God for them. God bless them and  America.\n\nIf you want to help out, all you citizens out there, donate to PBS,  and don't put up with any of this nonsense.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692246/shame-on-republicans-for-cutting-funds-to-pbs"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…to  deal with their Social Security and eliminating employees from Social  Security. The majority is trying to kill Social Security. That is who  it is, and Republicans want to help the billionaires and hurt the folks  who live on Social Security.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689891/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…are on the brink of exporting this injustice nationwide on a much  greater scale. Senator Padilla is right to sound the alarm about this,  and I am proud to join him. We want to help our fellow citizens  participate in our elections because only their participation will  ensure that the government is truly accountable to the people it  represents. And…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…safety.\n\nThis isn't new, Mr. Speaker. That has been the Republican playbook  all Congress long: Help the polluters. Help the banks. Help Wall  Street, and help the CEOs. They want to help everyone except the  working people who actually need it.\n\nMr. Speaker, you may ask: Why?\n\nI would say: Follow the money. Look at the donations.\n\nOne of the things we need…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…their wannabe emperor and his court of jesters and lackeys in  the White House.\n\nThis budget resolution tells us exactly who the Republicans are  working for and who they want to help, and it is not the American  people.\n\nMr. Speaker, it is a betrayal, and I won't stand for it.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689898/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…a warming climate.\n\nMs. CASTOR of Florida. You started this by saying that Gulf of  America started as a joke. This is not a joke to the people I  represent. They want help. They want help with the cost of living.\n\nIt seems like that is the last priority on Republicans' list.  Instead, they want to give a massive tax giveaway to the wealthy and  the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…help. Guess what? I understand why  they need help. It is because we, the Federal Government, have messed  up their lives quite vociferously.\n\nMr. ROY. We distort, and so they want help. I get it. Yet, what do I  do? Do I vote for food stamps?\n\nI am a cancer survivor--you know that--and I have cancer groups  coming in and asking for money. I look at them,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…way to Catholic Social  Services and had that support. I hope, if you are struggling and you  feel that aloneness out there, that you know there are people out there  who want to help and that you won't feel alone. I know being alone in a  tough situation is the worst thing that you could possibly feel, but  there are people out there who want to help…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…provision called the SALT provision in which they want to  make tax deductible State and local taxes. They are already, to a  degree, tax deductible, but there are people who want to help the  wealthier people deduct their State and local income taxes as well.\n\nI have talked to both my State legislators, and last weekend I talked  to a county executive, and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…trillion we are not even touching.\n\nMy question for my colleagues is: Was even the House bill good  enough? Not really; it really wasn't. I held my nose and voted for it.  I want to help the President. I want to move the agenda forward. I want  tax cuts. I want the green new scam subsidies terminated. I want  Medicaid reform. However, we were leaving in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…healthcare,  which helps people most in need: persons in nursing homes, the  disabled, kids from low-income families, and pregnant women. That is an  essential program, and we want to help those people who truly are most  vulnerable.\n\nYet, the demagoguery on this issue has really gone over the top, and  it is really frustrating, as a person who actually understands…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that the plan here?\n\nThis says that 63 percent of those who are tax filers will see their  taxes go up. Is that the plan here?\n\nMr. SCHWEIKERT. Mr. Chairman, just because I want to help out-- because I know this is heresy around here. Truly one of my favorite  Members to work with, even though we are on different sides of the  aisle, he may want to retract…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…believe the American people owe them something,  and we don't owe anybody anything. They take advantage of our system.\n\nIf this is your attitude, we don't want you here. We want you to help  this country become better.\n\nThe Somali population in Minnesota, as we have been watching on the  news for the last few days, is an example of a group that thinks they…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…racism.''\n\nAdditionally, Republicans created a $50 billion rural hospital fund.  It is the single largest Federal investment in rural healthcare in  American history.\n\nDo you want to help patients with rare diseases find treatments? We  were able to do that. We passed a bill that I introduced called the  ORPHAN Cures Act. As a doctor in Wyoming, I saw the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…have been doing  that in recent days, talking with colleagues. But I can't see a way  forward if we can't change direction and, together, say to the people  we serve: We want to help with your healthcare. We want to stop the  cuts to NIH and CDC. We want to reduce the increases in health  insurance costs. We want to help you and your family.\n\nIn my home…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…on the Senate bill. Now, that means it will have to go back  over to the House, so it won't get signed by the President right away.  So I am ready to do that too.\n\nI just want to help the people I represent, and these are very  special people. If any of you or Senator Heinrich met some of these  Alaska Native Vietnam vets, you would cry when you hear…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…illnesses, intellectual  disabilities, and much more.\n\nUnder the Biden administration, the Air Force suggested using the  Exceptional Family Member Program for families who want to help their  child transition. Democrats also introduced a bill to expand this  program to include transgender dependence and specifically lists gender  dysphoria as a qualifying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…several hundred  employees from the Minnesota Department of Human Services who  administered this program, who just get up every day and go to work and  do their job and want to help people. This is what they posted on  social media. I am quoting now:\n\nGovernor Tim Walz is 100% responsible for massive fraud in       Minnesota.\n\nI am sure he wasn't the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…just cut one program, you will never get  through it. You have to cut everything all across the board, not  because you don't like the recipients, not because you don't want to  help people, but because you don't want to destroy our country.\n\nFor just six pennies on the dollar, we can reverse this dismal  trajectory. In just 5 years, we can restore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…more to build new houses. The same thing is true when my  colleagues suddenly throw billions of dollars at having subsidies on  only electric appliances. If they really want to help people have a  choice, which my colleagues on the other side of the aisle indicated  that that is what they are for, then we give a subsidy for everybody,  if that is what…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Our  solution for healthcare is empowering doctors. Our solution for  healthcare is empowering people. Our solution for healthcare is  spreading costs out among people who want to help each other out in the  American way.\n\nIt is why I started talking about Christmas.\n\nThe question for Republicans is: If not now, then when?\n\nWhen are we going to stand up…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}]