[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Big Beautiful Bill Act that they passed, and we could have  taxed the billionaires.\n\nThe gentleman was saying we are the tax party. I want to tax the  billionaires more. I want to make sure they are paying their fair  share. Hell, if a teacher, a nurse, someone who works at a grocery  store is paying their fair share, how come billionaires aren't?\n\nOn…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Well, I am going to give them 10  percent more.\n\nYet this is a country with which we share a trade agreement that this  President negotiated with Mexico and Canada. If you want to make  changes, like for dairy or other things, do it in the review of that  agreement. Don't do it like this to a neighbor and friend.\n\nSecondly, what do these tariffs mean to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…but all of my colleagues across the  aisle and 10 colleagues from this side of the aisle, they decided that  I should be censured. I hold no animus toward any of them.\n\nI want to make a point. The President of the United States and his  men and women are now going to perpetrate this coverup and walk away  unscathed except for loss of dignity, self-respect,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their costs skyrocket across the board. And, as Democrats, we want to  make sure that, yes, they are paid, but they also have the ability to  get their healthcare.\n\nI heard the majority leader just now say they are not going to  operate with a…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…Act, the  question is: Do we want some rules of the road or no rules of the road?  To vote against this bill and to vote against the CLARITY Act is  irresponsible if you want to make sure that the Trump coin has  oversight and that consumers are protected.\n\nMr. GOTTHEIMER. Mr. Speaker, to not pass this legislation is deeply  irresponsible. It will allow…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693833/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…of common allergens in medications. Information that could  save lives.\n\nAs Adina's Representative and as a doctor who has cared for patients  for more than 20 years, I want to make sure that no one is in danger of  a life-threatening allergy attack simply because they took their  medication. That is why I am introducing the ADINA Act to make this…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692132/recognizing-adina-togal"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…stressing the fact that  when it comes to energy prices, they are going through the roof. The  Republicans don't seem to care at all about dealing with the issue. All  they want to do is make it possible for more of our gas to go abroad.\n\nThe way this bill is tailored, there would be basically no review,  other than, I think, for 1,000 feet, or something,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, initially, I want to make a very brief  comment on the legislation my colleagues Senator Heinrich and Senator  Kaine are advancing and which will be voted on later this afternoon. I  am proud to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. I thank my colleague very much.\n\nI just want to make sure, from a parliamentary standpoint, would the  Senator from Oregon yield for my question?\n\nMr. WYDEN. Mr. President and colleagues, I want to start by  commending my…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…of Elon Musk when he said, You guys, meaning you guys  on Trump's tariff team, haven't built squat, though he was a little  more rude in his choice of words.\n\nThe point I want to make is that this is not new. The ignorant  tariffs that he is applying come from the fact that they simply don't  get it with manufacturing because none of them--think about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Mr. Speaker, I am grateful for the opportunity to share the story of  this beautiful little girl.\n\nMs. PELOSI. Will the gentlewoman yield?\n\nMs. PELOSI. Just briefly, I want to make this further point. Ms.  Schrier has been so eloquent, and all of us associate ourselves with  her remarks and the professional knowledge that she brings, the  intellectual…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…52,000 retired law enforcement firearms have been  resold to the public and have been found at crime scenes between 2006  and 2022. That is 52,000 resold guns. They now want to make the number  even more.\n\nWe have more guns than people in this country. We have a gun violence  problem in this country. The solution is not the Federal Government  putting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Mr. SMITH of Washington. Mr. Chair, I yield myself 2 minutes.\n\nMr. Chair, there are going to be five amendments now that are all  targeting the transgender community. I want to make sure we understand  a couple of really sort of broad themes and why these amendments are so  problematic.\n\nNumber one is the transgender community has been targeted and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…deal with  those issues. We could have done that had the majority accepted my bill  that would have closed the ghost gun loophole, but they chose not to.\n\nIf they really want to make this bill do what they are claiming, then  let's write a bill that does that. This bill doesn't do it. This puts  American communities at risk.\n\nMr. Speaker, I urge a ``no''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the vote.  All you have to do is go to the board of elections or BallotReady and  recognize that in 2024, in his last election, his opponent got 30  percent of the vote. I want to make sure that facts matter here, and  when there is misinformation, I wanted to clarify that.\n\nLet me go ahead and say at a moment when so many Members of Congress  have conceded…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…economically  in the future? Do we want to create a dystopian world and make everyday  Americans subservient to the Chinese Communist Party and their  affiliates, or do we want to make a decisive stand to stop some of the  most advanced technologies from being used against us in every facet of  our lives?\n\nLoopholes currently available in U.S. export control…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I want to make it very clear to my  constituents in Kentucky what my objectives are over the next 22 months  of the 119th Congress.\n\nFirst of all, President Trump received an overwhelming…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…individuals will have no problem registering  under this bill. You can bring forward your identification. You can  sign an attestation if you don't have the documentation.\n\nWe want to make sure that it is easy to vote and hard to cheat. We  could look at our committee hearing that we had just this week where we  brought in the secretary of state of Wyoming,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…stop there, Mr. Speaker. Opposing this bill also means  protecting waste over purpose, fraud over fairness, and foreign  interests over American strength.\n\nMr. Speaker, I want to make sure voters in my district know what  passing the One Big Beautiful Bill Act will mean for them. It means  they get to keep more of their hard-earned money. It means that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…voted against the fraud provisions. They voted  against these protections that we had against the fraud. And now  Democrats, with what they want to do for the next 3 years, want to make  the fraud dramatically worse.\n\nThis needs to end. The American people deserve the care they need  from a doctor that they choose at a price they can afford. ObamaCare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…estimates that 2\\1/2\\ million of the 10 million  are not actually eligible for the program to begin with. That is a  quarter of that 10 million aren't even eligible.\n\nIf we want to make sure that our safety net programs work and are  stable, we have to ensure the benefits are actually going to people  whom Congress has made eligible for these programs in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…It should not come as a surprise that in a country founded on a tax  revolt, one person  is not allowed to raise taxes. Our Founding Fathers saw this and said:  No, we want to make sure that the authority of taxation begins not only  in Congress, that it actually originates in the House, the body closest  to the people.\n\nOur Constitution forbids taxes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…three times to no avail, which is, again, unfortunate.\n\nWhile the Postal Service operates, by the way, on a fee-for-service  basis and receives no direct appropriations--I want to make sure that  everybody understands that--my team, my staff, has talked to the  Congressional Budget Office to make sure that there is no score with  this. The news is, as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "John Rose", "party": "Republican", "sentence": "…no law can change a lawmaker's compensation until a new Congress  is sworn in.\n\nIf the House legislation we are debating today does not receive a  vote in the Senate, I want to make it clear that I am taking action.\n\nToday, I have introduced H. Res. 892, a House resolution that  empowers Speaker Johnson to bring this issue before the courts and  challenge…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…people.\n\nThis is an effort by the Democrats--this debate--to kneecap  immigration enforcement, to kneecap ICE. They lost the issue on the  front end of the election. Now they want to make it so hard for ICE to  do their jobs that deportations come to a halt. That is the truth, and  anybody in this town who tells you otherwise is just spinning.\n\nThey don't…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…puts these commonsense ideas into place to make  our elections more secure and fair. I invite my colleagues to support  my UC and pass the SAVE America Act. Why wouldn't we want to make  certain that elections in the United States of America are free and  fair?\n\nPresident Trump and the American people are all on board with the  SAVE America Act. The House…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…written in a very  specific way to comply with this Byrd rule. The underlying bill is an  effort to fix one of those instances, and I am supportive of this  policy change. I want to make that clear.\n\nAnother provision that was, unfortunately, not included in the final  bill as a result of the Byrd rule was an exemption for qualified  religious institutions…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is interest  because we have been refinancing a lot of our debt that was sold a few  years ago when interest rates were very, very low, and healthcare  costs.\n\nA point I want to make--and I am going to come back to this a couple  of times here--a couple hours ago, we had the Joint Economic Committee  over in the Senate. It is one of my blessings. I get…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thank the chairwoman for yielding.\n\nSo here we are. Democrats couldn't seem to find a single thing to say  about Epstein when President Biden was in office, but now they want to  make this the centerpiece of their entire conversation.\n\nThe fact of the matter is right now they know it is true, and right  now what they don't want to do is have the American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…border. They talk about almost  10 million people coming here, not just illegally, but we don't even  know who the heck they are. They could be all kinds of vicious. We want  to make sure that we let people into this country who are the right  people who assist and contribute to society as opposed to taking from  it, let alone commit violent actions…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}]