[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to address rising costs for  American consumers, Republicans used this week to negotiate their  Reckless Budget Scheme and rename a body of water. My constituents do  not want Congress to give trillions of dollars of tax cuts to  billionaires. They do not want cuts to SNAP or Medicaid, vital  lifelines in my home state of Minnesota. It's time Congress…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…people like Russell Vought a free pass to trash  the good work that takes place in this Chamber.\n\nAnd now, of course, there are reports that Donald Trump and Russell  Vought want Congress to agree on another rescissions package in the  near future.\n\nThen, there is Donald Trump's ``Big Ugly Betrayal''--a purely party- line vote, a partisan giveaway to billionaires…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…maybe you should be more  afraid of your constituents. Maybe you ought to listen to your  constituents because they are sick and tired of this BS. They have had  it. They want Congress to be a body that fights for them, that fights  to improve the quality of life for average people. They want this body  to be a place where we debate important issues passionately,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…weapons over to the  public. We must not make Axon, a multibillion-dollar company, even  richer. I am someone who has witnessed both police violence and gun  violence, and I want Congress to consider real reform like the George  Floyd Justice in Policing Act.\n\nThis bill was rushed to the floor. We tried to make changes, but our  edits were rejected.\n\nMr.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…subscribe to that view because true career civil servants  work hard to ensure that programs are executed according to the law,  but if my friends on the other side of the aisle want Congress to make  more granular decisions about spending, then that is exactly what is  happening through the community projects funding process, which we have  established.\n\nThis…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…agree on and prevent a serious shutdown. Secondly, split  off the DHS bill so we can negotiate reforms to rein in ICE and the  CBP. It is what the vast majority of Americans want Congress to do.\n\nIt is good news that we have a deal to fund these key programs that  families count on while work continues on serious DHS accountability  over the next 2 weeks.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…causes the Speaker to bring ridiculous  legislation to the floor to flatter the President and appease his base  rather than meet the needs of the American people.\n\nAmericans want a Congress and a White House that solves problems  rather than creates them. Americans aren't asking to rename the Gulf of  Mexico. In fact, public polling, including on FOX, says…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…It is not to make housing more affordable. It is  showerheads. We are out here talking about showerheads.\n\nNot a single person in upstate New York has ever told me they want  Congress focused on showerheads. The owner of the tattoo shop in Ithaca  told me she will go uninsured this year because she can't afford the  premiums.\n\nThere is a grandma in Endicott…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…things like  defending against challenges relating to their illegal cancelations of  projects across the country.\n\nTo bring this bill at a time when people really want to see the  Congress work to solve problems, I think, demonstrates that Members are  out of touch. It is part of a very disturbing Republican trend, led by  the President, to purge the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…know it would fail, even in a Republican  Senate. And second, they are afraid to vote on that resolution because  they know their constituents are tired of wars and don't want Congress  declaring more wars and treating serious law enforcement problems as  challenges for the U.S. military.\n\nI strongly support the resolution my colleague has filed.\n\nWhen…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…colleagues agree that we need to  restore the enhanced premium tax credits so people like Darla and her  family can afford healthcare coverage. They know that Americans want  Congress to act to bring down costs. And what Leader Schumer asked for  today is straightforward: that the Senate allow an immediate extension  of the enhanced premium tax credits…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the rule which is more than 100 times the  number of comments on the capital rule.\n\nConsumers are just fed up with these types of junk fees, and the last  thing they want is for Congress to raise them.\n\nMr. Speaker, I urge all Members to join Senate bipartisan opposition  to this resolution and vote ``no.'' Stand up for our constituents.  Stand up for…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…``no'' so that people know where they stand.\n\nMeanwhile, while families are bracing for gas prices to go up and  dealing with food prices that never came down, these guys want Congress  to ignore all of that and rubberstamp their big, ugly tax scam, a scam  that hands tax breaks to billionaires while ripping food off kids'  tables and healthcare out of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…Trump's message resonated with the American people,  and they elected him in historic numbers. They delivered Republican  majorities in the House and the Senate because they want Congress to  deliver on the promises we made.\n\nToday, it is time for us to act so that we can get on with the real  work in our committees. In passing this budget framework, we…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…does is it produces incredibly needed savings, Mr.  Speaker, savings that the American taxpayers want, as well. They want  their tax dollars being spent better. They want to see this Congress  find a way to get back to balanced Federal budgets.\n\nWhy don't we all work together to do that? We are here working  together to do that. Unfortunately, the other…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…deficit. They  ensure that government funding works efficiently to deliver services  that make life better for Americans.\n\nThe American people are watching us. They want to see Congress do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse. Through bipartisan, bicameral  negotiations, led…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…away with hiring child labor or wage  theft. They want to block financial managers from even considering  environmental risks like flooding and wildfires.\n\nYes, Americans want Congress to do something. The problem is that  Republicans control the House and the bills we consider in the Rules  Committee and vote on.\n\nHowever, Democrats can force votes,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]