[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…Hegseth took the helm, the Department of Defense has  been fraught with national security risks and constant drama. I urge  him to stop spending his time renaming ships because he wants to  pretend that we don't exist. He should do his damn job.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…here and get our  approval.\n\nThe people we represent did not send us here to be potted plants  while the White House sleepwalks us into another mess. If this  administration wants to escalate, make the case to the American people.  Get consent through their elected Representatives. Follow the  Constitution.\n\nLet me tell you what I think. I think this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…other bank agencies, making it  harder for them to carefully review these mergers.\n\nWhat Elon Musk was doing is consistent with what he has been doing  and I guess what Trump wants him to do. They want less services. They  want to make sure that they are supporting the biggest banks with these  mergers, the biggest banks that are going to close down the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…a money and politics system that is  corrupting the vision of government by and for the people and is  replacing it with government by and for the powerful. Who in America  wants a governmental system, designed and intended to be a reflection  of ordinary citizens' desires and aspirations and opinions, to simply  be a country run by oligarchs, by billionaires?…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…pollution from the transportation sector, but they are in luck. They  control the House, they control the Senate, and President Trump is in  the White House.\n\nIf the majority wants to directly attack States' rights and prevent  California from developing more ambitious public health protections,  they can propose an amendment to the Clean Air Act to change…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…rise today in defiance of  President Trump's threats to deploy the National Guard to Chicago.\n\nHe wasted $1 million every day to house the National Guard in D.C.,  and now he wants to further misuse taxpayer dollars instead of  investing in real, permanent solutions to gun violence. Like D.C., I am  sure Chicago can use money for more police, mental health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694900/national-guard-deployment"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…because the  Congressional Review Act only applied to rules, and this was not one.\n\nThe problem was that the fossil fuel industry, more or less, runs  this place right now, and it wants to sell more gasoline. So  California's Clean Air rules to make cars either be more efficient and  get more miles per gallon or become hybrid and be able to run back and  forth…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Education, is  billionaire Linda McMahon. As Trump's Secretary of Education, she will  dismantle the Department of Education from the inside out.\n\nPresident Trump told her that he wants her to ``put herself out of a  job'' by eliminating this Department. Since President Trump only  nominates people who are 100 percent loyal to him, we can expect Linda  McMahon…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…for students       to pursue careers in fields such as engineering or       agriculture. That is fantastic.\n\nBut the same party that claims to be the party of families       wants to shut down a grant that would help some of those       families with       child care. The irony is staggering. This is all while       also creating a renewable, energy-powered…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is on top of things. He says: ``Close your  eyes and vote for it.'' I would just add to that: Close your eyes,  cover your ears, and hide your calculators. That is what Trump wants  you to do.\n\nPass this quickly and move on so he doesn't get blamed for how much  it is going to screw people.\n\nMy answer to that is: We are going to fight back. If you support…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…break to CEO  billionaires, despite the fact that reckless tariffs are decimating our  small businesses to the tune of $38 billion a year, somehow, OMB  Director Russell Vought wants to fund the Department of Defense at more  than $1 trillion. Pete Hegseth declared it would be the Defense  Department's first trillion-dollar budget.\n\nThey are so proud. More…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…financial regulators to be reviewed and approved by the White  House budget office. This means this bill would hand over to the  President the ability to write the rules he wants to advance his crypto  operations.\n\nNot only that, under the Trump administration, the SEC has said that  memecoins, stablecoins, and bitcoin mining all do not fall under their…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…should commit ourselves  to take advantage of this window of opportunity. I hope that the peace  plan that is on the table will provide a path, as it should, to  everyone who wants an end to the suffering and bloodshed and the  humanitarian crisis that continues, a peace that guarantees the  security of the Israeli people, an end to the humanitarian crisis…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…support their own children. It is dangerous, and  it is wrong. These decisions belong to parents, their children, and  their healthcare providers, not politicians.\n\nEvery parent wants what is best for their children. As a parent, I  cannot imagine how I would feel if a doctor told me that Republicans in  Congress banned lifesaving, evidence-based care that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…rates didn't  go up. Why? Many people on Medicaid are already working.\n\nWho is better at paperwork? Is it someone on disability who Medicaid  was intended for or someone who wants to defraud the system?\n\nMost of the waste, fraud, and abuse in Medicaid is actually from  providers and not from the folks who need it. No, the real fraud is  this paperwork…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…wouldn't we be excited that a woman  looked at that ultrasound and said: You know what? I have decided I  want to have that baby.\n\nThat is not a choice everyone in this body wants that woman to make.  They want them to make a different choice for some reason.\n\nMr. Speaker, I am here today to support the pregnancy centers across  America, including Life…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699216/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…understand that borrowing is a tax. It is a tax paid for in the  future with your retirement, my kids, but it is a tax paid with  interest.\n\nWe have a society who so desperately wants free stuff. They want  money. The 100 times I have come behind this microphone and show the  charts saying, I want every dime of my Social Security. Of course. Of  course.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…short end of the stick. Worse, the American  people are going to end up on the short end of the stick because it  absolutely increases deficits. No one can deny it.\n\nAnyone who wants to get in a room and come debate me with a  whiteboard, show me the math. At some point, if you are in Congress,  pass a math test because the Senate bill doesn't add up. It…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…happens when no one will hear a word you  are saying because it requires doing hard stuff and pisses off some  lobbyists or some group or some group that is in our office that wants  us to regulate their competition's business or give them something?\n\nWe used to be the party of fiscal sanity. I still think we are. We  can get there. We can do it. Maybe…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…reserve the balance of my  time.\n\nMs. MACE. Mr. Chair, it is ironic that my colleague says that women  are harassed going into the bathroom. Well, that might be because  nobody wants a transgender, tranny, person in the bathroom with them.  No one wants biological men in women's spaces. And because this wacko  ideology, not based in science, is now pervasive,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…come here and start talking about all  kinds of things I didn't intend to. You heard my opening statement. You  heard the gentleman's opening statement. However, the other side wants  to go start attacking things.\n\nOkay, fine. We are just setting the record straight. Mr. Speaker, I  reserve the balance of my time.\n\nMr. Speaker, again, I would emphasize…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…correct course sometime today, if we don't  come to some sort of an agreement that recognizes that Donald Trump won  the election and has the right to have the government that he wants and  that we have a prerogative to make sure that it is not just confirmed  but that if there are some bad apples along the way, that they get held  up for greater scrutiny.…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…communities and elections, and  bringing down the cost of living despite Democrats fighting us on every  turn.\n\nMr. SCOTT of Florida. If my colleague from western Massachusetts  wants to defend democracy and protect elections, I offer him an  alternative that I, and a majority of Americans, would support. There  should be some commonsense, national standards…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…working man cannot even enjoy his daily life. That is  what they have missed.\n\nWe want to talk about how grand their philosophy is. When we look at  the mayor of New York City, he wants to have government-owned grocery  stores. People will be able to choose about 400 or 500 items instead of  the 30,000 or 40,000 items they could choose today, all in  consideration…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…stated a number of times that he served his  country very well.\n\nBut here is the deal: The President of the United States is entitled  to the Chairman of the Joint Chiefs that he wants. You look at history,  senior military commanders on the Democrat's side, on the Republican's  side--if the President doesn't feel comfortable with them, he has the  right…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…doesn't apply to you?\n\nI yield to the gentleman from Mississippi (Mr. Kelly) for a response.\n\nMr. GRIFFITH. Also, if it doesn't take your job?\n\nMr. Speaker, I recognize none of us wants the world polluted. The  gentlewoman indicated that somehow this was going to affect arsenic and  lead. I suppose, in a theoretical world, perhaps it could, but there  are…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…State. People coming up from States that have  banned all ivory say: I can't take that home. I can't buy it. Sorry.\n\nSo this is a simple, simple bill. You know, if a visitor wants to  come buy some ivory earrings in Alaska by one of our great Alaska  Native artists and then bring them home to a State that has a ban on  ivory, which is not sensible--again,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…supply chains of clothes and other  products they use every day.\n\nParents may think the Chinese Communist Party isn't interested in  what their kids are learning, but the CCP wants to influence every  American.\n\nThese bills will empower parents, protect students from Chinese  propaganda, and shine a light on how China tries to influence our  education…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…healthcare the  insurance company gives her permission to have. Put differently, giving  her the money gives power to the patient. That is where we should be.\n\nWhat Democrat wants to give 100 percent of the money to the insurance  companies for them to take 20 percent for profit and overhead? What  Republican does not want to give power to the patient…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…piece of legislation, Mr. Speaker, should it pass the  House, goes over to the Senate. Should it pass the Senate, it requires  the signature of the very President who they say wants to block it.\n\nI submit to you, Mr. Speaker, and to the American people, it would  only be logical to go with the one that can get voted on in the House  and have action going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}]