[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…Honor.\n\nAre we living up to that when we are saying we are going to take away  healthcare from millions of Americans in order to have greater tax  cuts?\n\nYou see, people want to just say, ``Oh, it is a government program,''  as if that is a slur, when, really, it is something that we the people,  in order to create a more perfect Union, created as a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman from Rhode  Island for his remarks.\n\nMs. KAMLAGER-DOVE. Mr. Speaker, I am so grateful to be a member of  the Congressional Black Caucus, and I want to just share some of my own  stories coming from my district and also my experience.\n\nI was in that Judiciary Committee where we had the hearing on  immigration, and I was in that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…friends       across the aisle roll their eyes. They scoff at the idea of       what is environmental injustice. It is not a thing. We don't       need to talk about it. So I want to just add a little context       to it.\n\nEnvironmental justice initiatives are lifelines for       communities that are at a higher risk of adverse health       impacts from exposure…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…slogan. It is a  principle of who we are in this country. It is those values that hold  this country together.\n\nThis bill is pushing corporations to create a loophole. I want to  take just a moment, ``voluntary for good causes'' is something we all  do in America, and we have the ability to do it now. This bill would  create more gray areas and, for those…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…I go back almost 20 years with Doug because we were in the State  legislature together. A lot has been said about his sense of humor,  which is also very, very true. I want to just share something that I  always think of with Doug because it speaks to the type of humor which  is really, I think, something that tells you about the man. There are  plenty…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…hikes are on top of the $29 billion in  electricity bill rate hikes that utility companies have requested since  the start of President Trump's term.\n\nMr. Speaker, I don't want to just talk about prices because the  bottom line is we are also talking with this bill about a cost to  Americans' health and safety.\n\nThis bill allows FERC to override regulations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…high  percentage of Medicaid-dependent patients.\n\nWe are already seeing cuts in hundreds of employees in the Seattle  area because of these impending cuts to Medicaid. I want to just be  crystal clear; this is absolutely true. We are hearing this across the  board that when Medicaid gets cut, we all lose.\n\nWe lose our local labor and delivery service.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…behind him, signed a new resolution saying that we are not going to try  to increase fuel economy standards in our Nation. Do you know what the  consequence of that is? They want to just put a big gas station up in  the Arctic Refuge, and we will just start drilling for more oil because  we don't want to make our vehicles more efficient. We are going to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…constituents? Do you want to decrease energy costs? Do you want  to give constituents the ability to have energy that is less costly and  that is also cleaner or do you want to just do what Donald Trump says  and embrace a sham energy emergency to give an easy pass lane to oil  and gas to bypass environmental regulations?\n\nThis timing today is bad and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, I want to just say that Republicans  have endured a rather lopsided relationship with Donald Trump this  year--dare I say, abusive. I hope you will consider this a Republican  intervention.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…those living in nursing homes, that is around one  in seven Georgia seniors. And they are united in opposition to cuts to  Medicaid. I hear their stories all the time. I want to just share a  couple of them with you.\n\nBristeria was excited to learn that she would be expecting her first  child, but her initial excitement quickly gave way to fear and anxiety…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…of our country.\n\nSo we are putting these young people at a serious disadvantage  compared to their classmates. So now my colleagues on the other side of  the aisle, they want to just take that tool away. They want to rip the  hotspots out of students' hands. Why? Let's just listen to a few of  their arguments.\n\nFirst, the Congressional Review Act supporters…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…forward.\n\nI am thinking about, as I wrap up this speech--I am thinking about  all of my colleagues who are here to speak with such intention about  what is happening. I want to just take a pause to acknowledge my  beloved Minnesota.\n\nI am so proud to be your Senator, and, you know, so many people  around the country are looking to you--to us--for hope,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…city. And when the back-and-forth happened with  former Secretary Esper, President Trump asked him point blank: ``Can't  you just shoot them in the legs or something?''\n\nI want to just flag for everybody that we are seeing a repeat of that  story but in exponentially more gruesome detail play out right now. The  President is looking for an excuse to send…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…President Putin said to President Trump: Oh, yes.  There is one other thing, too, before I will agree to a cease-fire in  the Black Sea or to a cease-fire generally.\n\n``I don't want to just negotiate with you, President Trump,''  President Putin said.\n\nHe said: I want China to be part of the negotiations and India and  Brazil and South Africa--and get this;…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, our colleague Doug LaMalfa passed  away on Monday, and I want to take just a minute--he would have liked  that--to honor him the best way that I know how: plainly.\n\nDoug believed that we should speak clearly, not in jargon. He had a  whiteboard…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698710/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Madam President, I am very hopeful that my colleagues  here will move forward on this bipartisan, clean continuing resolution  so we can get our government open again.\n\nI do want to just explain to the American people and maybe some of  our friends in the media a little dirty secret that is going on down  here on the Senate floor. A lot of my Democratic…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…it, number one, by locking in rates for  everybody. Nobody's taxes go up, Mr. Speaker, nobody's. Now, the other  side is upset about that, and I understand it. They don't want just the  billionaires' taxes to go up because they know in this bill the income  groups that get hit the hardest. If a ``no'' vote prevails--and we have  heard them, they are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, I could almost hear the joy from my  staff saying: Hey, it is only 30 minutes this time, not an hour.\n\nMr. Speaker, I want to do just a handful of things. One of these days  we are going to have not enough noise about the facts, the numbers, the  data, the debt, those things that we can come in and sort…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, I want to make a comment on the lands  bill, my frustration of where things have gone today on things.\n\nI do want to just pause for a moment and recognize that two staff  members of the Israeli Embassy were murdered last night here in  Washington, DC, simply because they were Jewish.\n\nThe murderer…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Republican or Democrat? It is just technology. Yet you have  protesters out there saying we can't allow the databases to talk to  each other. Have we lost our minds?\n\nI want to do this just as an example because this one just burns me.  Between Christmas and New Year's, I went up and spent 3 or 4 days up in  the Navajo Nation. I took my little 9-year-old…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…insulting to the American people.\n\nThat is a program that is riddled--riddled--with fraud. That is what  they want, these COVID bonus programs put forth by Joe Biden. They want  to just--3 more years, more direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are these programs? Well, let's just take a look at the  headlines.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}]