[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I want to thank Senator Warner for his  tremendous leadership on this important issue that is just really  tormenting so many Americans right now--as well as Senator Wyden.\n\nThis involves…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…I do thank the families who are represented in the gallery today for  their steadfast support. This is an important step to honor the memory  of their loved ones.\n\nI want to thank Senator Cruz for his bipartisanship in reaching this  agreement. He and I worked together on legislation we had originally  introduced called the Safe Operations of Shared…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I want to thank Senator Kaine for his  leadership on this issue, highlighting it, meeting on it, bringing it  to the attention of the American public. The same thing is true for  Senator Wyden…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…put some limits on things. The problem with the  way it is now is that it opens it up, and it is impossible to even  trace what money is coming in and from where.\n\nI want to thank Senator Kelly for bringing us to the floor today to  discuss such an important issue for our democracy and thank my  colleagues who are here today.\n\nIn the 2024 Federal election,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…economy--could affect the  livelihood of workers, supply chain manufacturers, and hard-won markets  that American exporters have wanted to see continue to be open.\n\nI want to thank Senator Grassley for his leadership over many years  for American farmers, for the people of Iowa, and for our country. I  want to thank him for working with me on the introduction…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, I want to thank Senator Mark Kelly for  bringing people to the floor to talk about that which is,  unequivocally, the greatest threat to American democracy right now. It  is the cancer that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Let's do it together and make certain that folks do have healthcare,  just don't have the anxiety and uncertainty and the bills that are just  going to cripple them. I want to thank the Senator from Illinois. I  want to thank my colleagues in the Senate.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…meaning, just like anyone else; and that our country stands with it.\n\nSo I thank my colleagues on both sides of the aisle for allowing this  resolution to pass, and I want to thank Senator Scott of Florida for  his partnership in the effort to counter anti-Semitism and hate  everywhere.\n\nRes. 246 submitted earlier today.\n\nMs. ROSEN. Thank you, Madam President.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…military  escapades without congressional authorization, no more tens of billions  to prop up foreign regimes while American families struggle right here  at home.\n\nI want to thank Senator Kaine, I want to thank Senator Schiff, and I  want to thank Senator Paul for joining with me in this very necessary  resolution. Of course, I thank our great ranking…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…no President has pushed the boundaries more  than President Trump.\n\nAmericans need Kaine here to do just what he is doing.\n\nThank you, Senator Kaine.\n\nI also want to thank Senator Paul and Senator Schiff for championing  this resolution today because the Senate will vote to discharge a  resolution that says two--two--simple things.\n\nFirst, it affirms…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…staff  throughout this process, and we are continuing to work.\n\nI also want to thank House Chairman   Tom Cole and Ranking Member  Rosa DeLauro and all their staffs.\n\nI want to thank Senator Kennedy, who is my counterpart on the Energy  and Water Subcommittee; Senator Moran and Senator Van Hollen, our  leaders on the CJS Subcommittee; and Senator Murkowski…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…None of that exists today. Because of the work of this legislation,  we actually have a regulatory framework that can protect consumers in  the future.\n\nI just want to thank Senator Scott and Senator Hagerty for their  extremely honest and thoughtful approach in working on bipartisan  legislation, which I am very proud of the effort we have made.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, I want to thank the Senator from New  Mexico for coming out here and making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their costs…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Mr. BENNET. Mr. President, I want to thank the Senator from Maryland  for his wise words. I was glad to be here for the end of his remarks  because he is right about this moment that we are facing.\n\nDonald Trump has painted…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, first, I want to thank Senator Kaine for  his great leadership on this issue, Senator Schiff, and Senator Paul  for working with me on this resolution.\n\nIf there was ever a moment for the Senate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. I want to thank Senator Durbin for his leadership in  this area the two or three times we have attempted to do this. One  time, I think we were successful, but it is still not law.\n\nI would…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "Ms. LUMMIS. Mr. President, I want to thank Senator Johnson for his  dedication to trying to pay the Federal workers who are being used in  what is a political battle--I want to excuse them from a partisan  political…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…we are  doing today. Instead of the world absolutely leading us, we are doing  what the world wants us to do. We are stepping up. We are leading the  world.\n\nAgain, I want to thank Senator Tuberville in every way. And to my  Democratic colleagues that I respect more than you know in all ways-- and I think that is how we all should be--please, let's stop…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…profession by recognizing accounting as a STEM education  subject and adding accounting education programs as an allowable use of  K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies large and small, assist in measuring…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…United States. For  years, I have worked with my colleagues to grow our hydropower  portfolio in creating new jobs, lowering prices, and strengthening our  grid.\n\nI want to thank Senator Fetterman for joining me as my colead to push  this bill across the finish line.\n\nOur bipartisan bill, S. 1020, simply allows the Federal Energy  Regulatory Commission…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, I want to thank the Senator from Virginia  for leading this effort. There is likely no issue more important that  confronts us as a nation, as a people, as a Congress, than whether or  not to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…families, and the servicemembers defending our Nation, which was  evident with the passage of the measure in the Appropriations Committee  by a vote of 26 to 3.\n\nI want to again thank Senator Ossoff as well as Chair Collins and  Vice Chair Murray for their hard work and collaboration. And also a  special thanks to our staff who worked so, so very hard…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "Mr. HAWLEY. Mr. President, I want to thank Senator Durbin for his  incredible leadership on this issue. It is truly a privilege to partner  with him on this effort.\n\nAnd I just want to say that the premise of this bill…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I want to thank my colleague Senator  Blumenthal and the Presiding Officer for his great service. We do know  the Marine Corps is part of the Department of the Navy, so we are all  related here.…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…profession by recognizing accounting as a STEM education  subject and adding accounting education programs as an allowable use of  K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies large and small, assist in measuring…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…good Senate  cooperation on these issues.\n\nSo that is an important issue for Alaskan Native heritage, culture,  artists, and now it has passed the Senate. So, again, I want to thank  Senator Padilla.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…appreciate the interest of my colleagues who want to ensure  these changes support their constituents, and I look forward to  continuing work to secure that result.\n\nI also want to thank Senator Alsobrooks for engaging in a very  constructive way regarding the bill, and I look forward to continuing  to work with her to try and figure out how we can go forward…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…2815, Cape Fox Land Entitlement Finalization Act of 2025 and H.R.  972, Sloan Canyon Conservation and Lateral Pipeline Act.\n\nMs. MURKOWSKI. Mr. President, I want to thank not only the Senator  from California but my colleague Senator Cortez Masto from Nevada as we  have worked through this.\n\nKnow that the Senator from California does have my commitment…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…safer.\n\nBut I know the Senator from Alaska has a few words to say, and I know  the Senator from Texas will as well.\n\nI yield to the Senator from Alaska.\n\nMr. JOHNSON. I want to thank the Senator from Alaska. He has been so  dedicated. He has been so tenacious in making sure that the finest  among us, the men and women of our military, get paid and then, you…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…here on the floor today to ask  unanimous consent to pass a very important resolution that I try to  move forward every year. It is my Choose Respect Day resolution.\n\nI want to thank Senator Schiff, my lead cosponsor on the other side  of the aisle. And it is to kick off also Domestic Violence Awareness  Month.\n\nAs a former AG like myself, this is really…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}]