[{"senator": "George Latimer", "party": "Democrat", "sentence": "…back, the message was clear: This administration would  rather silence dissent than defend liberty.\n\nI hear defense of the Second Amendment, the right to bear arms, but I  want to make sure that we defend all amendments, including the Fifth  Amendment for due process, and the 10th Amendment, rights that are  reserved for the States and the people from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…adults. We also lead the Nation in maternal  mortality and infant mortality, two statistics the Republicans in our  State should be embarrassed of.\n\nNow, Trump and Republicans want to make it worse. It is cruel, it is  reckless, and it is dead wrong.\n\nThis isn't about balancing a budget; it is about priorities. Donald  Trump's priorities are tax breaks for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you are threatening one judge, you are  threatening them all. Let's not kid ourselves. He is doing it.\n\nI am going to share this with you. I know who this President is. I  want to make sure that you understand that I am going to a different  topic in sharing with you who he is. I want to tell you who he is  because, in telling you who he is, I will be…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, initially, I want to make a very brief  comment on the legislation my colleagues Senator Heinrich and Senator  Kaine are advancing and which will be voted on later this afternoon. I  am proud to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…do, do it.\n\nIf you want to stand to bring down prices, if you want the average,  everyday American to be able to raise their children and live the  American Dream, if you want to make sure that families can afford to  pay their rent, can afford to buy food, can afford to have healthcare,  then you vote ``yes'' for this resolution.\n\nThe jury is really…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…natural resources across the globe for their economic and military  advantage.\n\nWhy would Republicans in Congress be party to that?\n\nThrough this bill, House Republicans want to make it easier for China  to import U.S. energy to power their industrial and military sectors.\n\nRepublicans have also enacted policies that wave a white flag to  China on cleaner…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…preterm or low-weight  birth.\n\nPollution has impacts, and we are just beginning to learn about the  impacts of PFAS in our water.\n\nThe Trump administration said that they want to make America healthy  again, a wonderful goal and a good idea, but this bill does exactly the  opposite. Please, let's kill the bill and kill the amendment. It is  dangerous…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Well, I am going to give them 10  percent more.\n\nYet this is a country with which we share a trade agreement that this  President negotiated with Mexico and Canada. If you want to make  changes, like for dairy or other things, do it in the review of that  agreement. Don't do it like this to a neighbor and friend.\n\nSecondly, what do these tariffs mean to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…comments  coming out of the Department of Homeland Security just yesterday leave  no doubts. A Department of Homeland Security spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal aliens who claim to be recipients of DACA are not       automatically protected from deportations.\n\nShe went on…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…nothing more than a  political stunt by a desperate, failed candidate for Governor trying to  pander to the people back in South Carolina. It is nothing more than  that.\n\nYou want to make the statement about who has brought disgrace to the  House. The actions of this House Republican majority have brought  disgrace to the House of Representatives from day…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…and due process. I can't speak  to those specific ones, but I can speak to what is going on in my  district right now. The reason we want more transparency is because I  want to make sure that the President of the United States knows what is  going on. He promised to go after criminals, those visa overstays,  those individuals with orders of deportation,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…is  remaining.\n\nMr. CLYBURN. Mr. Speaker, I would like to mention a little bit of  history here that I think is very meaningful and helps to make the  point that I really want to make tonight.\n\nI attended public and private schools in South Carolina, grade  schools, before going off to South Carolina State, now University. When  I came to Congress, South…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…massive tax giveaway to the wealthy and  the well-connected while people really need help with their  pocketbooks. They need help. They want to retain their healthcare. They  want to make sure that the ocean waters are free of pollution.\n\nPlease vote ``no'' and focus on what is important.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…themselves  and elect mayors and council members that choose to pass laws to  support the District. Congress should not be undermining local laws.\n\nMr. Speaker, Republicans want to make it easier to lock up poor  defendants pretrial, undermining the fundamental American principle of  innocent until proven guilty, all while stripping 700,000 residents of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Mr. SMITH of Washington. Mr. Chair, I yield myself 2 minutes.\n\nMr. Chair, there are going to be five amendments now that are all  targeting the transgender community. I want to make sure we understand  a couple of really sort of broad themes and why these amendments are so  problematic.\n\nNumber one is the transgender community has been targeted and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…economically  in the future? Do we want to create a dystopian world and make everyday  Americans subservient to the Chinese Communist Party and their  affiliates, or do we want to make a decisive stand to stop some of the  most advanced technologies from being used against us in every facet of  our lives?\n\nLoopholes currently available in U.S. export control…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…job.\n\nMr. COMER. Madam Speaker, I yield 3 minutes to the gentleman from New  York (Mr. Garbarino), the sponsor of the bill.\n\nMr. COMER. Madam Speaker, before I reserve, I want to make sure that  my colleagues across the aisle know what bill we are actually debating  on the floor, that the bill that pertains to law enforcement in  Washington, D.C. It has…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…individuals will have no problem registering  under this bill. You can bring forward your identification. You can  sign an attestation if you don't have the documentation.\n\nWe want to make sure that it is easy to vote and hard to cheat. We  could look at our committee hearing that we had just this week where we  brought in the secretary of state of Wyoming,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…stop there, Mr. Speaker. Opposing this bill also means  protecting waste over purpose, fraud over fairness, and foreign  interests over American strength.\n\nMr. Speaker, I want to make sure voters in my district know what  passing the One Big Beautiful Bill Act will mean for them. It means  they get to keep more of their hard-earned money. It means that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…voted against the fraud provisions. They voted  against these protections that we had against the fraud. And now  Democrats, with what they want to do for the next 3 years, want to make  the fraud dramatically worse.\n\nThis needs to end. The American people deserve the care they need  from a doctor that they choose at a price they can afford. ObamaCare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…estimates that 2\\1/2\\ million of the 10 million  are not actually eligible for the program to begin with. That is a  quarter of that 10 million aren't even eligible.\n\nIf we want to make sure that our safety net programs work and are  stable, we have to ensure the benefits are actually going to people  whom Congress has made eligible for these programs in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…like a King. They did not want a King. They were  tired of the endless wars of Europe. They took that power and placed it  with the people's representatives. They didn't want to make it easy to  go to war. They wanted to make it hard to go to war.\n\nSome will argue--they will say that Congress is so feckless. They  will never declare war.\n\nWell, guess…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…three times to no avail, which is, again, unfortunate.\n\nWhile the Postal Service operates, by the way, on a fee-for-service  basis and receives no direct appropriations--I want to make sure that  everybody understands that--my team, my staff, has talked to the  Congressional Budget Office to make sure that there is no score with  this. The news is, as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "John Rose", "party": "Republican", "sentence": "…no law can change a lawmaker's compensation until a new Congress  is sworn in.\n\nIf the House legislation we are debating today does not receive a  vote in the Senate, I want to make it clear that I am taking action.\n\nToday, I have introduced H. Res. 892, a House resolution that  empowers Speaker Johnson to bring this issue before the courts and  challenge…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…people.\n\nThis is an effort by the Democrats--this debate--to kneecap  immigration enforcement, to kneecap ICE. They lost the issue on the  front end of the election. Now they want to make it so hard for ICE to  do their jobs that deportations come to a halt. That is the truth, and  anybody in this town who tells you otherwise is just spinning.\n\nThey don't…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…puts these commonsense ideas into place to make  our elections more secure and fair. I invite my colleagues to support  my UC and pass the SAVE America Act. Why wouldn't we want to make  certain that elections in the United States of America are free and  fair?\n\nPresident Trump and the American people are all on board with the  SAVE America Act. The House…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…written in a very  specific way to comply with this Byrd rule. The underlying bill is an  effort to fix one of those instances, and I am supportive of this  policy change. I want to make that clear.\n\nAnother provision that was, unfortunately, not included in the final  bill as a result of the Byrd rule was an exemption for qualified  religious institutions…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…consume.\n\nI love public policy by storytelling, but this being the Joint  Economic Committee, let's actually go back to math.\n\nMadam Chair, I would say to Mr. Beyer that I want to make sure I am  communicating right, but at least we are down to, instead of the  Armageddon, his number was, well, if you cut $2 trillion over 10 years,  that is $200 billion.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thank the chairwoman for yielding.\n\nSo here we are. Democrats couldn't seem to find a single thing to say  about Epstein when President Biden was in office, but now they want to  make this the centerpiece of their entire conversation.\n\nThe fact of the matter is right now they know it is true, and right  now what they don't want to do is have the American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…hearing over and over is, this  is somehow a big tax cut for the rich. Again, for those people who  don't know, the tax rate for the wealthiest Americans did not change. I  want to make sure that it echoes through the next few years, that they  recognize the folks who are working and happen to be earning the most  money will stay at the same exact tax rate.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}]