[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…kind of firepower to another country's doorstep, we know  what we would believe was taking place.\n\nThe bottom line is this: Americans do not want another war. They  don't want American servicemembers put into harm's way, either flying  missions or with boots on the ground, for a war not authorized by  Congress. Mothers and fathers of American sailors,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…package, a package that in all reality barely  makes a dent in the very debt that they ballooned.\n\nSince they want to talk about the debt, let's talk about the debt. I  want the American people to take a look at this chart, Mr. Speaker. I  want the American people to look at this chart. The red indicates the  $3 trillion that Trump's big, ugly bill will…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…right  across, block it, make them the 51st State, and insult them. If that is  what you want to do, do it.\n\nIf you want to stand to bring down prices, if you want the average,  everyday American to be able to raise their children and live the  American Dream, if you want to make sure that families can afford to  pay their rent, can afford to buy food,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…chock-full of unqualified, horrible nominees--but the bottom  line is this: Democrats want individual votes on these nominees. We  want time to debate them on the floor, and we want the American people  to see for themselves who Donald Trump and the Republicans are trying  to appoint to serious positions of power.", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…link to the official report of  the names and ages of Palestinians confirmed and killed in Gaza.  https://data.techforpalestine.org/list/.\n\nMr. Speaker, look at this. I want the American people to see this.  The first 21 pages are all infants who did not live long enough to see  their first birthday.\n\nThere have been over 60,000 human lives confirmed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…by our kindness,  and, yes, we will be judged by our work to build a society where  everybody has a chance and nobody is left behind.\n\nThis is an immoral budget, and I want the American people to know I  do not share these values. Democrats do not share these values. I  reject this budget. Democrats reject this budget.\n\nMr. Speaker, I urge a ``no'' vote,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…corporations plunder this country. That should end. We have to be  willing to go to the mat for an economy that works for people who work  hard, who play by the rules, and who want the American Dream back.\n\nThe roots of this party, that I am proud to be a part of, go back to  the New Deal. It is a working-class party at its core. Allowing  somebody else to fake…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…their Medicaid cuts.  They have tried to hide their billionaire tax giveaways with budgetary  gimmicks and distractions. They are tying themselves in knots. They  don't want the American people to know what their agenda is. Well, if  Republicans won't be straight with the American people about their  agenda, Senate Democrats are glad to do it for them.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…billionaires. Who does that?\n\nWhy are they meeting at 1 o'clock in the morning? It turns out their  big, beautiful bill is really a big, ugly bill.\n\nRepublicans don't want you, the American people, to know what they  are doing. Tune in tonight at 1 a.m. Call your Congressperson and tell  them to vote ``no'' on this garbage. Watch as Democrats fight like…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691511/one-big-beautiful-bill"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…know their position is  indefensible, which is why they are resorting to lies and excuses--lies  that get more desperate by the day. They are lying because they don't  want the American people to know the truth.\n\nWhat is that truth? The truth is that Republicans are happy to make  permanent massive tax cuts for billionaires in their ``Big Ugly Bill''…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Members have worked all day. They started very early this morning. You  can say they are doing a double shift, in my part of the country. They  haven't eaten dinner. I just want the American people to know that  there are Members of Congress who work very hard, who respect our  Constitution, and who respect the laws of this country. It is now  almost nearly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…healthcare, to good jobs, to good schools, to clean air and water,  housing they can actually afford, safer communities, and a functioning  democracy. That is the vision.\n\nI want the American people to know that Democrats are not giving up  on healthcare. We are going to continue to fight.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696754/medicare-for-all"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…that is what Islam teaches. The Quran says to kill all  infidels. That means all people who don't believe in Islam.\n\nSo let's not mince words about this. Islamists want every single  American, and especially Christian Americans, they want them dead.\n\nIn 2021, Joe Biden orchestrated the botched Afghan withdrawal, which  was one of the most embarrassing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is protecting American citizens from  terrorist attacks--attacks like the one witnessed last week, just in  front of the White House. President Trump and Republicans want every  American to be safe, to be secure, and to be prosperous. This is our  top priority.\n\nAfter last week's brutal attack, securing our border and our  communities is more urgent…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…self-centered, self-serving piece of language that I have ever seen in  my time in office in any piece of legislation. For the people who are  saying it is $500,000, I want the American citizens to know this: It is  not $500,000. It is $500,000 per account, per occurrence.\n\nWe have one Senator, one, who maintains that this provision is good  and is currently…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…people in this country, but what about  sympathy for the children? They did nothing to stop the invasion at the  border. They had words, but that is all it was.\n\nThey want the American people to know that it is their money to spend  on illegal aliens' free college tuition, putting it on the backs of the  everyday working man.\n\nThis is the first step…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…some complicated scheme where you have to get approval for  somebody who is in network or not in network and who may or may not be  within 100 miles of your house.\n\nWe want the American people to be empowered. We want them to be able  to go defray costs and share costs in health-sharing ministries and  Medishare and all these different organizations…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…operators across the Nation have been clear over the  last several years that we need more dispatchable power to come online  to protect us from rolling blackouts.\n\nIf we want to keep American businesses running and ensure  uninterrupted power for our constituents, we must fix the broken  interconnection queue.\n\nI urge all of my colleagues to support this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…curious on what the minority leader says.\n\nMr. SULLIVAN. This Senator yields the floor to answer that inquiry  that I asked about.\n\nMr. SULLIVAN. Mr. President, I just want the American people who are  watching this that care about our national security--the chairman of  the Armed Services Committee just had a colloquy here on the floor  talking about…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "Mr. HIGGINS of Louisiana. Mr. Speaker, what is it that the Democrats  don't want the American people to know? It is a legitimate  consideration that the citizenry from sea to shining sea should ask  themselves right now. What exactly is the problem?\n\nThey say…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…doesn't like a military operation, the Constitution says  that it is Congress that appropriates money, not the President. So, for  instance, in Venezuela, if you don't want any American boots on the  ground, I think you could come forward and pass through the  appropriations process a prohibition of funds to be used to have  American ground forces in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]