[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…sicker and that needs more care. That care becomes more expensive. It  hurts us all.\n\nThat is why I am so outraged that this is the mechanism that my  Republican colleagues want to use to pay for a tax plan that will give  gigantic cuts to the wealthiest taxpayers in this country such as Elon  Musk. That is unconscionable. I wanted to start with that.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…bringing down the cost of groceries,  instead of debating legislation on making sure we can make this country  more affordable for working people, congressional Republicans want to  use this time to attack working families in the District of Columbia.\n\nOverturning this law will create chaos for D.C. families and  businesses at the start of tax filing season.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…country. And I agree with him about the murderous  dictator that is Maduro.\n\nBut here is the thing. If my colleagues in this Congress want to go  to war with Venezuela, if they want to use military force to bring  about regime change in Venezuela, or if they want to wage a literal war  using the military and armed force to blow up traffickers, then they  need…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…women who follow the traditional practice of  changing their name after marriage do not have a birth certificate that  matches their legal name. Republicans know this and want to use that  misinformation to block them from voting.\n\nThis bill would eliminate the voter registration methods that over 90  percent of Americans rely on, including online, mail-in,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…independent. That is the bottom line. No rationalizing  away what is happening here.\n\nThis is from the Cystic Fibrosis Foundation. I could give you so many  examples. I don't want to use up all the time. The Cystic Fibrosis  Foundation says:\n\nWhile people with chronic illnesses like cystic fibrosis       may be exempt from work requirements, we know exemptions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…sick. It is immoral. It represents  the opposite of what I believe we are here to do, which is to help  people, but that is their entire governing philosophy.\n\nRepublicans want to use their power to reward the billionaires and  special interest donors. They want an economy where those at the top  get showered in tax break after tax break, while working…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Congressional Review Act?\n\nMr. SCHUMER. Thank you, Mr. President.\n\nBefore I yield, I want everyone to understand what the essence of my  question was. This week, the Republicans want to use a legislative tool  known as the CRA in an unprecedented way: to repeal emissions waivers  that the fossil fuel industry has long detested.\n\nThe CRA has never been used…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691448/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…they claim that they have done.  Speak with specificities. Have the courage to speak with specificities.  They don't have the courage to speak with specificities. They just want  to use a broad brush.\n\nYes, I am going to say it, the President doesn't deserve the Nobel  Peace Prize because he has sanctioned genocide in Gaza. The world sees  it, and this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, Oregonians at home and colleagues in the  House often hear me talk about NOAA, but I want to use this time to  explain how this agency, the National Oceanic and Atmospheric  Administration, contributes to the economy and to our well-being.\n\nNOAA is not just a four-letter…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…protecting public health and the environment, a  President who wants to restore the bedrock environmental laws that the  Republicans have gotten rid of.\n\nRepublicans then want to use this bill as a shield to protect  polluters. If the polluter now, under a new President, isn't going to  have the protection, and the public is going to have the protection…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…business passthrough.  The Joint Committee on Taxation, passthrough for LLCs, says this  revision in the law will cost $736 billion. My good friend across the  aisle says: I want to use a magic baseline to show things cost less. He  says: We will use a technique here, some magic math, and tell the  people that it only costs $6 billion, even though the Joint…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the Trump administration is  doing.\n\nThe first Trump administration tried to roll back the requirements.  In fact, the then Attorney General basically said, ``I don't even want  to use this consent decree power, because it's one of the most  dangerous things, and it's an exercise of raw power.''\n\nWell, the reason why the Department of Justice has this…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and his billionaire buddy Elon Musk, the richest man  in the world, have asked Republicans in Congress to provide a massive  giveaway to the wealthiest Americans, and they want to use Medicaid  cuts as the piggy bank.\n\nLet's be clear: This is not a healthcare reform plan to improve our  healthcare system or lower costs for families and patients. Nope.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…diseases.\n\nShane lives in Cincinnati, so he has Cincinnati Children's Hospital,  but with these cuts, services at Children's will be undermined.\n\nShane told me recently: I want to use whatever time I have left to  help others with this and other rare diseases.\n\nI just wanted to come to the floor today to thank Shane. We are  fighting for him and we are…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690573/shanes-story"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…companies to have to find different and more expensive ways, as it  turns out, to create that electricity.\n\nWhat this bill does is, it pushes us on nuclear, which if you don't  want to use fossil, that is the only way you can get the baseload power  to supply us and make us competitive with the Chinese in the field of  AI. Yet, somehow, once again my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…healthcare. It was always about appeasing a far-left radical base.\n\nChuck Schumer said: Every day gets better for us.\n\nKatherine Clark said: Of course, people will suffer. We want to use  this as leverage.\n\nIt is an embarrassment to this country. You should all be ashamed of  yourselves for inflicting this pain on the American people, taking away  food stamps…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…opportunity for a major step forward in election integrity here in our  Nation's Capital. It is also a statement across the country because I  believe the radical Democrats want to use Washington, D.C., voting laws  as a petri dish to roll out their plan across the country.\n\nMy colleagues on the radical left would like to see noncitizens  voting in my…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to open government, and they continue to perform that political  theater. We need to prioritize the reopening of the government and stop  the suffering that the Democrats want to use as leverage.\n\nThe ranking member mentioned the discharge petition, and he is very  proud that it has 218 signatures, but not that long ago today we had a  unanimous consent…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…America, an America where citizens are  free to use their money. If they want to save it, if they want to spend  it, if they want to invest it, they get to decide.\n\nThey want to use it to build a small business, good. They want it to  control their family's future, perfect.\n\nIt is no wonder that the University of Michigan found that consumer  sentiment…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…for the country; it is a  problem for individuals who, I think--I am told, many of which regret  when they are 35 or 40, not having children when they were younger.\n\nPeople want to use the tax code to incentivize people to have more  children. There are a variety of ways you can do that. President Trump  floated a balloon just to give people a large check.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…weaponized against the  people. These are dollars that are being used and wasted and sent  around the world for $32,000 for transgender comic books in Peru. That  is how they want to use taxpayer money.\n\nWe are over here trying to make sure we are saving that money instead  of having $6 million to fund tourism in Egypt or $2 million for sex  changes and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…different ways. That brings down costs. This bill will allow us to do  that.\n\nIt also helps us restore American energy dominance, where we are  using all of the above. We want to use every asset at our avail, both  our energy itself, with what we produce there on the grid, and the  transmission within the grid.\n\nWe know that this is key for our working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…if we are working on taking the life of an innocent child.\n\nThere is also an ongoing debate that is happening right now over  chemical abortions--``mifepristone'' if you want to use the medical  term, and there are several generics that are out there as well. This  is an abortion drug that is literally now mailed to you without seeing  a physician.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and $3 million for Iraqi ``Sesame Street.'' Lord knows, the Iraqi  children need a little Big Bird in their life. It is a good use of $3  million of taxpayer money. I might want to use the $3 million on  homeless vets.\n\nHow about we take some of that cash back.\n\nMr. Speaker, $4 million for sedentary migrants in Colombia. That  seems like an oxymoron.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…when we also had three votes--we used one vote for  the tax cut, one vote to try and failed to do something on healthcare  reform, and a third vote that the Senators didn't want to use. They  wanted to restrict the floor votes to votes in which Chuck Schumer  signed off.\n\nWe are now at the same position this time, and I hope that our talk  radio and mouthpieces…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694987/calling-for-use-of-reconciliation-process"}, {"senator": "John Thune", "party": "Republican", "sentence": "…here, the New York Times.\n\nBy the way, this morning, the Democrat leader used one of my other  charts. Thank you for doing that. It makes my point. I am guessing he-- do you want to use this one? Maybe not.\n\nBut this one is the New York Times, and based on the questions on  views on whether Democrats should or should not shut down the  government if demands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}]