[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…workforce--there for up to 2 years,  the future of our civil service--they are firing, and so many of them  are veterans who have worn the uniform, served and sacrificed, and want  to continue to benefit the country with the skills and dedication they  have demonstrated as members of our U.S. Armed Forces.\n\nPublic service has long been a preferred path for…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…and leadership that is fighting the fentanyl  epidemic and has led to a reduction in overdose deaths. But just as  HIDTA has supported us, we must support HIDTA.\n\nIf we want to continue building on the progress we've made and  continue saving lives, we must resist calls to reposition HIDTA or cut  its funding. I am grateful for the heroic work of HIDTA…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to  me: We appreciate what you are doing.\n\nIt means a lot to me to have people that I do not know, many of whom  I will never meet and greet, to simply say to me: We want you to  continue to do what you are doing.\n\nAs you know, Mr. Speaker, I have been censured. I have been censured.  I was censured but not silenced. I was censured but not silenced.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…stood up for what was right and  what was just.\n\nGerry was a skilled statesman, an accomplished legislator, and a  fierce defender of democracy. I am sure he would want everyone here to  continue fighting like hell to stand up for those who cannot stand up  for themselves, to defend the rights of every American, and bring  accountability and transparency…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…have already got my letter.\n\nHis letter here says: Last year, the cost of your healthcare program  in total was $36,969--so almost $37,000. Starting January 1, if you  want to continue this program, it is $43,000.\n\nThat is happening across the State of Michigan already. So if you  thought that the Big Beautiful Bill was cutting someone else's  healthcare,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…funding  bill that was voted on yesterday, but Republicans in this House refused  to have any amendments on this important issue even considered.\n\nIt is clear that they want to continue to give Kristi Noem and Donald  Trump the green light to continue terrorizing our communities and have  untrained ICE agents run rogue, killing American citizens.\n\nThis…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Thune  wants to talk about bipartisanship, he should focus on keeping his side  of the street clean first, because Donald Trump and Russell Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…were just trying       to deal with a particular problem, not begin a trade war. So,       next week I'll be giving Prime Minister Nakasone this same       message: We want to continue to work cooperatively on trade       problems and want very much to lift these trade restrictions       as soon as evidence permits. We want to do this, because we…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…want to be abundantly clear that this is not about taking away  anyone's Second Amendment right to bear arms. Mr. Speaker, don't be  fooled by the gun manufacturers that want to continue to put profits  over people, over children, and over people's lives.\n\nI am from the South. I am a gun enthusiast. I do believe in the  Second Amendment, but I am a responsible…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…reach underserved  populations. And, like all of my colleagues, I want to make sure that  our technology never falls into the hands of our adversaries.\n\nThat is why I want to continue the bipartisan foreign due diligence  program enacted in 2022, which has already successfully identified and  mitigated foreign risk in its short period of implementation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…this space understand the  direction it is going in and understand who is going to oversee what,  so that consumers can be protected. I can't say that enough.\n\nDo we want this to continue to be the Wild West with uncertainty, or  do we want to have clear rules of the road to protect consumers? Do we  want to do something or nothing? Is it perfect? As…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…global hunger with U.S.-produced products, sourced from U.S. farmers,  manufactured in U.S. factories that help build U.S. goodwill around the  world.\n\nThat is what we want to continue. We do not want to give an  opportunity to China or anybody else to fill the void that is being  created right now.\n\nThe Global Report on Food Crises published last Friday…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…this moment in time. Elon Musk is, I believe, really inflating the  price of popcorn right now. This is something that is going to affect  my household.\n\nMr. Speaker, I want to continue back to Elon Musk. Whatever side is  taken in this debate, we cannot forget that Elon Musk, again,  repeatedly violated the law. He made illegal spending cuts. He tried…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…colleague again for putting on this event tonight, giving  us a chance to remember Dr. King and think about the civil rights  movement and where we are going as a nation. I want to continue to  fight alongside her and all my colleagues with the Congressional Black  Caucus and my colleagues here in the House of Representatives on both  sides of the aisle as…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…year, and  nationally, one in four women experience severe physical violence from  an intimate partner in their lifetime.\n\nI appreciate the work that Heather has done and want to continue to  extend heartfelt gratitude for all of her work.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691003/recognizing-heather-davenport"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…program of funds that are intended to help  American citizens in need.\n\nMr. Speaker, as expected, my colleagues are unable to focus on the  task  at hand. Instead, they want to continue their fear-mongering and  falsehoods about what is in the One Big Beautiful Bill Act.\n\nFor the record, again: It does not cut Medicaid for any U.S. citizen  who needs…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…year? What do we do for those Americans who are in some cases facing  $33,000-a-year premiums who have a salary of $90,000? What do we do for  them?\n\nSome people just want to continue the subsidies as they are--the  status quo: Let's continue the subsidies for 3 more years. And, yes,  the premiums will continue to rise. Yes, it will require taxpayers…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…for ignoring Federal law.\n\nTo the American people, you are not wrong to believe sanctuary city  policy is bad for your country. Democrats are wrong to support it and  want to continue it.\n\nSo what do we hear on the floor today? Not only is it that they don't  believe it is a problem but that they wish to continue it.\n\nThis is why I want a vote. We are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…headlines.\n\nMonday's Wall Street Journal: ``ObamaCare Is a Mecca for Fraud.''\n\nThe Democrats must be in favor of all this fraud because that is what  they want to do. They want to continue it for 83 billion more dollars.\n\nWhat about the Washington Post? This is yesterday's Washington Post:  ``Obamacare subsidies make it too easy to scam the system.''\n\nThat…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in part to offset  waste, fraud, and abuse that runs rampant throughout the program.\n\nRather than fix the problems of the unaffordable care act, Democrats  in Congress want to continue to send billions of taxpayer money  directly to giant insurance companies and leave families with thousands  of dollars in healthcare costs that they cannot afford.\n\nThe…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698370/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…corporations. We need to make sure that  199A is extended and, if not just extended, made permanent. The Tax  Cuts and Jobs Act made our small businesses more competitive, and we  want to continue to pursue policies that provide regulatory relief,  economic stability, and the ability to grow and create jobs.\n\nMr. Speaker, I thank my colleagues again for joining…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…law under Title IX on all  aspects of medical care, of counseling, and of opportunity. But sadly,  that has been left out as far as saying if you are pregnant and you  want to continue as pregnant in this school, we are going to support  you in that.\n\nTitle IX gives all of the information. We are not going to be  redundant. We are just making sure that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…think  about that, but that is a fact.\n\nAll DOGE is wanting to do is look at spending and see if we can cut  out unnecessary spending. I think the American taxpayers want that. We  continue to pledge to see if we can find wasteful spending and  eliminate it altogether.                 Recognizing Terry Forcht of the Forcht Bank\n\nMr. COMER. Mr. Speaker,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the same  thing when we had the horrible fires in California.\n\nHere is my point: I don't want to be at war with Canada. I don't want  to have a trade war with Canada. I want us to continue to be friends. I  made this suggestion to the new Prime Minister of Canada the other day,  Prime Minister Carney. I am going to make it again, and I hope, this  time,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Speaker, you have to have some abilities to take some of the money  that you make off the revenue sports, as they are called, and use them  for the other sports.\n\nNow, if we want to continue with the Wild Wild West, as my friend,  Gus Bilirakis, likes to say, then we do nothing and we defeat this  rule. We do nothing, and it will continue to be a crazy arena…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…not facts, and saying  something over and over again that is false does not make it true.  Democrats have told these lies before and were proven wrong.\n\nThe Democrats want to continue 4 more years of Bidenomics. We want to  put us on a path to prosperity. These are the same people claiming that  there is no waste, fraud, or abuse in Washington.\n\nThis…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the party of painful and punishing regulations. They remain the party  of never-ending dependence on foreign dictators for energy that we have  right here. Democrats want to continue the war on American energy, and  that is why they are going to line up today and oppose what President  Trump is trying to do to bring energy prices down.\n\nRepublicans…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}]