[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Partners in Education  Coordinator, Department of Family and Children Services, Columbus  Community Center, Student Assistant Professional Association, Rape  Crisis Center, Women Wanting Justice, Family Center, Jack and Jill of  America, Inc. (Local Charter Member), Jack and Jill of America  Foundation, Columbus Chamber of Commerce Ambassadors, Historical…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…ever allow to come back again.\n\nYet, the policies I am seeing coming out of this administration, the  decisions coming from some of the courts in this country, seem to be  wanting to take us back to that history that I thought we had gotten  beyond.\n\nI am proud to pledge allegiance to the flag of the United States of  America, but I am also proud to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…human dignity.\n\nWe know that corporate greed is driving costs up and creating this  affordability crisis, so we need to push back. If my colleagues in  Congress are serious and wanting to improve the lives of the American  people, they should stop corporate giveaways and support and pass the  economic dignity for all plan.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…some rifles to be sold.\n\nTo save lives, Democrats have now twice passed the bill that would  expand background checks on every gun sale, and here my Republican  colleagues are wanting to make it even easier to dodge the rules that  we do have.\n\nMr. Chair, recirculating retired service weapons already has inherent  risk. More than 52,000 retired law enforcement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the way, wants to veto that bill, I would like  to think that Democrats and Republicans unanimously would join together  to override such a veto. I can't imagine anybody here wanting to defend  the indefensible.\n\nWe have another way you could be helpful here. If we defeat the  previous question, I will offer an amendment to the rule to provide for  consideration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…argued that the United Arab       Emirates had thrown its weight behind Haftar in a bid for       port access and other shares of the country.\n\n``The UAE has this sickness of wanting to control harbors.       They came to buy New York Harbor one time,'' Sahad said.       ``The control of the Libyan harbors, some of them is to be       part of the Libyan…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…pay, and the services get worse and worse  and worse.\n\nThe customers are the victims of these big mergers who do not want to  be reviewed properly and who you support in not wanting to be reviewed  properly.\n\nMr. Speaker, I am just sitting here being absolutely shocked by some  of my own words when I take a look at the fines that we have charged  both…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…being used in  this fashion, and therefore I will present a different option, which is  to say we should address both the sale of meme coins as a way to profit  from people wanting to give us money and we should also cover the  stablecoins as well.\n\nSo this broader amendment is a more comprehensive way, regardless of  what conclusions you might have…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…agency has lost over 11 percent of its staff through September.  Who knows how many additional staff have left over the last 3 months  because you know that the President is wanting to fire everybody.\n\nLet me just review this, again, because I don't want to be too  bureaucratic here, Mr. Speaker. House Republicans want FERC to do  something it has no…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…way, there is no guarantee that  the United States Senate is going to take this up. This may all be for  show just to make people feel guilty about having voted for this or  wanting to convince voters back home that they really weren't complicit  in giving this extraordinary bonanza to a handful of elitists who feel  somehow aggrieved by the fact that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…they have reached 55 classrooms in both New  York and nearby Connecticut, and over 1,500 books and bears have been  distributed.\n\nMr. Speaker, I applaud Lauren and Peyton for wanting to help young  children in our community and for their entrepreneurial spirit.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695353/a-bear-and-a-book"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…body. We deal with the complexities of legislation  that often cause us sometimes to raise our voice, sometimes get  emotional, sometimes take it home with us in the sense of wanting to do  more but being hamstrung sometimes by the very politics that built this  body.\n\nIt is our mental health, and our physical health all tied together  that is so important.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Republicans to break their word, to eliminate  the filibuster so they can do the bidding of those who would pollute  our air.\n\nNow, I don't blame my Republican colleagues for wanting to shroud  what they have set out to do tonight in secrecy. I don't blame them for  trying to hide it. It was just a few short weeks ago the Republican  leader assured this…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…(Mr. Magaziner) and the gentleman from  Texas (Mr. Roy) for bringing us together tonight.\n\nMr. Speaker, imagine that, Democrats and Republicans in this Chamber,  in this town, wanting to do something about corruption. That is a good  thing. I hope the American people are paying attention.\n\nI will tell you it is clear from conversations with my constituents…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…it intact, as it has been for millions of years. And many  Americans had hoped we had moved on. That is, moved on because even the  oil companies have said, by virtue of not wanting to pay for any  leases, that this area is not a good place to drill.\n\nSome companies even paid to get out of their leases. I say moved on  because, time and time again, insurers…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…is something that appears to have been in the works and  something that was really desired by those on the left.\n\nWe have heard, of course, that the minority leader is not wanting to  face opposition from the left there in New York, and because of that,  of course, what we are seeing is that our Nation's business has come to  a halt.\n\nLast night and…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…from the people running around  this place and saying just use current policy because it is easy and so  I don't have to say no to the army of people sitting in my office and  wanting money for whatever their cause is.\n\nMr. Speaker, you do realize when you start looking at this stuff, you  are talking about 140, 150-plus percent of debt to GDP. It goes…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…to meet with the new Greenlandic President, and he wanted to know--he  said: What is it that the United States wants? What are they seeking?  There is this talk about U.S. wanting Greenland. What does it mean?  What do they want? Is it critical minerals? Is it more from a national  security perspective? Because if that is what you are seeking, we are…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…servant first, driven by an inner compass of  virtues or core values, with a natural desire to serve and empower  others. This is not about being subservient but about sincerely wanting  to help others by identifying and meeting needs.\n\n``A servant leader has the gift of persuasion through moral  authority: the principled use of natural virtues unique to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…daily for 30 days. Without  Donna and her ability and willingness to coordinate, far fewer people  would have been helped. As the holidays came and went, Donna kept in  touch, wanting to donate her time with us in ``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMs. MACE. Mr. Chair, may I inquire as to the time remaining.\n\nMs. MACE. Mr. Chair, if not wanting to castrate kids is a rightwing  culture war, then sign me up because this is not the kind of thing that  should be happening to children or military dependents anywhere in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…myself, I know firsthand that Cochise  College remains committed to helping students create bright futures.  Cochise College provides both university transfer programs for those  wanting to continue education and also offers workforce-ready  certificates designed to prepare graduates for immediate employment in  southern Arizona's growing job market.\n\nI am…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…they do  when they get to our office? They don't walk in the door and say: We  really want you to save the future generation. Spend less money.  Everyone is at our door either wanting money or wanting us to regulate  their competition. That is bureaucracies. That is businesses. That is  private groups, charities. Give us more money, or create a barrier…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…will not be destroyed is the spirit of the people of  Texas; the spirit of the people that those camps represent; the spirit  of the little girls who are already talking about wanting to go back;  the spirit of the people associated with Dick Eastland, the camp  director of Camp Mystic who gave his life trying to save those little  girls; the spirit of…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…President of the United States to pardon his entire  family.\n\nI know my friends on the other side of the aisle don't like to think  about that, but that is a fact.\n\nAll DOGE is wanting to do is look at spending and see if we can cut  out unnecessary spending. I think the American taxpayers want that. We  continue to pledge to see if we can find wasteful…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…drug gang, Graham was also convicted of sex trafficking by force or  coercion from 2013 to 2021.\n\nOf course, this is on top of my colleagues on the other side of the  aisle wanting to defend a Maryland man for being sent overseas after  the guy was clearly moving people illegally, beating his girlfriend and  wife, violating our laws, and here illegally.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…food prices, or they are going to continue to  pay an extra $10 or $20 a month in electricity.\n\nThat is what is going to happen that they don't realize, that what  they are wanting to do is mandate that businesses have to increase  their expenses at the expense of the consumers because they are the  ones that are going to pay for that.\n\nI have watched…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…was proud to say that, and I worked towards that in my  time as attorney general in the great State of Florida. That is why not  only are we leading in the Nation in people wanting to move to our  State for protection, the people who are doing that protection, our law  enforcement officers, are coming from all over this Nation, uprooting  their families,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…small business  corporation, S corps, LLCs, all the various different types of  businesses that we run here in the U.S., they all get a competitive tax  rate, keeping them wanting to invest here in America and reinvesting in  their business. If they can reinvest in their business, they can  actually grow overall tax receipts because of the concept of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…What about the Washington Post? This is yesterday's Washington Post:  ``Obamacare subsidies make it too easy to scam the system.''\n\nThat is what the Democrats appear to be wanting to do, continuing to  put money--$83 billion--into a system that even the Washington Post  said is easy to scam.\n\nIs that what the American people want? That is insulting…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}]