[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…and anti-Arab hate.\n\nAnd while others seek to divide and distort circumstances to advance  their narratives, there are so many stories actually worth telling. So  I want to take a moment to recognize and celebrate the contributions of  Muslim Americans to Virginia's history. Muslim Virginians are integral  to what makes our Commonwealth thrive. They…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…for his bipartisanship and his partnership, including to  pass this bipartisan resolution to recognize Jewish American Heritage  Month by unanimous consent.\n\nI also want to take a moment to speak about the horrific murders that  took place last night. Like so many other Jews in America and around  the world, I woke up this morning heartbroken by the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…not were buttressed by-- again, as my colleague from Rhode Island has explained--the analysis  and the findings of the GAO, which we charge with this input.\n\nAnd so I want to take a moment to just read some excerpts from the  GAO, as written to the Senate. And I will submit the entire letter for  the Record, but the key excerpts are important to highlight.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to recognize May as  Huntington's Disease Awareness Month. I want to take a moment to honor  the courage and strength of families across the Nation who face  lifelong hardships due to this disease--including one of my own  constituents, Rachel Reising,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…funding package  that was signed into law yesterday was the State and Foreign Operations  appropriations bill. And while people are understandably focused  elsewhere, I want to take a moment to talk today about what is in the  so-called SFOPS bill and why it matters because, simply put, this bill  will save lives all around the world. It will strengthen…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Ms. ADAMS. Mr. Speaker, I rise this evening to recognize the eighth  anniversary of Black Maternal Health Week, founded by Black Mamas  Matter Alliance.\n\nI want to take a moment to honor the life and legacy of my  constituent, Fatima Carter.\n\nI share with you a stunning portrait of her painted by Omari Maynard  of the ARIAH Foundation.\n\nThrough…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689832/recognizing-black-maternal-health-week"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…air should ``be  the birthright of every American.''\n\nI wonder if Governor, future-President Reagan and President Nixon  would recognize their own party today.\n\nI also want to take a moment to speak to parents of young children,  not just in California but across the country, because parents are  rightfully concerned about the safety of what our children…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…also includes a 5-year extension of the Hospital at Home  Program, an innovative initiative championed by my friend and former  colleague Senator Thomas R. Carper. I want to take a moment to  recognize Senator Carper's leadership to advance the Hospital at Home  Program. This special initiative allows hospitals to treat patients in  their homes, rather…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…consumer already has a  relationship with, like their current mortgage lender. If the consumer  opts in, and you can opt in, then you can have everybody call you.\n\nNow, I want to take a moment to acknowledge the good work of our  former colleague Representative Lacy Clay who helped pave the path by  first introducing a bill to curb abusive trigger leads clear…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…supporting schools, roads, and essential services. I am proud to  be bringing that money back to the families and communities that have  waited for far too long.\n\nI also want to take a moment to recognize some of the incredible New  Mexican advocates who helped make today possible. This is not a full  list, but it is a long one, so bear with me. Our Secure…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…subjected to unacceptable pressure and retaliation for reporting--will  see that by law that is now going to be a thing of the past. It is long  overdue, and, again, I just want to take a moment to publicly thank  Commander Young-McLear and her colleagues for having the courage to  step forward and make sure that the Congress is aware of this situation  and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…using the power of my pen as a lawmaker, using the power of       my platform, using the power of convening, which is what       brings us here today.\n\nI also do want to take a moment to acknowledge the       indefatigable efforts of my staff that I call the A team who       make great personal sacrifices and labor in love on behalf of       the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…make decisions on whether to exclude other agencies from the review  process entirely. That is simply not an efficient or collaborative  process, in my opinion.\n\nI also want to take a moment to note that while Republicans are  obsessed with destroying our public health and environmental laws in  order to speed up the construction of more pipelines, they…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…caucus as to what happens next. So it is with some real regret that  I will vote no today but will continue to talk with my colleagues about  how do we move forward.\n\nI want to take a moment and just speak to the Defense bill that we  have worked so hard on and that came out of the committee with such  strong bipartisan support. It would provide a better…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "Ms. LUMMIS. Mr. President, before I talk about digital assets, I want  to take a moment to remember Sarah Lynn Milgrim and Yaron Lischinsky,  who were tragically, senselessly murdered last night at the Capital  Jewish Museum.\n\nMay their memory be a blessing…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…MARSHALL. Mr. President, I am so excited to be here today. I am  going to talk about one of my favorite--favorite--topics, eating. But  my mouth is a little dry here, so I want to take a moment and enjoy  some whole milk.\n\nYou know, I am not the only one that loves eating. America loves  eating. If I can share a story with my fellow Senators, I always  thought…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…When California thrives, the rest of the country does, as well.\n\nResponding to California High-Speed Rail Authority Statement\n\nMr. KILEY of California. Mr. Speaker, I want to take a moment to  respond to the statement put out by California's High-Speed Rail  Authority in response to the audit from the Department of  Transportation that came out yesterday.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…close, and I reserve  the balance of my time.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nAs we wrap up this debate, I want to take a moment to cut through the  noise from our colleagues on the left. Instead of focusing on the  legislation before us, they are resorting to fear tactics and tossing  out false…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…that  these people are putting our country through by putting the grid up  against the wall.\n\nWe have to take into consideration what could come in the future. I  do want to take a moment, and I want to thank President Trump and his  executive order that he knows that this bipartisan committee for coal  was established over the last 30 years, and it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…subjugating the  American economy in the name of consumer protection. This is another  misguided rule that we must render null and void.\n\nMr. Speaker, before I reserve, I want to take a moment to recognize  the good faith efforts of Speaker Johnson in helping maintain a strong  family-centric posture here in the people's House.\n\nLeading from the front and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]