[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Trump's self-enrichment schemes. We need to know  whether the Senate is willing to stand up and show up against this  corrupt self-dealing.\n\nMr. BLUMENTHAL. Mr. President, I want to thank my colleagues Senator  Durbin and Senator Welch for being here today. I know my resolutions  reflect unanimity on our side, and I believe sincerely the reservations  and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…face a vote of  218 more persons who would vote to have you impeached.\n\nI rise to thank them for their courage, but I also rise with my cane  in hand to thank two people. I want to thank John Bonifaz. John  Bonifaz. John Bonifaz. Constitutional scholar, John Bonifaz.\n\nThere are many constitutional scholars in this country. Let me harken  back just a moment…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Medicaid. And even he and his wife  thought about what impact it might have, whether they were able to stay  married or whether he would have to go into a facility.\n\nSo I want to thank you for shining the light and ringing the alarm.  And I want to ask you, what do you think will be the impact on children  in this country without Medicaid?\n\nMr. BOOKER.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, I want to thank Senators Kaine and  Heinrich for introducing this resolution and for taking the floor to  highlight Donald Trump's energy emergency gimmick.\n\nWe Democrats are using every…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Mr. President, I want to thank my friend from Illinois  Senator Durbin for his leadership and commitment to saving public  broadcasting and educational programming for Americans all across our  beautiful…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…were able to  come together and write full-year bills that reassert our congressional  power of the purse and protect many investments that your families rely  on.\n\nSo I want to thank my counterparts: Chair Collins, Chair Cole,  Ranking Member DeLauro, and all of their staff for the endless work on  all of these packages.\n\nAnd I also want to thank our…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…stakeholders. I include in the Record my opening remarks:\n\nThank you to Jubilee--we are so appreciative of their       partnership in providing this space for us today. I want to       also thank tech. I want to thank security, and everyone else.       I think it's very apropos on the wake of the many faith       events that we have been at celebrating the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…more military  escapades without congressional authorization, no more tens of billions  to prop up foreign regimes while American families struggle right here  at home.\n\nI want to thank Senator Kaine, I want to thank Senator Schiff, and I  want to thank Senator Paul for joining with me in this very necessary  resolution. Of course, I thank our great ranking…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I rise today to join my colleagues in  standing up for the right to vote and the critical need to ensure that  that right is protected.\n\nI want to thank Ranking Members Padilla and Reed for their leadership  on this issue and in organizing this floor block. Senator Padilla, a  former Secretary of State himself, understands…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, I want to thank the Senator from New  Mexico for coming out here and making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…chairman. I am honored to serve as  the ranking member with the distinguished Member of this body, Mr.  Joyce.\n\nIf he would like me to yield to him now, I will. If not, I want to  thank him for his leadership of our committee, which has been collegial  and positive. I think it has led to this resolution today.\n\nMr. Chair, I urge strenuously and by the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…was very happy to work with Chair  Collins and address indirect costs to ensure that our scientific  research can continue without drastic interference and disruption.\n\nI want to thank everyone--some of my fellow leaders on the  Appropriations Committee who came to the table for very serious, hard  negotiations to put these bills together. This was not…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…banking.\n\nNone of that exists today. Because of the work of this legislation,  we actually have a regulatory framework that can protect consumers in  the future.\n\nI just want to thank Senator Scott and Senator Hagerty for their  extremely honest and thoughtful approach in working on bipartisan  legislation, which I am very proud of the effort we have…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, before he leaves the floor, I just want to  thank Leader Schumer for all the help. We are going to be focused today  on something that really matters to people, and I thank him.\n\nMr. President, we are beginning, as you…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…amendment?\n\nThe gentleman from New Jersey seeks recognition. He is       recognized for five minutes to speak on the amendment.\n\nMr. Menendez. Thank you, Chairman, and I want to thank my       colleague Mr. Carter, for offering this amendment. You know,       often when we talk about environmental justice our friends       across the aisle roll their…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…really very glad we were able to  reach agreement today to pass these four bills by unanimous consent and  will send them to the President to be signed into law.\n\nI want to acknowledge and thank my colleague and friend from Nevada  Senator Cortez Masto. I also want to acknowledge Senator Markey from  Massachusetts. They worked with us to try to get us to…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…family business, emphasizing the hard work and dedication needed to  run a successful farm. It is because of farmers like Mr. Sola that the  Central Valley thrives, and I want to thank him for his commitment to  our agricultural community.\n\nMr. Speaker, I ask my colleagues in the House of Representatives to  join me in celebrating Mr. Vincent Sola, as…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…tirelessly, who stayed up for weeks on end, who  dealt with ridiculous crises deadlines, who negotiated and renegotiated  in good faith across the aisle to achieve this result.\n\nI want to thank in particular the folks who make the SAC-D  subcommittee work--of course, principally, Rob Leonard, my clerk, and  Rob Karem, who is the clerk for Senator McConnell; but…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…these planes, we must quickly recapitalize these planes to  ensure the U.S. does not lose the critical capabilities provided by the  LC-130 fleet.\n\nBefore I conclude, I want to thank Bob Epp and Dennis Feeney from the  New York National Guard's legislative team, General Steven Slosek from  the 109th Airlift Wing, General Michael Bank, the New York Air…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…honor the trainers,  volunteers, and families who make this work possible.\n\nAs a Navy veteran, I've seen firsthand the impact these dogs have on  our service members. So I want to thank all of those organizations who  are doing this important work.\n\nWe see them. We thank them. We stand with them, and we support them.  I encourage all Americans to join…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695913/recognizing-september-as-national-service-dog-month"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…putting our country through by putting the grid up  against the wall.\n\nWe have to take into consideration what could come in the future. I  do want to take a moment, and I want to thank President Trump and his  executive order that he knows that this bipartisan committee for coal  was established over the last 30 years, and it was a bipartisan  approach…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I yield back all remaining time.\n\nMs. COLLINS. Mr. President, I want to thank all of our colleagues for  their hard work on this bill. I am excited about its impending passage.  I hope that will mean that we will immediately reopen government as…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…noncitizens won't be voting because when  noncitizens vote, it reduces the value of every legal vote.\n\nI would encourage these States to participate in this program. I want  to thank the U.S. Citizenship and Immigration Service for their  improvements to the SAVE Program, and I also want to thank Iowa's  Secretary of State Paul Pate for his commitment…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…of 2025.\n\nWith that, I yield to my colleague Senator Cantwell.\n\nMr. CRUZ. Mr. President, I thank Senator Cantwell and her staff for  their hard work on this bill. I also want to thank my staff on the  committee as well who have put in many hours. This bill is important to  the men and women of the Coast Guard and is important to our national  security.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…here on the floor today to ask  unanimous consent to pass a very important resolution that I try to  move forward every year. It is my Choose Respect Day resolution.\n\nI want to thank Senator Schiff, my lead cosponsor on the other side  of the aisle. And it is to kick off also Domestic Violence Awareness  Month.\n\nAs a former AG like myself, this is really…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…innovation  and drives opportunity.\n\nWe passed a comprehensive economic plan called the working families  tax cut law. It is the central part of our economic plan. I really want  to thank Senator Mike Crapo, chairman of the Finance Committee, for his  hard work on seeing this through.\n\nRepublicans cut taxes. Every single Democrat voted to raise taxes to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…negotiations.\n\nLast week, this three-bill package passed the House by an  overwhelming vote of 397 to 28, and the Senate just followed suit with  a very strong bipartisan vote.\n\nI want to thank and commend our subcommittee chairs and ranking  members as well as their staffs, who labored over the holidays to  finalize this package.\n\nSpecifically, I want to thank…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…prices for American families and businesses. That is why we are working  to roll back the Biden administration's disastrous policies on energy,  like this natural gas tax.\n\nI want to thank EPW, Chairwoman Capito, and the 25 other cosponsors  of my resolution.\n\nI urge all of my colleagues to support this Congressional Review Act  resolution.\n\nI look forward…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…that religious leaders of his stature bring  to the cause of religious liberty.\n\nOn behalf of the people of Alabama, especially the Orthodox community  of my district, I want to thank His All-Holiness for his continued  efforts towards peace for Christians everywhere.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696715/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…to vote for cloture  on the motion to proceed on the bipartisan fiscal year 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  bill.\n\nI want to thank the majority leader for bringing this important  legislation to the Senate floor.\n\nThis bill would address key military infrastructure needs, including  housing improvements…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693982/hr-3944"}]