[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…pretend  this wasn't a major military operation.\n\nThis is the U.S. Congress, and we have a constitutional role to be a  check on the President. Only Congress can declare war, and Congress did  not authorize the use of force against Venezuela.\n\nNow, I opposed the war in Iraq from the outset. And the parallels to  what President Trump has kicked off in Venezuela…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…feared the possibility of a President engaging  in unnecessary wars. In Article I of the Constitution, the Founders  gave Congress, not the President, the power to declare war. Congress  later passed the War Powers Resolution of 1973, which allows Presidents  to engage in military action for up to 60 days without a vote of  Congress, but Donald Trump's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…decision-- so contrary to all the precedent at the time--not to invest such a  vital attribute of state sovereignty in the Executive but to grant the  power to declare war to Congress.\n\nIn April 1798, a future President, James Madison, wrote to another  future President, Thomas Jefferson, underscoring the danger and the  decision. He said:\n\nThe constitution…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…voted in a way that we regretted  so let's not vote at all. Let's not vote at all. Let's overturn the  congressional and constitutional history that says we only go to war  with Congress and try to hide in the grass.\n\nMany of my colleagues have said things about Iran and how bad Iran  is. None of them have ever introduced an authorization for war against…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, why did the Framers vest the power to  declare war in Congress alone? It was because the kings were constantly  plunging their entire nations into wars of vanity, of conceit, of  caprice, of mere whimsy.\n\nThey didn't trust one man…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…recognize a simple truth: Venezuela does not pose an imminent threat,  and a war will do nothing to make America safer.\n\nWe are sleepwalking into another disastrous foreign war, and Congress  must wake up and stop this before it is too late.\n\nMr. Speaker, I urge my colleagues to support this resolution.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Staff--admit on the record that Donald Trump  ``wants to keep on blowing boats up until Maduro cries uncle.''\n\nFolks, the fact of the matter is, Congress has not declared war, nor  has Congress authorized the use of military force in Latin America. Do  you want to have that debate? Let's have that debate. Let's put that up  for a vote if you agree, but that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…this: Americans do not want another war. They  don't want American servicemembers put into harm's way, either flying  missions or with boots on the ground, for a war not authorized by  Congress. Mothers and fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if their kids  will be the ones who have to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a different point of  view than I on this point, but I think we should all be able to agree  in the fundamental constitutional principle that says we shouldn't be  in a war if Congress doesn't have the guts to debate it and vote on it;  that we should all, in having taken an oath to the Constitution, at  least support the principle that war is something…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Trump administration's lack of serious planning for the next phase.  That is why this War Powers Resolution is necessary.\n\nThe Constitution vests the power to authorize war in Congress, not  the President. President Trump has claimed this was just a law  enforcement mission. That is absurd. No matter how he describes it, the  President waged war on a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, no President, Democrat or Republican, can  declare war without Congress. Congress is the branch of government  vested with this solemn responsibility.\n\nPresident Trump has not requested or received any authorization for  the use of military force…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698452/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…debate, without authorization.\n\nWhich brings me to the matter of constitutional authority. The  Constitution is unambiguous. Article I, section 8 vests the power to  declare war in Congress, not in the executive branch. This was not an  oversight by the Founders; it was a deliberate choice borne from hard  experience with monarchs who could commit their nations…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Now, I ask my colleagues who have not joined us: How long will you  stand by and be on the sidelines of the most consequential decision a  country can make, to go to war?\n\nAre we a Congress or are we cowards?\n\nWill you stand up for the American people, and do what is right?", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…declarations of war?\n\nThe answer is no. They do exist. We have been able to find 130  examples of a Commander in Chief using military force without a  declaration of war by the Congress and also without congressional  authorization under the War Powers Act.\n\nOne example is in 1989, when President Bush 41 literally invaded the  country of Panama. He…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…They worried  about having too much power with the President, and so they severely  constricted the power of the Presidency. They said the President  couldn't take us to war; only Congress could. They said the President  couldn't spend money; only Congress could. They said the President  couldn't tax people; only Congress could.\n\nThese were the very bedrock…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Congress has only declared war five times,  does that mean all of these other military operations are illegal? No.  That is ridiculous.\n\nBecause we have power to declare war--us, the Congress only--it  doesn't mean the Commander in Chief can't be Commander in Chief.\n\nThis country cannot be put in a legal state of war unless the  Congress decides to do that,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…defensive  measures or hot pursuit of an enemy or retaliatory strikes. That is the  distinction they debated when they substituted ``declare war'' instead  of ``make war'' among Congress' enumerated powers.\n\nThe supporters of this resolution are correct. Congress has to  initiate hostilities, but neither of these resolutions are applicable  to current…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…Capitol.  Over 50 years later, on July Fourth, Members of this body gathered once  again to lay a second cornerstone.\n\nOnce more on July Fourth, at the height of the Cold War, Congress  laid a third cornerstone. This week, with this vote today, with our  Nation's birthday being tomorrow, we lay a fourth. With this bill, we  can vote as stewards of that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Constitution is clear: Congress, not the  President, has the authority to declare war. The Founders were  unanimous in proclaiming that the power to declare war belonged  exclusively to Congress.\n\nJames Madison, the father of the Constitution, said that the  executive branch was the branch most prone to war; therefore, the  Constitution, ``with studied…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…versus Presidential prerogative, and it should be about the  Constitution.\n\nThe Constitution specifically, thoughtfully, vested the power of  initiating war and declaring war to Congress. They talked about it.  They talked about it in the Constitutional Convention. They wrote about  it in the Federalist Papers, and from Hamilton to Jefferson, the  spectrum…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…against us tomorrow when the reins of power change  hands. That is precisely why our loyalty must be to the Constitution  and not to any party.\n\nIf our country wants war, then Congress must vote on it. We are the  voice of the people. There is a reason so many of our offices bear a  Prisoner of War/Missing in Action Flag. It is a solemn reminder of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]