[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…letter to William Cabell, James  Madison said this:\n\nIn no part of the constitution is more wisdom to be found       than in the clause which confides the question of war or       peace to the legislature, and not to the executive       department.\n\nA few years later, in another letter, this time to Thomas Jefferson  as part of their famous correspondence,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…elected Representatives  in Congress. That authority is not optional; it is not symbolic. It is  actually a pillar of democratic accountability when it comes to matters  of war and peace, to life and death.\n\nThe Senate has now spoken with a clear bipartisan voice: Trump must  end his dangerous and illegal military action in Venezuela now. This  Senate must…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…particularly appreciate that my colleague from Virginia  Senator Kaine has proposed this War Powers Resolution, a resolution  that reaffirms a basic principle: The decisions of war and peace belong  under our Constitution to Congress, not to the President.\n\nBut on June 21, President Trump ordered strikes on three Iranian  nuclear facilities. There was no congressional…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…plans? How far are they going? Is Donald Trump  about to drag America into another endless war?\n\nAnd again, I didn't get any satisfying answers.\n\nWhen it comes to matters of war and peace, Congress needs the truth;  the American people need transparency. Anything less is a total  disservice to our men and women in uniform and to every citizen of this  country.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697769/caribbean-boat-strike"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…either party to sanction military force that  Congress has not considered or approved.\n\nIt is time for Congress to reclaim its constitutional authority over  matters of war and peace, its Article I war powers, by removing these  open-ended AUMFs once and for all.\n\nI am thankful to my colleagues who have worked to pass these repeals,  having nearly passed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…East is not  America First. That is why Congressman Massie and I will introduce a  bipartisan Iran war powers resolution.\n\nAmerica First means Congress first on matters of war and peace. Every  Member in this body must go on the record about whether we should have  another endless war in the Middle East.\n\nThe American people are sick of billions of dollars…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700215/no-more-middle-east-wars"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…into harm's way without so much as a debate in Congress.\n\nToday, the Senate has a chance to move forward on asserting  Congress's constitutional authority on matters of war and peace. We can  tell Donald Trump: Enough with foreign adventures. It is time to focus  on lowering costs here at home. That is what the American people want.\n\nThis resolution…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. Speaker, I want to start by saying something simple that  shouldn't be controversial in the people's House. On questions of war  and peace, on questions of life and death, Congress is not supposed to  be a potted plant. We don't get paid to outsource hard decisions. We  don't get brownie points for showing…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…close to dragging us into a disastrous and unauthorized  war, this bill does not do enough to reinforce Congress's role as a co- equal branch responsible for matters of war and peace.\n\nTo be clear, the bill contains many provisions I am proud of. As the  Ranking Member of the Readiness Subcommittee, I fought for military  construction projects that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…keep coming back to this  Chamber. I am going to keep raising my voice and keep demanding what is  actually in our Nation's best interest because I don't make decisions  of war and peace based on how tough I want to look on Truth Social.\n\nAs I celebrate my Alive Day next week, I am going to do my damnedest  to make sure other troops get to come home to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…find its voice, it is  now. The Senate must act to stop Donald Trump's folly.\n\nToday, the Senate must assert the authority given to it in the  Constitution on matters of war and peace. We must send Donald Trump a  clear message on behalf of the American people: No more endless wars.\n\nIf any of my colleagues--if any of the American people--doubted what…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…resolution. I was  proud to co-lead Ranking Member Meeks' effort, and I urge all my  colleagues to join us today in reasserting this body's constitutional  authority on matters of war and peace.\n\nLet's be perfectly clear: Only Congress has the power to declare war.\n\nThe Trump administration's military escalation in the Caribbean is  not only reckless, it is blatantly…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698240/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…don't think that is worthy of emulation by the ``greatest  deliberative body'' in the world. We shouldn't be afraid to debate or  discuss anything, especially matters of war and peace.\n\nSecond, an argument that the Venezuelan campaign is not ``imminent  hostilities'' within the meaning of the War Powers Resolution is a  violation of every reasonable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…seems ready to lead our troops over the  Rubicon with a blindfold over his eyes, and that is a recipe for  catastrophe.\n\nCongress must assert its authority on matters of war and peace, and  time is of the essence. Multiple warships have been moved from other  ports of the world to be just off the coast of Venezuela. By some  estimates, 10 percent of…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…It has       accordingly, with studied care, vested the question of war in       the Legislature.\n\nThat is our Constitution--vested in the legislature because issues of  war and peace should never be entrusted to one person. It is too  tempting. That is why our Founders put it in the responsibility of this  Congress.\n\nSo to my colleague from Virginia,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…davening flowers held. Sway till halted singing from deep       within. Surging souls yearning to bond across. Man--made       borders--barriers to be. Breached for war or peace, To yet       prevail with heightened cadence. Of Shalom's invisible,       ever--surviving promise!", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697096/recognizing-october-7-revisited"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…therefore, to oppose this ill-conceived joint resolution.\n\nAs a U.S. Senator and former Ambassador to Japan, I understand and  respect the role that Congress plays in matters of war and peace, but I  cannot and I will not support a resolution that removes the ability of  the President of the United States to act decisively in defense of  national interests,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Androscoggin Lake,  turning quaint farmstands into a seasonal retreat in central Maine.\n\nThe proud history of Leeds is etched in stone atop Monument Hill,  where the Civil War Peace Monument stands as a tribute to the town's  extraordinary service. Erected by the distinguished Howard brothers in  1895, this monument honors the 161 local soldiers and…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…agencies, and perhaps it will soon restore Congress'  exclusive control over tariffs. I certainly hope so.\n\nReasserting Congress' supremacy and the momentous question of war and  peace will require a serious and sober discussion in Congress. When I  hear the hyperbolic and hyperpartisan rhetoric of the Democrats in this  House with their hatred of Donald…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…remains one of the most important  documents in American history.\n\nPresident Washington completed his two terms as our indispensable  first President. He was first in war, first in peace, and first in the  hearts of his countrymen.\n\nEvery step of the way, he viewed his actions through the lens of the  precedent it would set for the Presidency and for…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…variants of the  RC-135 and the EC-130H and EA-37B Compass Call electronic attack  aircraft. The sun truly never sets on the Fightin' Fifty-Fifth.\n\nOver the last 85 years of war and peace, missions and aircraft have  come and gone, and operating locations have changed as the needs of the  nation have evolved. Throughout it all, the men and women of the 55th…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and simple. No provision in the  Constitution provides such power to the Presidency.\n\nNo Supreme Court has allowed the Congress to abdicate its role in the  decisions of war and peace, and no Congressman of any self-respect will  argue otherwise.\n\nOur leaders debated fully whether or not to grant this power to the  President. To a man, from Jefferson…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…13 American Colonies.\n\nIt was the beginning of a force that would go on to secure our  freedom, shape our Nation's history, and stand as a pillar of strength  in times of war and peace.\n\nAs the oldest and largest branch of our Armed Forces, the U.S. Army  has played a central role in defending our Nation, upholding our  values, and advancing peace around…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…in the  legislature.''\n\nMadison would further state that ``in no part of the Constitution is  more wisdom to be found than in the clause which confides the question  of war and peace to the legislature, and not to the executive  [branch].''\n\nHamilton, who didn't always agree with Madison or Jefferson, wrote  that ``the Legislature can alone declare…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…have worn the  uniform of the National Guard, past and present. We salute their  sacrifice, their courage, and unwavering dedication to serving the  American people through war and peace, disaster and recovery, and every  moment in between.\n\nHappy birthday to the National Guard.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the Guard was there.\n\nThese are our neighbors, our coworkers, and our sons and daughters.  For generations, they have trained and deployed from Spokane, not just  for war but for peace, safety, and recovery.\n\nOn this Memorial Day, we thank them. We remember those who laid down  their lives in uniform, and we honor the Spokane Readiness Center as a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}]