[{"senator": "Donald Norcross", "party": "Democrat", "sentence": "…what it is like to work in a bipartisan  fashion and to Chairman Wittman for what he does each and every day to  make sure that we work together to make sure we support our  warfighters.\n\nThis bill continues the Tactical Air and Land Forces Subcommittee's  proud, bipartisan tradition and reaffirms our shared responsibility for  managing this risk.\n\nI am,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Marines have not only fought our wars, they have also responded to  humanitarian crises, assisted in natural disasters, and stood sentry in  times of peace. They are not just warfighters; they are ambassadors of  American resolve and resilience. This milestone of 250 years is an  opportunity to reflect, to honor, and to recommit.\n\nWe honor the thousands…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…exactly how we might expect.  In October, at Quantico, he told hundreds of generals and admirals:\n\nDon't fight with stupid rules of engagement. We untie the       hands of our warfighters to intimidate, demoralize, hunt and       kill the enemies of our country. No more politically correct       and overbearing rules of engagement, just common sense,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…really  important because what it is about is getting the Pentagon to be able  to buy the equipment, the innovative equipment, that it needs to adapt  quickly so that our warfighters can have what they need to meet the  challenges of the modern battlefield. It is way too slow right now, too  many programs, way over budget, and not delivering as advertised.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…require special storage and resilient  infrastructure if we expect them to perform in combat effectively.\n\nAs climate change creates a more challenging environment for our  warfighters, the DOD should be leading the charge in research and  adaptability.\n\nI feel especially strongly that the DOD, in firing its scientists and  throwing research in the trash,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…expands AI pilot programs and logistics, cyber  defense, intelligence, and maintenance. AI is a vital force multiplier,  cutting costs, speeding decisions, and keeping our warfighters ahead.  It also mandates regular reports to Congress for swift, informed action  to maintain our edge.\n\nMy second amendment ensures an immediate pay raise for Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695229/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…that was worked in a bipartisan, bicameral  fashion.\n\nThis year, we focused a lot of our efforts on fixing the Pentagon's  broken acquisition process, which is failing our warfighters. The  fiscal year 2026 NDAA includes a series of reforms to put commercial  solutions first, eliminate regulatory burdens, and end bureaucratic  inertia. It also puts in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…while saving  taxpayers over $20 billion through cutting inefficient programs and  government bureaucracy.\n\nThis is a bill that meets the moment and the need to support our  warfighters to protect our Nation. I applaud the work of the committee  to bring forth this strong and bipartisan bill. I encourage all of my  colleagues to vote ``yes.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…taxpayers over $20 billion through cutting inefficient programs and  government bureaucracy. This is a compromise bill that meets the moment  and the need to support our warfighters and protect our Nation.\n\nMr. Speaker, I applaud the work of this committee to bring forth this  strong bipartisan bill, and I encourage all my colleagues to vote  ``yes.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…This amendment will give the IBWC access to additional funding  sources, enabling it to properly maintain these assets and, in turn,  support cleaner training waters for our warfighters while strengthening  security along our southern border.\n\nThis amendment is the same text as H.R. 1948, which was favorably  reported out of the Committee on Transportation…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…bringing this critical piece of  legislation, which is vital to the national security of our Nation, to  the floor for the 65th consecutive year.\n\nThis year's NDAA puts our warfighters first by streamlining  procurement and ensuring they receive the capabilities needed to  counter the increasingly sophisticated actions of our adversaries,  particularly…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697804/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…categories would be immaterial.\n\nMr. Speaker, I urge the passage of this bipartisan NDAA so we can  deliver on our promises to servicemembers and their families, making  our warfighters lethal, better trained, and more prepared for the  future fight, while ensuring their quality of life is the standard  Americans expect us to provide their brave warriors.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697792/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Veterans'  Affairs, he fights tirelessly for our brave servicemembers and  leverages his expertise as an Army Acquisitions Officer to deliver  critical capabilities to our warfighters. He is also a champion for  expanding vocational education for all students, ensuring they are job-  or college-ready upon graduation.\n\nCOL Wilson continues to lead with…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…environment, something  the Department of Defense has struggled with in the past.\n\nThis bill takes a long-overdue step to ensure the quick delivery of  advanced capabilities to our warfighters when and where they need them.  I am confident that this bill, along with the number of targeted  amendments that we have been privileged to lead, will help lead in that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…General Allvin, chief of staff of the Air Force; Admiral Kilby,  the Acting CNO; and General Caine, our Chairman of the Joint Chiefs.\n\nThese experienced and highly decorated warfighters all see the  operational necessity of both generation-six aircraft, so who is  against it? Bean counters and academics are against it. Those wearing  suits to work, not…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…simple creed: Mission first, and no Americans left behind.\n\nMy bill is an embodiment to that promise. This isn't partisan  posturing. This is about doing right by America's warfighters. The  House Committee on Veterans' Affairs agreed. They voted for my bill by  voice vote without opposition. There was zero dissent. There was  complete consensus and stakeholder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…with unmatched commitment and devotion.\n\nDrawing on nearly two decades of combined Active-Duty and Air  National Guard service, he elevated the CRTC's role in preparing  warfighters for great power competition.\n\nUnder his leadership, the center continued hosting quarterly large  force exercises, training specialists in theater-deployable  communications,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Management Command. There, he played a critical role in fielding  and training troops on Individual Gunshot Detection equipment, ensuring  the safety and effectiveness of our warfighters during Operation  Enduring Freedom.\n\nFollowing his retirement from active duty, Master Sergeant King  remained with his family in Michigan. He supported the University of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Madam Chair, America's warfighters rely on more  than courage and training. They rely on an uninterrupted supply of  expertly manufactured weapons, parts, and ammunition. That lifeline  begins with our Army…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…story. North Alabama has been at the forefront of  innovation, from the rockets that carried our astronauts to the Moon,  to the systems that now protect our homeland and our warfighters. We  have earned the nickname ``The Rocket City'' because innovation and  national defense are in our DNA.\n\nSpace Command is charged with ensuring America's superiority…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}]