[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to extend a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of the world's Orthodox Christians and the head of the  Ecumenical Patriarchate of Constantinople.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…side.\n\nIt is disgraceful, if we are being honest here, Mr. Speaker. As bad  as these two bills are--and I can't emphasize enough that they are  really bad--they are just the warm-up act. In fact, this is filler. We  weren't even supposed to be dealing with these bills. We were supposed  to be dealing with the budget reconciliation bill. Mr. Speaker,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…sleeping in their  car.\n\nI ask my Republican colleagues: How many of them have constituents or  friends or neighbors who have sat in their cars after leaving the bar  to stay warm? We know how cold Midwest winters get. Should we really  criminalize people for staying warm in their cars and sleeping off a  hangover? Under this bill, people would now be…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…for a strawberry milkshake,       and sitting in her chair and reading the latest Janet       Evanovich book. My grandmother's talent for hosting and       making her home so warm for others lives on in her daughter       Patty. People are always comfortable under her threshold. A       tradition she proudly carries on every single day.\n\nDee Dee was a…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…we need, Mr. Speaker, are  four Republicans from this group to join us, and we can stop these  devastating cuts to Medicaid.\n\nJoin us. We welcome you with open arms into the warm embrace of  Members of Congress who are here to protect the healthcare of the  American people. Just four of y'all, we welcome you with open arms into  the warm embrace of Members…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…as we honor Doug today, I know plenty of people  who disagreed with him, but I don't know anyone that disliked him. When  you hear these qualities about his authenticity, his warm sense of  humor, just how relatable he was, that is all very, very true.\n\nI go back almost 20 years with Doug because we were in the State  legislature together. A lot has been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Eugene: Jennifer  Denton.\n\nSince 2015, she has led as executive director of Burrito Brigade, a  volunteer-driven nonprofit that has hand-delivered hundreds of  thousands of warm, nutritious meals to hungry people across Eugene and  Springfield. She also created Free Little Pantries, giving neighbors a  way to share food directly with those in need.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695683/recognizing-jennifer-denson"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Our district is  proud of the partnership and leadership of this community, not only in  creating innovative and essential programming for our neighbors, but  for creating a warm and welcoming experience for all residents.\n\nThe 12th Congressional District congratulates Warrendale Community  and all of its neighbors on their steadfast service to community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695383/recognizing-the-100th-anniversary-of-the-warrendale-community"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…he was running  for President, said he was going to address.\n\nI have heard from many New Hampshire families about how these tariffs  will raise prices for keeping their homes warm, for putting gas in  their cars. Now the Trump administration has reportedly fired the  entire staff of the LIHEAP program that helps families and seniors heat  their homes…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…participating as persons  who are aiding and abetting, if you will, many of them will find, as  they are finding out currently, that they are going to be received in  less than a very warm way when they find themselves having townhall  meetings. They are already experiencing this. That is why many of them  are not having their townhall meetings.\n\nThey are going…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…his face, and you smile. You  can always find him near the Chamber, working as a doorkeeper, at the  elevators, or up in the Gallery. No matter the role, he is  professional, warm, and a positive presence that makes the Senate come  to life.\n\nHe has been wonderful to our staffs, as well--kind, steady, and  generous in the way that matters every day in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…operations, combined with his steady guidance and  collaborative spirit, helped modernize the facility and expand its  impact across the Greater Rochester region. His ready smile and warm  personality have been the hallmark of his tenure, and his decades of  service reflect not only professional excellence but also a genuine  commitment to the people and institutions…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…have granted these Clean Air Act waivers that are  essential for reducing toxic air pollution, protecting public health,  and cutting greenhouse gas emissions that dangerously warm our planet.  No Congress has ever dared to revoke these waivers--until now.\n\nMy Republican colleagues say this is about protecting consumer  choice. Well, let me ask: Who is…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today to extend a warm welcome to  His All-Holiness Ecumenical Patriarch Bartholomew, the Spiritual Head  of the Eastern Orthodox Church, the second largest Christian Church in  the world. It is a…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…other countries. And what the President  is doing amounts to a new tax for Americans. For example, heating oil  and propane that keeps hundreds of thousands of Granite Staters warm in  the winter is going to cost more. We are going to add about $150 to  $250 to the cost of heating homes in New Hampshire.\n\nAnd gas prices are going to go up. In New Hampshire,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…every  event hosted--always the first to arrive and the last to leave. Whether  she's assisting with youth programs, supporting fundraising  initiatives, or simply offering a warm smile to a member in need,  Teresa gives selflessly--never asking for recognition, but always  making a difference. Her enthusiasm is contagious, inspiring both staff  and fellow…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…media trends and analytics.  She brings years of experience within the Blue Band, most recently as a  leader of the piccolos. The Blue Band's drum major leads the band  through warm-ups and performances.\n\nSince 1977, it has been a tradition for the drum major to do a front  flip as the band enters the field at home football games. Ellie  continues this…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…nature, enjoy  healthy competition, and create lasting memories.\n\nArrowhead Pointe exemplifies the best of public golf, offering a  world-class experience, welcoming players with warm southern  hospitality, and fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community well-being.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Act of 2025.\n\nUtah is in a wildfire crisis. Our unique environment makes wildfires  a constant danger. It is common to drive down I-15, a major  thoroughfare in Utah, in the warm months and see fire on the side of  our beautiful mountains.\n\nIn 2004, Congress created three regional centers in Arizona,  Colorado, and New Mexico dedicated to strengthening…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698236/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to know that my prayers  are with you and Lori.\n\nYou see, that was the fourth anniversary of my dear wife Lori's  death, and how he knew that, remembered it, and offered such warm  comfort on such a cold morning tells you what a truly caring and  wonderful man he was. And now he is gone, for time is fleeting.\n\nYet, death can't take the kindnesses and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I rise today to extend a warm welcome to  His All-Holiness Bartholomew, Archbishop of Constantinople, New Rome,  and Ecumenical Patriarch, on the occasion of his official visit to the  United States. His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…worldwide and ranked  them across numerous categories. St. Simons Island, the largest barrier  island on Georgia's Golden Isles, offers low-hanging Spanish moss,  salty air, and warm ocean water. It is home to pristine beaches, miles  of walking paths and trails, ice cream shops, and award-winning  restaurants. Despite this, St. Simons has still managed…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…here today as a  freshman Member. I didn't know Doug long, but I met him on one of our  first days in the orientation sessions and the planning sessions for  Congress. He was warm. He was friendly. He was helpful to a new  freshman who didn't know much.\n\nFrom there, I learned how fun he was. He loved to play with my last  name, ``Fedorchak.'' He used…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…and education.\n\nI thank them for dedicating their time, their energy, and their  passion in advocating for every human life.\n\nMr. Speaker, I ask that you join me in giving a warm welcome to the  Friends of Club 21 Choir.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…her energy, expertise, and creativity to every initiative.  Whether planning events, setting up for activities, assisting with  vendor coordination, or welcoming guests with a warm smile, Cindy is  always at the forefront, ensuring that every detail is executed  flawlessly. One of Cindy's most significant contributions has been her  work in supporting…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN. Mr. Speaker, I rise today to extend a warm welcome  to His All-Holiness Bartholomew, the Ecumenical Patriarch of  Constantinople and spiritual leader of Orthodox Christianity.  Recognized as ``First Among Equals'' among…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…naturally fosters camaraderie  which is great for anyone who works or volunteers at the Center. All of  these women maintain a loving demeanor and greet each client with a  warm smile and conversation (and sometimes a hug). The Center's clients  feel welcomed and cared for because of the lived values of love,  respect, compassion, and family centeredness…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interest.\n\nThe wheels are coming off, and, instead, the brain trust of some of  these folks--okay, I accept the tonal quality of some of the folks out  of the White House isn't warm and cuddly, but do you go around  neighborhoods, offices, and stick Nazi signs on their cars?\n\nMy wife drives a Tesla. We bought it a couple years ago. It is funny,  at that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Business Resilience Act, led by my colleagues, Representatives  Morrison, Downing, Pappas, and Bean.\n\nAs we look ahead to the summer months, many Americans are eager for  the warm weather and sunshine, but with that comes the reality that  hurricane season is approaching. Many communities, particularly in  rural America, are still working to recover from…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…received its charter, thus marking the beginning of its  formal governance and development.\n\nColeman was first settled in 1882 by pioneers who farmed the fertile  lands of the Warm Springs Hammock. The Florida Gazette of 1886-1887  listed Dr. B.F. Coleman, a physician and one of the area's earliest  settlers, as the town's namesake.\n\nMany early settlers…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}]