[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nuclear  arms control. He can follow in the footsteps of other Republican  Presidents. President Eisenhower, in his ``Atoms for Peace'' speech,  expressed the moral imperative to warn Americans and the  world of the destructiveness of atomic weapons.\n\nPresident Reagan in his second term negotiated the INF Treaty with  the Soviets. He spoke privately with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…--Medical institutions, like the CDC, NIH, and major       research centers around the country must defend science with       non-partisan funding of medical investigation and warn of the       dangers of abandoning global engagement on pandemic       prevention.\n\n--Universities and media must protect free speech. Without       a unified stance, they will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…on which pollution       alerts are declared has gone down. And if you live near a       river, you may have noticed that the signs have been coming       down that used to warn people not to fish or swim.\n\nWe came to Washington committed to respect the great bounty       and beauty of God's creation. We believe very strongly--\n\nReagan said--…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the main draw, Evanston organizers also handed out  ``Know Your Rights'' cards and whistles along with the toiletries.  Those whistles have been used by community members to warn others when  ICE agents are in the area.\n\nThis is what an American community looks like: It is organizing to  stand together to defend their neighbors. And while no community…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…harder to afford to stay in their homes.\n\nWe are preparing for another hurricane season. Folks along the Gulf  Coast need a National Weather Service that is functional that can warn  us about the threats ahead. We need the hurricane hunters out in the  Gulf telling us how severe the storms are going to be, but the Trump  administration and Republicans in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…clear: The last 100 days have not been an accident or a  fluke. He has done exactly what he said he was going to do. He gave us  the blueprint in Project 2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within weeks of taking office, the  Department of Education quietly rescinded guidance encouraging schools…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…working-class  families.\n\nAgain, Mr. Speaker, CHC stands with our community and rejects the  Republican budget betrayal.\n\nMr. ESPAILLAT. Mr. Speaker, we stood here tonight to warn the  American people of these massive cuts in vital programs like the  Medicaid program, SNAP, and the Food Stamp program, which provides  nutritional assistance to our families,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Karen Fernandes and Andrea Gardner, also leaders in this effort.\n\nDespite years of false starts and half apologies, the FDA has still  not actually said sorry for failing to warn the public in time.\n\nMr. Speaker, these people deserve that formal apology. Until then,  Congress ought to pass my resolution, H. Res. 342, which establishes  DES Awareness…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693582/no-apology-from-food-and-drug-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the ballot box: Americans are  tired of paying more for the things they need. They are tired of Donald  Trump mocking them because they can't afford the things they need.\n\nI warn my Republican colleagues: As the Florida and Georgia elections  last night showed, you follow Donald Trump to your own doom and our  country's doom.\n\nDonald Trump might claim…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Act, bring in the military,  the only thing left is martial law. He hasn't said that he will resort  to martial law at this time, but I want to say this: I have been trying  to warn you. I have been trying to warn the American people that this  President is moving us toward a dictatorship. I was among the very  first, if not the first, to say publicly that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…less than 2 years from retirement.\n\n``Who is going to run the government? You know, provide services that  keep the planes in the sky, the power flowing, the food safe, and warn  of pending major life-threatening events, events like hurricanes and  infectious diseases? Who will want to work for the American people  after this latest attack? Stop abusing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…has caused the World Economic Forum to elevate ``ecosystem  collapse as a mid- to high-level global risk.'' Other studies advance  the concept of planetary insolvency. Others warn about our continued  fossil fuel pollution: If left unchecked, ``then mass mortality,  involuntary mass migration, severe economic contraction, and conflict  become more likely.''…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…crisis--including widespread gang violence,       political instability, and economic collapse--ignores       conditions that even the U.S. State Department continues to       warn make travel unsafe. The consequences of this decision       are       not abstract or speculative; they are immediate and deeply       human. If allowed to proceed, the termination…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fanatical dislike of all government, and so they just cut it. They  don't even know what the effect will be. They don't even care. Just  cut, cut, cut. Cut meteorologists who warn our people, our citizens,  our farmers, our businesses of dangers that might come? Cut them? They  are not waste.\n\nTheir recklessness is hurting rescue efforts. It has hurt…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…alone put that trend in jeopardy.  Just as a return on investment, this is astonishingly bad. For every $1  spent by American taxpayers at NCI, they get almost $3 back. Experts  warn that we will lose a generation of scientists because of this  recklessness.\n\nI urge the administration and my Republican colleagues to reverse  course, maintain our global leadership,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population. We have been working on that to sort of modernize  it, and so for all the lobbyists who are making money trying to beat us  up for trying to actually fix it, I will warn you that the legislation  is almost done. We now have to work with the economists and others to  score it. We have been stunned though that it continues. Even last  Thursday,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "Mr. TUBERVILLE. Mr. President, I came to the floor earlier this year  to warn of the imminent threat that Islam poses to our great country.  Unfortunately, that threat turned into reality just a few weeks ago  when a deranged jihadist shot two of our…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…20 issue such as this cannot get 60 votes in this 100-person Chamber,  something is amiss.\n\nNow, some of my colleagues have raised concerns regarding voter  suppression. They warn that many U.S. citizens do not have a hard copy  proving their citizenship. The SAVE America Act directly addresses this  concern. It puts in place alternate documentation options,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Gray Wolf Population Reduction in Washington State\n\nMr. BAUMGARTNER. Mr. Speaker, with gray wolf populations reaching  over 400 in Washington State and Oregon, I rise today to warn of the  danger they continue to pose for hunters, farmers, and livestock.\n\nGray wolves can consume up to 7 pounds of meat a day. Their primary  food sources include deer, elk,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}]