[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…CHARTS'\n\nScammers are already taking advantage of the chaotic       moment, according to internal emails obtained by The Post.       Last week, employees in several offices were warned that       seniors were reporting receiving emails from accounts       pretending to be linked to Social Security. The messages       asked recipients to verify their identity…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…deported with their families to Nazi concentration       camps.\n\nMore than 13,000 Jews were arrested that same month, most       were sent to their deaths. Luckily, my mother was warned by a       sympathetic policeman. Immediately she went into hiding. She       then obtained forged identity papers and, with the help of a       smuggler, set out to cross…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…vulnerable members  of our community.\n\nNonpartisan health policy experts, economists, and medical groups,  including Healthcare Association of New York State, have already warned  that the impact of gutting this program will be felt by all, including  those with private insurance.\n\nEvery American can expect higher costs and reduced access to care.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…monthslong campaign built on dubious legal arguments,  institutional failures, and Congress' willful abdication of our  constitutional duties.\n\nFor months, my colleagues and I warned that President Trump's  military campaign against the alleged drug boats was strategically  incoherent and legally questionable. We warned that the massive  military buildup…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…several  of our Republican colleagues are interested in extending the ACA  enhanced premium tax credits, the time for us to act is now. The  President's own pollsters have warned that not extending these tax  credits would be a political catastrophe for the GOP.\n\nI would hope that we could all agree that addressing the  affordability crisis that Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…``greenhouse effect'' driving global warming.  That was 1896.\n\nIn 1968, at a celebration of the hundred-year anniversary of the  fossil fuel industry, the physicist Edward Teller warned that  greenhouse gas emissions from burning fossil fuels cause a greenhouse  effect and that increased use of fossil fuels would cause global  warming and severe sea level…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…talking about what is happening in this Rescissions Act.\n\nDon't take it from me. Just take it from Navy Admiral William  McRaven, who was a Navy SEAL and a 4-star admiral. He warned that  cutting State Department USAID will put every American at risk.\n\nThis is the quote: ``This is no time to weaken any element of  America's power. The dismissal of highly…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…fact, raise the price of  goods for Americans.\n\nDon't take my word for it, listen to the National Association of Home  Builders, a staunch Republican organization that has warned this  administration that putting tariffs on everything from steel to copper  and nickel is going to drive up the price of home construction.\n\nIn fact, screws and nails, made…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…jobs in Oregon depends on trade,  and the trade jobs often pay better.\n\nSpeaking with small businesses and workers all over Oregon--I did it  just last week--every single one warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon. But some of their  ingredients--like…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…who had been  unsuccessfully trying for years to get their hands on those chips.\n\nInside our own government, national security officials tried hard to  stop this deal. They warned that handing advanced AI chips to the UAE  would have serious national security consequences. Look, some of these  chips would go to G42, a UAE AI company that American national…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…trailblazing leader, Dr. Martin Luther King, Jr. Today, I  speak with urgency about the American Dream; specifically, that dream  being under attack.\n\nMore than 60 years ago, Dr. King warned this Nation that America had  given Black Americans ``a bad check, a check which has come back marked  `insufficient funds,' '' a promise made but not kept, opportunity  delayed…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699199/building-a-beloved-community"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…like this. I remind everybody who is  responsible for supersizing the ICE budget and bringing us to this  place, it was Republicans in Congress who did this, even though we  warned them that this is what would happen.\n\nICE needs to be dismantled. Secretary Noem needs to be fired, and  Stephen Miller has to go. He is the mastermind of this ghoulish plan.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699663/horrific-ice-abuses"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…officers and communities by       weakening their efforts to keep weapons out of the hands of       dangerous persons.\n\nThe Bureau of Alcohol, Tobacco, Firearms, and Explosives warned that:\n\nThese weapons could be used against law enforcement,       security personnel, or the public, creating an increased risk       of harm to public safety. They also would…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…when he said: ``We shall pay any price, bear any burden, meet any  hardship, support any friend, oppose any foe to assure the survival and  the success of liberty.'' Then he warned that those who ride the back  of the tiger would end up inside it. He warned against that, and I hope  our Nation never goes down that lonely, dark path.\n\nIn a contemporary…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…$1 trillion from  the Medicaid Program. Wait until that cut works its way through the  economy to your local hospital and clinic, and watch what happens.\n\nThey have already warned us: Unless something is done, there is going  to be a lot of closures and a lot of reductions of services in these  hospitals in rural areas, in small towns, and the inner…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…at the park are now blocked by protest signs. A Yosemite  biologist told gullible reporters that the staff cuts would doom the  Sierra Nevada red fox to extinction. Others warned that layoffs would  result in visitors stuck in restrooms and fires raging out of control.\n\nThis is human sacrifice, dogs and cats living together, mass  hysteria, as a ``Ghostbusters''…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cancel our sessions, every  oversight hearing, every markup of legislation, everything. Why? To  this day, there has been no coherent rationale offered.\n\nThroughout this time, I warned that this was not only holding back  our own legislative priorities but was also making the House irrelevant  in any deal to reopen the government. Of course, that is what…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…to ensure  that it continues.\n\nAlaska's business community stands with them. The Alaska Support  Industry Alliance, representing 547 companies and 35,000 Alaskan  workers, warned that the 2022 plan jeopardizes the jobs and investment  that their families depend on. National organizations from the National  Federation of Independent Businesses to the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…President John Fitzgerald Kennedy, who realized-- getting the appropriate quote--realized the negative impacts of high  tax rates. Indeed, roughly 60 years ago, President Kennedy warned:  ``The largest single barrier to full employment of our manpower and  resources and to a higher rate of economic growth is the  unrealistically heavy drag of Federal income…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to address and try to disrupt  the elections in Romania and the Republic of Georgia.\n\nOpen borders for dictators puts all Americans at risk of more 9/11  attacks imminent as warned by the FBI. President Donald Trump is  reinstituting existing laws which are successfully securing our border  to protect American families with peace through strength.\n\nToday…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…addressed years ago. It is kind of  a well-worn anecdote, but I will say it again. Patrick Monahan, a  Democrat U.S. Senator, in the late 1960s put together a study, and he  warned the degree to which we had these programs contributing to the  breakdown in marriage, but nobody paid attention Patrick Monahan.\n\nAnother man who did a lot of work in this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…power them while ensuring our constituents  have access to reliable and affordable energy.\n\nWe saw how close we were to power scarcity in Ohio over the summer,  as utilities warned Ohio residents to reduce energy power during peak  demand to help prevent rolling power outages. Ohio families should not  have to face a power emergency for running their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…This is why Congress should reauthorize this critical program so that  communities near volcanoes are provided ample time to react to an  eruption and so that air traffic is warned of potential dangers.\n\nThe NVEWS Advisory Committee is integral to this program. It provides  the Secretary of the Interior with information on current program  activities…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…food assistance. They were  fully aware of it. This was organized and orchestrated in Chuck  Schumer's office months in advance of the shutdown. The Department of  Agriculture warned the Democrats weeks ago what was going to happen.  The local newspapers around the country--as a matter of fact, a  newspaper in the Senator's home State of Oregon reported:…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…commander of the U.S. Indo-Pacific Command  testified to Congress that China escalated military pressure against  Taiwan by 300 percent last year. Commander Paparo explicitly warned  that these ``aggressive maneuvers around Taiwan are not just exercises.  They are dress rehearsals for forced unification.''\n\nIt is imperative that the full weight of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a long  rap sheet: multiple convictions for armed robbery, felony larceny,  breaking and entering; more than 5 years in prison; and 14 criminal  cases.\n\nHis own family had warned of his history of schizophrenia. His own  sister said that ``he didn't seem like himself,'' when he was released  from prison. He assaulted his sister, and now that guy is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Anyone can see it is repulsive  and dangerous for our children.\n\nBut for Meta, that was their goal: Get these kids in, and get them  using the chatbot. Even as employees of Meta warned that the chatbots  could sexualize children, Zuckerberg reportedly pushed for fewer  safeguards to attract as many users as possible.\n\nThis is not something that was researched…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Kingdom.\n\nIn France, a majority of young French Muslims put sharia above their  own national laws, and more than a third have sympathy for  Islamification. French officials have warned President Macron that  Islamists are infiltrating France's republican institutions and are a  threat to national cohesion. The authors of the report to Macron  identified the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…enter  our country, even through legal means, and it certainly means we must  remove dangerous criminals that are in the country today.\n\nAs the Trump administration recently warned, ``mass migration poses  an existential threat to Western civilization.''\n\nSo what do the Democrats think? Well, on Sunday, on ``Face the  Nation,'' CBS asked the junior Senator…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…oath, he testified--Joe Biden's Secretary of State--that  ``most of them were not'' vetted.\n\nIt didn't matter to Joe Biden. He waved them all into our country.\n\nRepublicans warned repeatedly that bringing people without proper  clearance from a war-torn country was a major national security risk.  The negligent Biden administration ignored the warning.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}]