[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…establish that civil servants must  demonstrate personal loyalty rather than professional competence, you  have replaced the rule of law with the rule of one.\n\nThe Founders warned us about this. Their pursuit of a more perfect  Union was dependent upon a calculated departure from consolidated  power. Now we are living the fears of our Founders and seeing…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…school district in the Nation. Yet, once again,  this is without allocating a single dollar to support these added  responsibilities.\n\nFor years, my Republican colleagues have warned against unfunded  mandates. They have rightly criticized Federal actions that impose  requirements on States and local communities that cannot afford to  implement those policies.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…appropriate  funds and conduct oversight. For decades, Congress has gradually ceded  more of these Constitutional responsibilities to the executive branch.  As our country's founders warned, this has created a dangerous  situation ripe for Presidential abuse. It is essential that Congress  reclaim its legitimate authority as the first branch of government.\n\nMy…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…award given for leadership on  the environment. He donated the $100,000 prize money to the poor  children of Ethiopia, Greece, and Turkey. ``We are losing time,''  Bartholomew warned while accepting the award, ``and the more we wait,  the more difficult and irreparable the damage.''\n\nAlthough his efforts have brought him little relief from his problems…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…vulnerable members  of our community.\n\nNonpartisan health policy experts, economists, and medical groups,  including Healthcare Association of New York State, have already warned  that the impact of gutting this program will be felt by all, including  those with private insurance.\n\nEvery American can expect higher costs and reduced access to care.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…tantrum when California punches back.\n\nChip deal: I don't mean nachos or potatoes. I mean the AI, computing,  and national security kind. For years, my China-hawk Republicans warned  about the competition with the CCP, only for Trump to ignore them and  green-light Nvidia H200 chip sales to China in exchange for a 25  percent fee. What happened to tough…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…fact, raise the price of  goods for Americans.\n\nDon't take my word for it, listen to the National Association of Home  Builders, a staunch Republican organization that has warned this  administration that putting tariffs on everything from steel to copper  and nickel is going to drive up the price of home construction.\n\nIn fact, screws and nails, made…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…first term, they  severely weakened the nonbank designation process. In a letter, former  Treasury Secretaries Geithner, Lew, and Yellen, along with former Fed  Chair Bernanke, warned: ``These changes would make it impossible to  prevent the build-up of risk in financial institutions whose failure  would threaten the stability of the system as a whole.''…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…jobs in Oregon depends on trade,  and the trade jobs often pay better.\n\nSpeaking with small businesses and workers all over Oregon--I did it  just last week--every single one warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon. But some of their  ingredients--like…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the public broadcasting station, the NPR station, kept the broadcast  going all day long to notify the people of Macomb and the McDonough  County area of the danger, and they warned them to stay home.\n\nYou say: I will bet the other radio station did too. They didn't. Why  didn't they do it? Because the four other radio stations are  recordings. There is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…strengthen our military  installations against these threats or to help them recover from past  disasters.\n\nDefense leaders, including during President Trump's first term, have  warned of the danger that climate change poses to our military, and the  tens of billions of dollars in damage to military installations from  recent severe weather reinforces their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…like this. I remind everybody who is  responsible for supersizing the ICE budget and bringing us to this  place, it was Republicans in Congress who did this, even though we  warned them that this is what would happen.\n\nICE needs to be dismantled. Secretary Noem needs to be fired, and  Stephen Miller has to go. He is the mastermind of this ghoulish plan.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699663/horrific-ice-abuses"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…talking about what is happening in this Rescissions Act.\n\nDon't take it from me. Just take it from Navy Admiral William  McRaven, who was a Navy SEAL and a 4-star admiral. He warned that  cutting State Department USAID will put every American at risk.\n\nThis is the quote: ``This is no time to weaken any element of  America's power. The dismissal of highly…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…changes directly impact people who get       coverage through Medicaid and state-based exchanges, the       ripple effects will be felt by everyone, health care leaders       warned.\n\n``The impact goes far beyond those who lose coverage. Our       entire health system and every community we serve will feel       the effects. Reduced services, longer wait…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans want to  confirm as an HHS watchdog? Give us a break. Give America a break.\n\nBy the way, these nominees are going to come back and embarrass  Trump, just as we warned about Hegseth. If you pick a FOX News  commentator to run the most complicated life-and-death Department in  our country, he will embarrass you, we said, or worse, and that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…at the park are now blocked by protest signs. A Yosemite  biologist told gullible reporters that the staff cuts would doom the  Sierra Nevada red fox to extinction. Others warned that layoffs would  result in visitors stuck in restrooms and fires raging out of control.\n\nThis is human sacrifice, dogs and cats living together, mass  hysteria, as a ``Ghostbusters''…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cancel our sessions, every  oversight hearing, every markup of legislation, everything. Why? To  this day, there has been no coherent rationale offered.\n\nThroughout this time, I warned that this was not only holding back  our own legislative priorities but was also making the House irrelevant  in any deal to reopen the government. Of course, that is what…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…to ensure  that it continues.\n\nAlaska's business community stands with them. The Alaska Support  Industry Alliance, representing 547 companies and 35,000 Alaskan  workers, warned that the 2022 plan jeopardizes the jobs and investment  that their families depend on. National organizations from the National  Federation of Independent Businesses to the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…President John Fitzgerald Kennedy, who realized-- getting the appropriate quote--realized the negative impacts of high  tax rates. Indeed, roughly 60 years ago, President Kennedy warned:  ``The largest single barrier to full employment of our manpower and  resources and to a higher rate of economic growth is the  unrealistically heavy drag of Federal income…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to address and try to disrupt  the elections in Romania and the Republic of Georgia.\n\nOpen borders for dictators puts all Americans at risk of more 9/11  attacks imminent as warned by the FBI. President Donald Trump is  reinstituting existing laws which are successfully securing our border  to protect American families with peace through strength.\n\nToday…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…addressed years ago. It is kind of  a well-worn anecdote, but I will say it again. Patrick Monahan, a  Democrat U.S. Senator, in the late 1960s put together a study, and he  warned the degree to which we had these programs contributing to the  breakdown in marriage, but nobody paid attention Patrick Monahan.\n\nAnother man who did a lot of work in this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…power them while ensuring our constituents  have access to reliable and affordable energy.\n\nWe saw how close we were to power scarcity in Ohio over the summer,  as utilities warned Ohio residents to reduce energy power during peak  demand to help prevent rolling power outages. Ohio families should not  have to face a power emergency for running their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…This is why Congress should reauthorize this critical program so that  communities near volcanoes are provided ample time to react to an  eruption and so that air traffic is warned of potential dangers.\n\nThe NVEWS Advisory Committee is integral to this program. It provides  the Secretary of the Interior with information on current program  activities…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…food assistance. They were  fully aware of it. This was organized and orchestrated in Chuck  Schumer's office months in advance of the shutdown. The Department of  Agriculture warned the Democrats weeks ago what was going to happen.  The local newspapers around the country--as a matter of fact, a  newspaper in the Senator's home State of Oregon reported:…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…commander of the U.S. Indo-Pacific Command  testified to Congress that China escalated military pressure against  Taiwan by 300 percent last year. Commander Paparo explicitly warned  that these ``aggressive maneuvers around Taiwan are not just exercises.  They are dress rehearsals for forced unification.''\n\nIt is imperative that the full weight of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a long  rap sheet: multiple convictions for armed robbery, felony larceny,  breaking and entering; more than 5 years in prison; and 14 criminal  cases.\n\nHis own family had warned of his history of schizophrenia. His own  sister said that ``he didn't seem like himself,'' when he was released  from prison. He assaulted his sister, and now that guy is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Anyone can see it is repulsive  and dangerous for our children.\n\nBut for Meta, that was their goal: Get these kids in, and get them  using the chatbot. Even as employees of Meta warned that the chatbots  could sexualize children, Zuckerberg reportedly pushed for fewer  safeguards to attract as many users as possible.\n\nThis is not something that was researched…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Kingdom.\n\nIn France, a majority of young French Muslims put sharia above their  own national laws, and more than a third have sympathy for  Islamification. French officials have warned President Macron that  Islamists are infiltrating France's republican institutions and are a  threat to national cohesion. The authors of the report to Macron  identified the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…enter  our country, even through legal means, and it certainly means we must  remove dangerous criminals that are in the country today.\n\nAs the Trump administration recently warned, ``mass migration poses  an existential threat to Western civilization.''\n\nSo what do the Democrats think? Well, on Sunday, on ``Face the  Nation,'' CBS asked the junior Senator…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…oath, he testified--Joe Biden's Secretary of State--that  ``most of them were not'' vetted.\n\nIt didn't matter to Joe Biden. He waved them all into our country.\n\nRepublicans warned repeatedly that bringing people without proper  clearance from a war-torn country was a major national security risk.  The negligent Biden administration ignored the warning.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}]