[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Minister Mark McLean, Reverend  Frank Coleman, and Reverend Margaret Fountain-Coleman.\n\nTheir hard work and principled advocacy for equal rights, economic  justice, and education warrants recognition on the floor of the House  of Representatives.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…out-of-control operation that is terrorizing  communities and shredding the Constitution.\n\nWe are watching masked, armed agents force their way into homes  without judicial warrants. We are seeing blatant violations of the  Fourth Amendment. We are witnessing agencies act with impunity. We are  hearing about kids getting kidnapped on their way to school…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…arrest them, and either detain them indefinitely or  forcibly deport them. Lawyers representing the subjects have been  denied access to their clients as well as access to the warrants and  other official documents. Judicial orders have been blatantly ignored  and courts denied access to potentially evidentiary information.\n\n``I am concerned these actions…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…lying about having permission from parents to speak  with their kids. ICE officials are arresting people with maximum  violence and lawlessness, showing up without judicial warrants, since  the Trump administration says it is fine to storm into some someone's  house without one; showing up in masks, grabbing people off the streets  without any badge or…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…kids--in front of their kids--often taking those kids and  separating them from their parents, breaking down doors, and detaining  citizens and noncitizens alike.\n\nAs for warrants? No. Apparently, DHS lawyers now claim you don't need  a judicial warrant to break through the door of a U.S. citizen and haul  them out in their underwear in the dead of…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…responsibility elected officials have to  protect it. We have got to do better than this. Let's focus on getting  violent criminals off the street. There are more than 100,000 open  warrants in the United States on any given day. Let's focus on those,  and let's move forward in a way that respects the Constitution.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…are spoiling the bunch, and in doing so,  are actually making it unsafe for law enforcement to do their jobs.\n\nAcross the country, ICE agents have conducted raids without warrants,  detained U.S. citizens, used excessive force, and torn families apart,  often with little oversight and no consequences. Communities are left  traumatized, afraid to report…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…costing human lives.\n\nICE is terrorizing our communities, indiscriminately racially  profiling, using force against peaceful protesters, barging into  people's homes without warrants, preventing doctors from treating their  patients, blocking students from their classrooms, snatching children,  elderly people, pregnant women, veterans, active military,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699296/dhs-is-working-with-no-oversight-and-no-accountability"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…U.S.  citizens, pulling people out of their homes, tearing children away from  their parents,  and stating that it is exempt from the constitutional requirement for  search warrants. I cannot support one more cent for detention  facilities with the highest death rate in decades and that fail to meet  the basic medical needs of detainees. No wonder they…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…has become a campaign of cruelty and fear. Families are being torn  apart with no warning and no plan. Children are afraid to go to school.  Homes are being entered without warrants. Workers are being dragged off  of jobsites by their hair. People are being abducted when shopping for  groceries, going to church, or taking their kids to school. Peaceful…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the execution of lawmakers is a reckless  and flagrant abuse of presidential power that promotes extra-judicial  punishment and the assassination of Members of Congress, and warrants  impeachment by the U.S. House of Representatives and trial by the  Senate.\n\nARTICLE II. Abuse of Presidential Power to Intimidate Federal Judges  in Violation of the Separation…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…right of protestors under the 2nd amendment to lawfully be armed in a  public space is being questioned by President Trump. DHS agents are  entering homes using administrative warrants that conflict with the 4th  amendment protection against unreasonable search and seizure.  Minnesotans are being detained without cause in violation of the 5th  amendment…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…administration  says, instead of unleashing fear and chaos on everybody else.\n\nWhat Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.\n\nSecond, we need real accountability, having ICE abide by the same  rules as local police do, including independent investigations of ICE.\n\nAnd,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…pointed at  unarmed bystanders. We have people targeted for the color of their skin  or the accents that they speak in. ICE agents are demanding entrance to  homes without warrants, and last week, an American citizen was gunned  down.\n\nAmericans know this is wrong, and they are horrified. People of  conscience across this country must come together and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698887/be-the-voice-of-moral-grandeur-and-spiritual-audacity"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…rights every single  day.\n\nWe have seen ICE agents and the Department of Homeland Security  detain and arrest American citizens without any justification, enter  homes without warrants, use excessive force when it wasn't required,  and ignore constitutional rights.\n\nThey are even weaponizing children in this country, kidnapping them  from schools and using…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…we continue to have people--brave women and men--who want to step up  and do that job.\n\nOne of the other things that our Democrat colleagues want is to end  administrative warrants. A little history: Administrative warrants were  originally passed in the Immigration and Naturalization Act of 1952, so  they have been around for nearly 75 years. Getting…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…has baselessly  asserted jurisdiction over the United States--and our citizens agree-- and its allies like Israel and further abused its power by issuing  frivolous arrest warrants.\n\nThere is no reason to use the ICC to define what countries are  actively seeking to harm the United States. We can do that. I oppose  this amendment that targets Israel…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to be targeting specific ethnic,  linguistic, or religious minorities held in detention, often without  being [informed of] the reasons for their arrest or provided arrest  warrants.''\n\nAmong those most frequently reported as targets are Falun Gong  practitioners and Uyghur Muslims in the Xinjiang Province. These  detainees, often imprisoned for their…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…or agency (including the budget justification       materials submitted to Congress) under the National       Intelligence Program;\n\n2. Apportioning, allotting, and issuing warrants for the       disbursement of, and obligating and expending funds under the       National Intelligence Program; and\n\n3. Carrying out Federal financial management service…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to       toll the period for filing a petition under section 6213(a)       in cases in which the Tax Court determines based on the facts       and circumstances that equity warrants such tolling.\n\n``(2) Rules for inaccessible filing locations.--\n\n``(A) In general.--Notwithstanding any other provision of       this title, in any case (including by reason…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…militarized our streets. Masked men in  full military gear roam the streets of our cities. These masked men  invade church properties and schools, knock down doors without  warrants, ram cars, and assault pastors and people of faith. These  masked, armed men have arrested hundreds of citizens just for looking  Latino.\n\nLast week, they killed a citizen.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…exceeds the agency's       legal authority, and lacks proper consultation as required by       department policy. At the very least, the complexity of the       new proposal warrants additional time for public review and       scrutiny and, importantly, meaningful consultation with the       Alaska Native tribal entities, corporations, and communities…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…worst of the  worst from 2025 generally, not just yesterday.\n\nIn Louisiana, we have a sexual predator, an illegal alien from  Honduras, whose criminal history includes active warrants for 394  counts of pornography involving juveniles and two counts of sexual  abuse of an animal.\n\nIn Kansas, a violent criminal illegal alien from Mexico was sentenced  to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…State or local officials are derelict in their  duty to protect the public and enforce the law.\n\nRemember how all this started: ICE agents attempted to execute court- ordered warrants on criminal illegal aliens. When a mob intervened, ICE  called for local law enforcement. The mayor reportedly stopped them  from responding, and the Governor did nothing.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "French Hill", "party": "Republican", "sentence": "…following:\n\n(1) The 250th anniversary of the signing of the Declaration       of Independence was a turning point in the history of the       United States and the world that warrants national       recognition.\n\n(2) The 68th Congress celebrated this fact by authorizing       the United States Mint to commemorate the 150th anniversary       of American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…particular note occurred last year, in which he  led and implemented a proactive investigation across nine counties,  including close to 30 agencies, that located and served warrants on  more than 21 suspects who were preying on children. This was truly a  heroic effort that spared many young lives from becoming victims.\n\nDetective Heaton is known by others…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Madam Speaker, the 250th anniversary of the signing of the  Declaration of Independence was a turning point in the history of the  United States and also the world, one that warrants national  recognition.\n\nI am honored to speak in support of a bill that recognizes this  landmark moment of our collective history through a coin that links our  Nation's…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…They won't do it because they will lose. They know what it  does. It ties up ICE's ability--which, by the way, they already have to  abide by due process. There are already warrants. They know all this.  They want to confuse the issue--mostly because they believe in open  borders but also because this Trump derangement syndrome is really a  hard thing…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Drug Interdiction issues. Later, as a Senior  Agent in Amarillo, he mentored new agents in surveillance techniques,  conducted criminal investigations, and drafted search warrants. He now  leads the CID Training Unit, supervising eight Training Agents/ Coordinators.\n\nI am honored to join LT Frick's friends and family in celebrating his  years of dedicated…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}]