[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…reach because the jobs aren't there. We have  to understand that preventative care in many of these places is also  just a dream because the condition of the communities don't warrant  healthcare practitioners setting up shop there or staying there.\n\nI don't care who you are. I come from Alabama, we treat Nick Sabin,  and rightfully so, as the greatest…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…aftermath of the briefing yesterday, I have had  good conversations with colleagues, and many of them have asked me  about the distinction between the execution of a valid arrest warrant  and a larger military operation.\n\nI want to state very clearly that I do not challenge, nor does this  resolution  challenge, the execution of a valid arrest warrant against…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…be required to use body  cameras. But that is just the tip of the iceberg.\n\nWe must end roving patrols. Federal agents should not enter private  property without a judicial warrant. We must end the bounty system that  incentivizes arrest without cause and has taken down numerous people,  multiple people, hundreds of people in our  State that were legal,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…up with scarred  oilfields all across these refuges that, unfortunately, were completely  and totally avoidable.\n\nYesterday, President Trump signed, in many ways, the death warrant  for all of these precious areas in our country because he pulled out of  the race to increase the fuel economy standards--where we put the oil  in the vehicles that we drive.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…just laid out and more. We will  be in the strongest possible position to fight for and win the drastic  changes we all know are needed to protect our communities: judicial  warrant requirements, no more detentions or deportations of United  States citizens, an enforceable code of conduct, taking off the masks,  putting the badges on, requiring body cameras,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Region, a family of  five, including an 8-month-old who was reportedly a U.S. citizen, was  detained and deported after ICE entered their apartment without-- without--a judicial warrant, a clear violation of the Fourth Amendment.\n\nIn December, our Afghan community was repeatedly targeted, including  ICE arresting a father and son after they exited a mosque…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Republicans rejected unanimously in committee a  provision to prevent mixers. Mixers are devices whose sole purpose is  to defeat even top law enforcement efforts pursuant to a warrant, and  under this bill mixers will be used to defeat law enforcement.\n\nRepublicans claim to be against crime in the streets, but they are  creating a device whose sole purpose…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…facility, and it is about using him as bait to get to his  family. That is happening.\n\nIt is about detaining a U.S. citizen at gunpoint, on that person's  front porch, without any warrant to go there and then forcing him to go  outside in subfreezing weather wearing nothing but his underwear.\n\nIt is about detaining a churchgoer delivering groceries to his…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…Israel that could  be used against the people of Gaza. Instead of photo ops with Benjamin  Netanyahu, it is time for condemnation. Help facilitate the serving of  an arrest warrant from the ICC to him.\n\nLet's make him the international pariah he should be. Let's use our  leverage to pressure him not to commit genocide in Gaza. People of good  conscience…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…body camera. You should not be masked, unless it  is for your health. You need to have insignia that shows you are  actually real law enforcement. You need to have a judicial warrant to  come into someone's house, not a warrant signed by some person at the  Department of Homeland Security, who may or may not just have political  dependencies on Kristi…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…32-year-old man, and  he was charged with online solicitation of a minor.\n\nFortunately, it was an undercover officer posing as a 15-year-old  girl, but there was an arrest warrant out for his arrest at the time he  came here and launched that attack.\n\nHe ended up pleading guilty and accepting responsibility in front of  the judge, or so he said, because…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…enforcement agents.\n\nIf a person runs away from these masked vigilantes, they will beat  and chase that person down. Mr. Speaker, if you ask to see their  identification or their warrant, they will assault you and arrest you.  If a person films them, they will pull a gun on that individual.\n\nThese tactics are grossly illegal and not tactics that local law…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…detention centers, but  apparently, Noem and her cohorts plan for a different America to start  the next 250 years, one where masked, unmarked agents seize people  without judicial warrant, whisk them away to remote detention centers  en route to uncertain final destinations. When such things have been  done in other countries they are called pogroms and ethnic…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…even longer.\n\nThere is no way to check on their whereabouts. If you think that it  sounds like something very unusual, if you have watched all the crime  shows on TV on what a warrant for an arrest may be, what your arrest  will be, what the Miranda warnings may be, this is totally unusual. The  ICE agents are making it all up. They are ignoring the law…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…gratitude to this family that has lost two of  their family members, police officers who died in the line of duty.\n\nRyan So was accidentally shot and killed after serving a search  warrant and conducting an arrest in Scottsdale. A United States Navy  veteran who served with the Scottsdale Police Department for 9 years,  Detective So is survived by his wife and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…a financial services business.  They don't state it that way. I mean, it is not that creepy inherently  in the United States. For the most part, you are supposed to get a  warrant. They don't always do that. They have been found to violate it  on occasion in the United States. In certain other governments, it is  very creepy.\n\nAs we were working to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…saw the highest  crime rate per capita in 2024. But since September, the  administration's Memphis Safe Task Force has made more than 4,200  arrests, including hundreds of warrant arrests for domestic violence,  aggravated assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more than 120 missing children and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…was ending  the national energy emergency. Now it is ending an emergency related to  fentanyl.\n\nThe American people recognize that these are legitimate crises and  that they warrant an aggressive response. President Trump and  Republicans promised that we would unleash American energy and end the  lawlessness at our borders, and we intend to keep those…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "Mr. HUDSON. Mr. Speaker, I rise today to recognize Chief Warrant  Officer Garrett Illerbrunn for his dedicated service in the U.S. Army's  82nd Airborne Division.\n\nChief Warrant Officer Illerbrunn, a native of North Dakota, with a  love…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the Office of Senate Security. The staff director, in       consultation with the minority staff director, may appoint an       alternate security manager as circumstances warrant.\n\n(c) Transportation of Classified Material.--Classified       material may only be transported between Senate offices by       appropriately cleared staff members who have…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…determination of the Governor       of such State (or the Mayor, in the case of the District of       Columbia) causes damage of sufficient severity and magnitude       to warrant the application of the rules of this section.\n\n``(3) State.--For purposes of this section, the term       `State' includes the District of Columbia, the Commonwealth…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…itself  from the responsibility of governing, and the United States will once  again be at war.\n\nThose who argue that small boats in the Caribbean are so dangerous  that they warrant being blown out of the water must explain why, when  some of the individuals happen to survive, they are not detained. The  drugs are not scooped up and tested. The survivors…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…guardsmen to our Federal law enforcement, to  our State law enforcement heroes--are being targeted.\n\nThen I hear dire language from the speaker before me--using the term  ``death warrant'' as it related to an issue--but they won't fully  engage and stand up against those who are supporting groups that are  targeting our heroes.\n\nAn attack on those who enforce…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Justyna Beyer, Jonathan D. Boyd, Jonathan Jay Campos, James       ``Tommy'' Thomas Clagett Jr., Chris Collins, Casey Laurance       Crafton, Pete \"PJ\" Diaz, Kiah Duggins, Chief Warrant Officer       Andrew Loyd Eaves, Danasia Brown Elder, James ``Brian''       Ellis, Ian Douglas Epstein, Lindsey Denae Fields, Jinna Han,       Jin Han, Cory Haynos, Stephanie…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…can meet the same fate as Maduro.\n\nMaduro was an indicted drug guy. He had indictments for being a drug  trafficker. The argument is that this operation was to enforce the  warrant. It was more of a law enforcement activity because he was the  President of the country--not legitimate, by the way, and everybody  pretty much denied that he was the legitimate…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the distinguished service of Chief Warrant  Officer 4 James McInnis, United States Coast Guard, as our Veteran of  the Month for December 2025 from Michigan's 9th Congressional District.  His more than two decades…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…reward for information  leading to the arrest or conviction of Maduro to $25 million. But then  President Trump directs an isolated Special Forces raid in support of a  valid warrant to capture Maduro so that he can be tried for drug  crimes, and Democrats are falling all over themselves to criticize the  seizure and arrest of this international criminal.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…seven  remarkable Americans whose military service embodies the very best of  our Nation.\n\nColonel Mark R. Baaden, Colonel John W. Mansur, Sergeant Raymond L.  Burkard, Chief Warrant Officer Thomas W. Thompson, Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio, and Sergeant Lloyd  Lasenby each served our country with honor and unwavering…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Maduro? It was to protect the homeland  of the United States of America, as he has done with action after  action after action. It is the same reason that two Presidents put a  warrant, a bounty, on Nicolas Maduro--not just President Trump, but  also President Biden. That is why Nicolas Maduro was snatched up,  because of his poisoning of the people of the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…We see it time and time again.\n\nIn D.C., police recently arrested a carjacking suspect who laughed in  their faces saying: I have been in the D.C. jail six times for this  warrant. I will be out tomorrow because the victims never show up. That  is the mentality of this broken system, and it emboldens criminals.\n\nPresident Trump is proving there is another…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}]