[{"senator": "Mark Pocan", "party": "Democrat", "sentence": "…Israel that could  be used against the people of Gaza. Instead of photo ops with Benjamin  Netanyahu, it is time for condemnation. Help facilitate the serving of  an arrest warrant from the ICC to him.\n\nLet's make him the international pariah he should be. Let's use our  leverage to pressure him not to commit genocide in Gaza. People of good  conscience…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…up with scarred  oilfields all across these refuges that, unfortunately, were completely  and totally avoidable.\n\nYesterday, President Trump signed, in many ways, the death warrant  for all of these precious areas in our country because he pulled out of  the race to increase the fuel economy standards--where we put the oil  in the vehicles that we drive.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…enforcement agents.\n\nIf a person runs away from these masked vigilantes, they will beat  and chase that person down. Mr. Speaker, if you ask to see their  identification or their warrant, they will assault you and arrest you.  If a person films them, they will pull a gun on that individual.\n\nThese tactics are grossly illegal and not tactics that local law…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…every  single America can support. When there is a shooting or another abuse,  an independent investigation should be standard.\n\nMr. Speaker, when ICE kicks down your door, a warrant signed by a  judge must be present. If you are speaking Spanish, Mr. Speaker, or  have skin color that is other than white, you should not be detained  just because of how…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…be required to use body  cameras. But that is just the tip of the iceberg.\n\nWe must end roving patrols. Federal agents should not enter private  property without a judicial warrant. We must end the bounty system that  incentivizes arrest without cause and has taken down numerous people,  multiple people, hundreds of people in our  State that were legal,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…disappeared to a horrific prison in El Salvador because  of an administrative error.\n\nThis week, U.S. citizens in Oklahoma were dragged out of their home  while ICE agents, with no warrant for them, took their phones, laptops,  and life savings, even though they weren't the suspects in question.\n\nOne of the most basic rights guaranteed in our Constitution is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690511/trump-immigration-policies"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…gratitude to this family that has lost two of  their family members, police officers who died in the line of duty.\n\nRyan So was accidentally shot and killed after serving a search  warrant and conducting an arrest in Scottsdale. A United States Navy  veteran who served with the Scottsdale Police Department for 9 years,  Detective So is survived by his wife and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…that are working in the kitchen.\n\nWe are seeing this happen every single day; battering down doors,  breaking car windows. There literally--there is no pretext. There is no  warrant. They are targeting people, not because they know that they  have committed some crime, but because of what they look like.\n\nThere is this thing that we have in the Twin Cities…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…doors, smash into  homes, terrify children, ransack living rooms and bedrooms, and detain  and arrest U.S. citizens, as well as undocumented immigrants, without a  judicial warrant, in violation of the Fourth Amendment. And that  violation is only one of many violations of constitutional, explicit  guarantees that we have seen repeatedly in Minneapolis,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Republicans rejected unanimously in committee a  provision to prevent mixers. Mixers are devices whose sole purpose is  to defeat even top law enforcement efforts pursuant to a warrant, and  under this bill mixers will be used to defeat law enforcement.\n\nRepublicans claim to be against crime in the streets, but they are  creating a device whose sole purpose…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Region, a family of  five, including an 8-month-old who was reportedly a U.S. citizen, was  detained and deported after ICE entered their apartment without-- without--a judicial warrant, a clear violation of the Fourth Amendment.\n\nIn December, our Afghan community was repeatedly targeted, including  ICE arresting a father and son after they exited a mosque…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…even longer.\n\nThere is no way to check on their whereabouts. If you think that it  sounds like something very unusual, if you have watched all the crime  shows on TV on what a warrant for an arrest may be, what your arrest  will be, what the Miranda warnings may be, this is totally unusual. The  ICE agents are making it all up. They are ignoring the law…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…32-year-old man, and  he was charged with online solicitation of a minor.\n\nFortunately, it was an undercover officer posing as a 15-year-old  girl, but there was an arrest warrant out for his arrest at the time he  came here and launched that attack.\n\nHe ended up pleading guilty and accepting responsibility in front of  the judge, or so he said, because…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…veteran who has lived in the U.S. for nearly  50 years was told to leave due to a 15-year-old minor drug conviction.\n\nIn Newark in January, ICE detained a veteran without a warrant,  disregarding his veteran ID card.\n\nA 10-year-old U.S. citizen with brain cancer was deported because his  parents were undocumented.\n\nTrump's actions tell us that no one…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…body camera. You should not be masked, unless it  is for your health. You need to have insignia that shows you are  actually real law enforcement. You need to have a judicial warrant to  come into someone's house, not a warrant signed by some person at the  Department of Homeland Security, who may or may not just have political  dependencies on Kristi…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Justyna Beyer, Jonathan D. Boyd, Jonathan Jay Campos, James       ``Tommy'' Thomas Clagett Jr., Chris Collins, Casey Laurance       Crafton, Pete \"PJ\" Diaz, Kiah Duggins, Chief Warrant Officer       Andrew Loyd Eaves, Danasia Brown Elder, James ``Brian''       Ellis, Ian Douglas Epstein, Lindsey Denae Fields, Jinna Han,       Jin Han, Cory Haynos, Stephanie…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the distinguished service of Chief Warrant  Officer 4 James McInnis, United States Coast Guard, as our Veteran of  the Month for December 2025 from Michigan's 9th Congressional District.  His more than two decades…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…with our colleagues on the  other side of the aisle, but the U.S. is not at war with Venezuela.  None of the actions taken by the Trump administration to execute an  arrest warrant on a criminal constitutes war.\n\nThe Trump administration has briefed both Chambers of Congress in  detail on the operation to bring Maduro to justice, an action the  Democrats…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…seven  remarkable Americans whose military service embodies the very best of  our Nation.\n\nColonel Mark R. Baaden, Colonel John W. Mansur, Sergeant Raymond L.  Burkard, Chief Warrant Officer Thomas W. Thompson, Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio, and Sergeant Lloyd  Lasenby each served our country with honor and unwavering…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the Office of Senate Security. The staff director, in       consultation with the minority staff director, may appoint an       alternate security manager as circumstances warrant.\n\n(c) Transportation of Classified Material.--Classified       material may only be transported between Senate offices by       appropriately cleared staff members who have…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…determination of the Governor       of such State (or the Mayor, in the case of the District of       Columbia) causes damage of sufficient severity and magnitude       to warrant the application of the rules of this section.\n\n``(3) State.--For purposes of this section, the term       `State' includes the District of Columbia, the Commonwealth…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…a financial services business.  They don't state it that way. I mean, it is not that creepy inherently  in the United States. For the most part, you are supposed to get a  warrant. They don't always do that. They have been found to violate it  on occasion in the United States. In certain other governments, it is  very creepy.\n\nAs we were working to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Coast Guard, where he  earned multiple awards, including the Coast Guard Enlisted Person of  the Year award in 2015 and 2019. He was posthumously promoted to the  rank of chief warrant officer, earlier this year.\n\nOfficer Horan served with the Greensboro Police Department for 7  years. He was only 44 years old and is survived by his wife and  children.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "John Thune", "party": "Republican", "sentence": "…reward for information  leading to the arrest or conviction of Maduro to $25 million. But then  President Trump directs an isolated Special Forces raid in support of a  valid warrant to capture Maduro so that he can be tried for drug  crimes, and Democrats are falling all over themselves to criticize the  seizure and arrest of this international criminal.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…guardsmen to our Federal law enforcement, to  our State law enforcement heroes--are being targeted.\n\nThen I hear dire language from the speaker before me--using the term  ``death warrant'' as it related to an issue--but they won't fully  engage and stand up against those who are supporting groups that are  targeting our heroes.\n\nAn attack on those who enforce…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…We see it time and time again.\n\nIn D.C., police recently arrested a carjacking suspect who laughed in  their faces saying: I have been in the D.C. jail six times for this  warrant. I will be out tomorrow because the victims never show up. That  is the mentality of this broken system, and it emboldens criminals.\n\nPresident Trump is proving there is another…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…saw the highest  crime rate per capita in 2024. But since September, the  administration's Memphis Safe Task Force has made more than 4,200  arrests, including hundreds of warrant arrests for domestic violence,  aggravated assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more than 120 missing children and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Jocelyn had been stopped at the  border, processed, and then simply released into the interior just  weeks before. The illegal alien who murdered Rachel was a fugitive with  a warrant out for his arrest for the murder of a different woman back  home in El Salvador. He had been deported three times in that year  alone, only to waltz back in across our open…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…can meet the same fate as Maduro.\n\nMaduro was an indicted drug guy. He had indictments for being a drug  trafficker. The argument is that this operation was to enforce the  warrant. It was more of a law enforcement activity because he was the  President of the country--not legitimate, by the way, and everybody  pretty much denied that he was the legitimate…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Thune", "party": "Republican", "sentence": "…was ending  the national energy emergency. Now it is ending an emergency related to  fentanyl.\n\nThe American people recognize that these are legitimate crises and  that they warrant an aggressive response. President Trump and  Republicans promised that we would unleash American energy and end the  lawlessness at our borders, and we intend to keep those…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]