[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Corey's  world. He cherished his grandmother, the late Margaret Lucinda Sidney,  his aunt Sylvia Sidney, and his cousin Arthur Dennis Sidney, both of  whom now reside in Washington, D.C. Corey was proud of his close-knit  family and maintained affectionate relationships across the country.\n\nThough he might have claimed to be shy, Corey was truly a social…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…say this because I am very concerned about the  President's proposal, and I am very concerned about the SAVE Act.\n\nGreg Kimsey, who is the Clark County auditor of a part of Washington  where I guarantee you, we have real election issues--basically, the  other day, in trying to fight against the SAVE America Act said this:  ``Voting is a constitutional…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…considered using government regulatory       agencies against unfriendly media companies. During the 2016       campaign, he had threatened Jeff Bezos, the owner of the       Washington Post and Amazon, with antitrust action, tweeting:       ``If I become president, oh do they have problems.'' He also       threatened to block the pending merger of Time…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…a well-respected member of the community with, as you can  see, adorable grandchildren. He was arrested, detained, and sent to the  Northwest Detention Center in Tacoma, Washington. Then immigration  officials tried to deport him.\n\nI visited Victor in Tacoma, where he was kept in bleak conditions and  spoke about his experience and his hopes to be reunited…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Elliot Muhammad (Boisdore), Louis Oubre,       Larry Parker, Tyrone Parker, Burnell Quinn, Eric Richard,       Victor Richard, Michael Roussell, Tyronne Smith, Gary       Washington, Christopher Willard, Alan Williams, Wydell       Williams, Rynell Wilson.\n\nDeceased Team Members: Joseph Broussard, Nathaniel Dorsey,       John Doucette, Alan Florent,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and Chilmark Tribes in Massachusetts transition to 100  percent renewable energy by 2040 through retrofits, microgrids and  efficiency measures, and Bainbridge Island in Washington analyze the  solar and water power options with a goal of transitioning to 100  percent renewable energy by 2040.\n\nAlthough this program has helped so many across our great…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…workers across the country are veterans. Keep in mind, too, these  aren't just people in the D.C. metropolitan area. Eighty percent of  government workers live outside of the Washington, D.C., metropolitan  area. There are jurisdictions and States and communities across the  country, providing services that those communities need. They won't  miss the water…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…time.\n\nWhat would be the Republican response to the situation in our skies?  Representative Addison McDowell of the great State of North Carolina  has a bill to designate Washington Dulles International Airport in  Virginia as the Donald J. Trump International Airport. Did Virginia  even vote for Donald Trump?\n\nFamilies are confronting thousands of dollars…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…proud to celebrate the work of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, and  I ask that my colleagues join me in welcoming him to Washington, D.C.  and thanking him for his ongoing commitment to advancing peace and  religious freedom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…championing  democratic values, Ambassador Pierce has exemplified the very best  diplomacy leadership.\n\nDame Pierce was indefatigable. It seemed she gathered people to her  home in Washington every day and every evening for conversations about  the most important matters on the globe. I think I saw more of Karen  these last 5 years than I saw of my own family.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…a profound impact as a performer,  choreographer, and instructor. As Co-Founder and Director of KC Dance  Center, she has trained students across Virginia, Maryland, and  Washington, D.C. in dance, yoga, aerobics, and Nepali-inspired fitness  programs. Luna's work is driven by her passion for preserving and  sharing Nepali traditions in America and giving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Council as the Legislative Assembly, the Councilmembers as  Representatives and the Chair of the Council as the Speaker. The new  titles are the ones used in the State of Washington, Douglass  Commonwealth constitution, which D.C. adopted in 2016 in anticipation  of enactment of the Washington, D.C. Admission Act, which would make  D.C. the 51st state.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696437/introduction-of-the-district-of-columbia-government-title-equality-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…granted because they live maybe closer to a city or in a  wealthier area than where the people in the Arkansas Valley live.\n\nFor 64 years, Coloradans have been relying on Washington to fulfill  its promise to build on their efforts--they have been a big part of  this in southeastern Colorado--to build on their efforts to deliver  clean drinking water.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Schwalb.                                                 September 10, 2025.      Hon. James Comer,      Chairman, House Committee on Oversight and Government Reform,           Washington, DC.      Hon. Robert Garcia,      Ranking Member, House Committee on Oversight and Government           Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…missed the following votes, but had I  been present, I would have voted no on rollcall vote No. 451, Motion to  invoke cloture on Executive Calendar No. 95 Joseph Kent, of Washington,  to be Director of the National Counterterrorism Center, Office of the  Director of National Intelligence. I missed the following votes, but  had I been present, I would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695340/vote-explanation"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Speaker, do we rubberstamp fraudulent election results  or stand for election integrity? That was the question before Congress  5 years ago today.\n\nIt was a sunny day in Washington. A largely peaceful protest was  growing outside and, unfortunately, made its way into the Capitol. As a  result, a joint session of Congress, originally set to be conducted…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698515/standing-for-election-integrity"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…matters. Americans alone must decide America's future.\n\nYet radical Democrats have abandoned the standard. New York City has  allowed noncitizens to vote in local elections. Washington, D.C., has  done the same, granting political power to foreign nationals in the  Capital of our Nation.\n\nGeorgia's own Senator John Ossoff, who once said that voter ID was…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…important role of producing the food that sustains America. His  experience as a farmer provided the foundation for his future as a  legislator, both in Sacramento and here in Washington, D.C.\n\nMr. Speaker, it comes as no surprise that in 2024, Doug was  unanimously elected to serve as the chairman of the Congressional  Western Caucus, one of the largest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…to start with recognizing that 19- to 24-year-olds  shouldn't be treated as youthful offenders.\n\nLocal news has recently reported that the number of juveniles  arrested in Washington, D.C., has increased every year since 2020 and  that 60 percent of carjackings in the District in 2025 so far are for  those over 20 years old.\n\nKnowing that the District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…footed  the bill.\n\nWe didn't need legislation to put America first. We needed a new  President.\n\nIt is a fact that the spirit of cutting waste, fraud, and abuse is  alive in Washington, D.C. Funds being sent to foreign countries that  hate America have been cut off. Republicans cut $100,000 for climate  resilience in Ghana; cut $360,000 for gender nonconforming,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Ms. ERNST. Mr. President, for over a decade, I have led the charge to  expose government abuses, curb reckless regulations, and protect hard- working taxpayers from Washington's overreach.\n\nAs my colleagues have so rightly discussed, the actions by the Biden  administration made it necessary for President Trump to declare a  national energy emergency…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington, D.C. this week.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695798/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…leadership skills. Nearly  600 alumni now serve in business, government, and the nonprofit sector,  which is a testament to the Maddy Institute's impact.\n\nMy District and Washington, D.C. offices have welcomed interns from  the Maddy Institute throughout my time in Congress. Their local  expertise and interest in government make the interns invaluable…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699141/recognizing-the-maddy-institute"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…normal permitting process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American people deserve and  that Washington has denied them for too long.\n\nI thank the gentleman from Minnesota (Mr. Stauber) for introducing  this resolution and for his tireless work on behalf of his  constituents.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…communities are safe.\n\nOn behalf of a grateful nation and myself, I thank EMS workers. I  thank these Americans in the EMS field for all that they do.\n\nAs long as I have a voice in Washington, D.C., I will always support  our EMS professionals and every first responder working to serve our  local communities, the State of Florida, and our great country.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…questions, and putting in your name and address. It showed up about a  week later.\n\nIf you look at the return address, it is fake. It says: James Smith,  2301 L Street Northwest, Washington, D.C. That is the West End Library  here in Washington. It was postmarked from Capital District 208 here in  Washington, D.C.\n\nIn this package, in this brown envelope, are…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "James Risch", "party": "Republican", "sentence": "…such  an annex is available to all Senators in the office of the Foreign  Relations Committee, room SD-423.\n\nHon. Mike Johnson,      Speaker, House of Representatives,      Washington, DC.\n\nDear Mr. Speaker: Pursuant to the reporting requirements of       Section 36(b)(1) of the Arms Export Control Act, as amended,       we are forwarding herewith Transmittal…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…generation of Michigan farmers can carry  on the tradition of actually feeding America, thanks to the permanent  death tax relief.\n\nAt each stop, I heard the same message: Washington needs to get out  of the way and let hardworking Americans do what they do best. That is  why I have been so proud to champion the One Big Beautiful Bill Act.\n\nThis legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…like Senator Ted Cruz and Governor Rick  Perry, both of whom are dear friends of mine.\n\nShe led a storied life. She rode her horse into the lobby of The  Mayflower Hotel in Washington, D.C. She acted in Hollywood where she  would go on to meet future President Reagan when she was in Hollywood  in that Golden Age. She held many positions in the Reagan…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…subsidies without reform is just paying more for a broken  system. I am not going to vote to promote a broken ObamaCare system. If  health insurance only looks affordable when Washington pumps in  billions of temporary subsidies, the law itself is not affordable. That  structure is the real problem that we need to fix. I urge my colleagues  to vote ``no.''", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}]