[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…enough from the people in charge. The Trump  administration and Republicans gave them $1 trillion in new tax breaks  in the budget megabill they passed in July. Somehow, that wasn't  enough.\n\nThe Trump administration junked an effort to crack down on another  partisanship abuse, something known as basis shifting. That is when  businesses dodge taxes by…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…lives of  really risky and potentially violent behavior.\n\nSo we came together in 2022, and we passed the Bipartisan Safer  Communities Act. It was a big bipartisan vote. It wasn't close. The  final tally was 65 to 33, with nearly two-thirds of the Senate voting  in favor of this commonsense gun safety measure. It wasn't anything  close to what I see…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…care, education funding, and food  assistance to pay for a transfer of wealth of $4.5 trillion from the  middle class and those aspiring to the wealthiest in this country.\n\nIt wasn't just a 10-point win that mattered. In fact, more than the  win was the turnout. We rivaled a midterm congressional election  turnout in a spring nonpartisan election. People…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today with my newborn, Sam, who is  just 4 weeks old.\n\nUnfortunately, I wasn't given the opportunity to vote remotely after  giving birth. Nevertheless, I wasn't going to let that stop me from  being here to represent my constituents and vote ``no''…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688112/disastrous-republican-budget"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…and pride.\n\nSeparation Day isn't just about the past. It is a reminder that  democracy isn't something we inherit. It is something we practice,  because that bold act in 1776 wasn't made by kings or generals. It was  made by ordinary people who believed that a better future was worth the  risk. They understood something we should all remember to this…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…was a prediction. We predicted it on the floor in  March that electricity prices were going to go up, and then others,  when the bill passed, predicted it, but by July 24, it wasn't just a  prediction.\n\nNewsweek:\n\nElectricity prices are soaring under Donald Trump.\n\nInflation is too high because of tariffs and other chaotic economic  moves on food, on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…The allies and adversaries--Russia and China--were part of this deal,  as were the UK and France and Germany. Those who worked on the deal  said the agreement was working. It wasn't turning Iran from a bad actor  to a good actor. It wasn't stopping all of Iran's bellicose behavior.  But it was limiting the very nuclear program that is now trying to be…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…represent.\n\nI have heard from countless people in my community, they are thrilled  that they were finally able to get the Social Security benefit that  they deserve and earned. There wasn't anywhere that I could go in the  community: church, the grocery store, the gym, restaurants, someone  always stopped me to thank me for voting for the Social Security  Fairness…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Republicans would not  reinstate the cost-saving and lifesaving tax credits. Millions of  Floridians, like many more across America, are facing higher healthcare  costs.\n\nWhat wasn't covered as much in the big, ugly bill and its impact is  what it is going to do to drive up people's electric bill. Already,  this year, household electricity prices are up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…had three major surgeries and six or more outpatient surgeries, all  made possible because of Medicaid. We would not have been able to get  our daughter what she needed if it wasn't for Medicaid.\n\n``She also has a seizure disorder and is on several medications. Some  of them are way too expensive for us to afford on a blue-collar income.  Finding doctors…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…resolution, Chuck  Grassley, was already in the Senate.\n\nWhile C-SPAN had begun airing floor activities over on the House side  back in 1979, the Senate had been a tougher sell. It wasn't until  someone introduced then-Senate Minority Leader Byrd as the ``Speaker of  the House'' on a trip back home in West Virginia but gave him the wrong  title--``Speaker of…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the President is  doing because they are paying those bills every month. Every month,  they know that tariffs are causing this inflation, and it is a self- inflicted wound. It wasn't Russia invading Ukraine. It wasn't a  pandemic. It was Trump and his tariffs that are not rooted in any kind  of true economic policy.\n\nMr. Speaker, if we defeat the previous…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…on minimum wage, private equity is coming in to buy up the  apartments and colluding to drive up the rents so it is even more  unaffordable to keep a roof over your head.\n\nIt wasn't always this way.\n\nFrom World War II to the late 1970s, we actually rigorously enforced  our antitrust laws to ensure that mom-and-pop businesses had a chance  to compete against…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Republicans looked at this ugly  betrayal of a bill and agreed they couldn't be part of the process. I  commend them. But, sadly, three votes on the other side of the aisle  wasn't enough. We needed one more.\n\nAnd who swooped in to cast his vote--the decisive vote? Vice  President Vance. He showed up at the last minute and cast a tie- breaking vote in…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Would you be interested in being my support vehicle?'       '' Hoker recalled. ``I thought it over and got back to him       and said, `Yeah, I'll do it.' '' The ride       wasn't just about miles. It became a journey of connection       with the country and its people.\n\n``I have a good feeling about America now because people       were so kind and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…colleagues on the other side of the aisle did not want to answer. That  is the simple truth. When we wanted to get data about the border, they  didn't want to answer it. It wasn't because of COVID.\n\nMr. Speaker, I note with respect to California that California's  mandates effectively take away America's ability to buy new gas cars.  As I mentioned…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…when this invasion by Hamas started, Israel was doing  nothing to deserve this. Instead, Hamas invaded the country. They  killed 1,200 people. They took 251 hostages.\n\nIf that wasn't enough, the torture that they committed on that day  was horrific. For those of you who haven't seen the film of what they  did, I  strongly recommend you don't look at it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "James Risch", "party": "Republican", "sentence": "…``periodically,'' is the word used. Sadly, the War Powers Act never  required the President to submit a report to Congress when hostilities  ended. It should have been in the bill; it wasn't.\n\nFor this reason, I sent a letter to the President asking him to  confirm that there are no U.S. forces engaged in hostilities in  Venezuela. Now, I knew that. You all knew…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…community, diverting water for  irrigation, plowing fields, and planning their first city, Salt Lake  City, our State's capital. Salt Lake was founded that very day. Denver  wasn't founded until 1858 and so was Carson City. Phoenix was founded  in 1867, Boise in 1863, and Helena in 1864. Of all Western States'  capital cities, only New Mexico's, Albuquerque,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…and, most importantly, pandering to radical  climate activists. Then they delivered perhaps the most damaging and  egregious move of all: They banned new exports on LNG. This wasn't to  help the environmental laws or to lower prices for American families.  It was to satisfy the radical green activists.\n\nLet me be clear that this ban put politics over…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…discourage marriage. Like I said, I rattled off about eight  programs. There are about 70 programs that you could lose if you worked  your way out of poverty or married somebody who wasn't in poverty.\n\nUsually, what you have to do is you have to keep your income below  $16,000 or $17,000, and if you talk to employers who hire people who  are making in the $10…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "John Rose", "party": "Republican", "sentence": "…protest was  growing outside and, unfortunately, made its way into the Capitol. As a  result, a joint session of Congress, originally set to be conducted in  the afternoon, wasn't finished until midnight or after.\n\nYet, the events of that day didn't change the serious concerns raised  about the ways six States conducted their elections. Members of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698515/standing-for-election-integrity"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…so strongly in this, they embodied it  in our Constitution. Our Constitution doesn't allow any one man or  woman to raise taxes. It must be the body of Congress.\n\nNow, this wasn't new. This was part of maybe a thousand-year  tradition from Magna Carta on. In Magna Carta, it is stated:\n\nNo taxation without the common counsel of the realm.\n\nEven at that…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…said there is all  these dollars--and I am going to talk about this probably two, three  times--that were appropriated. I showed one example of money  appropriated in 2015. It wasn't a huge amount of money, few million  bucks, and it has never been touched. We just leave it sitting in the  account. We borrowed it, we are paying interest on it, but it just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…preventing future Congresses from  allowing that tax increase to take effect. We also provided additional  benefits to working parents by making sure that their child tax credit  wasn't cut in half.\n\nAnd, of course, the President promised no tax on tips and no tax on  overtime for millions of middle-class families. We felt it was  important--and I know the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…philosopher, Alexis de  Tocqueville, traveled across the United States in the early 1800s in  search of what he said was ``America's genius and greatness.'' He said  that it wasn't in the commodious harbors or the fertile fields, not the  public schools or institutions of higher learning, not the democratic  Congress even, or our matchless Constitution,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695810/welcoming-rev-elliott-j-powell"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…was racist. And, you know, I didn't understand  that--being the first day here, I went, Wait a minute. I mean, I  thought we are all in this together. They know dang well this wasn't a  racist attack, but it was just something that they wanted to use, but  they never miss an opportunity to paint somebody a racist, you know,  when it comes to the Democrats.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…time of need to do what they needed to do.\n\nWe also saw where the Federal Government, in a lot of ways, failed to  do the job. Under the past administration, we saw where FEMA wasn't  doing the job. I am proud to say that under this new administration,  FEMA is getting the job done. Many folks who didn't live there saw  pictures of the mass destruction…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…its constitutionality. But it has been the  law now for over 50 years. And it is important to remember what it was  designed to prevent--and, even more importantly, what it wasn't.\n\nBack in 1973, the goal was preventing another Vietnam. The idea was  to impose guardrails against the large-scale, indefinite commitment of  U.S. troops abroad. And in shutting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…corruption, constitutes an unusual and extraordinary  threat to the national security and foreign policy of the United  States. . . .''\n\nNow, what I want you to know is that wasn't Donald Trump that wrote  that. That was Barack Obama that wrote that. If President Obama or  President Biden had taken the same actions to remove Maduro from power  and help…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}]