[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…right now on the floor of the House of Representatives,  connected to this one big, ugly bill.\n\nIn this letter, it says that: ``While we fully support efforts to  rein in wasteful spending and deliver on President Trump's agenda--''\n\nLet me park it right there parenthetically for a moment. Nothing in  this bill is about waste, fraud, and abuse. Nothing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…billionaire--those American farmers  and companies have lost their business with USAID, and the workers are  losing their jobs.\n\nIf the administration was serious about rooting out wasteful  spending, they would not have stopped programs in countries like  Somalia where USAID is a key partner in counterterrorism efforts with  the U.S. military.\n\nThey would not have…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…administration to, once again, hurt everyday Americans.\n\nMr. Speaker, it was just said on the House floor that the American  people are fed up with out-of-control, wasteful government spending. As  Democrats, we are committed to making sure that taxpayer dollars are  spent in an effective, efficient, and equitable manner.\n\nThis bill that is on the floor…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…lower people's  energy bills, transform our Nation's clean energy economy, and create  thousands of good-paying union jobs.\n\nThe administration called these investments wasteful spending. I am  here to tell you that they are wrong. Good-paying union jobs are not a  waste. Building the clean energy infrastructure of tomorrow right here  in America is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…cutting-edge technology that our warfighters and our military needs for  its readiness. This package invests in modernizing our Nation's air  traffic control systems and cuts wasteful spending in the Green New  Deal pet projects that only benefit far-left activists, all while  strengthening the safety net for those who are the most vulnerable  Americans and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…issued sweeping  nationwide injunctions to stop him at every turn. There have been 53  lawsuits already halting deportations of dangerous criminal aliens,  blocking cuts to wasteful spending, and tying the hands of a President  doing his best to protect America.\n\nThis isn't justice. It is judicial tyranny. The No Rogue Rulings Act  says that enough is enough.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…communities, and this investment will ensure they have the tools to  stop these lethal drugs before they reach our streets.\n\nMy second amendment redirects $2 million of wasteful spending to  increase further funding for counternarcotic support within the  Department of Defense. This will strengthen the DOD's critical role in  intercepting fentanyl and…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…degree.\n\nWhy should we continue to spend Americans' tax dollars on a system  that is clearly not working?\n\nSomething must change, and Americans are sick and tired of this  wasteful spending.\n\nWith Republicans in control of the House, Senate, and White House, we  have a real opportunity to cut through the waste, fraud, abuse, and  falsehoods in Washington.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…votes on the board to back up the principles that  most Americans relish, they walk away. They won't be there when it  actually matters.\n\nEverybody can talk about cutting wasteful spending, even if you don't  necessarily agree that it is wasteful spending. However, what we are  bringing today is wasteful spending, even if you think it might not be  as bad…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…wallets in fear.\n\nAgain, these are facts, Mr. Speaker, proven facts.\n\nThis budget resolution is our roadmap to take this country back. It  secures the border, slashes wasteful spending, delivers tax relief for  working families, and begins to rebuild the economy that the Biden- Harris administration shattered.\n\nIt is time to put America first again,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…service, leadership, and  enduring commitment to the safety of our communities. He has truly  earned this next chapter in his life.                    Eliminating Wasteful Federal Spending\n\nMr. CLINE. Mr. Speaker, the House is finally doing what the American  people have demanded for years. We are cutting wasteful spending and  restoring fiscal sanity.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…drained.\n\nSimply put, again, the budget resolution is a framework that will  allow us to deliver on the demands of the American people to secure the  border, eliminate wasteful spending, revitalize Biden's broken economy,  and safeguard our economic prosperity by providing permanent tax relief  for working families. I hope our Democratic colleagues will…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…received,  Congress has  45 days to act. The House is now acting. These rescissions are, in  part, due to what DOGE was able to uncover and bring forward in terms  of wasteful government spending.\n\nJust look at what we have been funding with taxpayer dollars: $6  million for net-zero cities in Mexico; $5.1 million for programs to  strengthen the resilience…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…deportations, and giving our agents the resources they need to stop the  fentanyl crisis and protect our communities.\n\nIt restores fiscal sanity by identifying $1.6 trillion in wasteful  spending for savings, ends taxpayer-funded transgender surgeries, and  implements real work requirements for able-bodied adults who are  benefiting from Medicaid or food stamp…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…right  now what they don't want to do is have the American people focusing on  the Republicans in Congress who are doing the thing they sent us here  to do, which is end wasteful spending, to stop the ridiculous spending  of a bureaucratic government that has been weaponized against the  people. These are dollars that are being used and wasted and sent…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…4, the  Rescissions Act of 2025.\n\nFor decades, Americans have been waiting for their leadership to  deliver on the promise that fiscal responsibility was on its way.\n\nWasteful spending of taxpayer dollars has been overlooked for far too  long. For far too many years, leaders have kicked the can down the  road, hoping a future Congress would make the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692519/rescissions-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…4234  and ask that it be reported by number.\n\nMr. SCOTT of Florida. Mr. President, I would like to thank my  colleague Senator Lee for working with me to stop Democrats' wasteful  spending in this package and bring accountability for the American  people.\n\nOur Nation is nearly $39 trillion in debt, running $2 trillion  deficits, and spending billions of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699432/consolidated-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…of Medicare services to our seniors.\n\nIt is completely and utterly unsustainable. We are at a critical  inflection point. We have a generational opportunity to rein in  wasteful spending, reignite growth, and put our Nation on a responsible  and sustainable path.\n\nMembers of this Chamber did just that. The Republicans of the House  fashioned a fiscal…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…and put money back into their  pockets.\n\nIn Terry County, they were grateful for our stewardship of their  hard-earned tax dollars as we cut $1.5 trillion in woke and wasteful  spending.\n\nIn Lynn County, we talked about strengthening rural healthcare  through the $50 billion rural healthcare fund; cracking down on waste,  fraud, and abuse that has plagued…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}]