[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…costs of  projects 4 years ago, 8 years ago, et cetera. It begs the question:  What will be the impact of these tariffs, whether it is on  transportation projects, on water infrastructure projects, on energy  infrastructure projects when the cost of materials goes up?\n\nIt is going to increase costs. It is going to delay projects. And,  once again, who…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…beneath  Sloan Canyon National Conservation Area. This pipeline will increase  water reliability for over a million southern Nevadans. It will fortify  the region's water infrastructure against potential outages, and it  will minimize disruptions and impacts to the surrounding communities.\n\nThe proposed underground route beneath the Sloan Canyon National…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…food benefits and  lose access to their healthcare in the HUD funding bill could lose  access to rental assistance, as well.\n\nI heard a lot about FEMA cuts. We had a water infrastructure  roundtable. I represent cities that have water infrastructure that is  over 100 years old. One of them received a grant to help upgrade its  water treatment plant and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…contingency bases and at  military installations, that can address and improve water efficiency,  and improve the conservation of water resources, and the resiliency of  water infrastructure.\n\nI urge support for my amendment.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694170/department-of-defense-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…percent of its annual water supply. Local ownership of this land will  allow the City to better manage its water resources, protect water  quality, and plan for future water infrastructure.\n\nUnder the bill, the land transfer would occur at no cost to the City  and be subject to valid existing rights.\n\nThe City would cover the administrative expenses of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…needed funding for the Howard Hanson Dam  bill, alongside crucial funding for many of our Nation's ports and  harbors.\n\nThe Energy and Water bill protects investments in water  infrastructure, hydroelectric power, and scientific discovery so our  National Labs can keep doing the cutting-edge work that we all rely on.  It rejects Trump's proposal to gut clean…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…access to use,  maintain, and repair Bolts Ditch Headgate and 450 feet of Bolts Ditch.\n\nRepresentative Neguse's legislation would ensure continued access to  critical water infrastructure, and promote efficient regional water  supply management while protecting the wilderness area.\n\nIt would also support higher in-stream flows for Cross Creek, reduce…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Government Accountability Office to review the  technical assistance programs created to help underserved, rural, and  Tribal communities obtain critical investment for their water  infrastructure needs.\n\nIn March, the Subcommittee on Water Resources and Environment heard  testimony from witnesses across the country on how these programs are  critical to economically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695403/water-resources-technical-assistance-review-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration's shortsighted  request.\n\nIt includes more dollars for harbor maintenance. It ensures that our  Great Lakes stay vibrant, our ports on all coasts stay open, and our  water infrastructure is built to last for Mother Nature's complexities  in this century and beyond. Our bill maintains our commitment for  critical regional commissions and authorities to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Additionally, I introduced legislation to crack down on junk fees  that would drain family budgets, and I have worked in a bipartisan  manner to lower costs and improve clean water infrastructure in  communities that need it the most.\n\nI have stood up for homebuyers, pushing back against corporate  practices that drive up housing prices and shut families out…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…that  were articulated by the sponsor, my colleague from Colorado, Ms.  Boebert; by the ranking member; and by the chairman. I think they have  ably explained why this water infrastructure project for southeastern  Colorado is so critical, a project 60 years in the making.\n\nI support it because, as was noted, there are no cogent issues with  this bill…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…communities.\n\nMy Democratic colleagues and I are committed to addressing the  barrier that rural communities face in securing clean water. That is  why we passed historic water infrastructure investments under the  Infrastructure Investment and Jobs Act and the Inflation Reduction Act.\n\nSince 2022, the IIJA has provided $500 million for the Arkansas  Valley…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…proposed budget effectively  annihilating the very science that keeps us safe. Programs that  previously had broad, bipartisan support, such as the Army Corps of  Engineers water infrastructure fund, EPA's drinking water and clean  water funds for States, forestry operations, energy utility assistance  for low-income households, science and technology programs,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…farmers and ranchers have been forced  to rely on unsafe, carcinogenic water for generations, despite the  Federal Government's six-decade-old commitment to fix their water  infrastructure.\n\nThe Arkansas Valley Conduit is the final unfinished piece of a water  delivery project that Congress authorized in 1962, 2 years before I was  even born. The conduit…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Farmers need that stuff. They don't want to go back to  the ``Farmers' Almanac'' in order to make key business decisions.\n\nWe see hundreds of millions of dollars in water supply infrastructure  projects suddenly in limbo because of DOGE, while our colleagues across  the aisle say nothing.\n\nWe see the entire rural healthcare safety net, including nursing…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…been invested in this  project. In 2020, President Trump and his team, his administration, did  the right thing, continuing with their commitment to improve Western  water infrastructure. He more than doubled the Federal investments in  this project with $28 million going toward it. The State of Colorado  then invested over $100 million in this project.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this vital infrastructure near Bolts Lake.\n\nThis is commonsense legislation that will help local Coloradans and  improve the operational efficiency of this important water  infrastructure.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…to assert our country's energy dominance. The bill cuts $766.4 million,  when compared to last year's funding bill, by focusing our efforts on  energy innovation and water infrastructure.\n\nThis appropriations bill provides funding to numerous scientific  energy endeavors from nuclear fusion research, small modular reactors,  nuclear fuel production,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…GOSAR.  Boebert), the lead sponsor of this bill.\n\nMr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue water  infrastructure improvements in rural Colorado. I thank Ms. Boebert for  her diligent work and attention to these issues.\n\nArizona is no second citizen to this. We want to see this…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Environmental Protection Agency.\n\n(4) An evaluation of how the provision of covered technical       assistance builds capacity in communities to access other       water infrastructure programs carried out by the       Administrator.\n\n(5) An assessment of the needs of economically distressed       communities eligible to receive assistance under a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…lower the cost of living and boost the economy. They  support domestic energy production, resulting in lower costs for  American families and businesses, and invest in water infrastructure to  address drought and protect supplies for communities across this  country.\n\nThese appropriations bills that are included in the rule spend hard- earned tax dollars…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…requests.\n\nThe bill invests $1.74 billion in 1,277 Community Project Funding and  Congressionally Directed Spending projects. These projects will improve  clean and drinking water infrastructure throughout this country.\n\nThis bill also fully funds all of our, what I call, must-pays, such  as PILT payments--payments in lieu of taxes--to States and territories…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…uses in The Dalles. In fact, the existing infrastructure  provides 80 percent of the City's annual water supply.\n\nHowever, in order to access and maintain this critical water  infrastructure, the City must perpetually reapply for special use  permits from the Forest Service, a time-consuming and expensive  process.\n\nIn addition to wasting time and personnel…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…States section of the  International Boundary and Water Commission, or IBWC, to receive  additional funding from other Federal and non-Federal partners to  support water and wastewater infrastructure.\n\nThe IBWC is already authorized to receive funds from the  Environmental Protection Agency, but this bill will allow the IBWC to  partner with other agencies…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…water and police projects will be funded, which will benefit some of  the poorest and most rural areas in this country. These projects will  help fund long-overdue water infrastructure projects and make local  improvements, ultimately driving down costs for communities throughout  the Nation.\n\nMr. Speaker, I recognize Representatives Houchin and Russell…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…today to announce that through  community project funding, my team and I have secured $3 million for  southeast Iowa, delivering targeted investments in public safety, water  infrastructure, and housing development.\n\nThese investments include: $500,000 for the SAFECity Initiative in  Oskaloosa, bringing advanced public safety technology to the community…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}]