[{"senator": "Al Green", "party": "Democrat", "sentence": "…and maybe one  or two others, which may be the case this time. Yet, believe me, it  will not deter me.\n\nWhat is interesting is that I have this on my wall. By the way, many  of the people who are listed here as persons who supported H. Res. 646,  many of the people who supported H. Res. 646, many of them who are  listed here, they have a similar document…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…January 20, the President was sworn in. This is when he signed the  pardon for these people who came into the Capitol in a very  rambunctious way and in a very demeaning way, in fact.\n\nPeople died as a result of this. He instigated this. What causes  people to think that he won't do it again? I believe that he will. I  believe that he will find great difficulty…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…of something that we all need.\n\nIt is Secretary Burgum's order, and it is the way Secretary Wright is  behaving, and it is the way Lee Zeldin is behaving, and it is the way  people in the White House are behaving. They want to create a shortage  of electricity. Why? First, they have ideology against solar and wind.  Trump has a particular idea about…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…object to. Let's go after the criminals.\n\nBy the way, we are not the party that pardoned all the  insurrectionists on January 6 and said that the slate is clean. By the  way, those people go on to murder innocent people, to rape women, and  molest children.\n\nThere is a difference here. We want to go after the violent  criminals, those who have committed…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…exempt millionaires.  Let's keep the tax cuts for the middle class and exempt millionaires.  Everyone on the Rules Committee, including the gentleman, voted ``no.''\n\nBy the way, if people want to know what is going on here, the cuts to  SNAP alone are $300 billion. The cuts to Medicaid in the Affordable  Care Act are $1 trillion. The tax cuts for people…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…cryptocurrency that is being used in  this fashion, and therefore I will present a different option, which is  to say we should address both the sale of meme coins as a way to profit  from people wanting to give us money and we should also cover the  stablecoins as well.\n\nSo this broader amendment is a more comprehensive way, regardless of  what conclusions…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Association of Social Workers, National Education       Association, National Women's Law Center, NETWORK Lobby for       Catholic Social Justice, People For the American Way, People       Power United, Public Citizen, Seed the Vote Action, SEIU,       Stand Up America, The Workers Circle, Voices for Progress,       50501 Movement.\n\nTo learn more about…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the aisle think that it is absolutely insane to raise the price of  healthcare; that they don't want to be associated with that. There are  so many people who feel that way. We have people retiring on the other  side of the aisle.\n\nBut the only way that we move the needle is if we get loud about it.  That is exactly what happened in 2017. Why is it that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…people shot when they didn't need to be.\n\nYou know, one of the things that is so important for us if we have a  family and if we live in a community is to act in a way in which the  people around us can be confident that we have got their backs; that we  won't hurt them or harm them; that we notice what their struggles are  and that we will try to help.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…question  for you, sir. My colleague from Hawaii said it perfectly yesterday.  Here is the quote:\n\nThere is enough money to bail out Argentina with $40       billion.\n\nBy the way, for people who don't know what that means, to all the  cattle ranchers in America, President Donald Trump said he is going to  bail out Argentina and buy $40 billion of their beef.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…see, after experiencing trauma--like witnessing a  shooting or seeing their home destroyed by a fire--people can suffer.  Exposure to trauma can harm the brain, changing the way people see and  interact with the world.\n\nWe know that young people who experience trauma have a shorter life  expectancy, are more likely to misuse drugs, attempt suicide, commit…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Act (ADA) was signed into law, and the theme  of the parade is 35 years of ADA: Still Rising, Still Thriving.\n\nThe mission of the Disability Pride Parade is to change the way  people think about and define ``disability,'' to break down and end the  internalized shame among people with disabilities, and to promote the  belief in society that disability…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…meets the moment, because the truth  is, we can't afford to fall behind.\n\nRight now we are at a crossroad. The digital asset industry is  growing, evolving, changing the way people around the world engage with  financial markets and emerging technologies. Without a clear regulatory  structure in place, we are seeing innovation move overseas not because…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…With immigration, you still have fewer people. That is over 20  years.\n\nOkay, fine. Maybe that is the policy decision of our society. In that  case, don't stand in our way when people like me are trying to find  ways to actually have productivity, wages grow.\n\nThis is something very unique that the United States is up against:  massive amounts of debt.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…continent against another continent.\n\nRemember the statistics of how well people do here and make sure that  our next generation is not polluted by this because we have way too  many people floating around this country who got a certificate in DEI  or a major in DEI, and they are up to no good.\n\nAnother thing I want to mention here is with regard to immigration.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…that framework and how the Supreme Court has applied it  to its decisions over the years is as essential today as it was 200  years ago.\n\nWhat has changed, however, is the way people get their information.  Today, most of us rely on digital sources for the most up-to-date  information, whether it is news, airfares, the weather, or Supreme  Court case…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…don't think  we have an Iron Dome-type Israel situation in which we are prepared for  other sorts of missiles.\n\nI think the reason we are not prepared is that there are way too many  people who are not working as hard as they could in the Pentagon. I am  going to ask the press corps to wake up and ask people about that.\n\nI will also ask the press corps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…track to put more  money in the pockets, by the way, of hardworking families, as we just  succeeded in doing with the One Big Beautiful Bill Act, every step of  the way, the only people trying to block that effort have been  Democrats in Washington.\n\nThey are getting nervous. They are feeling the heat from people back  home, Mr. Speaker, that are angry,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]