[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Yesterday, I urged the Speaker to join me on the House floor to  debate this reckless budget one-on-one so we would have an opportunity  to fully air, in a transparent way before the American people,  Democratic values and Republican values, the Democratic perspective on  this budget and the Republican perspective.\n\nI am on the House floor right now. I…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…operations--offensive operations--against the  Iranian regime or any other.\n\nThis resolution, with my amendment, would give Senators confidence  that a vote on that question will in no way put American troops or our  allies at increased risk, and the underlying resolution would give the  American people the confidence of knowing that they will not be dragged  into another…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…mainstream focus with the launch of  OpenAI's ChatGPT. When I first tried this tool, I was shocked. I knew  then and there that AI had the potential to revolutionize the way  American firms operate and do business.\n\nAI, like all emerging technology, comes with risks. AI outputs are  prone to bias, discrimination, misinformation, and omissions. Safety…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…citizen--who is  fighting cancer.\n\nAnd Trump has done that twice. That is right--twice. He has deported  a mother along with a kid who is fighting cancer--a kid, by the way,  who is an American citizen.\n\nHe is doing that without giving these parents any meaningful time to  talk to a lawyer or a spouse or to figure out what is best for that  child. We know…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…lower premiums  is to pass a clean restoration of the credits that expired last year.\n\nSo to my Republican colleagues: Do not block this legislation. Do not  get in the way. The American people demand relief, and today, you have  a chance to deliver it.\n\nMr. SCHUMER. Mr. President, Americans across the country--they could  be Democrats; they could be…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…law is misleading. It is already against the law. And, by the way, it  is also extremely, extremely rare.\n\nBut if our Republican colleagues were to have their way, American  citizens--American citizens--would feel the impacts of the SAVE Act,  from the Active-Duty servicemember who has to move for a new deployment  and has to work so much harder than…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…them.\n\nWithout these amendments, this bill gives DHS and ICE free rein to  operate unchecked and unaccountable while Republicans in this body  continue to look the other way.\n\nThe American people deserve better. They deserve safety without fear,  enforcement without lawlessness, and a government that follows the  Constitution.\n\nMr. Speaker, until the Department…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…over the previous 15  years when they were trying to get rid of it. Maybe this is death by a  thousand cuts in their minds, but something strange happened along the  way.\n\nThe American people started getting these notices in the mail that  their premiums were about to double or triple. The American people,  millions of them across the country, started…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…It sounds  like he is planning to separate children deliberately from their  parents in order to have that trauma be a deterrent for people coming.\n\nI said: There is no way any American administration--not blue, not  red--would ever deliberately harm children as a political policy  strategy.\n\nA member of my team said: There is one way to find out. Go…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…look good, but the minute trouble  arises, suddenly Hegseth says someone else was making the decision.\n\nNow, let's be very clear about something: There is a very easy way  for the American people to get the truth. Pete Hegseth should release  the full tapes of the September 2 attack--both the first and second  strike; not a clip, not some edited or redacted…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and woke Democrats  welcomed these often-unvetted individuals with open arms to the United  States through illegal programs. But they make no attempt to adapt to  our way and our American lives. Instead, they try to turn whatever  American city they are hiding out in into Somalia 2.0.\n\nThankfully, the Trump administration is working around the clock to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…drug trafficking networks that have gained, unfortunately,  a stronghold and a foothold in the United States and to combat the  fentanyl crisis that continues to claim way too many American lives.\n\nThis bill contains funding for the national security and  counterintelligence missions that counter foreign threats and protect  U.S. interests. By investing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…The rule provides for a motion to recommit for all  five bills.\n\nMr. Speaker, the bills before us today are about one thing: getting  the Federal Government out of the way of the American worker.\n\nFor too long, outdated definitions and woke regulatory overreach have  stifled opportunities and created a paperwork trap for the job creators  on our Main…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…voters said they had a poor experience going to the ballot. Over 72  percent said they had an excellent experience at the ballot. Then, you  could go further.\n\nBy the way, the American people get this. They understand that there  are examples of voter fraud. I come from a State where our elections  commissioner went to jail--yes, went to Federal prison--for…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the American people. And it is certainly  not going to continue to be stolen like it has been by these fraudsters  in Minnesota, while the Democrats look the other way.\n\nIn all, American workers are going to see higher take-home pay, more  money in their pockets, thanks to what we passed with the Working  Families Tax Cuts law.\n\nRepublicans are creating…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…framework, one that fosters innovation, creates  clarity, and protects consumers.\n\nNow we can start making sure that this foundation is built in a safe  and secure way for every American. We build directly on the momentum  and the strength of our national security posture at this very critical  time.\n\nWe all know that blockchain technology and digital…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…we are hopeful that by November 21, this  process can be complete and that we will be moving from a Biden budget  to a Trump and Republican budget, which, by the way, is what the  American people voted for when they gave a mandate to President Donald  Trump on November 5.\n\nNow, I mentioned the 12 bills, and 8 of the 12 have come out with  bipartisan…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Real Estate Caucus,  I worked with the Trump administration to reverse these disastrous  policies because the government should get out of the way and not stand  in the way of the American Dream.\n\nBack home in Missouri, I have seen exactly what these mandates do. A  Kansas builder showed that so-called green energy codes save homeowners  only about $125…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…but we in the Federal  Government have a role to play as well, one where we can help  facilitate these changes as opposed to more bureaucracy or rules that  stand in the way of American talent and ingenuity. By embracing these  reforms, we can help grow the housing supply, expand opportunity, and  unlock the American Dream for millions of Americans.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}]