[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President has used our military to strike  unknown targets on at least four occasions, and he is promising more.  With at least 21 people dead and more killing on the way and with the  President telling us that strikes on land-based targets may be next, we  ask you to join us in reasserting Congress's vital control over the war  power.\n\nMr. SCHIFF. Mr. President,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Caribbean Sea as  Trump is, once again, unilaterally--and unconstitutionally--using our  troops however he sees fit, rule of law be damned.\n\nTo put what he has done another way, the President has ordered  repeated military strikes against civilians without congressional  oversight, and he has claimed that such military action is justified  because he himself,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…had, as a result of the tariffs that are seen by our  trading partner in Canada that was the participant in the U.S.-Mexico- Canada Trade Agreement--negotiated, by the way, by President Trump, an  agreement he bragged about as being really effective and the best trade  agreement--that is getting ripped up in many ways. And then when you  add to it the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…reduce the trade deficit. It has reached a record high.\n\nAmericans literally cannot afford 3 more years of this, which brings  me to the heart of the matter, the No. 1 way President Trump has  worsened the state of our Union. He has taken a diverse, complicated,  and sometimes fractious country--which has always been diverse,  complicated, and sometimes…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…more equipment  and resources. That is why these bills are bipartisan. How can we allow  bipartisan bills passed out of the Senate to then be stopped, in a  partisan way, by a President who is then going to choose red States and  hurt blue States, even though my State has millions of Republicans who  deserve to have their communities safe as well?…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…$250,000, a permanent felony record, possible  restrictions on future employment, firearm ownership, and other rights.\n\nNow, if I or anyone of you should indicate in some way that the  President ought to somehow receive a death sentence, or if I or one of  you should indicate that the President ought to be hanged, I guarantee  you this President would have…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…using licenses or mergers as a way to coerce them to put up  what the government wants; the President telling the universities that  they need to shape their education the way the President wants and  support his political agenda--are you kidding me?--and so forth. And  then weaponizing the Department of Justice to go after an enemies list.\n\nSo it is here…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that he could then  return money, some to them if they were qualified but much to  billionaires who would qualify.\n\nThis is, in my opinion, a shameful and disgraceful way for the  President to tell people that they are going to get a tax break when it  is really their money that is being returned to them by way of this  tariff.\n\nI would also remind people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…organizations--Catholic, evangelical, Jewish--that have been doing this  work in many instances for more than a century, in  such an orchestrated, intentional, and calculated way as President  Trump.\n\nMatthew: ``I was a stranger and you welcomed me in. I was sick and  you cared for me. I was hungry and you fed me.'' This is a bedrock  belief of our Nation's…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…energy  independence.\n\nIt was done in a way that was as illogical, chaotic, and likely  illegal as canceling Revolution Wind was. Again, a self-inflicted wound  in every way by this President, and that is why he is the energy  emergency. He created it in just months, not even a year. He declared  it on his first day in office when there was no energy emergency.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…down to everybody else.\n\nThat is the Trump tax policy. That was the Trump tax policy in 2017,  and it is the Trump tax policy this year.\n\nIt is very unusual, by the way, to have a President who has been here  twice with an interruption, but that is the case with President Trump.  We now know the facts of the math that he claimed the last time.\n\nHe said…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…race-based electoral districts for any of'' some three maps that  are discussed in the letter, which includes the maps that are addressed  by the Department of Justice. By the way, the President made the  request that this be done.\n\nThe attorney general for the State of Texas said, no, they don't do  business like that. They don't draw lines to benefit people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…moment this is for our  rural communities. These days, Democrats and Republicans don't often  see eye to eye long enough to get a piece of legislation like this all  the way to the President's desk. The fact that we will today shows just  how important we all know it is to stand up for our rural communities.\n\nFor New Mexico, this is real money with real…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…banned--the very essence of bigotry and  discrimination. That policy was struck down by the Supreme Court. The  administration recalibrated it to do it in a different way, but the  President revealed what is his motivation.\n\nA few months into his first term, he said in an Oval Office meeting  of top officials that he thought that Haitians ``all have AIDS''--a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…could get  away with even if they were caught red-handed. They knew they could get  away with it because they knew that the President was there to back  them.\n\nBy the way, the President is also there to do what he normally does,  and that is throw his acolytes, his underlings, his persons who are  beneath him, if you will, throw them under the bus, and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…DHS, all the  spending on all the various programs in Commerce, and go down the list.\n\nWhat else? I read a story yesterday that because of tariff policy--by  the way, I support the President using tariff policy to isolate China,  restructure our worldwide trade that is being abused by friend and foe,  but I just read a story yesterday that they are planning…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…controls.\n\nThere is a troubling pattern where union bosses block measures that  they don't like, forgetting that they work for the American people and  not the other way around.\n\nThe President's executive order also improves care for veterans. On  August 6, 2025, the VA announced that it is terminating most union  contracts to comply with the executive…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…These terrorists have also targeted our friends in  Israel, Saudi Arabia, and the United Arab Emirates--mostly civilians,  for that matter.\n\nSo if the Democrats had their way, President Trump would not be able  to, for example, strike a secret meeting of senior Houthi leaders;  wouldn't be able to strike imminent attacks on our friends in countries  like…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…about what we are doing here  tonight.\n\nIn talking about free speech, it seemed to me that the gentleman from  Texas was doing all he could to prohibit or get in the way of the  President of the United States exercising his free speech and his  address to the joint session.\n\nThis is not about policy. This is not about whether Republicans are  better…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…provisions but also the spending cuts that are so important and to help  the President keep his other promises that he made on the campaign  trail. And we are on our way to what President Trump likes to call  ``one, big, beautiful bill.''\n\nWell, a lot of important conversations have been taking place, on  both sides of the Capitol, about what the result…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…making, frequently, millions of dollars a year are taxed at a much  lower rate than people who are welders, people who are nurses, or  people who make their money any other way.\n\nPresident Trump came out against the carried interest loophole when  he ran for President in 2016. He wasn't able to get rid of it at that  time. This time, I hope that our Committee…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…Supreme Court, about getting rid of any liability that  they should have for any damages.\n\nThe most recent thing that we have seen is within the executive  branch. By the way, the President's Chief of Staff  and the President's Attorney General worked for one of the biggest  lobbying firms, which has received hundreds of thousands and millions  of dollars…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700177/justice-for-epstein-victims"}]