[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…capital markets, and transparency  strengthens markets.\n\nBy doubling down on our strengths, this bill will further cement our  competitive lead and aid investors along the way.\n\nMr. Speaker, I call on my colleagues to support my legislation.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid and SNAP benefits for over a decade now. I  may well have found myself in a worse place if not for these programs.  Giving freely and charitably is the way of Jesus.''\n\nMr. Speaker, some people in this Chamber need to hear those words  again: ``Giving freely and charitably is the way of Jesus.'' That is  someone who is talking like a Matthew…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…that research saves and  all the people who are kept healthy and safe by this research.\n\nThis does not have to be partisan. This does not have to be  controversial in any way. Mr. Speaker, I call on all of my colleagues  on both sides of the aisle to stand up for science, research, and  innovation because standing up for science means standing up for the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…as a criminal.\n\nWe must reject this rhetoric and policies that pit our immigrant  communities against each other, tear families apart, and put our  neighbors in harm's way. Mr. Speaker, it is important to understand the  cruelty and how we need to make sure that, again, we protect our  community.                            Celebrating Juneteenth\n\nMs.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Speaker, I thank my colleagues, Chairman Williams and Ranking  Member Velazquez, for this incredible work and, as Mr. Stauber said,  allowing us to work together in this way.\n\nMr. Speaker, I thank Mr. Stauber for his incredible work in this area  and for his willingness to advocate for so many Americans, including  his own child. It takes tremendous strength…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…investment for them to do many of the drugs and treatments that we  currently have. This has been the case for decades. While some claim  that this is easily done, there is no way.\n\nMr. Speaker, the Chinese are investing billions of dollars to catch  up to us in this field. We should not lose American leadership.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…international system, global peace  and security, the health and welfare of millions of children across the  world and on public television. We will fight back every step of the  way.\n\nMr. Speaker, not only am I a ``no,'' I am a ``hell, no'' on this  package.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692386/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…security reasons. The House voted to reject such a  straitjacket on wind power and instead rely on the experts at DOD to  judge each project on the facts and science.\n\nBy the way, Mr. Speaker, just for the record, the turbine blades and  components in the Revolution Wind project are not made in China. Up in  New England, we pride ourselves on not, in fact,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…home buyer savings accounts, allowing  future home buyers to save, with tax deductible contributions, for the  downpayment and closing costs that often stand in their way.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this bill. Together, we can meet the affordability crisis head  on and deliver real support for our constituents.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…States at issue, and  this Republican Congress has decided that it is of the utmost priority  to, via legislative action, overturn resource management plans that, by  the way, Mr. Speaker, could simply be reversed with a phone call to the  Secretary of the Interior.\n\nLast time I checked, the Secretary of the Interior happens to be the  former Governor of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…have their family torn apart like I have or for someone  else to attend a wake or a funeral instead of a wedding or a graduation  ceremony. It doesn't have to be this way.\n\nMr. Speaker, I just--if we want to say it this way--celebrated the  12th anniversary of my son's murder. If my colleagues want to talk  about protecting our kids, let's really do…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…businesses, inflationary tariffs, and Elon Musk's access to the SBA's  HR, contract, and payment systems. I welcome the opportunity to look  into these matters in a bipartisan way.\n\nMr. Speaker, turning to our first bill, H.R. 825 will prohibit anyone  convicted of defrauding the government during the COVID-19 pandemic  from receiving an SBA loan.\n\nThe Small…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…resolution that the House is  going to consider today. This resolution is not bipartisan. It is not  carried by the Member who represents this community. This a first, by  the way, Mr. Speaker, in the precedence of this House, that the  majority would not give the Representative who represents the victims  the opportunity to speak on behalf of their community,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…like over in Congo. One- third of the world's cobalt comes from child slave labor, forced slave  labor. We have 88 percent of the reserves right in that complex.\n\nBy the way, Mr. Speaker, this Congressional Review Act doesn't  approve or disapprove any mining. It reverses the mining ban, the  dangerous mining ban, that the Biden administration put forward…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…refining on the Gulf Coast of Texas. If you transfer that to 18- wheelers, it is about 5,253 18-wheeler tankers on the road every day.  The pipeline is the best way to do this.\n\nMr. Speaker, in Texas, we understand better than anyone else that  America's energy strength depends on what happens to the oil after it  comes out of the ground. The Keystone…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…regulatory paralysis from the  previous administration. There was hardly a rubberstamp. There was  never a decision.\n\nFrankly, all we are asking for is a decision one way or another, Mr.  Speaker, yes or no, green light, red light. Don't just sit there in  purgatory forever and not make a doggone decision. That is the problem  we are trying to fix.\n\nWith…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…thoughts about where this  could go in the future, but, quite honestly, that is not the way this  bill was drafted. It is not going to lend itself to being used that  way.\n\nMr. Speaker, I do agree with the ranking member that all U.S. States  and territories already criminalize misuse of less-than-lethal devices  through existing assault and battery…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fact that I was  the vice chair and my chairwoman actually had a brain aneurysm. Also,  they had just indicted 10 percent of my State legislature.\n\nRemember, the fastest way, Mr. Speaker, to move up in an organization  is to have 10 percent of the people go to jail.\n\nI was a 28-year-old kid in my State legislature, and I was chairing  the health committee.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…my country. I will do it because I care. I swore an oath to the  Constitution to serve my constituents, to serve my State, and to serve  my Nation every possible way that I can.\n\nMr. Speaker, I urge my colleagues to take cyber threats by malign  actors seriously. I urge my colleagues to protect the security of  Americans' data. I urge my colleagues to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…undermines national security, and rewards partisan obstruction.  President Trump is trying to fulfill his duty to protect the American  people. Congress should not stand in his way.\n\nMr. Speaker, I urge my colleagues to stand with the President, put  America's security ahead of union politics, and vote ``no.''", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…bipartisan support because the  problem is obvious: We don't have enough housing, and Washington is  making it worse. The solution is also obvious: Stop standing in the  way.\n\nMr. Speaker, this legislation rejects the left's obsession with  central planning and embraces free enterprise, local control, and  common sense. It puts builders back to work and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…at Farm Credit, he built long-lasting friendships and  relationships with the people Farm Credit is proud to serve, and he  created long-lasting value every step of the way.\n\nMr. Speaker, everyone who is fortunate enough to have worked  alongside Vance, to know him, or to even call him a friend agrees with  this sentiment.\n\nMr. Speaker, I congratulate…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…the country.\n\nThis bill empowers parents with scholarships for tutoring, private  and parochial schools, and special needs, keeping the Federal  Government out of the way.\n\nMr. Speaker, school choice funds students, not systems. Let's pass  the one big, beautiful bill and deliver on the promise of educational  freedom for every child and every family.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692895/delivering-on-educational-freedom"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Colorado, along with Congressman Mackenzie from Pennsylvania for  lending their comments tonight, as well as our Speaker tonight, who  encourages us every step of the way.\n\nMr. Speaker, I thank you for the opportunity tonight. This is so  important that for once we are showing that Washington can work. We  rarely see in a substantive bill like this…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…of their hard  work, their integrity, and their devotion to the community. It reminds  us that real, lasting success is about the people that you treat well  along the way.\n\nMr. Speaker, on behalf of the family of South Carolina, I thank  George and Joanna and their family for their many years of service in  Fort Lawn and Chester County. I pray their…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…needed to power next- generation industries, we will cede American leadership on the world  stage to Communist regimes such as China and raise costs on consumers  along the way.\n\nMr. Speaker, I urge my colleagues to support the legislation as it  will make our grid more reliable and lower America's electricity bills.\n\nMr. GUTHRIE. Mr. Speaker, I thank Congressman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Americans.\n\nIt is past time we restore a commonsense approach to this and ensure  that our farmers can finally defend their ponds without any Federal red  tape in the way.\n\nMr. Speaker, I thank Chairman Westerman, Leader Scalise, the Gulf  Coast officials, and numerous Mississippians who have worked hard to  bring this bill to the floor. I urge my colleagues…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}]