[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…While the insurrectionists did not succeed that day, they did cause  even bigger damage than the dollar damage. The person most responsible  for this continues to behave the way he did then.\n\nGeorge Santayana famously said that those who forget history are  condemned to repeat it. I pray that that is not the case. We must  remember honestly, all of us,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698520/solemnly-recognizing-the-5th-anniversary-of-january-6"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…``generous with his  time, welcoming by nature, and the kind of person who made you feel  included without trying. He deserved to grow older, to keep showing up  for people the way he did for me.''\n\nAnd Alex did show up for people. He went on to become a nurse,  serving veterans at the VA Hospital in Minneapolis. His coworkers,  friends, and patients described…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…big change. You have got to be  willing to stand and say it as he did. This is not to say that others  did not deliver great commentary. I singled him out because of the way  he did what he did and in the presence of the people. He didn't wait  until he was out behind their backs to say what he said. He said it in  front of their faces. In my neck of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…strengthening the support systems around them: the women who care for  them, the employers who depend on them, and the families who love them.  However, we have a long way to go.\n\nDid you know that only 49 percent of men in the U.S. aged 21 and  older had a routine doctor's appointment or cancer screening in the  past year? These are dismal numbers.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…believe he was at the  FDA, if I recall correctly. He did tests to make sure that the medical  devices that were up for approval had been tested and actually worked  the way that they did.\n\nHe gave me an example. He said that pacemakers were one of those.  There are people who are trying to make innovations with respect to  these kinds of medical devices.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…place they can rely on for local news, for weather reports.  And farmers across rural America depend on public broadcast to get  weather reports because there is no other way. Did they know that it  guts international aid that ensures America's national security? Did  they even think of the consequences, just because Donald Trump says he  wants it cut?…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…have worked so  hard to overcome. The Speaker turned his back on moms and dads in  Congress and working families across the country.\n\nCongress is stuck doing things the way that we did hundreds of years  ago, and it is time that we move it into the 21st century.\n\nFor all of the people who have said that I should resign because I  can't do my job, they…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…egregious mistake and instantly offered their resignation for having  violated the law, contravened common sense, and put American troops in  harm's way.\n\nLet me put it this way: Not only did the National Security Advisor  set up an illegal, unsecured chat with the Secretary of Defense, the  CIA Director, the Vice President, and others to discuss highly, highly…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Presidential, he is  in command of something.\n\nI have three brothers. I grew up in a very active household. If you  remember--those of you who got the crap beat out of you the way I did-- when your brothers say, ``Look over here,'' ``look over here'' and  sucker punch you, that is purposeful to distract you. That is what  Donald Trump is doing with military…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…deal with math. I understand that President  Trump told the gentlewoman and other Republicans ``to close your eyes''  and vote for this budget. That is a direct quote, by the way.\n\nDid he tell Republicans to hide their calculator, too?\n\nI just went through my concerns about the cuts in Medicaid. This  budget actually has instructions to the Committee on…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…turned out not to be needed or  better spent elsewhere, and we pull it back, and we put it into a  different program. But we do that readjustment in the same bipartisan  way we did the initial program.\n\nWe are saying to our colleagues across the aisle, if the power of the  purse means something--and it does: the difference between an  authoritarian…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…such a fan of Charlie, and he wanted to start a Turning  Point chapter at his school. The school didn't want to have that  chapter, so my grandson had to find another way, which he did. I texted  Charlie to read him in on the situation, to make him aware. He jumped  in to support my grandson and to thank him for the effort.\n\nMy grandson said he really…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…adhere to our  constitutional duty, and firmly address crime in the Nation's Capital.\n\nFor the citizens of D.C., I would say, we wish your Council did this  the right way, but they did not and we will act.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…we do so.\n\nA continuing resolution, particularly long term, is a crazy thing  because it says we are going to fund the Federal Government at the same  level, in the same way that we did last year. And if it is multiple  years of continuing resolutions, the same way we funded the government  the year before that. Does anyone believe that the priorities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of us.\n\nDoug, I know you are resting in peace for eternity, but I thank you  for serving this great Nation. I thank you for serving the great State  of California in the way you did. You left a legacy. You helped all of  us become better Representatives.\n\nTo Jill, our thoughts and prayers are with her and her four children.  God bless you and take care…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698719/9999"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…they have to turn themselves around.\n\nYears later, Mr. Speaker, I have had these same guys come to me, who  are now free, and say thank you. Thank you for talking to me the way  you did and handling me the way you did and making me realize that my  path to a better life began through jail.\n\nThe fact that this horrible man should brutally stab this innocent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…increasing number of spoiled Americans who have become like Greta  Thunberg--anti-Westerners, anti-American people--who want elected  officials who share their view.\n\nBy the way, since we did touch upon the economy, I want to point out  something recently that was pointed out to me by Steve Miller. In the  most recent jobs report, there were some jobs we got…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…regulated  at breakneck speed. They are up for review. They need to be modernized.\n\nPart of the question is, if you are going to regulate air quality, do  you do it the same way you did 30 years ago, when you actually have  remote sensors that can be in your pocket, or do you need the million- dollar-a-year tower to do it where you look at the entire marketplace?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}]