[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "That is going to happen in just a few days if we  don't act in a responsible, bipartisan way.", "title": "Department of Defense", "date": "2025-12-08"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Speaker, as this year's Women's History Month comes to a  close, there is no better way to honor the prolific and powerful  contributions of women in this country than to finally authorize the  creation of the Smithsonian American Women's History Museum on The  National Mall.", "title": "Women's History Month", "date": "2025-03-31"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "It is not pressing in the way that the corruption,  the lawlessness, the tariffs, or so many other things are.", "title": "Gross Violations of Law By Trump Administration", "date": "2025-05-07"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Your muscles waste away, including your heart  and your lung muscles.", "title": "Defending Medicaid for Families Like the Currans", "date": "2025-04-08"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "I am glad we can work together  in this bipartisan way to ensure fairness for the residents of  Washington, DC.", "title": "District of Columbia Local Funds Act, 2025", "date": "2025-03-14"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "When we finally do work in a bipartisan way,  the Speaker tries to use a procedural move to undo that.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-01"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "The sad part about it is that regardless of how you feel about the  Federal Government, regardless if you feel that these jobs were  unnecessary or unneeded, even if you feel that way, I think we can all  agree that there is a better way to treat somebody than sending a 20- year worker, a 15-year worker, a 10-year worker an email on a Saturday  night saying you are out of a job on Monday morning.", "title": "People, Not Statistics", "date": "2025-03-05"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "From my hometown, Nashua, all the way up  to the North Country, New Hampshire small businesses are truly world  class.", "title": "Small Business Advocacy Improvements Act of 2025", "date": "2025-02-24"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Housing is way too expensive, and Trump's chaos and  corruption are making it all worse.", "title": "Northeast Ohioans Are Getting Squeezed", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The  law requires the Trump administration to consult with Congress; the  Constitution demands it; and the American people, especially the  families of those in harm's way, deserve nothing less.", "title": "Iran", "date": "2025-06-23"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "There is a better way to deal with it.", "title": "Nomination of Frank Bisignano", "date": "2025-05-05"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "The Minnesota Lynx clawed their way through the playoffs.", "title": "Taking on Wnba", "date": "2025-07-21"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "The Congressional Budget  Office issued a letter on March 5 where they reinforced that the math  is conclusive: Major cuts are the only way to meet the requirements of  the Republican House budget resolution.", "title": "Voters Sent Us to Congress to Lower Costs", "date": "2025-03-25"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "The Gwich'in people have said over and over  that it puts their way of life at risk.", "title": "H.J. Res. 131", "date": "2025-12-04"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "By the way, to those who say that Biden should have released these  files, let me just address that right now.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "But until Congress and until the authors of this  proposal identify a way to offset the expense or to make it less  expensive, we should not move forward with this legislation.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": "2025-10-08"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "It hosted community meetings, business  affairs, social gatherings, and even served as a way station for  elected officials, becoming an integral part of the region's political  and civic fabric.", "title": "Congratulating the Waterville Hotel", "date": "2025-07-15"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "I have seen the border closed as best it possibly  could in an amazing way.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "To help pay  her way through school, she worked at the university's copper mine  while remaining engaged in many extracurricular activities.", "title": "Recognizing Valerie Prehoda on Her Induction Into the Michigan Tech President Council of Alumnae", "date": "2025-11-18"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "It ensures we are getting the necessary rounds  back into the magazines of our servicemembers, whether they are  training at home or deployed in harm's way.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-16"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Leading from the front and building consensus are not always easy  endeavors.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-08"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Each Member in this chamber  and every citizen in these United States should be humbled by the  courage of our brave Veterans who voluntarily faced danger and  adversity to preserve our country and our way of life.", "title": "Recognizing the Honor Flight of Southern Oregon", "date": "2025-05-15"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Speaker, I thank my friend from California for  his remarks, and as I always say to Californians, don't take Arizona's  water.", "title": "Dismantling California's Citizens Redistricting Commission", "date": "2025-07-23"}, {"senator": "John Thune", "party": "Republican", "sentence": "More manufacturing--more businesses and jobs here in America--grows  our tax base, and that means more revenue--revenue that we get the  right way, which is with a bigger and stronger economy, not bigger tax  bills.", "title": "National Small Business Week", "date": "2025-05-05"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "It is way overdue.", "title": "Veterans Scam and Fraud Evasion Act of 2025", "date": "2026-01-20"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Anna Roessner, a senior at  Fort Recovery High School, has represented her school ably on her way  to achieving the Division III State Title for the 100 Meter Dash at the  State Track and Field Meet.", "title": "Special Recognition of Anna Roessner for Winning the Division III State Track and Field Title for the 100 Meter Dash", "date": "2025-07-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Now we need to deal with the reality of how hard that math is,  but there is a way to do it.", "title": "A Real Math Problem", "date": "2025-03-06"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Republicans' big, beautiful bill was passed out of our Budget  Committee just under 3 months ago and is already well on its way to  being approved by this body by Memorial Day.", "title": "Big, Beautiful Bill", "date": "2025-05-07"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Additionally, the way these prices are advertised are fragmented and  not uniform.", "title": "Hotel Fees Transparency Act of 2025", "date": "2025-04-28"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "This bill also paves the way for a renewable energy corridor and  year-round access to vital subsistence and tourism areas.", "title": "Cape Fox Land Entitlement Finalization Act of 2025", "date": "2025-12-15"}]