[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…noncitizens, but  Americans, Americans like James Wilson.\n\nJames Wilson is an Arizona voter whom I met with last week. He was  meant to join us in the gallery. He flew all the way to Washington,  D.C., last week to watch Congress debate the SAVE Act. He was forced to  fly home after the Speaker canceled 3 days of legislative work.\n\nMr. Wilson is an American…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…the pain  from his Trump tax, and what is the response from Republicans in  Congress? The majority plans to follow Trump off the cliff and make it  worse while we are on the way down.\n\nThis month, Republicans plan to pass the new tax cuts for their  billionaire donors and big corporations, and their giveaway to the  wealthy will be paid for by cuts…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…and a  dedicated leader on tribal treaty rights and environmental stewardship.  He served as chair of the Northwest Indian Fisheries Commission for  over 30 years, paved the way for the Boldt decision and was honored  with numerous prestigious awards. In 2015, he was awarded the  Presidential Medal of Freedom, the Nation's highest civilian honor.\n\nI…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…thing to see happen in the United States of  America.\n\nAlex Padilla is a great guy. He is thoughtful. He is passionate. He  is just trying to serve his constituents in the best way he knows how  by doing the thing that is in our Constitution--freedom of speech,  article I--by exercising his constitutional rights and his rights as a  U.S. Senator to ask…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…of public lands upside down, throwing it into chaos, all  just to score that quick win for their fossil fuel buddies because the  existing plans don't give away the store the way they would like to.\n\nIt doesn't matter that this might upend the system that grants land  ownership to Alaska Native veterans of the Vietnam war, which is what  one of these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…with. Both  bills are bipartisan; both even have a budget score, and yet the  Democratic bill sits with no plan to get it signed into law.\n\nWe need to pass bills over here in a way that ensures that both  Republican and Democratic priorities and bills become law.\n\nIn addition, I do have substantive concerns with S. 1084. I was not  the ranking member of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698420/unanimous-consent-requests-the-calendar"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…co-chair of the House Great Lakes Task  Force, I rise today to speak on behalf of our Great Lakes region.\n\nMy part of it is the Ninth District of Ohio that stretches all the  way from Bryan, Ohio, all the way across the northern part of Ohio  through Toledo, all the way to Sandusky and down to Fremont, Ohio,  passing through places like Rossford, Perrysburg,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…information to get on Social Security. This is  something that has been normal practice, using very precise identifiers  to make sure that waste, fraud, and abuse do not occur.\n\nBy the way, Social Security's accuracy is 99.7 percent. That has been  verified by outside audits and by the Social Security trustees. Yet,  despite that track record, what they are going…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…25 percent to the cost of fertilizer when that input cost  is already so high? It is mind-boggling to think that this is a  voluntary action by the President.\n\nCanada, by the way, happens to be our biggest trading partner, and 34  States have Canada as their major trading partner. In these tariffs--in  Canada, we are a 2.1 billion import partner with…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…sacrifice.\n\nIt is our responsibility as Americans to ensure that all of our  servicemembers, veterans, and their families have the support that they  earned and deserve. One way we can do that is by ensuring that veterans  are financially secure when their military service is over.\n\nMedal of Honor awardees receive a monthly pension that has not been…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…simply, was a call to action, and I am  going to talk about those American citizens who came forward. But make  no mistake, what happened to them could happen to any of us on our way  to church for a clothing drive or to make a donation, on your way to a  doctor's appointment, or even heading home from dropping off your 6- year-old son at school--everyday…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…commend my colleagues for working to get them to  the place that I know we are now, I can't in good faith support any  funding package that enables this administration in any way until ICE  de-escalates in Minnesota.\n\nThis is not how we operate in America. It is certainly not how we  operate in Minnesota. As Members of Congress, we must do everything…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699323/consolidated-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…see they are going down to negative--not just zero growth,  but negative. We can't afford that, and we can't afford the stock  market dropping 700 points yesterday.\n\nThe only way that we can work together is that if my colleagues here  will start talking about these tariff issues. We don't need to weaken  our institutions here; we need to strengthen…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…destroy our  democracy.\n\nThe President has turned the Oval Office into an auction house. He  has put a ``for sale'' sign on the White House lawn. Influence and  power are the way to a quick profit, whether it is crypto or pardons or  many of the other perks of office. He is using it for his own personal  ends and weaponizing the Department of Justice…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…these tax cuts for the billionaires, but you crashed the Social  Security website. You have closed offices. You have told seniors and  those with disabilities to figure out a way to get themselves to one of  the few offices that are still open, but you are going to have to wait  in a longer line because we have fired employees and are actually  ending…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…happy; I am very disappointed I am going  to have to do this--is to look at their language. If it is acceptable-- again, if he is doing anything with Presidential authority in the way  of adding or detracting, it won't be signed into law; it will be a  fruitless exercise. But if we accept their language--we will look at  it, and then maybe--maybe--we can…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people who are  here on student visas, work visas, or tourist visas. As far as people  who want to spend a short time here, particularly to work, we are even  more generous that way. I have heard of no strong efforts being made to  greatly reduce these numbers.\n\nAgain, we have to remind our young people, our constituents, not to  put up with this anti-American…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…shows  labor as a percentage of income.\n\nI am sorry, but this is actually really important when you are trying  to design how you finance your government. We are hitting a time way  down here. This is 2024 because that is the last sort of good data  point that I have. We actually believe it has actually fallen further.  For years, 64 percent, and there…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…this body has not resolved this.\n\nNow, I understand my Democratic colleagues want to defund ICE. I get  that. I hear from them over and over again: Let's defund ICE. And their  way of defunding ICE is to be able to cut off funding to this  particular part of our Federal budget.\n\nBut I think some of my colleagues have lost track of what this means  to be…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…months, President Trump has delivered on his promise  to restore America's strength and dominance, and I look forward to  continuing the fight with President Trump leading the way to ensure  America's golden age lasts for decades to come.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the mark and  then some.\n\nIt also makes ironclad commitments to deter aggression from foreign  adversaries that pose a serious threat to America's national security  and our way of life.\n\nEnsuring the safety and security of the homeland will always be the  top priority of Republicans in Congress.\n\nMr. Speaker, I support the rule, the underlying legislation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695112/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…worked hand in hand with Doug on  the many issues that face the American West. He had a love for his  work. He had an understanding as a fellow farmer in the value of the  rural way of life, and he fought to protect all of those things.\n\nWhen I stepped down as chairman of the Western Caucus, Doug was the  clear choice to take the gavel. He was elected unanimously…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…his time today.\n\nWe have a historic opportunity to advance the key priorities of this  administration with a one-bill solution, and I fully agree we need to  move forward in a way that reflects the needs of the American people.\n\nThis budget resolution unlocks the next step in the reconciliation  process to deliver on our priorities. That includes extending…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and first and foremost, of course, we passed the  Working Families Tax Cut and the rest of our landmark legislation.\n\nJanuary 1 was this past Thursday. If Democrats had their way,  Americans would have been facing a big tax hike at the start of this  year. Instead, thanks to the Working Families Tax Cut, Americans will  continue to pay the lower tax…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…working-class Americans.\n\nIt is past time we restore a commonsense approach to this and ensure  that our farmers can finally defend their ponds without any Federal red  tape in the way.\n\nMr. Speaker, I thank Chairman Westerman, Leader Scalise, the Gulf  Coast officials, and numerous Mississippians who have worked hard to  bring this bill to the floor. I urge…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…outstanding high school football  team in Ohio's 5th Congressional District. The young men of the St.  Henry High School football team have represented their school ably on  their way to achieving the Division VII State Football Title. In their  effort to surpass all other teams in the Division VII State Football  Playoffs, the St. Henry Redskins overcame…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697924/recognizing-st-henry-high-school-on-winning-the-division-vii-state-football-championship"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…chronic  conditions, the misery out there.\n\nWhat is fascinating is we have some articles right now talking about  that we may have actually hit something crazy, and it is an odd way to  phrase it, but it is what the researchers think, we may have already  hit what we call peak obesity.\n\nWhen we published the report 2 years ago, we still had about 4 or 5…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…state. It protects  our values of privacy, individual freedom, and free market innovation  by prohibiting a CBDC surveillance tool that could be wielded against  the American way of life.\n\nI am proud to be a cosponsor of this important legislation, and I  thank Whip Emmer and Chairman Hill for their outstanding leadership on  this important issue.\n\nMr.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693725/anti-cbdc-surveillance-state-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and my office on track, smiling,  and teaching us Armenian history along the way.\n\nWhile he was working around the clock in my office during the past 4  years, he has also been a part-time law school student and devoted  husband, father, and dear friend.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "Ms. MALLIOTAKIS. Mr. Speaker, I rise to ask the question: Why are the  Democrats so obsessed with allowing noncitizens to vote in our  election? Why do they go out of their way to dilute the voices of  American citizens, the very American citizens who elected them to  represent them?\n\nIt is incredibly frustrating to hear that they continue to double…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692316/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}]