[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…protect our jobs. Instead, they  have driven up the cost of steel, aluminum, and auto parts while plants  close and workers are left behind. When a plant shuts down in Detroit  or Wayne County, it doesn't just hurt the workers inside of it. It  hurts every business, schools, and families.\n\nWe need real solutions, like job training, stronger unions, and  building…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695795/real-solutions-for-manufacturing-in-michigan"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…as the City of Westland's City Clerk.\n\nMr. LeBlanc's steadfast dedication to community and service to our  residents has spanned five elected offices, from his start on the  Wayne-Westland Board of Education to the Michigan House of  Representatives, and most recently, as Westland City Clerk. At every  step, LeBlanc was known as a hard worker and accessible…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693810/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Avery's hard work, determination, and perseverance at  Wayne Carle Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Avery Kenkel on achieving the Arvada  Wheat Ridge Service…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691828/recognizing-avery-kenkel"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…12th Congressional District has uplifted  many of our communities.\n\nThe Caribbean communities in northwest Detroit, as well as in the  city of Inkster and throughout western Wayne and Oakland County, have  created powerful legacies through food, beauty businesses, fresh  markets, and nonprofits working to care for our families and new  immigrants.\n\nCaribbean…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…growth, expanding its campus, enhancing  academic facilities, and welcoming national figures, including  President Dwight D. Eisenhower, who laid the cornerstone for the  Anthony Wayne Library of American Study in 1953 and returned in 1963 to  deliver a commencement address; and\n\nWhereas, Defiance College remains a distinguished institution  dedicated to…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…serving her community through her work as a social worker.  After graduating from North Carolina Agricultural & Technical State  University in 1969, she began her career with the Wayne County  Department of Social Services. While accompanying her husband on his  assignments as a U.S. Air Force officer, Phyllis continued her work as  a social worker around…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Journey's hard work, determination, and perseverance  at Wayne Carle Middle School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Journey Bolejack on achieving the  Arvada Wheat Ridge…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691845/recognizing-journey-bolejack"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to honor Brigadier General  Donald Wayne Hansen, who recently celebrated his 92nd birthday. This  milestone marks a lifetime of extraordinary military service and  leadership.\n\nGeneral Hansen's nearly three-decade…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693452/brigadier-general-donald-wayne-hansen-celebrates-92nd-birthday"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…week was  because my father was visiting. My father, Jim Stevens, James R.  Stevens, of Shelby Township, he now resides in Shelby Township. He has  always been a hybrid Macomb, Wayne, and Oakland Counties man.\n\nMy father, Jim Stevens, was visiting. It was the first time he had  visited Washington since I was sworn in, in 2019. We had talked about  this…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is with joy that I rise to celebrate two exceptional young,  local basketball stars from northwest Ohio: Makhi Leach from Whitmer  High School and Elise Bender from Anthony Wayne High School, who were  named the 2025 All-Blade Basketball Players of the Year.\n\nMakhi Leach is a force to be reckoned with on the court. He dazzled  all of the audience with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689799/congratulating-all-blade-basketball-players-of-the-year"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…also in The Detroit News, that  the MSU president has spoken about the partnership between research  universities and innovation driven by government. We need these things.\n\nAt Wayne State University and Michigan Technological University, it  is the same thing. They conduct over 90 percent of the State's academic  research, totaling more than $3 billion.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…called the ``zeal of the convert,'' and       he vouched for Toledo's cultural amenities, community spirit       and easy, relatively short ride to the Detroit Metropolitan       Wayne County Airport.\n\n``I feel very confident that there is life after New       York,'' Levine said. ``And Toledo is made special by being       the only place where you can pretty…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…eight seniors last year, expectations were tempered,  but led by returning seniors Logan Gutierrez, Luke Somers, Matthew  Cummings, Christian Crosby, Ethan Cummings, and Cayden Wayne, along  with new senior Colton Bowman, the Eagles rose to the challenge with  grit and unity.\n\nLogan and Luke each reached the 1,000-point milestone, while  underclassmen like…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…showcasing  the lake's natural beauty for all, far and wide. In fact, he loved life  on the lake so much that he co-owned several other marinas, including  Conley Bottom Resort in Wayne County for many years, and Sunset Marina  and Resort on Dale Hollow Lake in Tennessee, which he took immense  pride in. At every marina location, he raised the bar for exceptional…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Huntertown; Oliver Werling from New Haven; Luke  Wonderham from Monroeville; and Allison Heine, Jacob Levitt, Jacob  Farrell, Jonah Haines, and Hayden Oberlin, all from Fort Wayne.\n\nOur service academies breed the best of the best, where strong  leadership and impeccable fortitude are forged in service to our  Nation.\n\nThroughout our Nation's history,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699143/military-academy-nominations"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…State  Volleyball Playoffs, the Avon Eagles overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Anthony Wayne Generals to win the state volleyball championship. The  members of this very special team have shown that their sport requires  an individual effort for a team result. Their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise in recognition of the outstanding  leadership of Sheriff Randy Retter, who dedicated 37 years of law  enforcement experience to my district in Wayne County.\n\nOver that career, Sheriff Retter has worked tirelessly, holding  positions of ever-increasing responsibility, beginning as a road patrol  officer before being ultimately…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688602/recognizing-sheriff-randy-retter"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Journal/Dow Jones;       Washington, Jessica: Intercept (The); Wasserman, Elizabeth:       Bloomberg News; Wasson, Erik: Bloomberg News; Watkins,       Thomas: National (The); Wayne, Alexander: KFF Health News;       Weaver, Dustin: Associated Press; Webber, Caitlin: Thomson       Reuters.\n\nWeber, Lauren: Washington Post; Weber, Maya: S & P Global;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…these areas with local elected officials who, for years, have  tried to generate a better experience for visitors to the Orange  Cliffs, and this goes in the wrong direction.\n\nWayne and Garfield Counties are counties that struggle in a State  that otherwise thrives. Utah has a really strong economy, but these  rural counties have really weak economies.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…jobs to the  U.S. economy. Many of these jobs came back to my home State of Indiana,  like the announcement from General Motors about increasing its  production in the Fort Wayne truck plant.\n\nHe has brought gas prices to their lowest point since 2021 by  unleashing American energy independence.\n\nOutside of the economic impacts that have saved money…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…TIMES; Lorenzen, Jacob: DANISH       BROADCASTING CORPORATION; Lormand, John: SRN NEWS (SALEM);       Lovelace, Berkeley: NBC NEWS.\n\nLowery, Stephen: NEXSTAR MEDIA GROUP; Lowman, Wayne: FOX       NEWS; Lowther, Jason: CBC (CANADIAN BROADCASTING       CORPORATION); Lozano, Nancy: NBC NEWS; Lu, Amy: HEARST       TELEVISION INC; Lu, Tao: HONG KONG PHOENIX SATELLITE…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Leslie: Freelance; Owen,       Clifford: Freelance; Ozturk, Yasin: Anadolu Agency.\n\nPalu, Luigino: Freelance; Panagos, Dimitrios: Greek       American News Agency; Partlow, Wayne: Associated Press       Photos; Pelt, Shedrick: Freelance; Perkins, Corinne: Reuters       News Pictures; Peterson, Mark: Freelance; Petros, Vasilios:       Freelance; Plesch,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Wayne  Barth, a physical trainer at Union General Hospital, who has been named  one of the 2025 Hospital Hero Award recipients by the Georgia Hospital  Association. This prestigious…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…rise to congratulate the Indiana High  School Athletic Association 3A football State champions, the Cascade  Cadets.\n\nThe Cascade High School football team triumphed over Fort Wayne Luers  with a 29-14 victory, securing the first football State championship in  the school's history.\n\nThese outstanding athletes played their hardest at Lucas Oil Stadium…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Mr. BURCHETT. Mr. Speaker, I rise to honor my good friend, Johnny  Wayne Farris, who was recently nominated as candidate for Time magazine  Dealer of the Year. He is also being recognized nationally by Time  magazine for his community service and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698413/recognizing-johnny-wayne-farris"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…children and families at risk of violence and created a new  job placement program for neurodivergent young adults. One of his  biggest projects being the expansion of the General Wayne A. Downing  Home for Veterans, which helped raise nearly $1.5 million for the  strengthening of services for local veterans.\n\nDon Johnson's tireless leadership and commitment…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…highlighted, Indiana does education right, and  Carroll High School is no exception. The U.S. News & World Report  ranked Carroll High School as the number one high school in Fort Wayne,  Indiana, and number 15 in the State.\n\nCarroll has demonstrated their high standards through excellent  performance on State-required tests, a 95 percent graduation rate,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}]