[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…members directly or making space for kin who can't be foster  parents to still support the child and the foster parents.\n\nLast Congress, we marked up this bill in the Ways and Means Committee  and sent it to the floor with our unanimous consent. While it passed  the House on a strong bipartisan vote, I was disappointed that the bill  did not become law.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Mr. LARSON of Connecticut. Mr. Speaker, I thank the leader of the  Ways and Means Committee and rise in strong support of this  legislation.\n\nWe have heard an awful lot of talk about subsidies over there. Let's  cut right to the chase. It is about subsidies.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698786/breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…pantry  staples and produce to hungry families.\n\nAs part of my statewide End Hunger Now tour, I visited the pantry  with my friend, Richie Neal, ranking member of the Ways and Means  Committee. We learned about an increase in need due to Republican cuts  and talked directly with pantry workers and people experiencing hunger.\n\nAs Congress prepares to consider…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699562/end-hunger-now"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…distinguished chair of the House Democratic Caucus.\n\nMr. BEYER. Madam Chair, I yield 1 minute to the gentlewoman from  Wisconsin (Ms. Moore), a distinguished member of the Ways and Means  Committee and the Joint Economic Committee.\n\nMr. BEYER. Madam Chair, I yield the gentlewoman from Wisconsin an  additional 15 seconds.\n\nMr. BEYER. Madam Chair, I yield 1 minute…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…these centers,  meaning that funding could not be taken away from them even if the  center engages in deceptive practices or even causes a woman's death.\n\nWhen the Ways and Means Committee marked up this bill last week,  Democrats offered commonsense amendments that should have been  uncontroversial to anyone who cares about women and families. We simply…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Mr. Speaker, I am really happy to see the chairman of the Ways and  Means Committee, and I am certainly happy to support this 5-year  extension of the hospital at home program, which, of course, includes a  critical study to ensure additional information…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…will give our seniors their best shot at catching  cancer early and treating it before it spreads. Just 2 months ago, our  bill passed unanimously out of the House Ways and Means Committee. It  enjoys overwhelmingly bipartisan support with 332 House cosponsors and  67 Senate cosponsors.\n\nLater today, I look forward to convening lawmakers, researchers,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…that  these DOGE individuals are held accountable.\n\nDemocrats demand answers, and I am proud to be joined by Rich Neal in  making sure that, on the Committee on Ways and Means, the committee of  cognizance for Social Security, we have DOGE come before us. If they  are doing such a great job and are exposing all of this fraud and  abuse, why aren't they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I certainly think that H.R. 5348, the Social Security Child  Protection Act of 2025, which passed the Ways and Means Committee with  overwhelming bipartisan support, deserves to be supported by this body.\n\nAs has been indicated, this legislation would direct the SSA to issue  a new Social…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697264/social-security-child-protection-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I certainly support H.R. 5345, the Improving Social Security's  Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security  office is common sense, and it will enable a victim to unravel…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…That is  not what my colleagues on the other side are suggesting that they want  to do.\n\nSo why don't we deal with the tax issue? We can do it. The chairman  of the Ways and Means Committee is right here. That is an easy one for  us to fix. But don't create a loophole big enough to drive a truckload  of ghost guns through.\n\nAgain, this bill does not do…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…hack  into, and that the Social Security Administration has no access to. No  one is allowed to look at that data who hasn't been vetted, as was  testified before the Ways and Means Committee last week.\n\nHow is it that DOGE employees are exempt because they are above the  law? It requires the United States Congress to call them in front of  us. If they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…of the aisle to  figure out how to resolve the State and local tax deduction is my  colleague,  Tom Suozzi from New York. He is a great Member and a member  of the Ways and Means Committee.\n\nMr. THOMPSON of California. Mr. Speaker, I thank the gentleman for  the passion he brings to this issue. I know how much work he has put  into it.\n\nI want to add…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…are not free  to use our sensitive personal data however they wish, but that may  actually be happening under the Trump regime.\n\nWhen this legislation was before the Ways and Means Committee, I  offered an amendment to address a serious and looming threat to our  privacy. The Trump administration is pursuing an unprecedented effort  to consolidate Federal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…proponent of the African  Growth and Opportunity Extension Act, I rise today in support of this  bipartisan bill, H.R. 6500, the AGOA Extension Act.\n\nLet me first thank Ways and Means Committee Chairman Smith, Chairman  Smith of the Trade Subcommittee, Ranking Member Neal, and Ranking  Member Linda Sanchez for working on this in a bipartisan way and  getting…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…Boyd Volunteer of the Year Award.\n\nShe has been an integral member of winning campaigns locally and  statewide. She served as the chief of staff for the Kansas Senate Ways  and Means Committee before joining my staff to lead my district office.\n\nDebbie is a battle-tested, stalwart conservative who is trusted by  many throughout Kansas, and her conservatism…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debate, we are going to not raise people's  taxes, but we will get to have a robust debate, discussion, and ideas  with the left, the right, particularly those of us on Ways and Means  Committee, Energy and Commerce Committee, those things, saying: Here is  what the mix should look like.\n\nMaybe we don't extend everything. Maybe we mix them up. Maybe we find…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the IRS. Without the guarantee  of rights, taxpayers are put in a situation where the  IRS is essentially saying: Heads, I win. Tails, you lose.\n\nMr. Speaker, the Ways and Means Committee has been working tirelessly  to strengthen taxpayer rights. This year alone, the committee has  approved several pieces of legislation giving taxpayers fairer  treatment.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…times. It also can save costs  versus expensive in-person hospital visits. It is no wonder that 99  percent of patients said they were satisfied with the program.\n\nAt a Ways and Means Committee hearing, we heard the incredible story  of a hospital at home patient from North Carolina named Roy who was  diagnosed with sepsis and initially treated in a hospital.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…He is someone who  understands market capitalism and a constitutional Republic like no  other Member.\n\nMr. HILL of Arkansas.  Malliotakis), who serves on the House  Ways and Means Committee and who is firmly opposed to socialism.\n\nMr. HILL of Arkansas. Mr. Speaker, I recognize the gentleman from  Missouri (Mr. Alford), the chair of the Small Business…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Speaker, I thank Mr. Moore for the opportunity to address our  colleagues. I thank him for his leadership, his Conference leadership  and on the Budget Committee and the Ways and Means Committee. It is an  honor to work with him.\n\nGod bless our great country. Let's get that One Big Beautiful Bill  Act and that America First vision that is wrapped in that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…expected by the end of this year. It is only common sense to make this  fraud prevention measure permanent.\n\nThis policy has already passed both the Senate and the Ways and Means  Committee with broad, bipartisan support. I hope the House does the  same and sends this to President Trump's desk as soon as possible.\n\nMadam Speaker, I yield back the balance…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…scorekeepers have finally  caught up with my Joint Economic Committee economists. Remember, I  chair the Joint Economic Committee. I chair Oversight Subcommittee in  the Ways and Means Committee, so I am blessed. I have a freaky smart  staff.\n\nIn 2032, the trust funds are empty. In 2033, the first year where  they are completely empty, if you said that we…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…communication  in this day and age.\n\nMr. Speaker, I thank Chairman Smith for his leadership and for making  tax administration and improved efficiencies a priority within the Ways  and Means Committee.\n\nMr. Speaker, I also thank my bipartisan co-leads on this bill,  Representatives DelBene, Feenstra, Schneider, Fitzpatrick, and Panetta.\n\nThis is a great step in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689375/electronic-filing-and-payment-fairness-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in the people's House. He was the driving force behind designating  historic Valley Forge, Pennsylvania, a national park.\n\nDick was the ranking member of the House Ways and Means Committee and  twice chaired the Republican Study Committee. He also served as  chairman of the National Prayer Breakfast. President Ronald Reagan  appointed Congressman Schulze…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Mr. KUSTOFF. Mr. Speaker, I thank Ways and Means Committee Chairman  Jason Smith for his leadership and also his support on this  legislation, and I thank our colleague, Judy Chu, for joining me in  introducing what I think…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "Ms. MALLIOTAKIS. Mr. Speaker, I thank the chairman and the Ways and  Means Committee staff for working with me on this legislation to combat  mail theft and fraud.\n\nA few months ago, I raised the issue of stolen checks to the Ways and  Means Committee…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…member himself as  well but also very much like him. Thank you for those awesome words.\n\nI yield to the gentleman from California (Mr. Thompson), my colleague  on the Ways and Means Committee.\n\nMr. MOORE of Utah. I yield to the gentleman from California (Mr.  Costa).\n\nMr. MOORE of Utah. I yield to the gentleman from California (Mr.  Garamendi), our final…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in the  preceding calendar year.\n\nHonoring Mark Roman\n\nMr. MOORE of Utah. Mr. Speaker, I will briefly add that I had the  opportunity to serve on Chairman Smith's Ways and Means Committee, and  I have seen the work that Mark Roman did, mostly behind the scenes, the  stress that he is put under, and the outcomes that we have delivered.\n\nOftentimes, we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deposit to a bank. However, the IRS currently does not  have procedures in place for a taxpayer to make such a request. This  bill fixes that flaw.\n\nI wish to commend my Ways and Means Committee colleagues,  Representatives Malliotakis, Kustoff, and Sewell, for their bipartisan  leadership on this issue.\n\nIn Representative Malliotakis' district alone, they…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}]