[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…like bird flu don't reach America's shores, where  they are now. It means that we can track those diseases.\n\nSo whether it is through its mismanaged trade war or deliberate  weakening of U.S. standing overseas, the administration is facilitating  China's global rise. That is why, as the ranking member of the Senate  Foreign Relations Committee, I am committed…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Education, which raises significant  questions about the future of IDEA and the impact on the education of  these 7.5 million children.\n\nThe students who would be hurt the most by weakening the Individuals  with Disabilities Education Act are the children who are the most  vulnerable. In nearly every State, public schools are primarily funded  by State and local…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Republicans also pushed a partisan healthcare bill that would make  things much worse by increasing the number of uninsured people,  shifting costs onto working families, and weakening the protections  that so many Americans rely upon.\n\nI offered an amendment to protect working families from losing health  coverage and to protect access to reproductive…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…this  rule would prevent more than 1,000 deaths and 3,700 cases of silica- related illness, but the Trump administration says it is on hold.\n\nWhat are we talking about here?\n\nWeakening or removing respiratory requirements, fit testing, medical  evaluations, and training for exposure to some of the most dangerous  substances like asbestos, lead, vinyl chloride,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employer could       average tips earned earlier in the week and use them to       justify paying $2.13 an hour for cooking shifts as well,       which would cut weekly pay. By weakening existing rules that       limit when the tip credit can be used, the bill would result       in reduced take-home pay for workers, give employers greater       control over…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…extremely disturbing and a stark reminder of the lengths to  which foreign adversary countries will go to use our media and  communications networks to disrupt and divide us, weakening our economy  for their own benefit. Whether it is through communications equipment,  the networks themselves, or social media, we have seen these operations  time and time…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…also encourage scanning of  content on users' phones or computers, before information is sent over  the internet, which has the same consequences as breaking encryption.\n\nWeakening encryption is probably the best gift you could give to the  predators and creeps who want to stalk and spy on children. Sexual  predators will have a far easier time stealing…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…help our young people afford a higher education. That will make it  harder for the next generation to afford college. It will also have the  effect of stifling innovation, weakening Americans' ability to lead by  staying on the cutting edge of technology.\n\nNow, in California we very much value our public education system. We  have Silicon Valley, the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode 25 years  of economic cooperation.\n\nIf we fail to act, we will likely see weakening supply chains and  increased poverty across the continent. Moreover, many industries could  shift investments away from Africa and toward Asia. Sub-Saharan African  exports…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…aligns regulatory disclosures with economic reality,  and gives investors a clear view of true costs.\n\nImportantly, it does so without rolling back investor protections or  weakening existing SEC oversight.\n\nThis bipartisan legislation will open the door for more investment in  BDCs, thereby unlocking more capital for small and mid-sized businesses  across…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…happened under the Biden administration. They came together. Those  kinds of standards also incentivize American innovation. Manufacturers  in America have been the leaders.\n\nBy weakening these rules, we open our markets to companies in  countries that manufacture low-efficiency products, like from China, at  the expense of American companies and American…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…year. Republicans are killing jobs by gutting domestic energy  investments that we made, that have created so many new good-paying  jobs. Republicans are rewarding China by weakening our economic  competitiveness and ceding American energy leadership to our  adversaries.\n\nThe hypocrisy is simple. On the one hand, they say we need more  energy for AI and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…we have made in the last 10 years. That is  heartbreaking. These actions are devastating to medical research across  America.\n\nWe are ceding our competitiveness to China, weakening our scientific  expertise as the envy in the world, and unfortunately, Americans are  paying the price.\n\nSo imagine my surprise by my Republican colleagues and their  reaction.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…for all investors.\n\nHarmonizing the exemption regime available for MDBs with that of the  IDA would enhance the IDA's ability to raise capital in the United  States without weakening investor protection. In turn, it will be able  to use these proceeds to provide increased funding for the world's  poorest countries. Importantly, too, the bill retains the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…long kept the American people safe. The Trump administration, however,  continues to trample on our Constitution with unauthorized military  actions while threatening others, weakening U.S. democracy, and making  the world more dangerous in the process.\n\nCongress cannot allow this to stand. I congratulate the Senator from  Virginia for his leadership to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…with  frontline NATO allies invite more brazen Russian incursions into the  alliance's territory and airspace; it would recognize how China is  watching closely for signs of weakening American commitments to  European allies, to Ukraine, or to AUKUS partners.\n\nOf course, responsible senior officials who understood the dividends  of security cooperation…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…not a legacy status  based on past emissions.\n\nThis flexibility fosters continuous improvement and aligns  environmental goals with economic incentives. This is not about  weakening protections. It is the contrary, actually. It is about  applying regulation in a way that actually works, delivering clean air,  encouraging innovation, and maintaining the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the Biden administration, the State Department  too often handcuffed U.S.-Taiwan engagement by clinging to outdated,  self-imposed restrictions and bureaucratic red tape, weakening a vital  partnership at a time when unity and strength are urgently needed. That  is unacceptable.\n\nThe Taiwan Assurance Act passed with bipartisan support in 2020, but…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…finally say  enough and stop loaning the government money.\n\nJust this week, the Director of the nonpartisan Congressional Budget  Office suggested that the U.S. economy is weakening. The people who  rank our credit have downgraded the U.S. credit rating.\n\nAs interest payments on the national debt crowd out the rest of the  government's budget, entitlement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…broadened beyond Congress'  original intent.\n\nAs a result, an agent could propose a penalty without prior review  and later seek approval from a wide range of individuals, weakening the  transparency and accountability that the law was designed to ensure.\n\nThe Fair and Accountable IRS Reviews Act restores clarity. It  reaffirms that an IRS agent's actual…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Independent, Green Party,  whatever the case may be--repeatedly say in overwhelming numbers that  the political divisions in this country are a serious problem.\n\nI believe it is weakening us as a country, and I think we need to  find opportunities to come together. We need to be looking for common  ground. The fact that we had one side that came to Tuesday's…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…stability is more important than ever as the LAF works to  permanently disarm and destroy Hezbollah's presence in Lebanon.\n\nBuilding on the tremendous success of Israel in weakening Iran and  eliminating Hezbollah's terrorist leader network, Hezbollah is now at  its weakest point. This is a tremendous opportunity for the LAF and for  the people of Lebanon…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…public-private  partnership that helps small businesses thrive.\n\nThough Administrator Loeffler is bringing a lot to this office and  has reined in the Biden administration's weakening, frankly, of  underwriting  standards in the 7(a) program, this bill advances good governance  policies that will protect taxpayer dollars and uphold the program's  record…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691855/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…beneficiaries of employer-sponsored retirement plans  rely on the expertise of fiduciaries, who are required by law to act  solely in the financial interests of participants. Weakening that  expectation to advance partisan ideological objectives is wrong and  hurts the safety and stability of Americans.\n\nFinally, Mr. Speaker, in response to my friends on…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Ukraine per  GDP than us.\n\nThis amendment is necessary because there are some appointees in the  Pentagon who have embraced the foolish policy of decoupling from Europe  and weakening our leadership in NATO. We have got to stand opposed to  this. We need to use our Article I powers today and be counted for what  we believe in.\n\nWhat happens if we withdraw…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…SpaceX.\n\nNow, it needs to be noted that SpaceX accounts for over 90 percent of  the total payload brought into orbit in the entire world, and so  targeting SpaceX is truly weakening our own country given how important  our global dominance in space is. So this latest demonstration of the  capacity of this particular company and American ingenuity in…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…adults are simply treated as adults.\n\nIt ends judicial discretion that allows juvenile, violent offenders  to escape mandatory minimums, and it prohibits the council from  weakening mandatory minimums on sentencing guidelines any further.\n\nMake no mistake, carjackings and robberies by juveniles are out of  control. More than 500 minors were arrested…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Discharge Elimination System permits for pesticide  use if the pesticide is already EPA approved and used according to  label requirements, which will reduce costs without weakening  environmental protections.\n\nFinally, the Improving Water Quality Certifications and American  Energy Infrastructure Act codifies the historic nationwide permit  process…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…have faced an outdated and  unpredictable permitting process that has delayed and even canceled  critical infrastructure projects, costing taxpayers millions of  dollars, and weakening American energy security.\n\nRight now, if you want to build a pipeline or a power transmission  line between the U.S. and Canada or the U.S. and Mexico, you are stuck  navigating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}]