[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to negotiate a cease-fire between  Ukraine and Russia, President Trump and Vice President Vance have  squeezed concession after concession out of Ukraine, even its mineral  wealth. At times, the Trump administration has effectively held  Ukraine's economic future ransom for more military aid.\n\nThis includes the dastardly moment when President Trump suddenly…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Ranking Member Waters for  their leadership and efforts to bring my bill to the floor today.\n\nPublicly traded companies are critical to this country's economic  dynamism and wealth creation. Their shareholders, including everyday  American families, believe in the potential of these companies and  demonstrate this faith by investing in their equities.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…voted  for it.\n\nAnd for what? To pay for tax breaks for billionaires and large  corporations; tax breaks they don't need. This legislation is the most  regressive giveaway and wealth transfer that Congress has ever  considered. The top 20 percent of income earners will get at least 68  percent of the tax benefits and everyone else will see their costs…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…seize Venezuelan oil and pursue regime change for  their imperialistic agenda in the Western Hemisphere. They do this all  so they can extract resources, they can expand their wealth, and they  can make sure that one day, should they lose their hold on power, which  they will, they can be pardoned for their corruption.\n\nIt seems like Republicans love Trump…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…per household that would have to pay the overdraft  fees that many of these folks put business plans together on.\n\nCredit card late fees, Mr. Speaker, also widen the racial wealth gap.  They impact and put a heavy burden on some of the poorest communities,  working-class folks. These are frontline workers.\n\nGutting the overdraft rule is a slap in the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689837/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…speaking out against these bad trade  deals.\n\nHowever, for most of American history in the last 50 years we have  watched the hollowing out of these communities, and we watched wealth  pile up in districts like mine in Silicon Valley and New York. My  district has $14 trillion of wealth. The income inequality in this  country soared.\n\nSo one of the things…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, the United States has not had a trade  surplus in over half a century. Trade deficits translate into lost jobs  and lost wealth for the American people. Balancing U.S. trade accounts  is an imperative and a worthy objective, but Trump administration  tariffs on the American people's purchases are taxes…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…down a job.\n\n``I still have my house, my car, my husband, and my health. Thank God  for that. Why should we have to struggle so hard just to live in a  country with so much wealth? I am considered one of the lucky ones, and  yet I still struggle to make ends meet for the basics.''\n\nThat is Maria, pouring her heart out to us, as Members of Congress,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…because they had watched their monarch. They had watched the King of  England use the powers that he had in order--not to protect the British  people but to amass enormous wealth. He used those powers both to  control dissents and protests domestically, but he also used those  powers in order to compel other nations and actors inside the empire to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…next to our desire for       peace, may well become the major concern of the American       people in the decade of the seventies.\n\nIn the next 10 years we shall increase our wealth by 50       percent. The profound question is: Does this mean we will be       50 percent richer in a real sense, 50 percent better off, 50       percent happier?\n\nOr does…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…complex on behalf of the program. The building will house a  museum, a business incubator, and center to teach people about trading  and investing as a means to building economic wealth in the community.  He envisions museum exhibits highlighting Akron sports legends,  scientists, and artists like LeBron James, Gus Johnson, Rita Dove, and  Woodrow Nash.\n\nHe…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump and Republican campaign promises to lower prices, the  President decided to launch a global trade war just last week that  wiped out a 2-day record of $6.6 trillion of wealth, affecting the  retirement savings of millions of Americans. Moreover, the Fed Chair  has said these policies will fuel higher inflation by sending the  prices of consumer…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…to reinforce the efforts of our States because when you  give total educational responsibility to States, it means that the  quality of education will be dependent upon the wealth of the State.\n\nSouth Carolina is becoming wealthy, but it is not a wealthy State. We  have States in our country that will not be able to afford the  investment in education…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…legislation would significantly change the       system D.C. has had in place since 1992, that has produced       higher appearance rates than the national average without       wealth-based pretrial detention. Between 1990 and 2009 the       number of people charged with an offense who received cash       bail jumped from 37 percent to 61 percent. Cash bail…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…are issued so investors and foreign individuals can buy influence and  personally enrich the President and his family. All of this has added  billions of dollars to Trump's wealth since becoming President.\n\nWhile Americans get poorer and Trump gets richer, something darker is  happening. The walls of our democracy are being disassembled brick by  brick.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous wealth of natural resources. In  fact, when Alaska was admitted to the Union, there was a specific  condition laid out that the new State would develop these abundant  natural resources…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…CLARITY Act. The  increasing adoption of digital assets and the use of blockchain  technologies can grow our economy and provide American families with a  new opportunity to grow wealth.\n\nHowever, under President Biden, digital assets were attacked, which  crushed innovation and created uncertainty for businesses.\n\nFortunately, President Trump is working to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…They just  don't.\n\nI grew up a child of the eighties. I grew up on studying supply-side  economics. I believe in leaving money in the hands of the American  people to produce wealth. I believe that does create more revenue the  Treasury can bring in with lower rates on a bigger pie. I think that is  important.\n\nYou still have to do basic math. If you reduce…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "French Hill", "party": "Republican", "sentence": "…intention is to protect investors, its overly broad definition excludes  millions of Americans who are experienced and knowledgeable enough to  invest in private markets.\n\nWealth alone should not be the sole determinant as to who can invest  in these markets. My friend from Nebraska, Representative Flood's bill,  provides a merit-based alternative by…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…withdrawals that block  responsible access to our Nation's critical mineral resources.\n\nMr. Speaker, this is not balance. It is Federal overreach that is  ensuring that Alaska's wealth stays in the ground, unavailable to the  people of one of America's most impoverished regions.\n\nThe plan also obstructs projects vital to America's future, such as  the Ambler…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and countless families across the country. It is incredible  how in-depth and thorough their work has been. This determined group of  students has demonstrated an incredible wealth of knowledge of our  democratic system, its key challenges, and what is to come in the  future.\n\nMr. Speaker, as policymakers, we would be wise to take notes from  this generation…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…adopt policies that will actually increase economic growth. That is  putting more money into the pockets of the American people and  deregulating so that businesses can create wealth.\n\nWe assumed 2.6 percent economic growth. That is higher than the CBO's  expectation of 1.8 but lower than the historic growth of 3.2 percent.\n\nWe hit the sweet spot. We believe…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…take action and take a stand to ban Members and their  spouses from owning or selling individual stocks.\n\nIt is simple. Public service should never be a pathway to private  wealth, especially when everyday Americans are struggling. This is  about rebuilding trust in what we do.\n\nCongress works for the people, not to enrich our bank account. I am  proud…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…redtape, we are talking about  ways we can get government out of the way of our small businesses and  our entrepreneurs so that our economy can grow and so that people can  create wealth for themselves and their families and their  beneficiaries. We are talking about reducing the government's footprint  so that the magic of American innovation can take place,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…strongly encourage this body, or if not this body, some  universities to look at people who have these bizarre opinions that  will inevitably destroy this country. They hate wealth production, they  certainly hate energy production even when it is new energy that is  fantastically clean, so much cleaner than it was when I was a child.\n\nThey hate it when…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the final tax rates  are laid out by the Committee on Ways and Means, I would like to see  lower rates for manufacturers who, after all, are responsible for  producing the wealth in this country.\n\nIt is something I have pursued in my own personal career. We have got  a nice low tax rate for Wisconsin manufacturers, but we would like to  see a lower…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…experience. You would say: Why does  that matter? It actually matters a lot because of our military and the  need to integrate our very powerful private sector.\n\nSo he brings a wealth of experience that, to be honest--in my 10  years in this position as a U.S. Senator on the Armed Services  Committee and my 30 years in the Marine Corps, I have never seen…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Western country, a well-off family,  somebody who hypothetically should have been happy, right? According to  her father, Greta Thunberg was unhappy, despite all her material  wealth. I think that is true of a lot of people, sadly. They are  spoiled people with time on their hands in the West.\n\nShe became happy by spending all her time pushing this global…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…invent, we perfected.  Everything that mattered happened here.\n\nBut, over the last few decades, the people in power squandered that  inheritance. They sent our children and our wealth overseas to defend  the borders of distant nations while throwing open our own borders to a  tidal wave of mass migration here at home. They shipped the good- paying, middle-class…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…nobody paid attention Patrick Monahan.\n\nAnother man who did a lot of work in this area was George Gilder who  wrote a couple of books, ``Men in Marriage,'' ``Visible Man,'' ``Wealth  in Poverty.'' He first looked into this problem, as some people do, in  a ghetto in Albany, New York. He could remember the time right before  that when it was a considered…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}]