[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…with the United States through the  Cooperative Threat Reduction Program, Kazakhstan demonstrated how  nations can choose security through disarmament rather than weapons of  mass destruction.\n\nTogether, our countries worked to eliminate Kazakhstan's inherited  nuclear arsenal, dismantle former Soviet nuclear infrastructure,  and secure vulnerable nuclear…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Donald John Trump: No regime-change wars. And yet here we go again.\n\nAlmost 25 years ago, George W. Bush and Dick Cheney cooked up claims  of Saddam Hussein having weapons of mass destruction to justify going  into Iraq. Last month, just 2 weeks before ordering the capture of  Nicolas Maduro, Donald Trump designated fentanyl as a weapon of mass  destruction.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…started, particularly  the war in Iraq.\n\nThe United States was basically--the public and this body were  basically lied to about the extent of the Iraqi program of weapons of  mass destruction, and then an administration forced a vote on the floor  of this body right before a midterm election. The debate and vote  occurred in October of 2022.\n\nI remember--at…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…removes  the statutory requirement restricting participation in the program to  areas designated by FEMA. Instead, it requires Homeland Security's  Office of Countering Weapons of Mass Destruction to decide which cities  to partner with for the program based on the jurisdiction's capability  and capacity to prepare and respond to terrorist attacks and other…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…possible way, but Venezuela  is not the source of the fentanyl problem.\n\nI think about how it was the case with George W. Bush that he created  a fake story about weapons of mass destruction to lead us into a  massive regime-change strategy and nation-building strategy in Iraq.  Huge amounts of American treasure and lives paid the price. Four  thousand…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Cooperative Threat Reduction Program. As  part of this program, our two countries took monumental steps to remove  residual materials and technologies related to weapons of mass  destruction in Kazakhstan, signaling a major shift in the global  security and political paradigm and building momentum that catalyzed  the Comprehensive Nuclear Test Ban Treaty.…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…that killed and displaced millions of people, our loved ones, and  created total devastation and instability in the region.\n\nWe have seen our government lie about weapons of mass destruction  before. We are not going to fall for it again. Instead of listening to  the American people who are saying no more wars, Trump is listening to  genocidal maniac…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692911/no-more-wars"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…here when we rushed to war in Iraq. We did have a  debate, but we were given faulty information by the administration at  the time. We were lied to. There were no weapons of mass destruction,  and look at what that cost us in terms of life, treasure, and  credibility around the world.\n\nMr. Speaker, again, I think there are things that we should be  focused…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…connect the dots before 9/11. And  perhaps most foreboding, in the runup to the Iraq war, intelligence was  distorted to fit policy preferences. Intelligence about weapons of mass  destruction and Saddam Hussein's ties to al-Qaida were inflated and  cherry-picked. Analysts who even at that time raised doubts were  ignored.\n\nThe result was a devastating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…still up on their website.\n\nSo which is it?\n\nIf Iran's nuclear facilities were obliterated, then why are we  sprinting toward another war based on false claims about weapons of  mass destruction?\n\nThey weren't obliterated. If that was all political spin to make  their strike sound more successful than it actually was, then why  should anyone trust the judgment…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…can change, and  they usually do.\n\nThis bill aims to improve the program's stability and strengthen  partnerships with at-risk cities by allowing the Countering Weapons of  Mass Destruction Office to select STC cities based on their  preparedness capabilities rather than UASI designations.\n\nThe bill, Mr. Speaker, also establishes performance metrics,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…served as  Special Agent in Charge of the FBI Atlanta Field Office.\n\nMr. Brown has served the FBI diligently since 2006, with experience  spanning counterterrorism and weapons of mass destruction.\n\nHolding degrees from both Western Illinois and Tarleton State  University, Mr. Brown built a well-rounded foundation that supported  his work in law enforcement…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699636/congratulating-paul-brown-on-his-retirement"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…check in with to get on a flight right now--they are not getting a  paycheck next week, although they are still working this week. They  defunded the Countering Weapons of Mass Destruction Office.\n\nListen, this is a big deal. We just had a shutdown of 43 days--the  longest in American history. Those TSA agents lost two paychecks during  that time period.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…lethal. The  amount that you can fit on a pinhead could kill a person. Unknown  exposure just from somebody coming to assist somebody could kill  somebody. These are weapons of mass destruction.\n\nIt is different from anything we have ever experienced in the history  of the United States or the world, for that matter.\n\nIf a foreign actor released a chemical…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…universities, laboratories, and  industrial companies. Funded by the Defense Threat Reduction Agency,  the IIRM-URA's primary concern is to mitigate threats against weapons  of mass destruction. The competition is an opportunity for students to  learn and engage in the fields that IIRM-URA supports.\n\nThe 2025 challenge involved a virtual drone simulation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…rehabilitation of the environment, which has  been absolutely massacred under the mullahs.\n\nFinally, 10 of her 10-point plan, a nonnuclear Iran that is also  devoid of weapons of mass destruction: peace, coexistence, and  international and regional cooperation.\n\nMr. Speaker, I can't say it any better than what Maryam Rajavi has  said. This matters for even…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…don't want the Chinese and our countries of  concern to be using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction, automated cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber operations.\n\nUnder…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Act of  1996, making it permanent law. The original act mandates sanctions on  individuals and entities involved in Iran's energy sector in its  efforts to develop weapons of mass destruction. By eliminating the  expiration date, we ensure that these sanctions remain a steadfast  component of our national security strategy.\n\nThe Iran Sanctions Act has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}]