[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…undermining the Senate's own rules to score a short-term win that will  do long-term damage but will placate the oil industry, because once you  start twisting the CRA into a weapon to attack anything you don't  like--rules, waivers, facts--you don't just hurt California; you hurt  the country, because don't think for a second it ends here.\n\nIf this gambit…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…millions of Americans  afford their healthcare. If that wasn't bad enough, President Trump  even withheld food assistance during the shutdown. Hunger should never  be used as a weapon.\n\nThe CR continues the Republican healthcare crisis. The Speaker has  already said he won't hold a vote to extend the Affordable Care Act tax  credits to reduce healthcare…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696728/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…threatening their Federal funding and their tax-exempt status.\n\nThis is a harmful bill that would only serve to weaken America and  give the Trump administration yet another weapon to attack the American  institutions that they deem are insufficiently loyal to President  Trump.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…seize control of elections is attacking the constitutional  order itself, and that is precisely the kind of abuse of power for  which impeachment exists, not as a partisan weapon but as a  constitutional safeguard against the usurpation of the electoral  process in our  country by a would-be King, Donald Trump.\n\nThat is what they were protecting against.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…other means often regret their attempt. They don't do it again, and  they seek help. That option, unfortunately, is rarely available to  those people like my dad who had a weapon available.\n\nToo many people don't seek help when they need it. Whether they are  held back by fear, stigma, or lack of access, we need to do more as a  society to remove all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695318/recognizing-suicide-prevention-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…agreement. It is working.\n\nFor God's sake, we have used diplomacy just as we are supposed to--by  preferring peace and diplomacy first--to deprive Iran of a path to a  nuclear weapon. Shouldn't we prefer diplomacy rather than putting at  risk the lives of American troops, the 40,000 troops who are in the  Middle East?\n\nSo what happened to the diplomatic…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…diplomacy, are what drove Iran to the negotiation table to  finalize the Joint Comprehensive Plan of Action in 2015, a deal that  effectively prevented Iran from obtaining a nuclear weapon before it  was torn up by President Trump in 2018.\n\nToday, Iran is closer to obtaining a nuclear weapon than ever before.  The Iranian regime, through its backing of terrorist…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…health conditions. They are all barred from getting a firearm,  and this dangerous loophole is designed to ensure that they now will  see a giant sign saying, ``Come get your weapon,'' because they no  longer will be prohibited from getting one of these weapons, while the  police officers, the law enforcement officers across this country, get  no benefit.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…decision to start a nuclear war can be made by a  single individual--the President--with no requirement that he first  consult with anyone. A single use of a tactical nuclear weapon, either  by accident or design, could trigger a flurry of escalating responses  with far more powerful strategic weapons that would cause incalculable  loss of life, widespread…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…arsenal is safe, secure, and reliable. All this is  done without any explosion. It is a scientific experiment called  subcritical and is far more helpful to understanding how the weapon  will perform than setting off an explosion in the desert.\n\nOur leadership on arms control and nonproliferation has clearly come  to an end, and the world is becoming a more…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…nothing.\n\nPalestinians were right. The Nakba never ended. Across Gaza, the  medical system has been deliberately destroyed. The Israeli Government  is using starvation as a weapon of war, which is a war crime. The  thousands of trucks carrying food and lifesaving aid sit blocked at the  border while Palestinian families starve.\n\nInstead of agreeing to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…pieces of land and how land  is going to be divided, many countries who are viewing this are  concluding that to protect themselves, they are going to have to have  the ultimate weapon. Just as North Korea made that decision, others are  making that decision. I don't support any of those decisions. I don't  support any nuclear weapons. I would like to see…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…States--with no requirement  that he first consult with anyone. A nuclear war could also be started  at any moment by Vladimir Putin, Xi Jinping, or any other leader of a  nuclear weapon state. Or it could be triggered by mistake.\n\nA single use of a tactical nuclear weapon, either by accident or  design, could trigger a flurry of escalating responses with far…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…nuclear modernization is the only way to be safe, but nothing-- nothing--could be further from the truth.\n\nWithout nuclear arms control agreements like the New START, every new  weapon we build only fuels an unwinnable arms race as our adversaries  respond in kind. We build. They build. We build. They build. And the  cost of this race is staggering.\n\nLet…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…an existential  threat to their futures, and of course to Israel, as well as the United  States and Europe, so I support the U.S. efforts to stop Iran's march  to a nuclear weapon.\n\nHowever, we cannot permanently end Iran's nuclear programs without a  negotiated agreement, without inspectors on the ground, without Iran  agreeing to reverse course. We…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…ensures that our  service animals are treated not just as tools but as heroes.\n\nUnder my legislation, the Federal penalty will be up to 15 years when  someone uses a deadly weapon to harm a Federal police animal. In  addition, this legislation will expand the Federal statute to apply to  any State, county, or local police animal assisting a Federal agency.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…organizations including the Venezuelan regime and violent  cartels operating in our own backyard. That 400,000 is about the size  of my native city of Miami. This is, in reality, a weapon of mass  destruction.\n\nYet here we are, debating whether to retreat from fighting terrorists  in our own hemisphere, while continuing to fight them halfway around  the world.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…and save  lives.\n\nThis past Saturday, President Trump directed our military to respond  to a growing threat that Iran could weaponize nuclear material and  deliver a nuclear weapon. With escalating tensions between our ally  Israel and our adversary Iran, the President made the decision to deter  and delay the capabilities Iran has to deliver a nuclear…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…The strikes in Lebanon's northeastern Beqaa Valley were       aimed at military facilities belonging to the Hezbollah       terror group's Radwan force, where operatives and weapon       depots had been detected, the Israel Defense Forces said.\n\n``The military camps that were targeted are used by the       Hezbollah terror organization for training and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Equipment: The following non-MDE will       also be included: FMU-139 joint programmable fuzes; DSU-38       laser sensors; practice bombs and bomb components; weapons       and weapon support equipment; major modifications and       maintenance support; training aids, devices, and spare parts;       spare and repair parts, consumables, accessories, and repair…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…but Hamas is a proxy and largely paid for by Iran. Within that 1,200  people, 48 were Americans.\n\nIt leads me to ask this simple question: What if they had had a  nuclear weapon?\n\nFor decades, American Presidents have said Iran can never have a  nuclear weapon. It is a lot of talk but not a lot of action. Over and  over and over again, Iran moved forward,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…homeland  from illicit maritime drug trafficking, and securing our border.\n\nAlso, sea mines are actually responsible for more damage to U.S.  naval warships than any other weapon since World War II. Although it is  10 years after originally planned, the LCS platform is now providing  support for detecting, localizing, and neutralizing surface, near-…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Equipment (MDE): None.\n\nNon-Major Defense Equipment: The following non-MDE items       will be included: Class IX spare parts in support of U.S.       Army-supplied vehicles and weapon systems and other related       elements of logistics and program support.\n\n(iv) Military Department: Army (UP-B-B-AF).\n\n(v) Prior Related Cases, if any: KA-B-WDA, NX-B-VGH.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699891/arms-sales-notification"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Disabling Chemicals (bear spray, tear gas, poisonous       chemicals or gases, or other chemicals designed for self-      defense);\n\n4.1.6 Drones/UAS;\n\n4.1.7 Firearms (any weapon that expels a projectile with an       explosive);\n\n4.1.8 Handcuffs, Flex Cuffs, or items that can be used as       restraints;\n\n4.1.9 Impact Weapons (batons, blackjack, clubs,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…resolution that uses anti-Semitism as a political pawn.\n\nMr. Speaker, I urge you and my colleagues on the other side to come  to your senses. Stop using anti-Semitism as a partisan weapon. Pull  this resolution. Allow Mr. Neguse's resolution to be introduced and  voted on, as is the tradition of this body, in parallel along with Mr.  Van Drew's, which accurately…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…firearms. It is not.\n\nThis would also prevent these ideas from taking hold amongst  discussions about ghost guns, which is something that is out there on  the street. For any weapon that also has kits that can be converted to  a firearm, it doesn't apply to them.\n\nThis bill also requires ATF to deny classification to any device that  could be readily modified…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Washington, D.C., off the coast.\n\nTime is not our enemy. Russia and China are our enemies. They have  submarines. Russia has submarines that could come close to our coast,  launch a weapon, and not be detected because we don't know what the  effect is of these windmills.\n\nAs the gentleman brings up, Sweden canceled 12 of 13 offshore  projects on their side toward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…it. Barack Obama said it. Joe  Biden said it. Even Senate Minority Leader Chuck Schumer said back in  2015:\n\nIf there is only a 10 percent chance Iran uses a nuclear       weapon, it is vital we prevent it.\n\nThat is exactly what President Trump did, and he did it effectively.  For over 40 years, Iran has targeted, threatened, and terrorized the  United…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Air-to-Air Missiles       (AMRAAM); one (1) AMRAAM D-3 guidance section; and one AIM-      120D Integrated Test Vehicle. The following non-MDE items       were also included: weapon system support to include       software, and KGV-135A COMSEC chips. The total cost of the       new MDE articles was $479 million, and the total cost of the       new non-MDE…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a child with intent to  sexually assault her with a deportation order since 2024.\n\nWe have a Laotian illegal alien convicted of strong-arm rape,  aggravated assault with a weapon, and strangulation with a deportation  order since 2012.\n\nWe have a Laotian illegal alien convicted of rape and child fondling  with a deportation order since 2003.\n\nWe have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]