[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…actually doing the work? How about we trust the plan participants,  the workers, and the retirees? Anyone who has a 401(k) or an IRA will  tell you that they can go on the website and pick from a range of  different plans based on what they think is a good idea for them. Why  don't we trust them instead of trusting bureaucrats and political  appointees…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…American--it doesn't  matter if they are Republican, Democrat, Independent, or someone who  doesn't follow politics--to tune in to the Committee on Rules. It will  be up on our website. I will be live-streaming on YouTube. It will be  on C-SPAN. Hell, maybe even cable will carry us live.\n\nI urge Americans to watch it and judge for themselves what this bill…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…We are now 2 months into  his administration, and we are finding that the opposite is true.\n\nA headline yesterday in The Washington Post read: ``Long waits, waves  of calls, website crashes: Social Security is breaking down.''\n\nNext to me is a poster board from The Wall Street Journal. Some  people may say that The Washington Post is always critical of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…That gave us real-time experiments on exactly what  happens when you make a marginal shift in the export of LNG from the  United States.\n\nAccording to the Department of Energy website, this is what happened:  ``The U.S. natural gas spot price fell by 13 percent on June 9. The  price continued to decline by an additional 17 percent through the end  of June.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…terminated.\n\nWe know that a VA researcher working on treatments for substance use  disorders among veterans was terminated.\n\nWe know that the cyber security lead for the VA website--the digital  hub that connects veterans with their benefits and holds sensitive,  personal data--was terminated.\n\nThese kinds of impacts--and I have mentioned just a tiny…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…National Climate Assessment was due for 2028, but in  2025, the Trump administration fired all the scientists and researchers  working on that project. They even shut down the website.\n\nWhy, you may ask, is the Trump administration suppressing science,  firing scientists and researchers? Why won't the Trump administration  protect the American people from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…promise of Social Security, which Mr.  Musk called a Ponzi scheme. We have already seen firings in the Social  Security Administration, threatening to close field offices, a website  crashing several times in March, a plan to end paper checks as an  option, and DOGE accessing sensitive data systems.\n\nAll of this puts people at risk, and the impact will…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…its mission of ensuring the safety and soundness of       individual FICUs and the credit union system.'' Call Report       data is made publicly available on NCUA's website and is       published in both aggregated and disaggregated form.\n\nIn addition to the Call Report requirement, NCUA also       carries out its oversight of federal credit…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…includes extreme  storms, prolonged droughts, shifts in water management practices,  ongoing aquifer depletion, and other major water uses. It is all about  having a public website displaying maps depicting zones at greater risk  of sinkhole formation, helping save lives and helping us have more  resilient communities.\n\nI thank Chairman Westerman, Ranking…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693480/sinkhole-mapping-act-of-2025"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…SNAP benefits to continue to roll.\n\nNow, President Trump says that the use of SNAP contingency funds is  illegal. Well, here is the document that was taken down from the USDA  website that was up just days ago. He decided to take this down and now  even the Speaker of the House is lying to the American people saying  that it is not allowed.\n\nPresident Trump…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…following. When asked about SNAP,  Trump assured everyone it will be fine; he said it.\n\nThen suddenly, last Friday, Trump ordered USDA to delete the plan,  take it off their website, and refuse to use the money. No reason. No  explanation. Just cruelty. Two-thirds of SNAP recipients are kids,  seniors, or people with disabilities. That is whom Trump is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…educational institution. Kenyan authorities cooperated  in the abduction of one of his employees, who was taken to Turkiye and  tortured. The next thing that we knew, up on a website in Turkiye was a  declaration that my constituent was being labeled as a terrorist.  Another incident of this type occurred only last month, and the Kenyans  have been unable…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…person; you  can register through the mail. It can be as easy as providing your  Social Security number and signature, which every American has, through  the secretary of state's website.\n\nAlternatively, the SAVE Act would change that by requiring that all  American citizens, whether registering for the first time or updating  their registration, to present…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to lay  out an expenditure schedule so that we can see whether or not funds are  being delayed, or frozen, impounded, and so forth, and that schedule  has disappeared. That website has been shut  down. So the President is hiding, and contrary to the law, what is  required so that we can protect the prerogatives of our Constitution.\n\nThese are the ways…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…this Republican Congress is taking us.\n\nIf you like this unserious bill, there is another deal for you  because Eric and Don Jr. are selling Gulf of America hats on their  website for 50 bucks a pop. One hat even says: ``Gulf of America, Yet  Another Trump Development.'' The sales pitch for one includes ``as seen  on President Donald J. Trump,'' and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and Commerce of the House of       Representatives and the Committee on Commerce, Science, and       Transportation of the Senate, and make publicly available on       the website of the Commission, a report on the findings and       data derived from such program, including the extent to which       the use of artificial intelligence improved the ability…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…untenable and should not be  tolerated in a civilized society.\n\nI am, therefore, pleased to support the solutions presented by H.R.  4922, including the establishment of a website on District of  Columbia's juvenile crime statistics.\n\nPassage of this bill will go a long way to correcting the broken,  soft-on-crime policies here in Washington, D.C.,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…accessible index of each criminal statutory offense listed in       the report required under subsection (b) and make the index       available and freely accessible on the website of the       Department of Justice; and\n\n(2) the head of each agency described in subsection (c)(2)       shall establish a publically accessible index of each       criminal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…executive summary.\n\n(6) Publication.--The unclassified executive summary of       each report required under this subsection shall be published       on a publicly accessible website of the Department of       Homeland Security.\n\n(g) Access to Information.--\n\n(1) In general.--The Secretary of Homeland Security, the       Director of CISA, the Attorney…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…This bill isn't about politics. It is about protecting lives.  Republicans are delivering real reform, tougher accountability,  transparent juvenile crime data via a public website, and a safer D.C.  for all.\n\nMr. Speaker, I urge my colleagues to join us and pass H.R. 4922 now  to make America and this District safe again.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…risky sexual behaviors.\n\nThere are 16 States that have declared youth exposure to pornography  to be a serious public health issue, and  19 States have enacted some form of website age verification  requirement.\n\nThe Supreme Court is poised to rule on the Texas age verification  law. Whether they apply strict scrutiny or a lower form of judicial  review,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…on Small       Business of the House of Representatives and the Committee on       Small Business and Entrepreneurship of the Senate, and make       publicly available on a website of the Administration, a       report on the activities of the Office during the one-year       period immediately preceding the date of submission of the       report.\n\n``(2)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Education Call Center of the Department for       calls about services provided under this chapter. Each       regional office of the Department shall include, on the       website of the regional office, a name, telephone number, and       email address, through which veterans may receive information       about services provided under this chapter.''.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…and aware of how Federal agencies are  utilizing AI to advance their mission.\n\nTo ensure greater transparency, the safeguards in this bill would  require DHS to report on its website any contract in excess of $1  million, reducing the amount that was previously required to be  reported from $4 million to $1 million.\n\nAs we look to prevent waste, fraud,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…provider to establish such an account       or profile.\n\n(5) Online dating service.--The term ``online dating       service'' means a service that--\n\n(A) is provided through a website or a mobile application;       and\n\n(B) offers members access to dating or romantic       relationships with other members by arranging or facilitating       the social introduction…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…just got to keep at it.\n\nFirst, the Great Lakes Authority has only been authorized since 2022.  It still does not have a Federal co-chair, so nobody is in charge. It  has no website, and it has no programs funded. They haven't done  anything.\n\nThey haven't spent any money making any lives better, yet, strangely,  it is still receiving Federal dollars…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…requested.\n\nAll of the fiscal year 2026 CDS requests submitted to the  Appropriations Committee can be found in a searchable table that has  been posted on the committee's website.\n\nMs. COLLINS. I urge our colleagues to defeat this amendment, and I  move to table.\n\nMs. COLLINS. Mr. President, I call up my amendment No. 4273 and ask  that it be reported…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of: Give it to me now. You  guys will figure out something in the future.\n\nWe have worked with some of the DOGE folks because I have the  economists, but go on their official website right now. They think,  next year, 2026 fiscal year, we can save $160 billion. That is real  money. If we borrow $6 billion a day, that is 24, 23 days of borrowing.  That…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that are basic driven by our demographics.\n\nLet's deal with some reality. If anyone has a question about my math,  you can look it up online, Mr. Speaker. Go to the Treasury's website.  This is important. We are now 51 days, I believe, into the new fiscal  year. We are 51 days.\n\nMr. Speaker, do you realize we have now borrowed $628 billion in the  first…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…intermediaries that assist small  businesses and merchants.\n\nFor example, express checkout tools would be affected by this  rulemaking. Let's say you want to buy an item on the website of a small  retailer in Lincoln, Nebraska. If that website allows interfacing with  express checkout tools, as many do, then you are going to see the  effects from this rulemaking…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}]