[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…our Nation's economy.\n\nIt is not an exaggeration. The Port of Los Angeles, which is the  largest port in the United States, expects imports to drop by 35  percent in just 2 weeks' time, as Trump's tariffs and his manufactured  chaos bring global trade to a halt. The Port of Long Beach is expecting  similar declines.\n\nTake a minute to think about the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I thank the gentleman from Virginia (Mr. Griffith) for  yielding me the customary 30 minutes.\n\nMr. Speaker, it is December 2. The year is almost over. We are now  only a few weeks away from new health insurance premiums skyrocketing.  People's insurance bills are going to double, triple, and, in some  cases, quadruple. I would think all of us would be…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…people who gave him the most  money for these digital baseball cards called a meme coin to come to a  dinner where he would feed them at his fancy Virginia golf club, held 2  weeks ago.\n\nAnd he said: Oh, and the top 25 buyers of my meme coin, those buyers  will get some other special access and special tour.\n\nAnd 220 people gave the President $148 million,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…countless New Yorkers,  will see their premiums go up.\n\nIn fact, sadly, today is the last day for Americans to sign up for  January Marketplace coverage. And over the next 2 weeks, this holiday  season--this Christmas season, this Hanukkah season--millions of people  will see their skyrocketing premium amounts deducted from their bank  accounts, wondering…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…plants.\n\nPresident Trump is a President who, in the 8 months now since he has  been President, has proceeded to try to cut off almost any source of  clean energy. Just a few weeks ago, he announced that he was going to  stop the offshore wind projects that were over 90 percent constructed  in Rhode Island. He has done the same throughout the eastern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Colorado. Committing violent acts and  murder against Americans living their everyday lives is not justifiable  protest.\n\nThese two unconscionable tragedies in just the past 2 weeks are a  product of a terrifying rise in anti-Semitism in our country. Sadly,  this does not come as a surprise to the American Jewish community, who  regularly face hatred and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…who continues to put profits and corporations over people.\n\nFrom the very beginning, I have shown up for this community. I don't  represent East Palestine, Ohio, but within weeks of the derailment, I  traveled there. I met with residents. I pressed FEMA, the EPA, the CDC,  Health and Human Services, and the Department of Transportation for  answers…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…percent  of their income for coverage.\n\nNow, Republicans think that people can afford increased premiums by  37 percent, and that is what they are proposing today. They said 2  weeks ago that they had a healthcare plan that they wrote on Friday  night. As I noted at the time, it was held together by bubble gum and  Elmer's Glue. By the way, Democrats never…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…last seen on October 8 when he suffered a medical emergency and was  separated from the group to receive care. Today, he is nowhere to be  found. He has been missing for 8 weeks.\n\nHomeland Security claims he was never in their custody despite  multiple credible eyewitnesses who say otherwise.\n\nMr. Speaker, Vicente has lived in the United States for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697508/vicente-ventura-aguilar-disappearance"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…warhead stockpile from a high of 70,000 in the mid-1980s to  roughly 12,000 today.\n\nNow that is meaningful, serious progress, but instead of building on  that progress, we are weeks away from reversing those hard-earned  gains.\n\nOn February 5, New START is slated to expire. That expiration will  mean the end to limits or verification of the still-formidable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE. Mr. Speaker, only in Washington, D.C., could politicians  come to the floor and brag about cutting $9 billion from rural radio  stations while 2 weeks ago they voted to increase the deficit by $4  trillion. Spare us these lectures.\n\nFor years, Republicans have lectured us and the country about so- called fiscal responsibility,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693711/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Mr. President, I call up my amendment No. 1274 and ask  that it be reported by number.\n\nMs. DUCKWORTH. Mr. President, what Trump and Musk have done to our  veterans in just 8 weeks since Trump has been back in office amounts to  a total betrayal. He has already fired more veterans than any other  President in modern history--6,000 and counting--for no…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, on a separate subject, in just a few  weeks, the Affordable Care Act's enhanced premium tax credits are set  to expire. We have precious little time to act. That means, on January  1 of next year, millions of Americans…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Republicans who are publicly admitting now that they didn't  realize that this provision was in the big, beautiful bill that they  passed. Of course, we all remember a couple weeks back this bill was  pushed through in the dark of night, after 1 a.m. It was clear that it  was rushed through so quickly that most of our colleagues did not have  time to…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…services we all need to live and thrive on.                       President Trump's First 100 Days\n\nMs. TLAIB. Mr. Speaker, it is hard to believe that it has only been  13 weeks.\n\nPresident Trump's first 100 days in office have eroded constitutional  rights, illegally and lawlessly dismantled Federal agencies, and  consolidated power into the hands…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690549/dte-rate-increase"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Government is one that I take  very seriously, especially in light of our Nation's debt surpassing $38  trillion.\n\nThe performative tactics that we have watched over the last 7 weeks  have truly been a disservice to Americans. My friends across the aisle  should never have put leverage or politics over those people who they  represent.\n\nThe most important…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…gave us that lift. All of those players  standing on that gold medal platform on Sunday, February 24, all of  them on that small platform, gave America the lift.\n\nA couple of weeks ago, I had dinner with some of the members of the  gold medal team. Captain Mike Eruzione said this to me: Pete, that  hockey game gave me life. Had we not won, I was going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…in the last few years  because of the enhanced premium tax credit subsidies that were added in  2021. Those temporary tax gifts to insurance companies expire in just a  few weeks.\n\nNow, he knew that they would expire. As he told me in our  conversation we had this week, he said he knew they were temporary, but  now he is trying to figure out what to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…President, I came to the floor earlier this year  to warn of the imminent threat that Islam poses to our great country.  Unfortunately, that threat turned into reality just a few weeks ago  when a deranged jihadist shot two of our National Guardsmen just steps  from the White House. Just before Thanksgiving, SPC Sarah Backstrom and  SSG Andrew Wolfe were…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Madam Speaker, we had an interesting 2 weeks out of  this building, and sadly my home State of Wisconsin made the news  again, in an effort to remove not just any person here illegally but  somebody who had broken the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Nation's promise to  servicemembers through another pay period.\n\nI certainly hope he won't have to divert resources from urgent  modernization again to make payroll in another 2 weeks, but that ball,  of course, is in the Democrats' court. I hope they realize the surest  way--the surest way--to help servicemembers and civilian DOD employees  is to simply…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…substantial amount of that is  just a boldface lie.\n\nFor anyone who is really interested just in sort of the academics of  what goes on here, I talked about this a couple of weeks ago. If you  have your search engine, look up ``AI Review of Congressional  Speeches.'' There is an academic group.\n\nThis is in like Nature, so it is a peer-reviewed article…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…hire, grow, and create onshore jobs that we  have carelessly lost overseas.\n\nH.R. 3174 is essential to keep pace with demand for capital and bring  jobs back to the U.S. Two weeks ago, the Committee on Small Business  heard testimony from the industry and other manufacturing stakeholders  about the importance of this bill for small manufacturers across…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, the last few weeks have been nonstop.  The Trump administration and congressional Republicans have been  advancing legislation and policies that put Americans first.\n\nJust last week President…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Iran Human Rights and Democracy Caucus was  organized to promote and what H. Res. 166 pledges to accomplish.\n\nMr. McCLINTOCK. Mr. Speaker, Mr. Fine has been here only about 6  weeks. As you can see, he is already distinguishing himself as a vital  voice for freedom abroad and for liberty at home. I couldn't be more  pleased to have him here today to speak…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…This is about protecting children who are the most  vulnerable among us. As I just mentioned, the Commander in Chief called  on us to act on this law in this very Chamber a few weeks ago.\n\nMr. Speaker, I urge the House of Representatives to vote ``yes'' on  the TAKE IT DOWN Act. Let's make history today. Let's protect our  children. Let's just take it down.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…packages, we will have funded 96 percent of all  of government.\n\n(Applause.)\n\nMr. President, the package also continues funding for the Department  of Homeland Security for 2 weeks to allow us additional time to  evaluate further changes in ICE procedures beyond those that we have  already included in this bill.\n\nLet me end by thanking our Appropriations…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…other Chamber.\n\nMr. Speaker, House Republicans remain on a positive, forward moving  trajectory in delivering upon the American people's mandate from  November. Just a few short weeks ago, we passed the One Big Beautiful  Bill Act.\n\nThis week, we are taking up a nearly $10-billion rescissions package,  and soon we will be moving into the appropriations process.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sooner had the  announcement been made than the Governor of California ran to court to  file his latest frivolous lawsuit.\n\nI say ``his latest'' because it was just a couple of weeks ago that  Governor Newsom was unanimously defeated before the Ninth Circuit Court  of Appeals on his National Guard lawsuit.\n\nYet, this frivolous lawsuit is particularly perverse…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693872/ending-waste-of-taxpayer-dollars-in-california"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…U.S. citizens.\n\nMy colleagues on the other side of the aisle bring up the married  woman argument. As you may know, Mr. Speaker, I am engaged and going to  be married in a few weeks from now. My fiancee is planning to change  her name, move to the great State of Wisconsin, and register to vote.  She and countless other individuals will have no problem…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]