[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…as he  is about running the United States.\n\nFinally, I will just say, if the Energy Department bill does make it  to the floor of the Senate--it is being debated this week in the  House--I will offer an amendment to that bill to prohibit the  requisition of Venezuelan oil for the purposes of nation building.\n\nThat will, of course, be an endeavor that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…MENENDEZ. Madam Speaker, I rise today frustrated by the chaos and  harm that is being caused by House Republicans under the direction of  the Trump administration. This week, the  House is coming to a standstill because Republicans refuse to address  the Epstein files despite Trump's repeated commitments to the American  people to do so.\n\nHowever, their…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…rights. It is beyond time, Mr. Speaker, to  stop the rot from the top, which has turned this agency into a rogue  and lawless force that is terrorizing our communities.\n\nThis week, the House will consider funding for DHS and give even more  funding to ICE.\n\nLet me be clear, Mr. Speaker: I am not only a no, I am a hell no.\n\nFrom unleashing violence in Minneapolis…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699193/defund-ice"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, last week, both the House and the Senate  voted to pass what is known as a rescissions bill. That is a term which  a lot of people aren't familiar with. What it basically means is that  Congress…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…do our constitutional duty: Stop  this illegal war, end this rotten tax scam, and stand up for the people  we work for.\n\nMr. AUSTIN SCOTT of Georgia.\n\nMr. Speaker, this week, the House has the ability to advance four  pieces of legislation under this rule.\n\nH.R. 3944 is the Military Construction, Veterans Affairs, and Related  Agencies Appropriations…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, this week the House will vote on a bill to  reduce clean water standards, setting our country back in our fight for  clean water. I worked for three decades to improve the water quality in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693947/protecting-and-preserving-long-island-sound"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ms. STRICKLAND. Madam Speaker, this week House Republicans are  bringing forth their ill-conceived, cruel budget resolution. This  resolution will set the stage across the board for cuts on the basic  services our constituents…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, last week, when the House was out of  session and I was in the greatest State in the Union, Delaware, I met  with a family farmer in Sussex County who continues to farm the same  land that her…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…understands this. In their bipartisan fiscal year 2026  conference agreement for National Security, the Department of State,  and Related Programs that was published earlier this week, House and  Senate appropriators recommend continued funding for most UN  organizations and programs, as in past years.\n\nAccording to their bylaws, no UN member state, including…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…launched his Trump memecoin. Days later, Melania Trump  launched her memecoin.\n\nOn March 25, 2025, World Liberty Financial launched a dollar-pegged  stablecoin just 1 week before the House Financial Services Committee  marked up stablecoin legislation and 2 weeks after Senate colleagues  held their markup.\n\nOn March 31, Eric Trump and Donald Trump, Jr.'s,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…administration  recklessly cuts critical Federal research programs, engages in mass  firings of crucial experts, and engages in wild swings in national  trade policy from week to week.\n\nHouse Democrats have shown our commitment to American technological  leadership. The CHIPS and Science Act, for example, makes  transformational investments in research and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692732/deploying-american-blockchains-act-of-2025"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…world-class dairy  products and family farms across Central New York and the Mohawk  Valley. That legislation, Mr. Speaker, is the Whole Milk for Healthy  Kids Act.\n\nEarlier this week, the House passed this bill with overwhelming  bipartisan support, a clear sign that commonsense policy can still  bring Democrats and Republicans together.\n\nThis bipartisan bill…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698263/supporting-whole-milk-for-schoolchildren"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…flag right behind the  Speaker's chair and what that flag represents: opportunity, access,  honesty, integrity. What we have seen last week and what we are seeing  this week from the House majority when it comes to this reconciliation  bill is silence. It is silent on these issues that mean so much to the  people in our communities.\n\nI can't tell you how…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opposition to this bill. I  have to say that I keep hearing from my Republican colleagues about  permitting reform. In fact, they have been calling this permitting week  here in the House.\n\nThe reality is they are not interested in any kind of permitting  reform unless it involves streamlining the ability to eliminate  barriers for fossil fuels, for…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…a better use for those dollars than paying an additional tax to  bureaucrats who want to regulate every detail of how they do business  from hundreds of miles away.\n\nThis week, House Republicans will take a commonsense step forward by  protecting consumers and small businesses alike from these costs. The  Small Business Regulatory Reduction Act is exactly…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…materializing  and that they are neglecting Democrat bills in the House while  preferencing Republican bills.\n\nI don't see this. In fact, to the contrary. Within the last week, the  House of Representatives has passed multiple bills--I believe it was  three or four bills--introduced by Democrats; Democrat bills run  through the suspension of the rules calendar…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, it has been quite a week for  the House Republicans with the long and late committee hearings as we  move forward on our reconciliation package and deliver substantial wins  for the American people. Like I…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…threatening our  elections.\n\nWhile President Trump is hard at work securing our border, it is now  time for Congress to secure our elections from noncitizen voters. This  week, the House will vote on the SAVE Act, legislation that strengthens  our election laws by requiring proof of citizenship to vote in Federal  elections.\n\nThe SAVE Act also requires…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, we just got done with a very interesting  week in which this House passed a budget bill, and now we proceed  actually to the more difficult process in which, sometime over the next  4 months, we plan on passing both the reconciliation…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…vision with clear rules, strong  protections, and a real momentum to keep the dollar at the heart of  global finance.\n\nLet's make crypto great again.\n\nMr. Speaker, this week, the House has the ability to advance four  pieces of legislation under this rule:\n\nH.R. 1919, the Anti-CBDC Surveillance State Act prohibits the Federal  Reserve from issuing a…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to make sure that our son will  have what he needs to also thrive in this environment. I look forward  to that chance.\n\nMr. Speaker, I have been very encouraged this week to see the House  and the Senate Republicans coming together to deliberate on our  reconciliation package. We are trying to get this timeline going as  quickly as possible. There is…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Women by Illegal Aliens Act that protect American  citizens. That is what Americans overwhelmingly voted for in this past  election, and the work has only just begun.\n\nLast week, House Republicans took a crucial first step to unlock the  process to advance President Trump's full legislative agenda. This  Republican majority will not stop fighting until…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "French Hill", "party": "Republican", "sentence": "…defined, respectively, under section 2331       of title 18, United States Code).\n\nI rise in strong support of H.R. 2384, the Financial Technology  Protection Act.\n\nLast week, the House passed critical digital asset legislation,  setting the stage for the United States to reclaim our global  leadership position in financial technology on digital assets.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Madam Speaker, this week, the House will  vote on several bills under the Congressional Review Act to repeal out- of-touch Biden-era Green New Deal policies.\n\nH.J. Res. 88, which I introduced this Congress,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…lucky to have him representing them  in the House of Representatives.\n\nMr. Speaker, I rise in support of the rule and the underlying  legislation. This is an important week in the House as we take up  legislation to fund our military and advance several key financial  services bills, including efforts to establish a clear market structure  for cryptocurrency…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, this week, the House will  vote on the first DOGE rescissions package that will claw back nearly  $10 billion in wasteful spending. The American public expects their  government to be good…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}]