[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…can live with dignity instead of fear of bankruptcy.\n\nDemocrats did not give up on the American people, unlike many  Republicans, who chose to let these tax credits expire 1 week ago. That  is right. When the ball dropped in Times Square on New Year's Eve,  millions of Americans saw their healthcare premiums rise. That is a  direct result of the healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…expiring in 2025. For the people who benefited the most, the top 1  percent of this country in terms of their economic position, for them,  that is their number one priority.\n\nA week ago Friday, in the Budget Committee, on a party-line vote, the  Republicans produced their bill, their budget reconciliation bill,  which extends those tax cuts, despite the fact…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…like, you would decide to add tax cuts and make  permanent tax cuts for people who are making over $400,000 a year.\n\nWe actually had a vote on this, late at night about a week ago, where  we asked our Republican colleagues: OK. Well, how about for people  making over $10 million a year? That was Senator Warren's amendment.  She said: OK. How about if…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Representatives. Republicans should  be ashamed of themselves.\n\nI thought all of us ran for Congress, regardless of party, to try to  help people. What Republicans did a little over a week ago was about  not only hurting people but screwing them over. That is sad.\n\nThen, look at today. Some of the bills at one time were bipartisan.  H.R. 2483 reauthorizes funding…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I say thank you so very much to Ohio's corn  and soy farmers for their excellent agricultural summit in which I  participated about a week ago in Defiance, Ohio. We discussed the  importance of biofuels as a reliable source of income for northwest  Ohio farmers, in fact, 44 percent of their income and rising.\n\nThis…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698200/northwest-ohio-biofuels-summit"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…politics, cooking,       the family. All of it. It's equally difficult to put into       words how much she loved all of the people here. But there is       a silver lining. One week ago, a bus arrived. Except this one       was not faulty this time. It was right on time. It took my       grandmother on. It took her to a table where Lil, Clara, and       Fawn…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, 1 week ago today, Republicans allowed the  ACA premium tax credits to expire after telling us there was no money  to do so.\n\nHealthcare premiums have soared, and millions of Americans…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698585/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, 1 week ago, Republicans skyrocketed healthcare  costs for 22 million Americans. They chose to let the ACA tax credits  expire, even though there was bipartisan support to extend them.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698797/breaking-the-gridlock-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Mr. LANDSMAN. Mr. Speaker, I rise today on behalf of one of my  constituents, Debbie. Up until 1 week ago, Debbie worked at the  Cincinnati VA, responsible for finding and hiring doctors with the  skills needed to treat very sick veterans.\n\nDebbie loved her job, she was good at…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687961/debbie-va-employee"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…issue. More time? More time to study exactly  what? It has been 3 months. What the hell is there to study? What is  there to study? I made this request to the Secretary a week ago, and,  to date, he has still not provided access to all Senators.\n\nSo, ahead of tomorrow's briefing, we need to be clear about one  thing: Every single Member is entitled…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…saying she won't  believe The Washington Post articles. I wonder if she will believe the  sentiments of her own colleagues? I believe it was Mr. Lawler from New  York who a week ago was bemoaning online the closure of one of the  Social Security offices in his own district.\n\nWhat are we talking about? These offices are being closed in North  Carolina,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Mr. Speaker, I thank the ranking member for yielding  time.\n\nMr. Speaker, I am here to commemorate liberation month. A week ago,  Liberation Day brought us President Trump's tariffs which will liberate  a typical American family from 3,800 of their hard-earned dollars each  year, according to one study.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689853/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…how wrong it is--it makes the spending process totally partisan.\n\nThe leader's words and his actions are a complete contradiction. He  can't have it both ways.\n\nAgain, not 1 week ago, Republicans jammed a rescissions package  through this Chamber, axing billions in bipartisan funding to public  broadcasting and foreign aid, purely on a party-line vote.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…the screams of families being  separated, U.S. citizens being arrested without cause, and the  indiscriminate gassing of innocent families, including a 1-year-old  just a week ago.\n\nFamilies in my district are living with fear and trauma that no one  should have to endure in our country.\n\nLast week, we returned after 54 days with the House shuttered,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…hours ago, Elon Musk affirmed a statement  about actually impeaching the President. I mean, who would have thought  that we would end up here because, literally, less than a week ago,  they were having a bromance in the Oval Office? It is really just  incredible to think about what has happened over the last 72 hours when  you think about it.\n\nI think…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…been identified in improper payment requests.\n\nOver at the Centers for Medicare and Medicaid Services, the  government has launched a Fraud Detection Operations Center, and 1 week  ago today, CMS announced they suspended suspected fraudulent payments  to 33 different providers. One such fraudulent payment was for a  patient that died two decades ago. It…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$9 trillion, and we are going to issue about two, $2.2 trillion new  debt.\n\nTiny movements of interest rates are really stressful. The Federal  Reserve, what was it, 1 week or so ago, lowered their economic growth  projections for the United States for the next 3 years. Just that  lowering, I think they lowered us from like 2.1 to 1.7 percent this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I thank my friend from Kentucky for  yielding.\n\nMr. Speaker, a little over a week ago, America witnessed a horrific  act of political violence that goes against everything the United  States stands for.\n\nOn June 14, a deranged murderer disguised himself as…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, thanks to the leadership of President Trump,  America and the world are safer today than we were a week ago. Iran,  the world's leading state sponsor of terrorism, is no longer on the  verge of obtaining a nuclear weapon. They have agreed to a ceasefire  with Israel. President Trump…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is a dataset. Now, we have  been using 8 years from now because that was the official Census Bureau  number.\n\nThere are a couple demographers out there who wrote articles a week  ago saying, we may have already hit more deaths than births in America.  I need you to process what that means. You have a system where Social  Security, the financing of Medicare,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…providers in your State that had plenty of  cash lying around to fly people out to come lobby. So we did this, we  pulled open another Wall Street Journal article from a week or two ago  talking about how many people in the Medicaid systems in the United  States are enrolled in multiple States.\n\nYou actually have billions and billions and billions of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…day the tariffs are on, one day they are off, the  next day there is a loophole for this industry or that industry, is  chaotic and is leading to turmoil in our markets.\n\nA week ago, when the thought of tariffs came forward, the markets  plunged to historically low levels.\n\nThe tariffs on Canadian imports, the tariffs on Mexican imports, the  tariffs…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, time flies these days, but it was just  over a week ago when the House and the Senate passed what President  Trump called the One Big Beautiful Bill, just in time for him to sign  it before the deadline that he himself requested…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, it is great to be here in the people's  House once again.\n\nJust a week ago, when I was celebrating with friends the July Fourth  holiday, watching the fireworks go off and celebrating the freedoms we  enjoy, many people actually came up to me in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…sponsoring a resolution in our State legislature to commend the team's  win and to host the team at the Kansas State House to see the  resolution's unanimous adoption.\n\nA week ago, on the 20th anniversary, the community in Iola came  together and inducted that 2006 team into the Iola High School's Don  Bain Hall of Fame. Believe me, Mr. Speaker, the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699133/congratulating-2006-iola-fillies-on-don-bain-hall-of-fame-induction"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and the delays that ensued after that such that these  astronauts had to overstay their planned trip by many, many, many  weeks.\n\nIt was just on March 18, a little over 1 week ago, that they finally  were brought home thanks to SpaceX and splashdown in the Gulf of  America.\n\nThis was a great moment for our country, certainly a great moment for  the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]