[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…this  House.\n\nWhat was the President's response? Did he respond to these  allegations? Did he rush to stop Republicans from trying to cover their  tracks who had been lying for weeks about the nature of this bill and  how it would gut our healthcare to millions of Americans, and how it  would cause our Nation to spend generations of debt on the backs of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…his       comments during a Cabinet meeting in which he called Somali       people ``garbage'' and said, ``They contribute nothing. I       don't want them in our country.''\n\nWeeks later, a conservative YouTuber named Nick Shirley       posted a video in which he recorded Minneapolis Somali-run       child care businesses and accused them of fraud, claiming…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I rise in opposition, strong opposition, to this  resolution.\n\nFor the past 5 weeks, Elon Musk and congressional Republicans have  been running around calling any Federal spending debt they don't like  waste. The empowerment exercise of Elon Musk is a rather…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…in coordination with the Capitol Police; and second,  we will see real funding to support enhanced Senate security; and  finally, that we will see more progress in the coming weeks.\n\nI look forward to continuing to work on a bipartisan basis to get  that done.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…I hear my  colleague, who I respect, the chairman of our Energy and Commerce  Committee, keep saying that the Medicaid cuts in the budget bill that  they passed a couple of weeks ago affect only the able-bodied, that it  doesn't affect people with substance use disorders or those struggling  with mental illness because they are exempt from the work…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…accountability measures that required  additional reporting by the Secretary and an inspector general review  of the circumstances surrounding the projected shortfalls.\n\nA few weeks later, on October 30, 2024, VA notified the committee  that it had reviewed its calculations at the conclusion of fiscal year  2024 and determined that it would not have experienced…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, in the span of 12 weeks, our country was  shaken by the tragic killings of Renee Good and Alex Pretti, who lost  their lives because of the violent and reckless choices that the Trump  administration…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699662/horrific-ice-abuses"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Party's efforts to  undermine the United States.\n\nMr. Speaker, I thank Representative Strong for sponsoring this  legislation,  but I must acknowledge that over the past few weeks, the Trump  administration has taken several alarming actions that work to counter  the work we are trying to do today with this legislation.\n\nMr. Speaker, I urge the Trump…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…learning and empowerment, as well as their achievement, operate before-  and after-school programs, train teachers, and help adult learners go  back to finish high school.\n\nA few weeks ago, on the evening of June 30, the Department of  Education sent out the following message to States:\n\n``Given the change in administrations, the Department is reviewing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…health.Decades of sound science and public health progress are being  cast aside in favor of conspiracy theories and pseudoscience.\n\nLast month, the CDC Director was dismissed after just weeks on the  job. This week, the agency's vaccine advisory committee is considering  changes that could weaken or even eliminate requirements for lifesaving  childhood vaccines.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695435/cdcs-dangerous-turn-on-vaccines"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…happening inside these facilities. For years, Members of Congress could  visit unannounced, but under Secretary Noem, that right was stripped  away. My team and I worked for weeks just to gain entry and finally got  a scheduled appointment.\n\nWhen I visited, 1,079 people were being detained at Bluebonnet.  Nearly 700 of them, almost two-thirds, were designated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…America's closest allies are wanting to cut off the shipment of weapons  that sends a green light to Netanyahu's extremist government.\n\nAnd yet we are here today where just 2 weeks ago, President Trump, in  fact, indicated that he intends to ship another half billion dollars'  worth of 2,000-pound bombs and 1,000-pound bombs to the Netanyahu  government.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…diagnosed with pancreatic cancer, my mother's cancer was not detected  until it was stage IV, and therefore, was not treatable.\n\nTragically, the cancer took her life 8 short weeks after her  diagnosis. It was a shock to our entire family, the lingering effects  of which I feel every day.\n\nIn an effort to turn my pain into passion, I made a commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Congressional Black Caucus to commemorate National Minority Health  Awareness Month, but I am also here for personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was  excited. I was expecting a girl. I had placenta previa, so I knew we  were going to have to schedule a C-section. We had just scheduled it.  She was due June…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…government--the part of  government dealing with the Department of Justice and other justice- related Agencies--over border wall funding.\n\nThe first shutdown lasted for about 2 weeks. The second shutdown-- again, of part of government, not all of government--lasted for about a  month. And they are horrible. The consequences for those affected,  whether…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…decision.\n\nThe Supreme Court said 2 days ago that they are going to put a hold  on the time on this Judge Boasberg and this migrant issue that has been  with us for the last 3 weeks.\n\nThen, yesterday, this unelected district judge in California who  thinks they get to decide how many probationary employees work in the  executive branch, not the guy who…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689717/no-rogue-rulings-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…U.S. citizens.\n\nMy colleagues on the other side of the aisle bring up the married  woman argument. As you may know, Mr. Speaker, I am engaged and going to  be married in a few weeks from now. My fiancee is planning to change  her name, move to the great State of Wisconsin, and register to vote.  She and countless other individuals will have no problem…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Government is one that I take  very seriously, especially in light of our Nation's debt surpassing $38  trillion.\n\nThe performative tactics that we have watched over the last 7 weeks  have truly been a disservice to Americans. My friends across the aisle  should never have put leverage or politics over those people who they  represent.\n\nThe most important…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…this shutdown. That is the epitome of hypocrisy, and the  American people deserve better than that.\n\nHouse Republicans did our job. We passed a clean continuing  resolution weeks ago, the same kind of straightforward measure that  should have been agreed to immediately to keep this government open.  Senate Democrats blocked that 14 times, prolonging…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…working men and women of the rural community where he was  born and raised and grew up, but he always did it with a good-natured  smile and a quiet, respectful manner.\n\nJust 3 weeks ago, on December 15, I took my seat on an early  Washington-bound flight from Sacramento, about eight rows behind Doug.\n\nWhen I looked up, he was standing there in the aisle…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…a  time to be determined by the majority leader, in consultation with the  Democratic Leader, during Thursday's session of the Senate.\n\nMr. THUNE. Mr. President, just over 2 weeks ago, the Senate passed  the HALT Fentanyl Act with bipartisan support. As I said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking so…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Up  Navajo Project. In May, a courageous team of 16 WREC employees traveled  over 1,800 miles to the remote, rugged terrains of Arizona and New  Mexico, where they spent two weeks installing vital electrical  infrastructure for Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692595/recognizing-theodore-gomez"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…a target on their  heads.\n\nWe have heard for 18 months that the intifada should be globalized.  We have heard ``resistance by any means necessary.'' On Sunday, and  again 2 weeks ago, we saw what that looked like.\n\nIn this country, we have a hard decision to make. We have to make a  decision about whether we are going to continue to be afraid or whether…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…one of only three companies in the United States of America  that controls the entire healthcare market has been buying up medical  practices across my district.\n\nJust a few weeks ago, I launched a community inquiry. Thousands of my  constituents and my neighbors and friends who have been hurt by Optum  have responded detailing horrific stories of declining…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…each other?\n\nBack to one of the things that has just annoyed the crap out of me--I  used this board a handful of times for some of my leftwing protesters  the last couple of weeks, and to their credit, some of them were  actually shockingly intellectually honest saying: Oh, that is not part  of our talking notes. No one told them the truth.\n\nMr. Speaker,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…spiritual groups and civic organizations within the community to help  hurricane victims. Thanks to these efforts, Our Lady Queen of Peace  served 12,000 families during the six weeks after the hurricanes. David  still works with Fresh Start for Pasco, Endeavors, and Pinellas  Emergency Operations Center to help victims of disasters. Most  recently, his…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690173/recognizing-david-cruz"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Nation's promise to  servicemembers through another pay period.\n\nI certainly hope he won't have to divert resources from urgent  modernization again to make payroll in another 2 weeks, but that ball,  of course, is in the Democrats' court. I hope they realize the surest  way--the surest way--to help servicemembers and civilian DOD employees  is to simply…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…gave us that lift. All of those players  standing on that gold medal platform on Sunday, February 24, all of  them on that small platform, gave America the lift.\n\nA couple of weeks ago, I had dinner with some of the members of the  gold medal team. Captain Mike Eruzione said this to me: Pete, that  hockey game gave me life. Had we not won, I was going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Up  Navajo Project. In May, a courageous team of 16 WREC employees traveled  over 1,800 miles to the remote, rugged terrains of Arizona and New  Mexico, where they spent two weeks installing vital electrical  infrastructure for Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…MANN. Mr. Speaker, after decades of pledging Never Again, we are  watching the vile presence of anti-Semitism rear its ugly head once  again.\n\nFirst, the unthinkable happened 2 weeks ago here in the streets of  the Nation's Capital when two staffers from the Israeli Embassy, Yaron  Lischinsky and Sarah Milgrim, were brutally murdered. Sarah was one of…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}]