[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…program, the program which provides more  coverage for more Americans than any other program, 72 million  Americans, was a target in this budget reconciliation bill.\n\nOver the weekend, the measure had been released and we finally get to  see what, in fact, it looks like. The chairman of the Energy and  Commerce Committee, who is a good friend and a good…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…cost-effective. The offer  was turned down because this isn't about saving the government money.  This is about thoughtlessly cutting critical services in the name of  ideology.\n\nThis weekend, Commerce Secretary Lutnick said his 94-year-old mother- in-law wouldn't miss her Social Security check if it didn't show up.  Mr. Lutnick is a billionaire who can easily…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689272/social-security-cuts"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, this past weekend marked the 60th anniversary  of Bloody Sunday where a triumphant march in pursuit of equality and  justice for all was met with brutality and violence.\n\nAs I rise today, I…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688732/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…worked at the Israeli Embassy  and were planning their engagement, but their future together was cut  short when a man yelling, ``Free Palestine,'' murdered them.\n\nThis past weekend, 12 people who gathered weekly to bring attention  to the hostages held captive by Hamas were firebombed by an anti- Semitic terrorist in Boulder, Colorado. Committing violent…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the  healthcare that they deserve. That is what we should be debating. Those  are issues that are far more pressing and critical to Americans.\n\nI was home in my district this weekend. Not one person asked me about  Chuy Garcia, not one person in my district or in my State. We have to  worry about our own districts. Isn't that what people say, ``What is…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696775/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, today I am here to stand up for Oregon. Just  before the weekend, the President spouted off some nonsense about  deploying the National Guard to Portland. As we have seen in D.C.,  L.A., and now Boston, it is an unwelcome occupation.\n\nThe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695015/national-guard-in-portland"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…about  that. I am talking about they just want to go today. They want to leave  today. People have flights today. It is Thursday, and it is not 5 p.m.\n\nSo were we to work a weekend to try to land this airplane, that would  be beneficial to the country, to the body, to Republicans and Democrats  alike. We are actually very close, and Senator Lankford…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Speaker, I rise with a heavy heart but a deep  resolve as we confront the assassination and attempted murders of  multiple State legislators in Minnesota.\n\nWhat we witnessed last weekend was an unspeakable act. This is a  scary time for our country, and it comes at a time of increasing  political violence. There have been assassination attempts, kidnapping…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…taken care of.''\n\nAt a time when so many families are struggling to put food on the  table, why would we take away a lifeline that millions of Americans  rely on?\n\nThis past weekend, I visited Christ the King Lutheran Church in Cary,  North Carolina, where I saw firsthand indispensable work to combat food  insecurity in our own community.\n\nRepublicans…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693584/condemning-republicans-big-ugly-law"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Irving, Richardson, Rowlett,  Plano, and University Park. Its network spans light rail lines, bus  routes, commuter-rail service (the Trinity Railway Express and as of  this weekend the new Silver Line), GoLink on-demand services, and  paratransit. Recently, DART has adopted an updated Strategic Plan  setting bold new vision and mission statements, guiding…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, this weekend in Yonkers, I met four  constituents who have recently been fired from Federal service. Their  human stories force us to consider the painful toll created by the cut- and-destroy…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688724/considering-the-painful-toll"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…House Republican colleagues here,  too.\n\nMake no mistake: That is going to lead to hospitals closing in the  places where they are needed most. I just read an op-ed over the  weekend about a doctor who was working in a rural area, and his  hospital was dead center between hospitals that are 200 miles apart, so  if his hospital has to shut down, you would…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and all instances  of excessive force and abuse at the hands of immigration agents in  Chicago and elsewhere.\n\nAs Federal District Court Judge Biery said in his order, this  weekend, requiring the release of Liam Ramos from ICE detention,  ``Observing human behavior confirms that for some among us, the  perfidious lust for unbridled power and the imposition…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…majority party actually believed  in supporting student parents, then they would take real action, not  just grandstand on the House floor because the March for Life is this  weekend.\n\nThe bill before us today requires the dissemination of incomplete  information, but it also comes after House Republicans have worked  alongside the Trump regime to dismantle…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…too long. We have talked  about this issue over and over again. It is time to do something.\n\nI want to salute those air traffic controllers. They have gone  through a tough weekend, with Americans traveling for Thanksgiving, and  I know that many of them have worked hard to make sure we have safe air  travel.\n\nI want to echo the comments of the Republican…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to be  able to stay here until it is resolved?\n\nNow, I want to see my family like everybody else does. There are  folks that have all kinds of issues that are happening this weekend.  Some are going on codels. Some are heading overseas. Some are going  home. Some have elections coming up. There are lots of things that are  happening this weekend, and…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…coast, north to south,  meeting with men and women who feed this great country. They are  memories I will always treasure. He was supposed to be with me in  Pennsylvania this weekend. His presence will be sorely missed.\n\nIn a town full of self-important figures, Doug was authentically  normal. I will certainly miss his wisdom, his sense of humor, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, before I begin, I just want to say that I  join Americans around the country in praying for the victims of the  torrential flooding in Texas this weekend. More than 100 have been  reported dead--among them, at least 28 children. It is a moment of  unfathomable pain for so many, and my prayers are with the grieving  parents…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693248/central-texas-floods"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate the Albany  Huskies on their undefeated season, closing it out with a win over  Waseca in the Class 2A championship last weekend.\n\nThese players were unshakable, even when the score was tied up. They  knew their mission and executed, and they have made their families, the  Albany community, and the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Mr. Speaker, when it comes to festival, this one is shrimply the  best. I invite my colleagues and you, Mr. Speaker, to come shell-e- brate with us. It is always the first weekend in May.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690464/isle-of-eight-flags-shrimp-festival"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, when Congress is in session, there are  always interesting articles in the paper that I think demand a little  bit more attention.\n\nOver the weekend, or late last week, there was an article that said  that the United Kingdom, in a few years, is going to begin having 16- year-olds vote. Since frequently problems in America…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…responsibility forward to wherever  the next calling may be.\n\nSo fair winds and following seas, shipmate.\n\nI would like to add, as we debate these bills on the floor here, that  this weekend is Memorial Day where we remember those who have given  their lives, that we may speak freely down here, that we may debate  with our colleagues, hopefully in civil tone and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, we heard so much over the weekend from  Tennesseans who were reaching out, just so saddened by the series of  truly devastating attacks we saw in Syria. Two of our National Guard  members from Iowa lost their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…other States across the country.\n\nMs. LEGER FERNANDEZ.  I thank Representative Roy for acknowledging the tremendous  loss that  Jim McGovern and his wife, Lisa, suffered this weekend when  their daughter, Molly, was taken by cancer, a disease both of us have  battled, as well.\n\nWith the Speaker's indulgence, I will read a few sentences from the  McGoverns'…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, over the weekend, the Colorado Springs Police  Department, the El Paso County Sheriff's Office, and the Drug  Enforcement Administration worked hard to do a raid in my hometown of  Colorado…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690282/raid-in-colorado-springs"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…including  when responding to emergencies and disasters.\n\nThat fact was clearly demonstrated during the response to the tragic  flooding in Texas over the Fourth of July holiday weekend. Petty  Officer Scott Ruskan and the Rescue 6553 aircrew were first on the  scene at Camp Mystic, the historic girls' camp that was caught in the  catastrophic flooding, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, Congress is leaving and won't be back  until next week. If it is like every other weekend, a lot of what you  see on television is going to be incidents going on in Minnesota  affected by the immigration situation.\n\nI remind my colleagues and the American people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699736/america-cannot-have-unlimited-immigration"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…estimates that the total amount of criminal fraud  to this point, after 5 years, has reached $9 billion. That is billion  with a ``b.''\n\nMinnesota's attorney general said this weekend on CNN in an interview  that, you know, the fraud estimation is not a serious thing and that is  just political theater.\n\nThat is expensive political theater.\n\nA statement…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…of that. Instead of  adjourning, we need to lock ourselves in a room and figure this out-- because real people are being needlessly hurt as Members fly out for  another long weekend.", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696473/vote-explanation"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…defend that in the  future. And I want to thank President Trump for bringing attention to  the 250th birthday of the U.S. Army with the festivities that are going  on this weekend in Washington, DC.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}]