[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…justice. Today, we mourn the passing of  my dear friend and brother in service, Congressman Sylvester Turner.\n\nMr. Turner was more than a colleague. He was family. He carried the  weight of his community on his shoulders, never once complaining, never  once backing down from a fight when the people needed him. He walked  these Halls not for power, not for prestige,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…administration hell-bent on  dismantling the very systems designed to protect the most vulnerable  amongst us. For Black Americans, those of us who have always carried  the weight of a broken system and bad policies, the danger is real, it  is tangible, and it is urgent.\n\nLet me be clear: The last 100 days have not been an accident or a  fluke. He has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…under Donald Trump's America or  under the very D.C. crime bill he is pushing today, he wouldn't be  standing here as a Member of Congress. He would still be living with  the weight of those charges.\n\nLet's call this what it is: Opportunities for me, but not for thee.  He climbed the ladder of redemption, and now he is yanking it right up  from under D.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…car,  afford health insurance, go to the grocery store, or go shopping for  clothes, toys, tools, and school supplies. It is a reality that our  Nation functions under the weight of unfair global supply chains.\n\nWhile we can all agree that it is great to manufacture as much as  possible in America, that requires real investment in companies and in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…pretty rough week for  Donald Trump's so-called Beautiful Bill. As everyone watching can tell,  things haven't gone according to plan. The bill has been bucking under  its own weight, the delays have piled up, and it is obvious large  chunks of the Republican conference don't like their own bill.\n\nBut, of course, we are hearing that Republicans may still…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…Secretary has strong ties to the stablecoin Tether. He spent 40  years as CEO and chairman of Cantor Fitzgerald, one of Tether's key  investors. He is using his and his family's weight to pitch Tether to  foreign governments across the Middle East, turning public policy into  personal profit.\n\nThe United States Government must be a free and impartial referee.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692975/leadership-of-blockchain-technology"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…my qualifications,  experience in my own eyes, perhaps still more in the eyes of others,  has strengthened the motives to diffidence of myself, and every day the  increasing weight of years admonishes me more and more that the shade  of retirement is as necessary to me as it will be welcome. Satisfied  that if any circumstances have given peculiar value…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Veterans Day. Like many of our colleagues, I  joined the western New York community to honor those who selflessly  served our country and their family members who have carried the weight  of that service with unwavering strength. I was reminded of their  commitment to this country and how the liberties we enjoy today were  paid for in duty, courage, sacrifice,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…that we cherish have  always required vigilance, courage, and sustained commitment. Today,  that lesson is as urgent as ever. Across our country, communities are  feeling the weight of an administration that governs through extremism,  division, punishment, and exclusion.\n\nWe see it in attacks on our voting rights, in efforts to criminalize  protests,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and I have good moods or bad moods but always  find myself lifted when I walk onto this floor. It is a sacred civic  space. It is extraordinary. And I am always aware of the weight of  history when I walk in here. No matter a good day, bad day, whether I  am in a rush or not, when I touch the Senate floor, I feel something  really magnificent.\n\nI don't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…being priced out of their own grocery store. Food prices have  shot up--meat, milk, bread, eggs--basics that every family depends on.  Households are getting buried under the weight of their grocery bill.\n\nNow, to make matters worse, the Trump administration has unilaterally  paused Federal food assistance and canceled shipments to food banks. We  are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…growth and  comfort--and what is perhaps of still greater consequence, it must of  necessity owe the secure enjoyment of indispensable outlets for its own  productions to the weight, influence, and the future maritime strength  of the Atlantic side of the Union, directed by an indissoluble  community of interest as one Nation. Any other tenure by which…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…signature of someone      Who has never watched a child      Take their first steps at 12,      Never seen the light in eyes      When words finally come,      Never felt the weight      Of a family's hopes      Balanced against      The coldness of cost.      Yet in these rooms where care persists,      Where love defies their calculations,      We piece…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…taxpayers nearly $3  billion. Americans cannot afford the cost of gun violence, not in  dollars, in pain, or in grief. Black Americans, in particular, bear a  disproportionate weight of that grief.\n\nThis past weekend, I joined survivors of gun violence in an  environmentally-friendly balloon release to honor the 46,000 lives lost  to gun violence every…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…the rest of the agricultural supply chain.\n\nThe inspections provided by the Federal Grain Inspection Service  define and classify grains, as well as assign grades to specify weight  and quality requirements.\n\nThese inspections provide a gold standard assurance backed by the  U.S. Federal Government to both grain buyers and grain sellers.\n\nI proudly represent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…U.S.C. 2052(a)(5)).\n\n(2) High concentration of sodium nitrite.--The term ``high       concentration of sodium nitrite'' means a concentration of 10       or more percent by weight of sodium nitrite.\n\n(d) Effective Date.--This section shall take effect 90 days       after the date of enactment of this Act.\n\nI rise today in strong support of H.R. 1442,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690219/youth-poisoning-protection-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…sacrifices  of these families do not go unnoticed. We acknowledge that behind every  fallen officer, firefighter, or EMT is a family--spouse, children, and  parents--who bear the weight of that loss every day, yet continue to  honor their loved one's legacy through quiet strength and enduring  service to their communities.\n\nThis resolution sends a clear message:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…initiatives  and work to fight homelessness.\n\nIt devotes funding to improve quality of life, including childcare  and housing resources for military families who help carry the weight  of their loved one's service.\n\nIt reaffirms our commitment to peace through strength by providing  for military base infrastructure and key deterrence efforts in the  Indo-Pacific.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…with the minting and issuing a $2.50 coin for wide       circulation;\n\n(5) proposed physical characteristics of a $2.50 coin,       including--\n\n(A) composition;\n\n(B) weight;\n\n(C) diameter; and\n\n(D) design features to distinguish the $2.50 coin from       existing coins;\n\n(6) a description of the ways in which the Secretary       consulted with…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…needed it. He taught his family the value of  being tough and rolling with what life gives you. He was fond of the  saying ``rub some dirt on it, you'll be fine'', which carries weight  with everyone who knew him.\n\nFrank took immense pride in being a Night Stalker. These men and  women are some of the best rotary wing aviator crews in the world.  Frank's…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…efforts to  bring an end to the Russian invasion of Ukraine. The Chinese companies  illegally supplying Russia in violation of U.S. export controls must be  subjected to the full weight of our sanctions regime. The bill ensures  that the CCP and the world understand that supplying America's  adversaries comes with a very severe cost.\n\nHouse of Representatives,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hope, and responsibility,  sometimes all at once.\n\nThis month, we pause to recognize that while our servicemembers  protect our freedoms, their children carry the emotional weight of that  commitment. They sacrifice stability, time with their parents, and the  comfort of staying in one place, and they do it all with a resilience  that is nothing short…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…providers--that track pending requests  for new generation facilities to connect to the grid.\n\nRight now, our Nation's interconnection queues are buckling under  their own weight. The growing backlog of projects is adding years to an  already slow process and prevents shovel-ready projects from being  built and connected.\n\nAccording to the Lawrence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…actually one of  the most important things to be focusing on right now.\n\nMr. Speaker, I take a lot of questions from folks back home. Utah is  a State that hits above their weight in academic outcomes. We have  large families. This is a big, big deal for us.\n\nThe confusion of why would you dismantle the Department of Education,  I will make sure I do…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…wanted to say thank you to everyone who took the time out of their  busy schedule to come here. This program has in the past, I think,  allowed our region to punch above its weight. Indeed, this is the  biggest chamber trip, I understand, to D.C. that exists anywhere in the  country.\n\nIt really underscores the tremendous spirit of collaboration that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…about the real-world issues that  they are facing when raising capital.\n\nOutdated regulations make it more difficult than it needs to be. Our  current laws can trigger the full weight of the Paperwork Reduction Act  when the advocate's intention is to simply collect feedback from these  small businesses. That is simply bureaucratic overreach run amok.\n\nMrs.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…remembrance, reflection, and gratitude--a moment to  recognize not only those fallen heroes, but also the families, friends,  and loved ones who share in their sacrifice and carry the weight of  their loss.\n\nIn my home State of Mississippi and across the country, law  enforcement officers serve on the frontlines with unwavering  dedication. Despite increasing challenges…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…Apparently, my colleagues think we  are doing nothing to address infrastructure when literally their plan  will contribute directly to crumbling infrastructure due to the heavy  weight of these trucks. They could also crash into barriers, which  would endanger lives. This would make sure the number of around 45,000  fatalities in this country would increase.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  guardsmen. I visited as they prepared for patrol. I have seen them in  action while on duty.\n\nI also thank the families, spouses, and loved ones back home who  carry the weight while their Guard members serve here in D.C. The  families' sacrifice and strength are a vital part of a successful  mission. Their dedication reflects the values we hold dear…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Discounts Kaktovik's longstanding record of supporting       environmentally responsible development.\n\nKaktovik--the only community in the entire Refuge--bears       the full weight of the impacts. Yet our voice was minimized       while outside interests were elevated over the rights and       concerns of the people who live here and are the most…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}]