[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…requires  informed debate and buy-in from the people's representatives and the  public, from us here in the Senate and from our colleagues in the  House, because we need to weigh the benefits and the risks for our  constituents and for the country as a whole, because a decision like  this one should be insulated from partisan politics and not made with…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…families; households where       parents hold TPS, but their children are U.S. citizens. The       termination of their parents' protected status would force       parents to weigh impossible choices: Do they uproot their       children and take them to a country they may have never       known, away from the only home they've ever had? Or do       families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…changes to make this program better,  stronger, and more effective moving forward.\n\nThis is a straight reauthorization for 3 years, providing a runway  for all stakeholders to weigh in on needed improvements. To appropriate  the sage words of Frederick Douglass: ``Power concedes nothing without  a demand. It never did and it never will.''\n\nThe U.S. must…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698907/agoa-extension-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of personal rights imaginable.''\n\nJudge Pratt went so far as to raise questions not put before the  court by parties and invite the Florida attorney general to intervene  and weigh in on these questions.\n\nHe wrote an opinion holding unconstitutional a Florida law that  allows minors to seek abortions without parental consent through  judicial waivers.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…should be protected  from those kinds of unethical management practices. That is why it  should be considered a best practice for retirement plan professionals  to appropriately weigh ESG factors--just weigh them.\n\nUnfortunately, this bill would establish unnecessary barriers to  retirement plan fiduciaries who want to consider these factors. This is  despite…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…relicensing at the  end of 2028.\n\nThe relicensing process is typically very lengthy, in part for good  reason. The public comment period needs to be robust for all parties to  weigh in. Without that input, we risk potentially devastating  environmental consequences on regional ecosystems.\n\nWith relicensing activity set to double in the coming decade and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…authorizing war, not the President.\n\nSo this week, due to the resolution being brought forth by my  colleague from Virginia Senator Kaine, we have a chance--all 100 of  us--to weigh in and correct this failure on this third point and  reclaim the responsibilities that we took on when we took the oath of  office to become a U.S. Senator. That is our responsibility.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…House, they bring it  to the floor; we debate it; it either passes or it doesn't pass.\n\nIt has the advantage of going through committee and being considered  and having people weigh in on whether it is a good idea or not. But to  simply reinvent and pretend, if you will, that the color black is the  color white or an orange is an apple--because everyone…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Republican majority has brought to the House  Floor this week. These bills roll back vital protections that ensure  our constituents have access to clean air and water, and can weigh in  on projects that will affect the health of their selves, their  families, and their community.\n\nMake no mistake, the six bills before the House this week are not a  commonsense,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…administration's failure to restore funding for  food aid for malnourished children, despite their promise to do so.\n\nI speak today about the biology of hunger. A 2-year-old child may  weigh the same as a newborn. Their bodies stop growing. Their immune  systems shut down. They lose the ability to walk and sometimes even the  ability to cry. That is what severe…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…does not  track the vehicle's location or collect, use, or store any data that  would compromise the privacy of vehicle occupants.\n\nPrivacy is a concern, and my friends should weigh in on the  rulemaking process. NHTSA, the agency involved with this, should work  with government agencies that have expertise in this area to ensure  that consumer data is…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pollute the water, kill  wildlife, and despoil our ecosystems.\n\nIt is the plan of giving fossil fuel companies the power to bypass  the public comment period so the public can't weigh in about the  terrible ideas the fossil fuel companies are putting forward.\n\nThe public can't weigh in about the drilling rigs and the leaky  pipelines and the export terminals…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…leadership just puts the resolution on the  floor, it will pass unanimously in this House. I have no doubt, so I am  just asking my colleagues to give us the opportunity to weigh in or at  least explain to us and my constituents why my community is being  deprived of this resolution that honors law enforcement, the FBI and  the Boulder Police Department,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…invitation for these leaders to choose forward hangs in  the balance, and your plea is historic, passionate, soulful, inspiring  not just world leaders but people everywhere as they weigh  recalibrating the dial for liberty.\n\nIt is your voice that history will remember, rising to energize our  world forward from inside the grim, fierce cauldron of struggle that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…finance an unexpected $400 expense, such as a car  repair or medical bill.\n\nThat being the case, it should not be controversial for retirement  plan professionals to appropriately weigh environmental, social, and  governance factors in their clients' best interests. H.R. 2988 would  restrict the fiduciary's ability to consider all relevant factors that  might…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…First, it targeted individual companies for  designation without any process or notice.\n\nSecond, it failed to evaluate whether designation would actually  mitigate risks or weigh the costs and benefits to the company, its  shareholders, and ultimately the financial system.\n\nThird, the old system failed to give SIFI designees due process or an  opportunity…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…CFPB gave the  public just 30 days to comment on this proposal. That is 30 days for  businesses across the country, Members of Congress, State regulators,  and the public to weigh in on a rule that has potentially profound  consequences for digital commerce, one of the most rapidly growing  portions of Financial Services and FinTech.\n\nIn addition, the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…wealth alone is not a particularly strong judge of  whether someone should be an accredited investor or not. A better one  is whether someone has the knowledge to accurately weigh the benefits  and risks of private offerings.\n\nIn 2020, the SEC started allowing professional investors with  credentials like a Series 65 or a Series 7 to become accredited…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…following:\n\n``(bb) Numismatic $2.50 Coin.--\n\n``(1) In general.--The Secretary may mint and issue--\n\n``(A) not more than 100,000 $2.50 numismatic coins, each of       which shall weigh 4.1795 grams, have a diameter of 0.425       inches, and contain not less than 90 percent gold\n\n``(B) not more than 300,000 $2.50 numismatic coins, each of       which shall…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…evaluating whether we still have an  emergency for these designated emergencies and for this designated  period of time.\n\nAs such, it was limiting the power of our Members to weigh in on  these very important questions. This runs contrary to everything I have  ever believed when it comes to states of emergency.\n\nWhen I was in the legislature in California,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…for the poor when our country was founded were very keenly aware that  programs which indiscriminately gave things to people were actually  harmful to people, that you had to weigh in with them on their moral  choices, on their work choices. It was, in fact, a negative to set up a  program in which one did not look at moral choices that people are  making.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…next subcommittee hearing within the Energy  Subcommittee of the Energy and Natural Resources Committee. That would  provide the Trump administration with the opportunity to weigh in with  its views and allow us to hear analysis from BOEM and BSEE and any  other Agencies that are affected--consistent with how the committee has  considered other legislation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}]