[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…produced  that product.\n\nThe Rules process was a different thing. It was a very, very partisan  exercise in which if Republicans made requests, they got them,  including the weird little thing that we just went through with some  financial services issue, which I don't understand why that is in our  bill. It shouldn't be. Well, I do understand why it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…diabetics have a hard time being diagnosed. ``(Type 1       diabetes) is definitely a hard disease to see, and it is       common. A lot of people have it, which is why it's so weird       that it's almost unheard of at times,'' she said. ``Diagnosis       is not easy for a lot of kids. My time with diagnosis was       easy. My mom's a doctor, so we caught…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…transgender people serving in our  academies right now because of the transgender military ban.\n\nSo what is this amendment all about?\n\nThe GOP obsession with bullying trans people is weird. It is  invasive. It is abusive. It is discriminatory, and it is dangerous to  our military readiness.\n\nI want to remind my colleagues that words have power. You are  standing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695234/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…lawful  review process that goes into effect next year to find ways to improve  it.\n\nThat is how responsible governments handle trade disputes, by  following the law, not through weird social media tantrums about  bridges and hockey trophies or through childish threats to annex a  sovereign nation and make it the 51st State.\n\nHis daily barrage against Canada…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…spends more time in front of his Pentagon makeup mirror and doing  press stunts than effectively managing the Armed Forces, and who has  prioritized support for bigotry and weird cultural war obsessions like  changing the pictures on the Pentagon's website and renaming military  bases after Confederate icons.\n\nWhen this bill is combined with the money…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…suspensions.\n\nFederal workers have been fired then rehired as their functions were  quickly proven to be indispensable rather than nonessential. Employees  have been bombarded with weird emails that threaten them with  termination if they don't accept a sketchy buyout or snitch on their  colleagues and with demands that they interrupt their real work to do…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and big polluters and who takes a perverse  joy from destroying American government from the inside.\n\nSo there will be misery ahead for most normal people, not counting  the weird ones who like inflicting pain and doing damage for the  benefit of a bunch of creepy, rightwing billionaires who have propped  them up their whole lives.\n\nThe reason we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…in danger or to have your daughter's  scholarships, your daughter's skills, and your daughter's opportunities  stolen from her because some guy--some mentally ill, deranged, weird  freak of a man--thinks he is a woman because he can put on a skirt and  wave his willy-nilly around in a locker room, that he somehow is equal  to a woman and that he is going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…ALFORD. Mr. Speaker, I highlight a special place in Camdenton,  Missouri, in the Fourth Congressional District of Missouri: The Funky  Buffalo Coffee House and Trading Company, a weird name, but a great  place. It is our September Small Business of the Month.\n\nNow, this just isn't an ordinary coffee shop. It is where community  happens, families gather, students…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…pipeline right now for NPR and PBS, two outlets  that routinely spew anti-American and anti-Christian propaganda. They  sow racial division in this country, and they promote weird, woke  values that most Americans find disgusting.\n\nMr. Speaker, this is something that we have talked about for a long  time, and finally, we have a President who is serious…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692310/ending-taxpayer-funded-propaganda"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…funded by Iran. All  the weapons come from the Iranians.\n\nWhat is this all about? Killing the Jews and, eventually, us and  dominating the world religiously. If you think that is weird, then you  need to get on the internet and listen to what they are doing. You need  to watch their behavior. And they mean what they say. And don't be like  the people in the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…world where you actually--the liquidity of the debt  markets.\n\nI grabbed an article that was in one of my--I think it was in one of  my bond publications because I have some weird reading habits. ``Japan  prepared to use its role as America's largest creditor as leverage in  Trump's trade talks.'' The point I want to make by reading that  headline to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population was 65 and up. Mr. Speaker, 20 years later, it is,  functionally, 18 percent. It is not double, but it is pretty darn close  to double those who are 65 and up.\n\nLook, a weird little factoid: When I was a teenager in the 1970s--and  I remember this number. There was, functionally, $7 spent for every  young person and $1 spent on seniors. Today, that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…robbery. As a matter of policy, they are choosing  criminals over innocent Americans.\n\nMr. Speaker, we hear from the other side of the aisle that locking up  criminals by some weird and bizarre logic increases crime. The reality,  which we all know because it is self-evident, is that when a criminal  is in jail, by definition, they are not committing crimes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Eruzione was from Boston  University as well as Jack O'Callahan. Mark Wells was from Bowling  Green. These players meant something to their communities.\n\nIn fact, it is really weird. I represent Babbitt, Minnesota. There is  a Realtor up there, and it was just last year, Madam Speaker, that I  asked the Realtor: Would you please bring me by Buzz Schneider's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in regard to the  reconciliation budget and how people are making things up. Let's have  at it.\n\nDue to the fact that I sit in an airplane 10 hours a week, and I have  some weird reading habits, I actually came across a paper written last  year, published just recently. It is in Nature Human Behaviour. It is  one of those quirky--excuse me, those academic,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Committee. I was  trying to get an answer to whether the economists' projections from the  Joint Economic Committee are correct. You have to understand that there  is actually a weird little battle going on here between the Senate and  those of us in the House and those of us on Ways and Means.\n\nA number of our brothers and sisters over in the house of lords…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Member I was talking to, great Member, brilliant in their area of  specialty, really smart. I have spent my whole life doing budgets and  healthcare finance and a few other weird things.\n\nThey said: David, CBO is always wrong, the Congressional Budget  Office. They make up things. It is way off.\n\nOkay. For anyone that keeps telling you that, this is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we spent $7.746 trillion.  This year we are going to spend $7.148 trillion. Remember that 2025 is  an estimate because I still have a couple of weeks, and there are  always weird timing effects at the end of the year where we roll a bill  over into the next fiscal year.\n\nWhat happens with our total receipts? We are going to take in $5.254  trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]