[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…aspects of God's creation including the people around us and  the natural world in which we live.''\n\nI join American Orthodox Christians, environmentalists, and  peacemakers in welcoming back to Washington and the United States His  All-Holiness Ecumenical Patriarch Bartholomew. Congress will be honored  to once again host him in our Halls next week.\n\nI urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…opening  future opportunities in an increasingly global society.\n\nEven through the challenging moments our community has faced this  year, this school has remained a safe and welcoming place for all kids  and has promoted and instilled a love of learning. No matter what may  be happening at home or in the world, these kids know that they can  come here…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…generations. Their contributions  are an important part of Arizona's diversity and character.\n\nI am proud to join Orthodox Christians in Arizona and across the  country in welcoming His All-Holiness to the United States and to  Congress. His visit is a point of pride for many Arizonans and a  reminder of the shared values of faith, service, and community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and community. Under the  leadership of Pastor Deante Lavender and Arnalesa Lavender,  affectionately known as Pastor Lav and Pastor Lesa, The Remedy Church  is dedicated to welcoming everyone from our community with open arms.\n\nThey are guided by the motto, Love Christ, Love People, Build  Community, and the mission to ``teach Christ boldly, love our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Worcester,  Massachusetts, give today's opening prayer.\n\nFather Jonathan, as he is known by his parishioners, is a true force  of good in the Lincoln Street area. He is always a welcoming and  friendly face who is known for buying pizza for the neighborhood kids  or opening up the gym for pickup basketball games.\n\nHe is also the chaplain for both the Worcester…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700103/welcoming-reverend-jonathan-slavinskas"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Orthodox community in Southern Nevada,  I extend my deepest respects to His All-Holiness Ecumenical Patriarch  Bartholomew. Mr. Speaker, I ask my colleagues to join me in welcoming  him to our Nation's Capital.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…that her philosophy as an educator is simple:\n\nEmpower students to connect with their community and their       own potential through storytelling.\n\nChayanee has created a welcoming space for her students to express  themselves and share their stories through creative avenues like  journalism and documentary storytelling, where they highlight topics…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…remarkable woman  and the family she raised. I have had the privilege of knowing the  Christiana family for over sixty years. The farm on 1215 Silver Lane  was a magical and welcoming place made so by Dorothy's cooking and her  delightful daughters, Linda, Patty, and Karen, always the center of her  life, and the man to whom she was devoted--Carman F.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…veterans to  receive care in the VA and through community care are simply untrue.  Since 2019, the VA has made enormous improvements in customer service  and has become more welcoming to veterans through historic outreach.\n\nIf we listen to veterans, as I do every weekend because I go home  every weekend, what I hear is customer satisfaction rising and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…schools for at least two years, it aims to expand  educational opportunities for all.\n\nThis school year, TFA Hawaii marks its 20th year of service to the  State of Hawaii by welcoming 103 corps members to classrooms across our  islands. In total, the TFA network in Hawaii now has 631 corps members  and alumni, collectively improving the lives of over 18,000…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of who we are as Americans--so tiny little parishes  like St. Elizabeth of Hungary or synagogues or other churches all over  this country who pride themselves on offering a welcoming environment  for people who are here lawfully and want to make their way in America  will be able to continue to do just that.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Speaker, I am proud to celebrate the work of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, and  I ask that my colleagues join me in welcoming him to Washington, D.C.  and thanking him for his ongoing commitment to advancing peace and  religious freedom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…listening today  and those who are with us only in spirit. Your stories demonstrate  bravery and courage, and you deserve every ounce of our effort in  creating a VA that is welcoming and accessible, and every dollar of  benefits we can muster on your behalf.\n\nMr. Speaker, I support this legislation, and I ask my colleagues to  do the same.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…congregation of St. Demetrios Greek Orthodox Church in Union,  New Jersey. Under his leadership, the St. Demetrios community has  flourished as an example of faith in action--welcoming neighbors from  every walk of life to their Annual Greek Cultural Festival and offering  vital community services year-round.\n\nIt is therefore my great honor to join my constituents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Illinois' Third Congressional District, I commend Billy  Ocasio for his lifetime of service and commitment to fighting for our  communities. At a time when wannabe kings threaten welcoming cities  like Chicago, I am inspired by the stories of local residents  demonstrating that diversity, that equity, that inclusion which are  exactly what make our communities…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today to ask my colleagues to  join me in welcoming His All-Holiness Ecumenical Patriarch Bartholomew  to our Nation's Capital. As the Head of the second largest Christian  Church in the world, Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695466/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Greek  Orthodox community but all those who care about human rights, religious  liberty, and the stewardship of God's creation.\n\nMr. Speaker, I ask my colleagues to join me in welcoming His All- Holiness to the United States and celebrating this historic visit with  many Greek Orthodox Americans who are honored by his presence. This  moment is a reminder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this month, I have had the privilege of  welcoming two groups of South Dakota veterans to Washington during  Honor Flight visits. I went simply to say hello and to thank these men  and women for their service to our country.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Association of Metropolitan  Water Agencies.\n\nTed also understood that public service extends beyond pipes and  pumps. He championed the transformation of Water Works Park into a  welcoming community space, helping to lead the development of the  Lauridsen Amphitheater and creating new opportunities for Iowans to  gather, enjoy outdoor recreation, and build…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…number one State to do  business in for 12 consecutive years, making it a popular destination  for new manufacturing facilities and data centers. While I join  Georgians in welcoming these economic drivers to our State, it also  presents increased demand for our grid that we must address.\n\nWe know electricity demand is expected to grow significantly over…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…they come here. Don't defraud our government. Don't come here to  try to destroy us. Assimilate with the Americans in this country to  make our country better. We should be welcoming immigrants who are  willing to assimilate with our culture and to contribute to our  society. That is what we want. Being in this country is a privilege,  not a right. If…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in fostering an inclusive and welcoming environment  for all members, especially in her contributions to the Chamber's 60th  Anniversary Celebration.\n\nOutside of the Chamber, Susan is an Assistant Treasurer of…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Whether it is a leisurely stroll through Blevins Patriot Park,  boating on Lake Harris, enjoying the spa, or a round of golf, Howey-in- the-Hills remains a beautiful and welcoming place to live, work, and  visit.\n\nI am honored to join the community in commemorating the 100th  Anniversary of the town of Howey-in-the-Hills, and in celebrating its  proud…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…ferry for Cumberland  Island connects visitors with the history and natural beauty of our  coastal region.\n\nToday, we honor the Riverview Hotel for preserving tradition,  welcoming families and travelers, and contributing to the vibrant life  of southeast Georgia for 110 years.\n\nRecognizing the 50th Anniversary of Gallery 209 in Savannah\n\nMr. CARTER…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…commend the parish on this remarkable achievement.\n\nSince its founding on November 3, 1950, Assumption BVM has dedicated  themselves to ministry and outreach. By offering a welcoming place for  worship to the residents of Feasterville, Langhorne, Oakford, and  Trevose, the parish has been a steadfast presence in Bucks County for  three-quarters of a century.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…can connect with nature, enjoy  healthy competition, and create lasting memories.\n\nArrowhead Pointe exemplifies the best of public golf, offering a  world-class experience, welcoming players with warm southern  hospitality, and fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…she met Ardell O. Kennedy at the  Memphis Naval Air Station. They married in January 1946 and began their  family in 1947. Ardell and Anna enjoyed 71 amazing years together  welcoming their four children: Karen Delleen, Bonnie Lee, Mark Alan,  and Douglas Ray. They both made education a priority, ensuring each  child completed college and pursued careers…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Tots North and South  Area, Al Dia Today Newspaper, Martin's Famous Potato Rolls, and  Premiere Oaks 10 Cinema, the mission of this event is simple but  powerful: to create a welcoming place where families can celebrate  Christmas, give back, and support one another.\n\nMore than sixty local businesses and organizations have stepped up  with donations of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Metropolitan Ministries. Carol has been a dedicated volunteer at  Metropolitan Ministries since 2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm, ensuring newcomers feel comfortable and understand the  importance of their…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…grief in our community.  Dakota took action by researching youth mental health and grief, then  redesigning the children's waiting room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}]