[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…today, Republicans are okay with debating trivial issues passionately  but important ones not at all.\n\nMr. Speaker, when I chaired this committee, back when we gave a damn,  we welcomed ideas. We let the House work the way it is supposed to  work. In our first 5 months, Democrats allowed over 25 percent of all  amendments, more than 200 thoughtful proposals…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I just wrapped up the Give 'Em Hell Tour, 10  townhalls over the last 3 months from every corner of my district. We  welcomed all Oregonians, and we were thankful to have community leaders  participating and local law enforcement keeping us safe.\n\nFrom Bend to Portland, Silverton to Albany, over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695465/give-em-hell-wrap-up"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…them.\n\nThis issue is deeply personal to me. I am the son of Vietnamese  refugees who fled war and persecution in search of safety and a better  life in America. This country welcomed them and gave me the chance to  succeed. I joined the Army out of a sense of duty to my country because  I wanted to give back to the country that gave me so much. I wanted…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Church was  initially pastored by white ministers during its first twenty-two  years. Demonstrating a spirit of love and acceptance for all,  regardless of race, the church welcomed anyone in Columbus seeking to  worship. By 1858, the church had baptized 731 members--390 white and  341 black.\n\nThroughout its history, the church relocated three times to…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…German language was being  criminalized in some of our States in the aftermath.\n\nThese immigrant refugee Catholics decided that they wanted a place  where they could feel welcomed, loved, and safe as they worshipped in  accord with the American value of freedom of worship. So they set up  this little parish in the Highland Park neighborhood of Northside…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…as a treasured  cornerstone of both the city of Albany and the wider theater community.  The warmth of her personality would always shine through as she  enthusiastically welcomed audiences at the start of so many shows.\n\nThroughout her three decades at the repertory, Maggie nurtured local  artists and performers, while sharing her own illustrious talents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…participate as equal  members of our society.''\n\nTimothy Hale-Cusanelli was pardoned by President Trump. And what is  more? After his release from prison, Mr. Hale-Cusanelli was welcomed as  a speaker at two events held by the President's supporters last year at  his Bedminster club.\n\nAt one of these events, he received an award from Ed Martin, now  serving…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…work is informed by the  words of that Gospel.\n\nFor I was hungry and you gave me food, I was thirsty and       you gave me something to drink, I was a stranger and you       welcomed me, I was naked and you gave me clothing, I was sick       and you took care of me, I was in prison and you visited me.\n\nAnd some asked the Master, when were You hungry? Lord,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…same cease-fire he unilaterally declared last week.  So far, he has refused to even direct negotiations with President  Zelenskyy in Turkiye.\n\nThis is the same man who has welcomed China's, Iran's, and North  Korea's support for his war effort. He has shown contempt for all  international democratic norms, both in his own country and in dealing  with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…often, politicians here treat Cubans as commodities, as  props in their political arguments. This is dehumanizing.\n\nIt has gotten worse under President Trump. Cubans were once welcomed  with open arms into the United States, even given preferential  treatment not available to others fleeing dire conditions. No more.  Cuban immigrants are equally at risk…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…the U.S. Capitol Rotunda by Speaker Newt Gingrich, a rare and  distinguished honor. The State Department hosted him in the Ben  Franklin Room, and Vice President Al Gore welcomed him at a breakfast  at the Vice President's Residence.\n\nThese visits remind us of the enduring spiritual and cultural bonds  between the Ecumenical Patriarchate and the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…soldiers returning home from World War II found  themselves facing the same socioeconomic and racial discrimination they  had faced before going off to war. Instead of being welcomed back home  with open arms, they struggled to find jobs, to get an education, and  to purchase homes.\n\nWe cannot undo the injustices of our past, but we can begin to  restore…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…full, unedited  video of the September 2 strike. If they followed the laws of war, it  will be clear for all of us to see. If they have nothing to hide,  transparency would be welcomed and obvious. The American people deserve  to see what is being done in their name, and I can only say their  reluctance to do so suggests that they are reluctant for a reason.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…extended to Afghans, who helped our soldiers at  war and risked their lives for the American people? This administration  ended their deportation protections on the same day they welcomed  Afrikaners.\n\nFor those Haitians who fled instability and gang violence, why were  TPS and humanitarian parole ripped away from them?\n\nAround the world, we have victims of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…For those with an  affinity for art and culture like me, frequenting the heritage center  is truly an incredible experience.\n\nSince its founding, the foundation's museum has welcomed over 80,000  visitors. There have been more than ninety different exhibition areas  ranging from `Budapest in the 1900s' with a focus on looking into the  past to `40 years…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Airport is in my district. It is one of the  reasons we proudly hold the claim to the distinction of Crossroads of  America.\n\nThis past month, Indianapolis International Airport welcomed a  nonstop transatlantic flight to one of our gates. The flight from  Indianapolis to Dublin on Aer Lingus marked the start of daily nonstop  service to this European gateway…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteers at the Center. All of these women maintain a loving demeanor  and greet each client with a warm smile and conversation (and sometimes  a hug). The Center's clients feel welcomed and cared for because of the  lived values of love, respect, compassion, and family centeredness that  is regularly displayed by these dedicated volunteers. The benefit to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteers  at the Center. All of these women maintain a loving demeanor and greet  each client with a warm smile and conversation (and sometimes a hug).  The Center's clients feel welcomed and cared for because of the lived  values of love, respect, compassion, and family centeredness that is  regularly displayed by these dedicated volunteers. The benefit to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…In 2005, Paul continued his calling at MEMA as an area coordinator,  serving for 11 years in that role. During that time, he and his wife,  Traci, whom he married in 1999, welcomed their son, Caleb, through  adoption in 2010 and celebrated the birth of their daughter in 2013.  His commitment to service grew right alongside his family.\n\nAfter leaving…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Hotel in St. Marys, Georgia, one of our  State's most cherished historic landmarks.\n\nBuilt in 1916, the Riverview Hotel rests on the banks of the St.  Marys River and has welcomed travelers and locals for more than a  century. For generations, this hotel has offered hospitality and a  sense of belonging to visitors from near and far. It has welcomed…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…helping youth is a key to  building a more conscientious, responsible, and productive society.\n\nI am proud to co-chair the Congressional Scouting Caucus. This past  summer, we welcomed dozens of Scouts from across the country to Camp  Capitol Hill and Eagles on the Hill. This was an opportunity for Scouts  to meet with Representatives and showcase what they…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…against the mainstream media and elected officials  who are empowering radical Islam to take a foothold in the United  States of America.\n\nGovernor Kathy Hochul of New York welcomed in the new year by  declaring January as Muslim American Heritage Month. To red-blooded  American patriots' dismay, Hochul directed State landmarks, including  the iconic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…desperately poor from burning Nauvoo, found  temporary refuge among the kind members of the Omaha Tribe.\n\nThey made an agreement with the Omaha through their Chief, Big Elk,  who welcomed the pioneers, understanding the trouble they had recently  escaped. The pioneers would stay in residence, building houses,  planting gardens and fields, and then move on after…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…budget, and seriously evaluated how we are  spending our tax dollars. For some people in this town, it was  heartburn. However, Mr. Speaker, Kansans in the Big First District  welcomed this fiscal sanity.\n\nThe reality is, our national debt is unsustainable. If every single  household was to contribute and bring our debt to zero, we would each  be responsible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…600 alumni now serve in business, government, and the nonprofit sector,  which is a testament to the Maddy Institute's impact.\n\nMy District and Washington, D.C. offices have welcomed interns from  the Maddy Institute throughout my time in Congress. Their local  expertise and interest in government make the interns invaluable  members of my team. I'm proud…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699141/recognizing-the-maddy-institute"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…continues to be a serious threat  and the main detriment to peace in the Middle East.                          College Sports Are Broken\n\nMr. BAUMGARTNER. Mr. Speaker, there was welcomed news last week that  President Trump is considering a Presidential commission on college  athletics. I welcome the President's leadership because college sports  are important,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691270/preventing-iran-from-obtaining-nuclear-weapons"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…is a household name. Well, they were headquartered in  Missouri, and they made their stuff in Missouri, too, with factories in  small towns all across our State; but as we welcomed China into the  world economy, Toastmaster began to feel the squeeze of cheap Asian  imports. By 2001, every Toastmaster plant in our State was gone,  shipping hundreds of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteers at the Center. All of  these women maintain a loving demeanor and greet each client with a  warm smile and conversation (and sometimes a hug). The Center's clients  feel welcomed and cared for because of the lived values of love,  respect, compassion, and family centeredness that is regularly  displayed by these dedicated volunteers. The benefit to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…know if  he was ready. Yet, he was called to serve his community, which he has  done faithfully for the past 56 years.\n\nIn 1961, he married Dorothy Neal, and the two of them welcomed four  children, Paula, Cynthia, James, and Timothy, seven grandchildren, and  one great-grandchild.\n\nThis year, Elder Childs was rightfully promoted to superintendent,  and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…didn't have a place to turn until one of her  friends suggested that we go to a pregnancy resource center.\n\nWe went down to the Women's Care Center in South Bend, where they  welcomed us with open and loving arms. They gave her an ultrasound, and  for the very first time, we saw our child, who, at that time, was about  the size of a peanut. Half of that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}]