[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the Food Bank of Western Massachusetts to  establish the UMass Amherst Campus Pantry.\n\nLast Friday, I was proud to stand with them to officially open the  pantry, which is a welcoming space that will provide anyone in the  UMass community with a little extra help when they need it. The shelves  are stocked with nutritious food, including food grown locally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695079/umass-amherst-campus-pantry"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…development.\n\nI would also like to extend heartfelt gratitude to the dedicated  staff of the Silverado Ranch Community Center. Their tireless efforts,  professionalism, and welcoming spirit have made this first year a  resounding success.\n\nAs we celebrate this anniversary, let it serve as a testament to what  can be accomplished when local government,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691298/recognizing-the-one-year-anniversary-of-the-silverado-ranch-community-center-in-clark-county-nevada"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Orthodox community in Southern Nevada,  I extend my deepest respects to His All-Holiness Ecumenical Patriarch  Bartholomew. Mr. Speaker, I ask my colleagues to join me in welcoming  him to our Nation's Capital.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…schools for at least two years, it aims to expand  educational opportunities for all.\n\nThis school year, TFA Hawaii marks its 20th year of service to the  State of Hawaii by welcoming 103 corps members to classrooms across our  islands. In total, the TFA network in Hawaii now has 631 corps members  and alumni, collectively improving the lives of over 18,000…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I wish to congratulate Rev. Dan Fowler and  First Presbyterian Church of Ashland on 150 years of commitment to  welcoming and accepting people through all walks of life into your  community of faith. Ever since Rev. Moses Allen Williams organized the  First Presbyterian Church of Ashland on…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693320/recognizing-the-150th-anniversary-of-first-presbyterian-church-of-ashland"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…opening  future opportunities in an increasingly global society.\n\nEven through the challenging moments our community has faced this  year, this school has remained a safe and welcoming place for all kids  and has promoted and instilled a love of learning. No matter what may  be happening at home or in the world, these kids know that they can  come here…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…join my constituents in  New Hampshire, including those at the St. Nicholas Greek Orthodox  Church of Manchester and the St. Nicholas Greek Orthodox Church of  Portsmouth, in welcoming His All-Holiness Ecumenical Patriarch  Bartholomew on the occasion of his visit to the United States from  September 15 to 17, 2025.\n\nOn behalf of the State of New Hampshire,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of who we are as Americans--so tiny little parishes  like St. Elizabeth of Hungary or synagogues or other churches all over  this country who pride themselves on offering a welcoming environment  for people who are here lawfully and want to make their way in America  will be able to continue to do just that.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Speaker, I am proud to celebrate the work of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, and  I ask that my colleagues join me in welcoming him to Washington, D.C.  and thanking him for his ongoing commitment to advancing peace and  religious freedom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…listening today  and those who are with us only in spirit. Your stories demonstrate  bravery and courage, and you deserve every ounce of our effort in  creating a VA that is welcoming and accessible, and every dollar of  benefits we can muster on your behalf.\n\nMr. Speaker, I support this legislation, and I ask my colleagues to  do the same.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and community. Under the  leadership of Pastor Deante Lavender and Arnalesa Lavender,  affectionately known as Pastor Lav and Pastor Lesa, The Remedy Church  is dedicated to welcoming everyone from our community with open arms.\n\nThey are guided by the motto, Love Christ, Love People, Build  Community, and the mission to ``teach Christ boldly, love our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Illinois' Third Congressional District, I commend Billy  Ocasio for his lifetime of service and commitment to fighting for our  communities. At a time when wannabe kings threaten welcoming cities  like Chicago, I am inspired by the stories of local residents  demonstrating that diversity, that equity, that inclusion which are  exactly what make our communities…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…mandatory and resort  fees.\n\nI have to say that it is a privilege to represent the State of  Florida in the Congress, and I know my friend, Mr. Bilirakis, will  agree. We enjoy welcoming visitors from all across the Nation and all  across the globe to Florida for their vacations.\n\nUnfortunately--it is not just in Florida--but sometimes visitors  arrive and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…personally and  professionally. We collaborated on transportation, immigration, and  women's issues. Together, we tried our best to make North Carolina a  more prosperous and welcoming place. I will miss her as a dear friend  and as an inspiring leader. Her son, Bardia, has been a valuable and  trusted member of my team since I first ran for Congress. Every…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…that her philosophy as an educator is simple:\n\nEmpower students to connect with their community and their       own potential through storytelling.\n\nChayanee has created a welcoming space for her students to express  themselves and share their stories through creative avenues like  journalism and documentary storytelling, where they highlight topics…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today to ask my colleagues to  join me in welcoming His All-Holiness Ecumenical Patriarch Bartholomew  to our Nation's Capital. As the Head of the second largest Christian  Church in the world, Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695466/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Greek  Orthodox community but all those who care about human rights, religious  liberty, and the stewardship of God's creation.\n\nMr. Speaker, I ask my colleagues to join me in welcoming His All- Holiness to the United States and celebrating this historic visit with  many Greek Orthodox Americans who are honored by his presence. This  moment is a reminder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this month, I have had the privilege of  welcoming two groups of South Dakota veterans to Washington during  Honor Flight visits. I went simply to say hello and to thank these men  and women for their service to our country.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Association of Metropolitan  Water Agencies.\n\nTed also understood that public service extends beyond pipes and  pumps. He championed the transformation of Water Works Park into a  welcoming community space, helping to lead the development of the  Lauridsen Amphitheater and creating new opportunities for Iowans to  gather, enjoy outdoor recreation, and build…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…is additional income for her team and she is hopeful this  will help retain more permanent employees. I am so thankful to Mary  Beth and all the other small businesses for welcoming me, and I look  forward to visiting Dolan's Bar-B-Q again and enjoying a delicious  barbecue sandwich.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694787/promises-made-promises-kept"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…they come here. Don't defraud our government. Don't come here to  try to destroy us. Assimilate with the Americans in this country to  make our country better. We should be welcoming immigrants who are  willing to assimilate with our culture and to contribute to our  society. That is what we want. Being in this country is a privilege,  not a right. If…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…commend the parish on this remarkable achievement.\n\nSince its founding on November 3, 1950, Assumption BVM has dedicated  themselves to ministry and outreach. By offering a welcoming place for  worship to the residents of Feasterville, Langhorne, Oakford, and  Trevose, the parish has been a steadfast presence in Bucks County for  three-quarters of a century.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Whether it is a leisurely stroll through Blevins Patriot Park,  boating on Lake Harris, enjoying the spa, or a round of golf, Howey-in- the-Hills remains a beautiful and welcoming place to live, work, and  visit.\n\nI am honored to join the community in commemorating the 100th  Anniversary of the town of Howey-in-the-Hills, and in celebrating its  proud…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…celebrates unsung leaders in education whose  dedication makes a profound impact on their schools and their  communities.\n\nMarlon's hard work and commitment to maintaining a clean, welcoming,  and inclusive environment have helped create a space where students and  staff can thrive.\n\nThis achievement reflects the collective teamwork at Mary Lee Clark  Elementary…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in fostering an inclusive and welcoming environment  for all members, especially in her contributions to the Chamber's 60th  Anniversary Celebration.\n\nOutside of the Chamber, Susan is an Assistant Treasurer of…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…can connect with nature, enjoy  healthy competition, and create lasting memories.\n\nArrowhead Pointe exemplifies the best of public golf, offering a  world-class experience, welcoming players with warm southern  hospitality, and fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…she met Ardell O. Kennedy at the  Memphis Naval Air Station. They married in January 1946 and began their  family in 1947. Ardell and Anna enjoyed 71 amazing years together  welcoming their four children: Karen Delleen, Bonnie Lee, Mark Alan,  and Douglas Ray. They both made education a priority, ensuring each  child completed college and pursued careers…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…place where history, culture, and natural beauty come together  in extraordinary ways.\n\nIt has grown from humble roots to a thriving community, celebrating a  strong economy, welcoming neighborhoods, and stunning environment. From  the pristine shores of Vero Beach to the citrus groves of Fellsmere,  Indian River County embodies the very best of Florida…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694133/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Metropolitan Ministries. Ellen has been a dedicated volunteer at  Metropolitan Ministries since 2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm, ensuring newcomers feel comfortable and understand the  importance of their…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…grief in our community.  Dakota took action by researching youth mental health and grief, then  redesigning the children's waiting room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}]