[{"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Presidents who have  echoed these warnings and these concerns. In FDR's last inaugural, he  said that we have learned that to have a friend, we need to be a friend  and that our welfare is dependent upon the welfare of nations far away.  In John F. Kennedy's inaugural address, he talked of opposing any foe  and supporting any friend to aid the causes of liberty.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…opposition to H.R. 3492 and H.R. 498. These bills would criminalize and  dismantle healthcare for transgender young people and as such represent  a direct threat to patient welfare. We urge you to reject these extreme  proposals.''\n\nLook who signed this: American Academy of Pediatrics, American  College of Obstetricians and Gynecologists, American College…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Delta 2 at Buckley Space Force Base in my home state of  Colorado. In this crucial role, she was the principal advisor to the  installation commander, overseeing the morale, welfare, training,  climate, readiness, and professional development of over 1,000  personnel. Her leadership was instrumental in ensuring the effective  execution of critical missile…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…programs that would save thousands of lives, and  gut public broadcasting.\n\nThis is a full-scale attack on our international system, global peace  and security, the health and welfare of millions of children across the  world and on public television. We will fight back every step of the  way.\n\nMr. Speaker, not only am I a ``no,'' I am a ``hell, no'' on…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692386/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…will be one of the  largest government handouts in American history, paid for by those who  can least afford it and delivered to those who need it least. Talk  about corporate welfare.\n\nWhile the rich will get their tax cut, working families will be stuck  footing the bill for Trump's tariffs. It is not too late for  Republicans to change course. I pray…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…showcases her unwavering dedication to improving  the lives of others.\n\nMrs. Booker's service extends far beyond her church. She has been a  consistent advocate for children's welfare and has worked relentlessly  to provide opportunities for underserved populations. Her tireless  efforts reflect her core belief that every child deserves access to  quality…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…money in the pockets of the wealthiest,  allows them to rig the system to benefit them, while working-class  Americans more and more get a raw deal.\n\nWe are seeing a virtual welfare state for the wealthiest of the  wealthy in our policies that benefits and protects the wealthiest, that  serves the largest corporations, that is designed to line the pockets…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…protecting the District and its residents in a wide range of       matters, such as enforcing child support laws, handling abuse       and neglect proceedings in the child welfare system,       enforcing our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…society. Virginia Murray Bacon then established  the Bacon House Foundation which worked hand in hand with the  Diplomatic and Consular Officers, Retired (DACOR) Education and Welfare  Foundation to establish the DACOR Bacon House Foundation which was  tasked with caring for the historic House in perpetuity.\n\nOn May 23, 1986, Secretary of State George P.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Republican colleagues were serious about  helping children and families in need, let them speak out against this  administration's illegal payment freeze for childcare and child welfare  funding.\n\nRight now, as we debate this bill on eligibility for TANF spending,  the Trump administration is illegally holding up more than $10 billion  in Federal funding…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…know helps prevent child maltreatment and strengthen  families. It would eradicate the Social Services Block Grant that  provides substantial investment in childcare, child welfare, and adult  protective services. These egregious cuts alone will cost Illinois over  $72 million dollars and hurt Illinois' children, seniors, and families.\n\nI reject this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to force the Cuban Government to treat its  own people better, yet now when they have a chance to speak out against  the Trump administration's callous indifference to the welfare of the  Cuban people or even advance policies that will improve the lives of  Cubans on the island, these same people are silent. I find that  shameful.\n\nIn the past, whether…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…recognize community land  trusts as eligible HOME fund recipients.\n\nThe package also expands foreclosure mitigation counseling to  delinquent borrowers and raises the public welfare investment, or PWI,  cap to 20 percent to free up capital for historic investments in  affordable housing and community development.\n\nAmong other community bank reforms, H.R.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Managing Director of CNBC Europe. Earlier in his career, he served  the federal government as Executive Secretary at the United States  Department of Health, Education, and Welfare and as Special Assistant  for Renewable Energy at the United States Department of Energy. Across  every role, he demonstrated a  rare ability to navigate complexity while…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…workers and communities continue  to breathe toxic air pollution. This harmful Republican resolution puts  the profits of billionaire corporate polluters over the health and  welfare of the American people, and it makes a mockery of Republican  promises to make America healthy again.\n\nI really believe, Madam Speaker, that this resolution is a  distraction.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Studies found illegal immigrants annually  take--and this is a conservative estimate--nearly $120 billion directly  from public services, to include public schools, public welfare, and  healthcare. Every American across the country should expect more from  their government.\n\nJoining me today are a few of my colleagues. I yield first to the  gentleman…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every other country in the world  combined. We have a foreign-born population of 51.9 million, almost 16  percent, a record high. This is the important part. We have social  welfare and social safety nets that are being used by noncitizens that  are blowing out the rolls and driving up the cost of all of these  goods.\n\nMy point here is that we have had…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…appoints fiduciaries for veterans who are unable to manage  their VA financial benefits. These fiduciaries are required to use a  veteran's VA benefits for the veteran's care and welfare. The VA  periodically reviews fiduciary activities to ensure that fiduciaries  are not misusing a veteran's VA benefits.\n\nWhen a fiduciary misuses a veteran's benefit, current…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…would hope that city leaders who defy our Federal laws shouldn't  be entitled to Federal tax dollars. Federal grant dollars are not  entitlements. They are not unconditional welfare for far-left  activists. If you want Federal funds, you have to comply with Federal  law.\n\nSanctuary cities are in open defiance of Federal law. They actively  prohibit their…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…they got from Europe to Qatar  or to Paris. Therefore, seeing a corrupt, unhappy region in Gaza and a  region, by the way, of bored people because they were living off of  welfare largely, in a choice between that and a well-run, Western,  honest country like Israel, Greta Thunberg got more joy out of engaging  in protests or whatever these people do…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…amendment No. 4272 and ask that  it be reported by number.\n\nMr. PAUL. Mr. President, a freelance journalist discovered recently  that billions of dollars had been stolen from welfare programs in  Minnesota. Congress didn't discover this theft; a member of the public  did. How did Congress respond? Did Congress open an investigation? Did  Congress claw…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…provisions in there that strengthen rural hospitals so they  can  provide basic care to the hardworking farmers and ranchers and energy  producers and their families. We have welfare reforms that stop  trapping people in dependence on the Federal Government and encourage  them to get out and work and do something with their hands and be  blessed by it…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…world a  better place.\n\nVictoria's project, ``Pet Resource Central,'' in partnership with the  Community Resource Center of Punta Gorda, the Harry Chapin Food Bank,  the Animal Welfare League, the Suncoast Humane Society, and peers at  Port Charlotte High School, was an excellent endeavor to address food  insecurity and animal welfare in our community by…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…the red carpet  and actively enticed illegals and those covered by Biden's bogus asylum  programs to settle in my State, to the tune of over 500,000 people.  They received welfare benefits, CDL licenses, and State identification.  The Democrats have even voted to allow them to be law enforcement  officers.\n\nI do not have to tell you how dangerous this…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…volunteers who have worked over 300,000 volunteer hours. CASA  volunteers come from every walk of life and share a commitment to  improving children's lives and protecting the welfare of our  community's youth.\n\nOrganizations like the Tulare County CASA help create a safe  community for our children and I want to thank every volunteer for  their commitment…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698218/recognizing-the-tulare-county-court-appointed-special-advocates-casa"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…looks like, just take a look at Europe.\n\nUnder Barack Obama and Joe Biden, our Federal Government imported  millions of foreigners who hate America, enabling them to live on  welfare and forcing American taxpayers to pay the bills.\n\nNew York City's recent mayoral election reveals how easily a Muslim  communist can come to power in our Nation's most iconic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…District Council 47. She has held numerous AFSCME leadership  roles over decades--including Business Agent, Delegate, Trustee,  Steward, Legislative Coordinator, and Health & Welfare Fund Trustee and  has received substantial training in fiduciary responsibilities and  public employee benefit trusts.\n\nHer community involvement has been no less impressive.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to be a separate regular session of the State       legislature.       SEC. 3. INCLUSION OF INFORMATION ON FOSTER AND ADOPTIVE                     FAMILIES IN ANNUAL CHILD WELFARE OUTCOMES                     REPORT TO CONGRESS.\n\nSection 479A(a) of the Social Security Act (42 U.S.C.       679b(a)) is amended--\n\n(1) in paragraph (6)(C), by striking ``and''…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…operational precision and compassion. Despite personal hardships,  including one case manager losing her home while another lost her  rental property, the team prioritized the welfare of the community,  working tirelessly to ensure safety and stability for all. Post-storm,  the team was responsible for helping shelter residents whose homes were  no longer…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…these  kids.\n\nTogether, these new policies represent important steps needed to  correct the mistakes of the Biden administration.\n\nMore can always be done to safeguard the welfare of vulnerable  children. For these reasons, my oversight will continue.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]