[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…infrastructure public-private partnership in U.S. higher education at  the time. This project doubled the campus footprint, adding new  classrooms, research labs, housing, student wellness facilities,  recreation and more. Eleven UC Merced 2020 project buildings earned  LEED platinum certifications.\n\nThe first-ever comprehensive campaign ``Boldly Forward'' in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…therapy program for veterans with PTSD.  World-renowned soprano, Renee Fleming, recently released ``Music and  Mind'', a new book about harnessing the arts for health and wellness.  It is full of examples, stories, and research.\n\nFor today's children and young adults who will be tomorrow's leaders,  I urge all of my colleagues on both sides of the aisle…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…healthcare system is so expensive is  that people don't have primary care; that is to say, they don't have  the ability to go in to see a doctor in a timely way, just to get a  wellness checkup for themselves or for their kids, just to make sure  that everything is OK, so they don't develop a chronic healthcare  condition that makes the healthcare much more…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…employers and workers, grants for health projects, and  loan repayment for healthcare professionals serving in these zones. It  supports initiatives such as mobile clinics and wellness programs and  provides Medicare bonuses for services delivered in HIZs. The bill  focuses on improving outcomes for conditions like diabetes,  cardiovascular disease, and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Award--Claudia Massey: Claudia  Massey has made a lasting impact in media and communications as a  bestselling author, TV and radio host, columnist, and Certified Life  and Wellness Coach. Through her podcast and documentary, Reclaiming My  Life, she reaches audiences worldwide, sharing stories of strength and  hope. Claudia also founded Rena's New Life…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…reflect on their sacrifice, we must also recommit ourselves to  doing more for those who wear the badge today. That means investing in  officer safety, mental health, and wellness. It means supporting their  families, and it means ensuring they have the tools and resources to  serve our communities with dignity and professionalism. Choosing a life…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of the Improving Law Enforcement  Officer Safety and Wellness Through Data Act.\n\nLaw enforcement officers serve as our lifeline of defense against  danger. With this bill, we have an opportunity to equip the Department  of Justice and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Class 1 departments that serve over 500,000 constituents.  Throughout his service, Chief Baker has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…have wait lists. Many older Americans wait months or even years  to access program benefits. It is not just about the food. Nutrition  programs also promote socialization, wellness, and safety checks. Food  delivery or community meals might be the only social contact older  Americans have during the day.\n\nI have joined Meals on Wheels for deliveries…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…anxiety.\n\nThis Police Week, I thank the sponsors of the bill, my colleagues  across the aisle, for introducing H.R. 2240, the Improving Law  Enforcement Officer Safety and Wellness Through Data Act.\n\nI did offer an amendment to require that the Department of Justice  include recommendations on improving training programs for domestic  violence cases…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691322/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…or  BX, is a thriving tax-free benefit that strengthens our nation's  military lethality. The Exchange serves those who serve with department  stores, restaurants, malls, wellness services, combat uniforms at cost,  school meals for military children overseas, a robust presence at  ShopMyExchange.com, a leading credit option and more.\n\nAt 130, the Exchange,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…ensuring that  everyone, regardless of background or financial status, has access to  the care and resources they need to thrive. Their century-long  commitment to mental wellness and family stability has made an  indelible impact on Aurora and beyond.\n\nAs they commemorate this remarkable 100-year milestone, I would like  to extend my deepest gratitude…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…honor to shed light onto a mission devoted to strengthening our  communities, improving quality of life, and ensuring that everyone has  equal access to quality health and wellness services.\n\nHealth extends beyond clinics and hospitals. It is the cornerstone of  a strong nation. By engaging our communities, public health workers  address health care…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689417/recognizing-national-public-health-week-and-the-ut-school-of-public-health-san-antonio"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I rise today to recognize and celebrate the  grand opening of the Endeavors Health & Wellness Center in El Paso,  Texas. Endeavors is a distinguished Texas-based nonprofit organization  dedicated to serving veterans, active-duty service members, first  responders,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696519/recognizing-the-grand-opening-of-the-endeavors-health-wellness-center-in-el-paso"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…community leadership by ensuring outreach and vaccinations were  available during the pandemic; securing multiple sources of public  funding for a Center for Recovery and Wellness, a substance use  disorder outpatient center that  opened in October 2024; and numerous additional legislative  accomplishments.\n\nIn addition to some of the civic engagements…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…comprehensive services to the county's seniors. These  services have grown over the decades to include programs for home- delivered meals, medical transportation, health and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee has been able to help elderly adults  and their families navigate the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…degree from Vanderbilt University,  Calvin spent fifteen years at Mars, Inc. His experience at J&J spans  many roles including: U.S. President, Internal Medicine; President,  Wellness & Prevention Inc., where he was the founding leader of Johnson  & Johnson's health and wellness business; and Worldwide Vice President,  Human Resources, where he supported…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…led Family Support Groups, offering encouragement and  understanding to others walking a similar path. She is also a certified  instructor for Mental Health First Aid and Wellness Recovery Action  Plan (WRAP), further extending her impact in the community. In addition  to her peer support and education roles, Joanne chairs NAMI Hernando's  Fundraising…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…to veterans and their families who earn at or  below 50 percent of this area's median income. These homes are designed  with dignity in mind, paired with access to health, wellness, and job  readiness services.\n\nTogether, Victory I and II provide 150 safe, stable homes for men and  women who once wore our Nation's uniform. The apartments offer not only…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…history, increasing the endowment by 67 percent, and under  his leadership, the college completed major capital improvements,  including the construction of the Lillis Athletic & Wellness Center,  renovation of Rock Bowl Stadium and Keane Hall, and the construction of  the Tucker Tennis Complex. Collins also expanded graduate and  professional programs, achieved…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, I rise today to congratulate the  Independence Police Department for receiving the 2025 National Officer  Safety and Wellness award in comprehensive wellness. This is the top  award in the country, and Independence Police Department is the first  in Ohio ever to win it.\n\nThe department focuses on…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Academy oversight. Sec. 263. Electronic locking mechanisms to ensure Coast Guard Academy                cadet room security. Sec. 264. Report on existing behavioral health and wellness support                services facilities at Coast Guard Academy. Sec. 265. Required posting of information. Sec. 266. Installation of multipurpose medical privacy rooms.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Unfortunately, law enforcement officers face the continued threat of  unprovoked and ambush-style attacks. The bill before us, the Improving  Law Enforcement Officer Safety and Wellness Through Data Act, would  require the Attorney General to develop a series of reports related to  violent attacks on law enforcement officers.\n\nThe left's defund the police…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Speaker, Charlottesville Hyperbarics has become a  frontline in the fight for veterans suffering from the invisible wounds  of war.\n\nThey recently launched the Hyperbaric Wellness Foundation and have  partnered with the HOW Foundation to provide hyperbaric oxygen therapy  to veterans battling PTSD or other traumatic brain injury.\n\nAdditionally, generous…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…certified under the Law  Enforcement Officers Safety Act to carry a concealed firearm in a gun- free school zone; and H.R. 2240, Improving Law Enforcement Officer  Safety and Wellness Through Data Act, which would require the Attorney  General to submit a report to Congress that includes data on attacks on  law enforcement.\n\nThese bills are widely supported…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…and led  to the development of a new police station and civic plaza, enhancing  public safety and revitalizing the city's core. She also helped  establish the Victorville Wellness Center, the first facility of its  kind in San Bernardino County, which reduced the city's unsheltered  homeless population by fifty-seven percent and now serves as a model…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Clinic Foundation.\n\nFor three decades, Jim served the great folks of the Treasure State,  advocating tirelessly for rural healthcare access and the expansion of  community wellness programs. Jim grew the foundation's endowments from  $3 million to an astounding $150 million, funds that will benefit the  community for generations to come.\n\nJim also played…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693079/congratulating-jim-duncan"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…love:  mental health.\n\nEstablished by Congress in 1949, May was designated as Mental Health  Awareness Month to increase awareness of the importance of mental  health and wellness.\n\nMental health is about more than just illness. It is about well- being, resilience, and the ability to cope with various challenges we  experience day to day. These challenges…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Texas Tribune reports:\n\nThe state's health care agency said it will use the funds       to strengthen rural health care clinics in a variety of ways,       including: creating wellness and nutrition programs to rural       providers; educating and attracting health care professionals       to work in rural areas; and modernizing resources and       technology…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…support. Tommy's  commitment to advocacy inspired the creation of the annual Strike Out  Stigma fundraiser, an event that continues to unite the community in  support of mental wellness. Building on its success, he spearheaded the  launch of Reconstructing Hope--a nonprofit initiative that brought  together businesses in the construction industry to raise…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}]