[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…upcoming 101st  birthday on September 24, 2025.\n\nMr. Drake was born on September 24, 1924. On June 6, 1942, he  enlisted in the United States Navy at the age of 17. He went on to  serve with distinction as a Petty Officer Second Class, participating  in several major campaigns, including the Atlantic Invasion of North  Africa and the pivotal battles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that same year, I ran for State senate  because I wanted to be part of crafting policies to actually achieve  those goals and implementing those policies and programs. I went on to  serve for 6 years as chair of the California State Senate Committee on  Energy, Utilities and Communications.\n\nSince then, California has continued to lead the Nation with…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…see if my mom can  unlock the key to that nickname for me. My mom grew up in Bristol,  Connecticut, and my father grew up in Newark.\n\nI mentioned earlier that he then went off to serve this country in  uniform as an Air Force member and served in Germany during the Cold  War. I think about that a lot. I didn't get to talk too much about it.  I wish…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Varney earned his Master of Science degree in Criminology from  Fresno State and his Bachelor of Science degree in Resource Development  from Michigan State University.\n\nHe went on to serve with the Dallas Police Department and the  Lansing, Michigan, Police Department before becoming Police Chief and  then City Administrator for the City of Chowchilla, California.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…with deployments to Saipan and Tinian.  Following his military service, Mr. Akaka earned both a bachelor's and  master's of education from the University of Hawaii. He went on to  serve as a teacher, vice-principal, principal, and chief program  planner within the Department of Education. He later became the  director of the Hawaii Office of Economic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and a year later he managed Gerry's successful campaign  for Congress.\n\nWhile a new Member, James is no stranger to Congress. After Gerry's  election to Congress, James went on to serve as his chief of staff for  over a decade, where he worked closely with many of us and our staffs.  James consistently fought alongside Gerry for the people of Virginia's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…International  Women's Year conference in Houston.\n\nAnn Richards was right behind me. She was getting ready to make a  speech on the ERA. She would go on to be Governor, and I went on to  serve in the city, county, State, and now here in Federal Government.\n\nThat day, we were doing what I am doing right now: fighting for the  equal rights amendment, fighting…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…where he managed  financial operations, enforced fiscal accountability, and ensured  resources were directed toward member support and workforce  development. He then went on to serve as Assistant Business Manager and  Field Representative, where he coordinated grievance procedures,  negotiated collective bargaining agreements, and advocated for safer…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Foreign Affairs, where her portfolio included oversight of  the United States' relationships with Canada and Mexico and countries  throughout Central and South America. She went on to serve as Senior  Policy Advisor to three consecutive Assistant Secretaries of State for  Western Hemisphere Affairs at the U.S. Department of State, helping to  manage policy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…Washington State, especially in the times  we are in today.\n\nWaverly highlighted Dorothy Hollingsworth, the first Black woman  elected to the Seattle School Board in 1975, who went on to serve on  the Washington State Board of Education. Hollingsworth's commitment to  civil rights and equality laid the foundation for all Washington  students.\n\nFrom Waverly's…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700266/waverly-davis-and-rion-walker-win-black-history-month-essay-competition"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the Navy in 1943. Recognizing his talent, the Navy  placed him in the B-12 program at Emory University, where he again  graduated valedictorian from dental school. He went on to serve with  the 1st Marine Division at Camp Lejeune, providing essential care as a  naval officer in the Dental Corps. His distinguished career spanned sea  service, Active…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…astounding 50 years of  dedicated service in fire and rescue.\n\nChief Williams began his journey as a volunteer with the Strasburg  Volunteer Fire Department in 1975. He went on to serve 25 years with  Fairfax County, ultimately retiring as a captain, and then brought his  leadership to Shenandoah County, where he has served since 2005,  including the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska Native people in terms of service to our  military, we would have a better America.\n\nThey underwent an incredible injustice because so many Alaska Natives  went to Vietnam to serve in the war when a lot of Americans--let's face  it--were avoiding service in Vietnam. So these great men and women went  to serve their country in Vietnam. When they…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Bryan began his career in Washington as a Staff Assistant for Senator  John Cornyn and quickly earned a reputation for being a hard worker who  was quick on his feet. He went on to serve as a Military Legislative  Correspondent for Senate Armed Services Committee Chairman Jim Inhofe,  where he developed a deep understanding of defense policy and America's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…two decades with the Erie County Child Support Unit. In  1984, he was selected as Elma Town Justice, becoming at age 28 the  youngest Town Justice in Erie County, and went on to serve the Town of  Elma for more than twenty-two years.\n\nIn 2006, Judge Boller was nominated to the New York State Court of  Claims and later received full appointments in 2010…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699266/recognizing-the-honorable-m-william-boller"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…times, and the Good Conduct Medal two times.\n\nFollowing her military career, she earned a bachelor's degree in  social work with honors from Texas Tech University. She went on to  serve in several public service roles in Waco, Texas, including at the  Texas Youth Commission, Texas Behavioral Health Network, and Child  Protective Services. Since 2007,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Mingus deployed 12 times to Iraq and Afghanistan,  repeatedly placing himself along soldiers in harm's way and earning the  enduring respect of those whom he led.\n\nHe went on to serve in key staff roles at U.S. Central Command and  the Joint Special Operations Command, where his strategic insight  helped to guide complex and high-risk missions.\n\nIn…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…career as a mail  carrier in Flower Mound. Demonstrating a commitment to professional  growth, she completed the Customer Service Associate Supervisor Program  in 2019 and went on to serve in supervisory and leadership roles across  multiple Texas stations, including as OIC Postmaster.\n\nIn 2022, Mrs. Maddalena was appointed Manager of Consumer Affairs for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Jersey.  Later, she made her home and spent much of her life in Ewing, New  Jersey after marrying her husband, Ken Birkhead. Ken was a United  States Navy veteran who went on to serve as an Ewing Township Police  Officer and work in construction. As a devoted homemaker, Helen created  a warm and loving home where she and Ken raised their two children,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…He served as an operations  officer where he conducted training with 50 air squadrons in various  air to land operations. Retiring in 1999 as a Navy Chief, Mr. Askew  went on to serve as Marion County's Veterans Services Director and the  Administrator of the Ocala/Marion Veterans Memorial Park. He and his  staff were awarded the ``Service Office of…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…thankful that he stuck it out because this entire body has  benefited from his public service and his expertise.\n\nJack has come a long way from his days as an intern. He went on to  serve as my legislative director in my congressional office. For the  last 6\\1/2\\ years, he has been with me at the T&I Committee, first as  deputy staff director and, most…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…School in 1962, he  proceeded to enroll in the United States Air Force Academy.\n\nAfter graduating from the Academy and marrying his high school  sweetheart, Nancy, he went on to serve 26 years in the United States  Air Force.\n\nDuring his tenure, Rick would become the commander of the 32nd  Tactical Fighter Squadron Wolfhounds, later the 33rd Tactical…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November 2018 and sworn into office  the following month, she went on to serve as Mayor from December 2020  through December 2023. Debra was instrumental in championing Measure P,  which expanded law enforcement, strengthened code enforcement, and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Bettendorf home.\n\nVern managed two businesses, Harvey Homes and Kirkwood Investors  Realty, where he contributed greatly to the community by building  affordable homes.\n\nVern went on to serve three terms as an Iowa State House  representative for district 779. As a fellow veteran, I understand  Vern's services, sacrifices, and commitment to our Nation.\n\nOur…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Planning and Zoning Commission, where his leadership earned him  positions as vice chairman and chairman. In 2009, he was elected to the  Royse City Council, where he went on to serve as Deputy Mayor Pro Tem  and Mayor Pro Tem. Today, he continues to serve as a steadfast and  engaged councilman, working tirelessly to support and represent his  community…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}]