[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…needless bureaucratic barriers and excessive paperwork into a  lifesaving program to make it harder to qualify for care, all to pad  the pockets of the ultrawealthy.\n\nIf that weren't enough, the bill also includes what can only be  described as a backdoor abortion ban, prohibiting Medicaid funding from  going to family planning clinics that provide abortion…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…decades now, California has had a right to set its own air  quality standards. That right was given by statute.\n\nBut other States have chosen to follow California's lead. They  weren't required to. They weren't forced to. They chose to. They chose  for their constituents to have air as clean as what California was  striving to achieve.\n\nAnd, yes, a lot…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…were criminal-- simply criminal. Those crimes were exactly what the Department of  Justice was investigating when subpoenas were issued for certain phone  call logs. These logs weren't being targeted for political reasons;  they were part of a legitimate and serious investigation into criminal  activity. The Justice Department followed standard legal practice…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…insurance provided by my dad's civilian job  at the Department of Defense, Olivia wouldn't have gotten the care that  she needed to live for 19 years as healthy as possible if it weren't  for the Washington State Legislature expanding Medicaid the year she  was born.\n\nMy family would have faced dire choices about which bills not to pay  in order to meet Olivia's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…eyes; that nothing is real; that nothing is true; that if  you are a supporter of the regime and I tell you once plus one equals  three, then one plus one equals three. Those weren't war plans. Those  weren't classified items.\n\nThat is also why the official position of the White House on key  issues like tariffs changes every hour, because if the ground…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…billion for fiscal year 2024, and VHA was facing a  potential shortfall of $12 billion for fiscal year 2025.\n\nNow, out of an abundance of caution and to ensure veterans' benefits  weren't disrupted, Congress quickly passed H.R. 9468, the Veterans  Benefits Continuity and Accountability Supplemental Appropriations Act,  which provided VBA with additional funding…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…committee received one. Everybody got a letter.\n\nThen Congress had 90 days to adopt a resolution of disapproval.  Republicans have tried to disapprove of the withdrawal, but they  weren't able to bring it to the floor. Congress didn't ask, and the  window of disapproval closed.\n\nNow they are trying to use the Congressional Review Act to get a do- over. The…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Department of Homeland Security Appropriations Act of  2024, which is Public Law 118-47.\n\nAm I shocked? Let me be honest. I am not shocked. We were illegally  denied entry. While we weren't surprised, it was pretty disrespectful  for Members of Congress to not be able to do their job.\n\nI want my colleagues to visualize this. There are four Members of  Congress,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the President to his face that you  don't have a mandate to cut Medicaid, Medicare, and Social Security.  This was at a joint session of Congress. This dastard said that they  weren't going to do it, and, lo and behold, the dastard did it. They  cut about a trillion dollars out of healthcare. This is the dastard who  perpetrated the deed. He ought to be…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…protect public health and center  our families, Republicans are pushing harmful resolutions that threaten  the well-being of our constituents and the future of our planet. If it  weren't so cruel, it would be laughable.\n\nH.J. Res. 61, the one before us today, would cripple the EPA's  ability to protect our communities from hazardous air pollutants, the  worst…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688525/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Independence was being drafted and  voted on in Philadelphia.\n\nThe Declaration voted on in Philadelphia, July 4, 1776. July 5, 1776,  in Williamsburg, the Virginia ``B team'' that weren't in Philadelphia,  they did four really cool things: They passed the first Virginia  Constitution. They enacted the first Virginia bill of rights, which  became a model for…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…caused it, which I think  is why we are here today--because this insurrection didn't happen far  away. An election wasn't almost overturned on another continent. Police  officers weren't beaten in a foreign capital, and guns weren't drawn in  some other senate somewhere else.\n\nIt all happened right here. It happened in the United States of  America. It happened…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…governance. It is not because there is some urgent crisis but because  Republicans want to score cheap political points and take power away  from a local government that they weren't elected to make decisions  for.\n\nIn fact, Republicans referred to the District of Columbia as  ``property'' in last night's Rules Committee hearing. Who talks like  that?…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Poland. My grandfather fought in the Pacific then came  home and worked in a factory that made airplane parts. His wife, my  grandmother, worked in a department store. Their jobs weren't  glamorous. They weren't anything special, but they earned enough to buy  a house, to raise four kids, and to build a stable, middle-class life.\n\nMy father's side of the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…colleagues on  their specific concerns with funding for the Corporation for Public  Broadcasting, but the concerns I have heard raised as part of the  debate on this package actually weren't even raised as part of the  appropriations process in the last 2 years as I chaired this  subcommittee. My colleagues are saying that this is such a grave  problem that we…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…not a war in Venezuela.\n\nNow, some of them on the quiet will tell you: Well, it was a war, but  it is all over. It is all done. Yeah. We are not going to quibble. We  really weren't arresting somebody. It wasn't a drug arrest. It was a  war. It is a mini-war. But it is all over, so the War Powers Resolution  doesn't apply because the war is over.\n\nAnd…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…are  actively destroying the power grid. They are the least reliable sources  of power and the most expensive. Nobody would use them, and nobody  would produce them, if they weren't subsidized by your tax dollars. It  funds zero-emission vehicles that only the wealthy can afford and  depends on supply chains dominated by China.\n\nIt actively promotes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…don't  know if people forget, just under 2 years ago, one of our own  colleagues was mugged at gunpoint several blocks from the Capitol. That  might not have happened if we weren't understaffed by about 800  officers in Washington, D.C.\n\nWhen we undermine law enforcement, we embolden the criminals.  Congress has a constitutional duty to ensure the MPD…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…abandon their faith, their  faith has never abandoned them. One of the martyrs' widows said: Their  blood mixed together, and as a result, we the widows are united.\n\nThese men weren't just believers. They were immovable. Their story  should remind every American what real religious freedom means. May we  never forget them.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…absolutely shameful.\n\nMy constituents were patching their roofs and clearing debris by  hand. FEMA was busy footing the bill for nice hotel stays in New York  for folks who weren't even supposed to be in the country. This was a  willful effort by the other side to just enable this border crisis.\n\nI have to say that Congressman Knott pointed out how…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Mr. Speaker, I am prepared to close, and I reserve the balance of my  time.\n\nFor 4 years, Democrats gaslit the American people in a vain attempt  to convince them that costs weren't going up, inflation wasn't real,  our economy wasn't in trouble, and there wasn't a crisis at our  borders. The American people saw past that deception, and they voted  for…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…what. A lot of these guys and a few women were overseas  serving their country in Vietnam. They didn't know. There was no  internet, no cellphones, right? So they got home. They weren't treated  well because they were Vietnam vets. Let's face that. They weren't  treated well because there is still a lot of discrimination with regard  to Native people, indigenous…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fentanyl. They literally took over their homes. I met  with and talked to Cindy Romero from Aurora about what happened to her  in her home and that my Democratic colleagues weren't even  acknowledging that it was happening. They were just ignoring it.\n\nThen Tren de Aragua moved to San Antonio and other places across the  country. I want to give a shout-out…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…with an income.\n\nThere are Pell grants. As one young gal about 22 years old told me,  she and her husband got married before they had a child; but she knew  lots of friends who weren't getting married because they got free  college.\n\nDaycare is another program in which you can pay to have someone take  care of your kids while at work if you don't get married…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…come to power in our Nation's most iconic city. You know,  foreign-born, communist mayor Zohran Mamdani polled 62 percent of  support from foreign-born voters in New York. They weren't born in the  State of New York. They weren't born in our country. Sixty-two percent  of them supported him. Only 30 percent of American-born voters voted  for him.\n\nUnder…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…big issue. The Biden administration became flippant about  this chemical abortion drug because the  Biden administration was focused on having more abortions in America.  They weren't just pro-choice; they were pro-abortion, trying to  increase the number of abortions in America, but to do that, they did  not take into account the health and life of the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…CR and then  cheered on their Democratic colleagues in the United States Senate to  keep the government closed as people suffered, as individuals who were  showing up to work weren't receiving payment, including law enforcement  officers and Border Patrol officers. SNAP benefits weren't being paid,  and that pain was getting quite real.\n\nFinally, after…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…is equivalent to 6.5 million document pages as PDFs or office  files, 500 hours of high-definition video, or 250,000 photos. The  depositions were not filed properly or they weren't filed at all and  archived as they are supposed to be, and as the rule that set up the  prior committee said, they were supposed to be there.\n\nI can assure you, Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…bureaucratic steps and  precautions'' when opening the case.\n\nNow, was this supposed to be an opinion piece on behalf of terminated  FBI agents or a real news article?\n\nNormal steps weren't taken. As I noted in my February 3, 2025, floor  speech about FBI agent Thibault:\n\nDoes the New York Times [truly] believe that it is normal       for an Assistant Special…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the country who otherwise would  not be allowed in.\n\nUnder Operation Allies Welcome, President Biden extended this  immigration E-ZPass to hundreds of thousands of aliens who weren't  eligible to come to the United States. This discretionary authority was  only supposed to be used on a case-by-case basis. It is an authority  that President Biden repeatedly…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]