[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…for their community  sparked growth, soon reaching 23 members. As the neighborhood around  them evolved, so did the church, embracing change and relocating to a  new home on West McNichols in 1950. By May 27, 1951, Trinity Church  broke ground on their new fellowship hall, proudly serving a growing  congregation of 210 strong.\n\nWhile expanding their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Amelia's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Amelia Ferkuniak on achieving the  Arvada Wheat Ridge Service…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689635/recognizing-amelia-ferkuniak"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…behind him  can only get half of that in Federal student loans. That math doesn't  math.\n\nI visited a dental clinic in Abingdon, Virginia. Before the dental  clinic, most people west of Roanoke who needed dental services waited  until once a year when the RAM Clinic came to Wise County. You would  see the longest line you have ever seen of people waiting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…district is  home to more than 32,000 veterans, many of whom rely on physical and  mental health care from three VA medical centers: Lebanon in Berks  County, Coatesville in West Norriton, and Philadelphia for Montgomery  County.\n\nYet, because of President Trump, the VA, which cares for more than 9  million veterans nationwide, has been gravely weakened.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688623/fighting-for-our-veterans"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that natural gas prices would  increase by over 30 percent, so we are essentially, in this bill,  removing crucial safeguards. What you are going to have instead is a  Wild West, allowing all adversaries like China to purchase even more of  our energy, essentially, to use against us.\n\nThis is the same playbook that Republicans ran when they repealed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the Massachusetts  Seventh's very own Super Bowl champions, the Randolph High School Blue  Devils.\n\nShowcasing electric offense and stifling defense, the Blue Devils  shut out West Boylston at Gillette Stadium, capping off an undefeated  season with another championship.\n\nThese student-athletes have made their school and families proud and  proven to themselves…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Ecumenical Patriarch of  Constantinople for nearly 35 years, the Patriarch has taken on the most  difficult issues facing the world, whether it's building bridges  between East and West, protecting our environment, or fostering  dialogue between religious faiths.\n\nEcumenical Patriarch Bartholomew is also an international  environmental leader and has earned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and capabilities and results of  our Federal agencies.\n\nMr. Speaker, I enthusiastically urge my colleagues to vote ``yes'' on  H.R. 1368.\n\nMr. Speaker, the gentleman from the West, Mr. Begich and Mr.  Whitesides, along with Mr. Kennedy, who appear to be three freshman  Members of Congress, have come together in an important way to  introduce H.R. 1368.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…heard and seen people's fears firsthand at  my townhalls because civil servants are the quiet force behind the  services that hold our communities together.\n\nWhen a farmer in west Michigan loses a season's worth of crops, it is  the USDA employee who helps them adjudicate a crop insurance claim,  making sure they can recover and keep food on our tables.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690734/public-service-recognition-week"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to congratulate Chief Don  Lombardi of Golden,  Colorado, on his retirement following 33 years of service to the West  Metro Fire Protection District.\n\nThroughout his career, Chief Lombardi went above and beyond the line  of duty, and focused on growing programs that saved Coloradans money…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Designers Guild Awards for his work on the film.\n\nWhile this is Paul's first win at the Oscars, he was also nominated  for costume design in the 2022 film adaptation of the ``West Side  Story.''\n\nPaul, a 1982 Buchtel High School graduate, proudly acknowledged  during his acceptance speech that he is the first Black man to win an  Oscar for costume design,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688615/recognizing-paul-tazewell"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…platoon in the invasion of Iraq.  I think about the faces of those young men whom I was responsible for,  Black, White, Asian, Hispanic, from the North, from the South, East,  and West, from farms and from cities, rich and poor.\n\nWhen I think of America, I still think of those young paratroopers  and how we came together despite our differences. We served…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…millions of  Americans, and put our forests at high risk of catastrophic wildfires.\n\nMs. SCHRIER. Mr. Speaker, I would like to echo some of those comments  because I am also in the West, in Washington State, and we are seeing  the risk of catastrophic wildfires increasing every year.\n\nBecause all of this is being done under the guise of DOGE, the  Department…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Speaker, I rise today to congratulate the 2025  U.S. Little League champions: the Summerlin South Little League.\n\nAfter undefeated runs at the District Four, Nevada, and Mountain West  tournaments, Summerlin South punched their ticket to the Little League  World Series, making them the third consecutive Nevada team to qualify.\n\nIn Williamsport, they went…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695305/congratulating-summerlin-south-little-league-team"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…from the Great Lakes region of Ohio.\n\nMr. Chair, if you look around our country, for many, many years my  part of America lost jobs and economic growth to California and the  West because of the Bureau of Reclamation. It is important to  understand what the Bureau of Reclamation does and the fact that places  like I represent have enormous environmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…find innovative and low-impact solutions to this  growing concern. In their search, the team discovered BEBOT, the first  battery- and solar-powered beach-cleaning robot on the West Coast.  Through funding provided by the North Tahoe Community Alliance, the  team was able to successfully deploy BEBOT to the shores of Lake Tahoe,  maximizing beach cleanup…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…from being shared with friends or  family.\n\nThrough this horrendous conduct, we have lost beautiful young lives,  including Gavin Guffey from South Carolina, Bryce Tate from West  Virginia, and many other children. I have also met with parents,  including a mother from my home State of Florida, who shared the  heartbreaking story of her son who fell…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…joins me as the dean of our  Republican delegation, to welcome our new colleague to the House.\n\nMatt Van Epps brings a great personal story to us here in the  Congress. He is a West Point graduate and a lieutenant colonel, and he  has a distinguished record of combat service as a helicopter pilot and  mission commander.\n\nHe is a proven leader with government…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…almost twice the income as the  average European American.\n\nOther groups that do tremendously well are the Taiwanese, the  Filipinos, the Cubans, people who come here from the West Indies. They  are all doing far better than the native born, despite the fact that  they are not of European heritage.\n\nIf anybody knows anybody who has been corrupted by this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…fifth of all crude oil traded in the world passes. This is an  ominous sign. We know they are strengthening their cooperation together  in a way to undermine and challenge the West, including the United  States. The last thing the United States should do is to join this  cooperation by investing in the Chinese military, and that includes not  just the…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to recognize Margaret Peterson,  a dedicated public servant and respected leader in West Valley City.\n\nMargaret served on the city council for 18 years, always putting  families and students first. She is also the founder and Executive  Director of the Community…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690092/recognizing-margaret-peterson"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…as the chairman of the Congressional  Western Caucus, one of the largest congressional membership groups on  Capitol Hill, focusing on rural policy and issues that affect the West  and beyond.\n\nDoug left an indelible mark on this institution and the people whom  he got to know along the way. For those who knew him, they understood  his unique love of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…several military academy appointments.\n\nLucas Gaston of Brookville, Pennsylvania, has recently accepted a  fully qualified appointment to the United States Military Academy in  West Point, New York.\n\nLucas is the son of Becky and Mike Gaston and the grandson of Hazel  and Joe Gaston, as well as Nancy and Ted Fox of Brookville.\n\nAs a student of Brookville…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Captain Carol Young MacGibbon\n\nMr. SELF. Mr. Speaker, I rise today to honor Captain Carol Young  MacGibbon, a distinguished graduate of the United States Military  Academy at West Point.\n\nCommissioned into the U.S. Army Corps of Engineers in 1980 as part of  the historic first class of female graduates, Captain MacGibbon served  our Nation with distinction…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…this year, tragedy occurred in the district I am  honored to represent when multiple police officers were shot while in  the line of duty. One, Officer Andrew Duarte of the West York Borough  Police Department, made the ultimate sacrifice. Mr. Speaker, he was  only 30 years old.\n\nPolice officers across the country put their lives on the line every…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this legislation and its commitment to fiscal  responsibility. President Trump's record demonstrates a commitment to  prioritizing unleashing abundant water supplies across the West.\n\nMr. WESTERMAN.  Boebert), the lead sponsor of this legislation.\n\nMr. WESTERMAN. Mr. Speaker, I respect the administration's views on  this legislation, and I respect my colleagues…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…feeds, and clothes our  great Nation and beyond. Today, I am honored to celebrate an occasion  that represents the true embodiment of the spirit and unparalleled  ingenuity of West Texas--the groundbreaking of the Crossroads Business  Park in Big Spring, Texas.\n\nThis development is the first major business park in West Texas tied  to the Ports-to-Plains…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…music continued through his master's  education at Wilkes University and additional graduate coursework at  Villanova University, University of Miami, University of Arts, and West  Chester University.\n\nMr. Parker dedicated 27 years to sharing his musical expertise and  passion with QCSD students. From 1998 to 2004, he directed the award- winning Milford…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the  rules, and ask only for a fair shot and a government that works for  them, not against them.\n\nIt is for places like Peachtree City, Georgia; Yukon, Oklahoma;  Petersburg, West Virginia; Erie, Pennsylvania, and all of the other  communities that the Committee on Ways and Means visited over the last  24 months. The One Big Beautiful Bill Act is their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Professional Compounding Centers of  America, PCCA, and the healthcare industry.\n\nHis educational background, including a bachelor of science in  chemistry and biology from West Texas A&M University and an MBA from  the University of Portland, has shaped his strategic leadership.\n\nSince joining PCCA in 2000, Mr. Smith has played a crucial role in  the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}]