[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…you have to have a full  policy that is centered by workers, industrial policy.\n\nOne of my colleagues who gets this idea of economic patriotism deeply  is Mr. Ryan. He is a West Point graduate. I won't hold that against him  too much. He deeply understands the fight that we need and understands  that our core of economic patriotism is what we are all about.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…from the Coast  Guard. She testified before that committee and talked about, again,  some of the hard experiences that she went through.\n\nOther military academies, such as West Point and Annapolis, have  actually adopted safe-to-report policies, and tomorrow's bill will get  the Coast Guard Academy in line with those institutions.\n\nThis bill also extends…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…exceptionally meritorious service while serving in positions of  increasing responsibility and culminating as the Deputy Chief of Army  Reserve. A native of New Jersey and West Point graduate, Major General  Kotulich's distinguished service has impacted the lives of countless  soldiers and their families.\n\nAnd she has served in several key leadership…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…service to Alabama and the United States has made  a lasting impact on the lives of many.\n\nColonel Richard Tucker is a graduate of the United States Military  Academy in West Point, New York, where he was commissioned in 1998. Mr.  Tucker served as Chief of Staff at Ft. Novosel, U.S. Army Aviation  Center of Excellence.\n\nColonel Tucker has served our…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…increased  responsibilities, culminating in his role as Assistant Chief of Army  Reserve. A native of Oregon and a proud graduate of the United States  Military Academy at West Point, Mr. Austin has left an indelible mark  on the lives of countless Soldiers, Army civilians, and their families.\n\nEven after retiring as a Colonel in the U.S. Army, Mr. Austin's…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Lieutenant Caroline Robinson\n\nMr. PALMER. Mr. Speaker, I rise to congratulate Second Lieutenant  Caroline Robinson on her graduation from the United States Military  Academy at West Point.\n\nA little over 4 years ago, I had the honor of nominating Caroline to  West Point when she was a student at Mountain Brook High School. While  at West Point, Caroline earned…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…attitude,  spirit, and wit will be truly missed, especially at Monday morning  coffee.\n\nThis past weekend was the 126th Army-Navy game. As a member of the  Board of Visitors at West Point, this is not easy to say, but for  Simona, I will: Congrats. Go Navy.\n\nMr. Speaker, she will be truly missed.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…me as the dean of our  Republican delegation, to welcome our new colleague to the House.\n\nMatt Van Epps brings a great personal story to us here in the  Congress. He is a West Point graduate and a lieutenant colonel, and he  has a distinguished record of combat service as a helicopter pilot and  mission commander.\n\nHe is a proven leader with government…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Wyatt Spaulding, upon his acceptance to the United States Military  Academy at West Point.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force--the United States Army--guided by duty, honor,  and country.\n\nThe service…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692756/congratulating-wyatt-spaulding"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Captain Carol Young MacGibbon\n\nMr. SELF. Mr. Speaker, I rise today to honor Captain Carol Young  MacGibbon, a distinguished graduate of the United States Military  Academy at West Point.\n\nCommissioned into the U.S. Army Corps of Engineers in 1980 as part of  the historic first class of female graduates, Captain MacGibbon served  our Nation with distinction…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…agent; to the widow of  an officer who was killed in the line of duty; to a 13-year-old  survivor of brain cancer, such an inspiring young man; to a young man  admitted to West Point; to a history teacher who has finally been  brought home after being a political prisoner in Russia, sentenced to  14 years; and to the family of Corey Comperatore.\n\nEach…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…military-industrial capabilities, securing all servicemembers a well- deserved pay raise, making meaningful strides to secure our southern  border, and so much more.\n\nAs a graduate of West Point and the proud Representative of Fort  Knox, I am excited by the commitment this bill makes to Army Reserve  Aviation and the strategic partnerships it creates with local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695348/ndaa-restores-peace-through-strength"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…a  town of patriots, with a veterans memorial paying tribute to those who  defend freedom. Among the most illustrious veterans is Lt. James  Porter. After graduating from West Point in 1869, he served with the  7th Cavalry in the Reconstruction Era South under George Armstrong  Custer and distinguished himself by his courage during the mission the  eradicate…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…several military academy appointments.\n\nLucas Gaston of Brookville, Pennsylvania, has recently accepted a  fully qualified appointment to the United States Military Academy in  West Point, New York.\n\nLucas is the son of Becky and Mike Gaston and the grandson of Hazel  and Joe Gaston, as well as Nancy and Ted Fox of Brookville.\n\nAs a student of Brookville Area…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "John James", "party": "Republican", "sentence": "…been a family friend for such a long time.\n\nI also have the pleasure of sharing the opportunity on this bill with  Erin Houchin, my classmate; Robin Kelly; and Pat Ryan, my West Point  classmate. This is an example of Congress coming together, reaching  across the aisle, and working in the best interests of the American  people. There are so many more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…congratulate  them on this true accomplishment.\n\nMr. Speaker, I congratulate Libby Russell and Zanna Paraskevas, who  were accepted to the United States Military Academy at West Point.\n\nI congratulate Savion Kirby, Natalie Doig, Audrey Ponton, and  Maximilian Perez, who were accepted into the United States Air Force  Academy.\n\nI congratulate Victoria Nelson,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689824/congratulating-floridas-eighth-districts-student-accomplishments"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Tyrone Miller, upon his acceptance to the United States Military  Academy at West Point.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force--the United States Army--guided by duty, honor,  and country.\n\nThe service…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692755/congratulating-tyrone-miller"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…our Nation by enlisting in the United  States Army. His exceptional potential was quickly recognized, earning  him an appointment to the United States Military Academy at West Point,  from which he graduated in 1984 with an Engineering degree. He further  sharpened his expertise, earning an MBA from The Ohio State University  and completing a Senior…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}]