[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…our coasts.  When estuaries thrive, local communities thrive. The National Estuary  Program makes that possible.\n\nFor more than three decades, NEP partnerships have restored wetlands,  improved water quality, reduced toxic pollutants, strengthened fish  habitat, and built natural buffers that protect homes and businesses  from flooding and storm surge.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Chair, I rise in strong opposition to the PERMIT Act.  For over 50 years, the Clean Water Act has protected rivers, streams,  and wetlands that our communities rely on. This bill undermines these  protections by shielding polluters from responsibility for toxic waste  like PFAS, lead, mercury, and arsenic, and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698033/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…reality, the  PERMIT Act is a partisan package of over a dozen bills that roll back  the Clean Water Act, further weakening protections on our rivers,  lakes, streams, and wetlands. This bill protects polluters from  responsibility for treating toxic pollution in their waste stream like  lead, mercury, selenium, PFAS, and arsenic. If enacted, the PERMIT…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…its clean  water, including the Puget Sound and hundreds of lakes and thousands of  miles of rivers and streams throughout Washington.\n\nWe all know that rivers, streams, and wetlands are intrinsically  connected. The health of the waters in my State and its water-related  economy depend upon a strong partnership with the Federal Government  and a level…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Reauthorization of Junior Duck Stamp Conservation and Design  Program Act.\n\nThis program is an art- and science-based curriculum that educates  children on the importance of wetlands and waterfowl conservation. The  Junior Duck Stamp curriculum is a program during which students can  develop an understanding of waterfowl anatomy and habitats, culminating…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…the law that Americans don't deserve clean water.\n\nAlready today, clean water protections have been defanged, leaving up  to 80 percent of our streams and 50 percent of our wetlands at risk of  pollution or destruction, but my House Republican friends have offered  this bill that further rolls back the remaining protections on clean  water.\n\nMr. Chair,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…underlying bill.\n\nFor the last fifty years, the Clean Water Act has provided the  federal government with the means to hold polluters accountable for  contaminating our Nation's wetlands, rivers, lakes, and sources of  drinking water. The Clean Water Act, in many cases, has been the sole  reason why decades of pollution threatening the health of our  communities…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "The Wetlands Conservation and Access Improvement Act of 2025 would  extend critical wetlands conservation funding through 2033.\n\nMany of my constituents live and breathe wetlands conservation.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…general, D.C. is not eligible for funding under this Act.\n\nThe Dingell-Johnson Sport Fish Restoration Act provides funding for  sport fish restoration, aquatic education, wetlands restoration and  boat-related activities. Under this Act, each state receives a minimum  of one percent of the total amount apportioned, while D.C. is capped at  one-third…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700089/introduction-of-the-pittman-robertson-wildlife-restoration-act-and-dingell-johnson-sport-fish-restoration-act-district-of-columbia-equality-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Initiative--or some people call it the  GLRI--has been a bipartisan lifeline and a vital investment that has  brought over $3.7 billion to our complex ecosystem to restore our  wetlands, to clean up toxic waste in hotspots, and to protect our fresh  drinking water. It is complex with lots of industry, lots of  agriculture, lots of people, and lots of freshwater.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…interconnected threats to our  native species is unfolding in Hawaii. Habitat destruction has  significantly reduced the space where native plants and animals can  thrive. Forests, wetlands and coastal ecosystems--critical habitats for  native species--are being cleared or degraded, leaving these species  increasingly vulnerable. As these ecosystems are altered…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…bears, and caribou roam. Beluga and bowhead whales shelter in its  coastal waters. Millions of migratory birds rely on this intact  landscape and the critical waters and wetlands that are the NPR-A.\n\nThe legislation before us today would withdraw a smart and well- thought-out plan to balance conservation and development in the NPR-A.  The 2022 NPR-A…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…both the Trump and Biden  administrations, has shifted permitting authority back to the Federal  Government, creating enormous disruptions to Florida's efforts to  protect wetlands and water resources and is now blocking Florida's  ability to issue necessary permits for development projects across the  State, including: projects to restore Florida's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…decades. In fact, Arizona and much of the West have  been in a 30-year drought. Under the current 5-year window, pauses that  ranchers and farmers might take can often revert to wetlands,  triggering EPA oversight that locks out grazing.\n\nMy amendment recognizes the reality of the West and protects these  parcels so they can return to production when conditions…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…is, How are we going to get there? As a  family, we have done projects like we planted over 20,000 trees on our  land. We have done several water projects where we preserved wetlands.  We have eliminated invasive species. We have worked with and invested  in Ducks Unlimited, which does some incredible things for the  environment.\n\nWhat is interesting,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Wetlands Conservation and       Access Improvement Act of 2025''.       SEC. 2. AVAILABILITY OF INTEREST ON OBLIGATIONS HELD IN                     FEDERAL AID TO WILDLIFE RESTORATION…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, I thank Chairman Westerman for  yielding me time.\n\nMr. Speaker, I rise today in support of my legislation, H.R. 2316,  the Wetlands Conservation and Access Improvement Act of 2025.\n\nThis bipartisan legislation ensures that the interest earned on  unallocated Pittman-Robertson funds will continue to support…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…or wetland acres.   acres identified                                                        as riparian areas                                                        and wetlands ------------------------------------------------------------------------", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]