[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…mother fighting for their child with autism,  for every parent fighting for their child with a visual or intellectual  disability, and for every child who rolls in with their wheelchair  every single day, mighty with pride and glory that they, too, can learn  and be integrated, there may not be any Federal protections to make  sure that they are respected.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…him in continuing this new way of life       for him.\n\nOur community of people with disabilities desperately need       help!\n\nSasha from Fountain:\n\nI have a 9-year-old, wheelchair-bound daughter with       cerebral palsy. She depends on me 100 percent. She depends on       me 24/7, morning, day, and night.\n\nI change her, dress her, get her out of bed,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…__________\n\nMy father was a proud Jewish American and serviceman who       fought in Okinawa. During the last years of his life, he was       bound to a wheelchair and unable to perform daily tasks       independently. The man who bathed him, dressed him, prepared       his food, pushed his wheelchair and drove him to appointments…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…has allowed Reverend Latifah Griffin  to care for her 10-year-old son who suffers from pain and has severe  difficulty walking. Her son has cerebral palsy and depends on a  wheelchair and pediatric extended care.\n\nIn Alachua County, Medicaid has meant that Virginia, an adult with a  disability, has a home health aide to care for her every single day so…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688148/medicaid"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Roots,  addressed the challenge of finding accessible programs and  opportunities for those with disabilities in our community. Paige took  action by designing and building a wheelchair-accessible garden bed to  help existing programs become more inclusive. She created an  instruction manual to share with other organizations, providing a  supply list, step-by-step…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…investigated. If the  city decides not to investigate, then the Office of Civil Rights comes  in.\n\nThe Office of Civil Rights investigates for the mother and the child  who uses the wheelchair when the school says they don't need a ramp.\n\nThe Office of Civil Rights literally provides constant oversight over  every school district in this country so that a child…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…basis.\n\nTonya and Cameron. God, Tonya uses Medicare and Medicaid to care for  her son, her beloved child Cameron. Cameron is battling stage IV cancer  and is confined to a wheelchair. Due to the severity of his illness, he  cannot be without his cancer treatment and prescription medication.  Medicare and Medicaid coverage are for them, they say, a matter…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…have come into my office and then ask you a  question. This is all lead-up to a question.\n\nSo I have a constituent who was paralyzed about a decade ago, and he  now uses a wheelchair, and the only insurance program that can provide  him with what he needs from a mechanical and technological standpoint,  plus the drugs he needs to survive, is Medicaid.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…it to be the manna from  heaven, then they shouldn't be afraid to go into their districts and  talk about the cuts, talk about cutting Medicaid.\n\nLook at the person in the wheelchair, look at the person who is  dependent on Social Security benefits, look at the veteran who is  receiving Social Security, and tell them that they don't matter. Tell  them…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…only strip away these healthcare benefits, but it also increases  private healthcare costs and reduces services for everyone.\n\nTake Jake, a high school student who uses a wheelchair. He relies on  a Medicaid waiver for school support and depends on our healthcare  system to move, thrive, and survive. Cutting his Medicaid isn't just  wrong, it is cruel.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691781/opposing-medicaid-cuts"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…come from a well-off family to work a Federal job, or basic  disability accommodations in the office, like making sure the office  coffee pot is in reach of someone in a wheelchair.\n\nAre these destroying our workforce like the President says?\n\nThese moves are not about fairness. They are about power and about  stripping protections from the most marginalized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Snake was known for his energy, his drive, his showmanship, and his  humor. His legacy goes far beyond the wins. He helped the University of  Texas-Arlington Movin' Mavs wheelchair basketball program start, and he  was also very active in the Fort Worth chapter of Kappa Alpha Psi.  Coach LeGrand, or Snake, as everybody affectionately called him, was…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Americans are. They accept what God gives them, and they love that  child.\n\nBut it makes a difference whether they can live their life if they  have Medicaid that helps get that wheelchair, that may help them with a  van so they can go out as a family. That is literally what we are  talking about. This is real. This is consequential. This is not about  polls…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…cuts the heart out of programs that  help Americans meet their basic needs: healthcare, nutrition, essential  services. There's nothing excessive about needing insulin or a  wheelchair or therapy. This isn't luxury. It's survival. My son is on  the autism spectrum.\n\n``And let's be real about who this hits the hardest: children, people  with disabilities,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Weakness occurs over two or more months. Unlike GBS, CIDP is chronic,  with symptoms constantly waxing and waning. Left untreated, 30 percent  of CIDP patients will progress to wheelchair dependence. Early  recognition and treatment can avoid a significant amount of disability.  Post-treatment life depends on whether the disease was caught early  enough to…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…endangered species. The park's success has  significantly contributed to Madison's economy by attracting tourists  from across the Nation.\n\nAccessibility is a priority with wheelchair-friendly amenities  ensuring all guests can fully enjoy the experience. TIME highlights  Georgia's commitment to preserving natural wonders while promoting  economic development.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of America. Today, I rise to recognize one of those wonderful things,  the Eastern Washington University Adaptive Athletics Program, home of  the first collegiate National Wheelchair Basketball Association team in  the Western United States.\n\nFounded in 2019, this program embodies the values of leadership,  teamwork, positivity, and integrity, helping…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Winter Games starting this Friday, February 6.\n\nLiam Cunningham of River Falls is competing in sled hockey. Dan Rose  of Tomah and Matt Thums of Ogema are both competing in wheelchair  curling. They overcame tremendous obstacles and hardships to earn their  position with Team USA. They are role models to young athletes  everywhere, proving that with resilience…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699752/congratulating-wisconsins-seventh-district-paralympic-athletes"}]