[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Washington this week to receive the prestigious Templeton Prize,  recognizing exceptional contributions to the fields of science and  religion. Ecumenical Patriarch Bartholomew is widely known as the  ``Green Patriarch'' for his longstanding commitment to protecting the  environment. He has organized several international, interfaith summits  to address some…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…States. It does not provide any  new tools or training that would reduce police shootings or promote the  safety of officers or the public.\n\nInstead, it makes dangerous weapons widely available to everyone,  including those who should not have them. It allows those weapons to be  untraceable, undetectable by equipment, and sold to anyone without a  background…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…makers are leading producers of lithium-      iron-phosphate, or LFP batteries. These iron-based battery       cells cost less than the nickel-and-cobalt combination used       widely in North America and Europe.\n\nCATL's newest fast-charging battery, the second generation       of its Shenxing lineup, is an LFP battery with a range of       about 500 miles.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…major  world power. Meanwhile, the U.S. remains far behind amid increasing and  blatant misinformation about the features of digital currency.\n\nLet's talk about the EU. It is widely acknowledged that the EU has  one of the most stringent data protection regimes and protection laws  on the planet. They have strict data protections, number one, on the  GDPR,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…for abolition of nuclear weapons. It's a       position that occupies the highest moral ground, famously       seized by the Nobel laureate scientist George Wald in a       widely reprinted 1969 anti-war speech at MIT. ``Nuclear       weapons offer us nothing but a balance of terror, and a       balance of terror is still terror,'' he said. ``We have…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…originating from  the United States. His Liberation Day scheme, which imposed 10 percent  tariffs on all countries, as well as additional tariffs based on a  formula for reciprocity widely mocked as nonsensical, led to the most  significant drop in the financial markets since the 2020 crash  triggered by the COVID-19 pandemic.\n\nAdditionally, Donald John Trump…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…audit of the consolidated  financial statements of the federal government, an annual effort that  has significantly improved transparency and accountability.\n\nGene Dodaro is widely respected on both sides of the aisle as a  principled, nonpartisan public servant. He has been recognized by  numerous organizations, including the American Society for Public…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…schools, so many things. It is really quite exciting, and  the IMPACT Act can play a role. The bill will improve cost- effectiveness, durability, and material demand efficiency of widely  used cement, and similar materials while achieving measurable  greenhouse gas emissions reductions in their production processes. We  like to call this a win-win.\n\nH.R. 1534…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…time in the  history of the school or any school that I know about in the city of  Chicago, 23 of its students achieved a perfect score on the ACT test.\n\nOf course, the ACT is widely used in admission decisions and as a  predictor of college success. I am certain that, if the business, civil  rights, and National Urban League leader, Whitney M. Young, was…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Now-Justice  Kavanaugh, while serving on the DC Circuit, wrote that multimember  independent Agencies like the FTC are part of a ``deeply rooted  tradition'' that ``has been widely recognized by leading judges,  congressional committees, and academics.''\n\nThis is because bipartisan commissions allow Presidents to shape the  direction of a commission while…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…loath to do: Roll up your sleeves and do  the hard work of passing legislation. That is what we did. That is why  insulin is $35 for senior citizens. That is why 20 of the most widely  used drugs' prices have plummeted, because we negotiated with Medicare.  That is why no family pays more than $2,000 total for all their  prescription drugs. We worked hard,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690954/prescription-drugs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…that someone with a  mental health condition or some other condition, someone you do not  want getting a gun, to ensure safety through that background check.  That has been widely supported by law enforcement.\n\nThere is a concern about the weapons of war that are brought onto our  streets and kill multiple people. There are a number of reasonable  measures…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the team of physicists and engineers  who built the first atomic bomb. Oppenheimer, as you know, directed the  Manhattan Project's Los Alamos Laboratory in a way that--it was widely  believed then and is to this day--no one else could have done.\n\nThe use of the atomic bomb against Japan marked the end of the Second  World War. It also demonstrated to the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…allowed in to  bear witness to what is happening. But the Netanyahu government has  said no reporters, no Members of Congress.\n\nMore than 60,000 Palestinians have been killed, widely reported, but  understand this: 18,500 of them were children. According to a reporting  by Associated Press, more than 80 children have died from malnutrition- related causes.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…destroyed the  lives of hundreds of young women.\n\nAs I speak, the U.S. Department of Justice has files detailing the  names of those connected to Mr. Jeffrey Epstein. It has been widely  reported that in May our Attorney General Pam Bondi informed President  Trump that his name appears in the Epstein files.\n\nBut, to be clear, just because a name is listed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…again, to make our communities safe again, and to get these  violent gangs and criminals off our streets.\n\nNow, even though these efforts have been very successful and are  widely supported by the American people, we have seen some powerful  institutions in our country try to block the will of the people and  what they wanted to see done. This includes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Accessibility.--The support provided by the behavioral       health specialists hired pursuant to paragraph (1)--\n\n(A) may include care delivered via telemedicine; and\n\n(B) shall be made widely available to members of the Coast       Guard.\n\n(4) Notification.--\n\n(A) In general.--Not later than 180 days after the date of       enactment of this Act, the Commandant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…available.--The term `commercially       available', with respect to cement, concrete, and asphalt,       means that the cement, concrete, or asphalt is--\n\n``(A) readily and widely available for purchase in the       United States; and\n\n``(B) produced using a production method of cement,       concrete, or asphalt products, as applicable, that is widely…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for       their department.\n\nThis present policy has many civil and criminal       implications for tribal police departments, especially given       that this nuance is not widely explained to FFLs or the       public. Additionally, the exclusion of Native American tribes       and their law enforcement departments creates many logistical       difficulties…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Technological  University, he has built a successful career as the owner and president  of Jebco Consulting, where his expertise in electro-mechanical  engineering has been widely respected. Yet, despite his professional  success, his true legacy is his dedication to serving his community.\n\nJim's contributions to Cass City are immeasurable. As a mentor…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…HSRA will miss its latest 2033 deadline . . .  without having completed a single segment of the track. Indeed, The New  York Times reported that, according to `projections widely used by  engineers and project managers, the train could not be completed in  this century.'\n\n``This malfeasance leads to questions that transcend mere  incompetence. How is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with the congressional Members of  Congress to see what they are trading. That is ridiculous.\n\nYou should come to Congress. You should take your assets and move  them into widely held index funds. It should be able to be done on a  tax basis. Come in here. Clean the decks. Go represent your  constituents. It is long past due. Let's move the bill. Let's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…redistricting in every State in the country. I am calling on House  leadership to do the right thing and bring this bill to the floor for a  vote. Not only is it supported widely by Members in this body but a  poll showed that the American people support this proposal by a 3 to 1  margin. Let's pass this legislation and restore a dose of sanity to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…bring  the power on that will actually meet the demand that we need for the  future.\n\nNumber six, wind and solar are no longer emerging technologies. They  are mature. They are widely developed. Wind and solar now account for  17 percent of our electric generation.\n\nThe cost of these technologies has also dropped dramatically, and  this is the seventh reason…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…cotton. Alongside  its agricultural success, Delano has experienced steady commercial  growth, attracting major businesses such as Wonderful Citrus, the  company behind the widely popular Halos brand.\n\nDelano is also a culturally rich and diverse community, shaped by  generations of residents from around the world. Since the arrival of  early settlers…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}, {"senator": "French Hill", "party": "Republican", "sentence": "…cash-handling businesses, consumer groups, and vending and       transit industries;\n\n(7) an analysis that estimates the potential seigniorage       associated with a widely circulated $2.50 coin; and\n\n(8) a plan that could be followed to mint and issue a $2.50       coin that includes--\n\n(A) coordination with the Federal Reserve System and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…would we continue to allow States like California and other  States to game the system, to get Federal dollars sent back in a money- laundering scheme, as has been reported widely by The Wall Street  Journal and others? They are openly and knowingly doing it. Why  wouldn't we fix that?\n\nWhy wouldn't we apply eligibility rules and work requirements,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the jaws of consensus.  This is an issue that liberal thinkers and conservative thinkers have  both said is a problem that we ought to address.\n\nJustice Kagan has been quoted widely as having said that it just  cannot be the case that a single district court judge can hold up  Federal policy for the lengthy period of time nationwide that it takes  for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…America's geostrategic leverage, the very outcome Congress sought to  prevent by opening up the NPR-A in the first place.\n\nThe issuance of Biden's new highly restrictive IAP was widely  condemned as egregious by Alaskans. Our entire Alaska congressional  delegation slammed the decision as contrary to good science, in  contravention of congressional directives…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…gives the Saint Regis Mohawk Tribe  clarity on their reservation land and resolves a centuries-old  violation of the Non-Intercourse Act. This settlement is long overdue  and widely agreed upon. It is up to Congress to take the final steps  and authorize the settlement.\n\nMr. Speaker, I urge the passage of this bill, and I yield back the  balance of my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}]