[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…beloved partner, Laurence  Jones; many aunts--including Carole (and husband Clayton), Clarice,  Yvonne, and Sylvia; cousins Juan, Jose, Thomas, and countless others;  and a wide community of close friends who will dearly miss him.\n\nCorey touched countless lives with his kindness, faith, and joyful  spirit. He leaves behind a legacy of love that will…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…The DC Attorney General, as the District's chief law       officer, is also responsible for local legal issues, namely,       protecting the District and its residents in a wide range of       matters, such as enforcing child support laws, handling abuse       and neglect proceedings in the child welfare system,       enforcing our housing code, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…About 80 percent of U.S. LNG is       shipped to NFTA countries. The public interest includes       impacts to prices of natural gas and reliability. Section 3       gives DOE wide latitude to protect U.S. consumers now and in       the future as larger amounts are exported.\n\nH.R. 1949 removes Section 3 and the protection that it       affords. The bill…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…person, a  family, they have the bad luck of having a disabled child, but they  have the good heart that they can love that child as though it is the  best child in the whole wide world. That is how they are. That is how  Americans are. They accept what God gives them, and they love that  child.\n\nBut it makes a difference whether they can live their life…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…debatable. There are a couple of things that  are debatable.\n\nWhat do we do about it? What treatments are appropriate, given the  set of circumstances? Personally, I think it is wide open to have that  conversation. What should the medical profession do?\n\nSecond, when there is a transgender woman or a transgender man, how  does that work in terms of sports…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…The DC Attorney General, as the District's chief law       officer, is also responsible for local legal issues, namely,       protecting the District and its residents in a wide range of       matters, such as enforcing child support laws, handling abuse       and neglect proceedings in the child welfare system,       enforcing our housing code, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…legislation will  build on the longstanding partnership between the Department of Energy  and the National Science Foundation to leverage the unique investments  and expertise in a wide range of fields, including quantum science,  artificial intelligence, fusion energy, and, of course, advanced  manufacturing.\n\nAlongside these research partnerships, this legislation…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…or HUD, is attempting to  experiment with crypto in their operations, including by paying  grantees in stablecoin or crypto. One of Trump's executive orders  leaves the door wide open for Trump to require the use of his  stablecoins and meme coins in order to pay taxes or enter into other  arrangements with the government. This would be just another…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…think, in a  political generation, maybe several political generations. And it is  not your usual suspects of moderates who might be able to get you guys  to 60 but a pretty wide swath of U.S. Senators on the Democratic side  to try to reform the rules on a bipartisan basis. And we are achingly  close to doing this like adults.\n\nIt is not lost on me…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…demonstrated a deep commitment to  public service and a genuine concern for the people who turned to our  office for help.\n\nIn her role as a Constituent Advocate, Kathryn handled a wide range  of complex and often deeply personal issues, including IRS cases,  housing matters, student loan concerns, and many other challenges faced  by families across the district.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Agency  often gives a notice of proposed rulemaking so the world will know what  they are considering doing and then solicit comment from affected  stakeholders, the public, a wide variety of people.\n\nSo you start with an Agency that seeks to make a rule. They have to  follow the processes of the Administrative Procedures Act, which is a  very careful…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…football teams have won four State championships and  are now competing against Brighton for their fifth State championship.\n\nThis year's squad is led by quarterback Carson Miller; wide receiver  Henry Shoemaker; running back Jagger Fenton; and the aptly named  Charlie Garnet, Garnet being the school mascot.\n\nTheir strong offense mowed down all of the competitors…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…thinking, confidence, communication, creativity, and  a love of learning. Students need arts and music education, hands-on  project-based lessons that teach teamwork, and a wide range of career  and technical education classes. We must invest in, not cut,  educational research, and we need to promote, rather than politicize,  family, parental, and community…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Department of Commerce's Assistant Secretary for Industry and Analysis  with promoting the stability and resilience of critical supply chains.  It creates a new government-wide Supply Chain Resilience Working Group,  led by the Assistant Secretary, to prepare for and respond to supply  chain shocks by mapping, monitoring, and modeling U.S. supply chains…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Center for Senior Services for serving their two millionth meal to  seniors in the Mount Washington Valley.\n\nFounded in 1973, the Gibson Center for Senior Services provides a  wide range of programs for residents of the Mount Washington Valley,  including meal delivery, transportation. social programs, exercise  classes, home repair, and even a thrift…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…That is absolutely absurd.\n\nNow, many on the left look at our electoral system and say: There is  nothing to see here, no issue, no problem. But that is what they said  about wide-open borders. That is what they said about censoring  conservatives online. That is what they said about the botched  Afghanistan withdrawal. That is what they said about President…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Best Dinner  Theater in America by USA Today's Readers' Choice Awards.\n\nSince opening its doors in 1967, the Alhambra has brought Broadway to  Florida's First Coast, hosting a wide variety of shows, musicals,  comedies, and tribute acts.\n\nUnder the visionary leadership of my good friend, Managing Partner  Craig Smith, the Alhambra has evolved into a unique…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…released thousands en bloc.\n\nMr. ROY. Hundreds of thousands en bloc under parole, an abuse of the  law, an illegal act, abuse of asylum to release people in our country,  and then wide-open borders where people were flooding across the river.\n\nDid that in totality, coupled with people overstaying their visas,  coupled with, frankly, a far more liberal immigration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…by H.R. 4242 have previously       been scored as having a de minimis effect on federal revenue.\n\nModernizing policy for less-lethal capabilities has the       backing of a wide range of respected organizations       representing both law enforcement and community voices. These       include:\n\nLaw Enforcement & Public Safety Organizations\n\nFraternal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…even having to say that.\n\nRight now, our system has real gaps, and the longer we ignore them,  the more confidence we lose. Some of the left would rather keep those  loopholes wide open than ensure the integrity of our elections.\n\nWe have already seen what happens when Washington refuses to act. We  have seen the chaos at the border. We cannot let that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…leasing under P.L. 115-97 (Tax Cuts and Jobs Act).           Why the 2024 ROD is Harmful to Kaktovik and ANCSA Rights\n\n2024 ROD:\n\nIgnores the statutory mandate for area-wide       leasing.\n\nDisregards congressional limits on habitat       closures and surface disturbance.\n\nUndermines ANCSA village lands specifically       conveyed to KIC for local…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…located  in Warminster, Pennsylvania. With her business' mission to enhance  people's natural beauty and provide opportunities to indulge in self- care, Beauty Mood offers a wide range of services in a relaxing  environment, delivered by skilled professionals. On June 24, 2025,  Beauty Mood will be celebrating its first anniversary, commemorating a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…similar       contracting opportunities.\n\n(b) Publication.--The information required under subsection       (a) shall be made publicly accessible on the single,       Government-wide point of entry described under section 1708       of title 41, United States Code.\n\n(c) Covered Solicitation Defined.--In this section, the       term ``covered solicitation''…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Major General John  C. Harris, Jr., on his retirement as Adjutant General of the Ohio  National Guard. During General Harris's career in the Ohio National  Guard, he held a wide range of leadership positions, culminating in  service as a key member of Governor DeWine's cabinet. Governor DeWine  announced General Harris's retirement and nomination to…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…million acres  across Arkansas and Oklahoma.\n\nManaged by the U.S. Forest Service, it is a true multiple-use forest,  supporting timber harvesting, wildlife conservation, and a wide range  of outdoor recreation opportunities, such as hiking, hunting, camping,  and fishing.\n\nArkansans take great pride in this forest, which draws more than  670,000 visitors…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…capabilities. The system       operates at variable frequencies and uses various standard       waveforms.\n\nThe AN/PRC-167 is a multi-domain multi-channel tactical       narrow and wide-band dual transceiver radio system providing       Type 1 encryption and SAASM GPS location and timing       capabilities. Each transceiver is software programmable and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…first Bell telephone;\n\nWhereas Edwin Land invented the Polaroid instant camera;\n\nWhereas Hedy Lamarr invented the concept of ``frequency       hopping'' which made possible a wide range of wireless       communications technologies, including Wi-Fi, GPS, and       Bluetooth; and\n\nWhereas, to counter the rise of antisemitism, it is       critical to increase…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…strengthening community through  recreational, educational, cultural, and social programs rooted in  Jewish values. For 80 years, the JCC has fulfilled this mission by  offering a wide array of inclusive services and programs open to people  of all faiths and backgrounds. From preschool classrooms to Camp  Centerland, from heated pools to the renowned Jewish…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "French Hill", "party": "Republican", "sentence": "…States Mint shall conduct a       comprehensive study to evaluate the feasibility,       practicality, and potential public benefits of minting and       issuing a $2.50 coin for wide circulation in the United       States.\n\n(b) Report.--The Secretary of the Treasury, acting through       the Director of the United States Mint shall, not later than…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…air traffic congestion and robust launch windows,  enabling greater efficiency and mission success.\n\nThis spaceport is designed to be highly adaptable and can accommodate  a wide range of launch vehicles, from small satellites to larger  payloads. Its infrastructure includes multiple launch pads, a state-of- the-art range control center, and cutting-edge…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}]