[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…thoughtful consideration of government  spending is a responsibility I don't take lightly. I believe every  hard-earned taxpayer dollar must work for all Americans, not fuel  wildly irresponsible economic theory.\n\nI would like to think my colleagues on the other side of the aisle  believe the same thing, given the rhetoric we have all heard over the  last…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, we all know that the Republicans' so-called  big, beautiful bill is wildly unpopular. Every poll, including FOX  News, shows that Americans think it is rotten, and it is.\n\nThat is why Trump is trying desperately to rehabilitate the bill in  the eyes…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693089/what-americans-want"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Republican majority is also using the same shady  tactic to take away the authority of Congress to legislate tariff  policy, likely because Republicans know their positions are wildly  unpopular and proper oversight would highlight these failings.\n\nThis is yet another example of the erosion of separation of powers  that we are seeing in this administration…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…traffickers is  both ineffective and unwise, as drug trafficking is fundamentally a law  enforcement matter, not a military one.\n\nThis is yet another instance of Donald Trump wildly abusing our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate  peaceful protesters…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…American power that we have, and what people will now see is  the most powerful man on Earth flying around in a plane paid for by a  foreign government. It is disgusting. It is wildly corrupt. And just  because they are doing the corruption in plain sight not does make it  any less damning or sad or gross.\n\nThis week, several of my colleagues and I will…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…a large-scale military buildup in the Caribbean but has  completely failed to explain the rationale to Congress. A military  posture that includes a carrier strike group is wildly disproportionate  to the goal of prosecuting counter-narcotics missions. The financial  costs of Operation Southern Spear are significant and will likely run  into billions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Democratic leaders just yesterday, and he didn't seem to be aware of  what was at stake here for the Americans who are about to lose a huge  healthcare benefit.\n\nThey just go wildly forward. We have seen it over and over again here  on the Senate floor. How many times in just the few months that we have  been here in this administration have Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…elections and, in turn, over the policies  that all Americans have to live under. And this has fueled what is  growing to be a growing discontent.\n\nEnding Citizens United is wildly popular on both sides of the aisle.  The majority of Americans want to see an end to this cancerous  decision. Americans are sick and tired, and they are demanding that we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…success, ensuring nearly 18  million students at over 10,000 schools and libraries could get online.  In Connecticut, that Federal support, in addition to State funding, was  wildly successful to our closing the homework gap. We made sure that  every single student had access to a laptop and to high-speed  broadband. I am so proud of everyone in Connecticut…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…responsibility,  as a coequal branch of government charged with upholding the  Constitution, to call out  wrong when we see it, to call out illegality when we see it. This is  wildly unconstitutional. This is wildly illegal.\n\nSo we have a chance today, with these resolutions, in order to make  clear that we are not going to accept or make normal this kind…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…it was an essential part of  this branch of the Federal Government exercising its oversight when a  President does something like veto the Arkansas Valley Conduit, which  is wildly out of step with what the people that we represent want all  across this country.\n\nIf Congress allows this veto to stand, we set a troubling precedent.  It would mean that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Vietnam protests, but they failed to bring down America because  Americans themselves are hardworking, and they realized the middle- class lifestyle in America would be like a wildly wealthy lifestyle  everywhere else in the world.\n\nThey failed. They thought: Let's educate our so-called minority  people that America is a horrible country and that you are…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…eruption in 1980 caused more than $1 billion in  damage. Adjusting for inflation, that figure would now exceed $4  billion.\n\nDamage estimates for volcanic eruptions can swing wildly, depending  on many factors, but are almost always severe, underscoring the need  for early warning and monitoring.\n\nObviously, protecting human life is our paramount concern…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…remind everybody that people who come here from India, who are the  most successful minority, Philippines, China, Japan, Cuba, the coast of  western Africa all are succeeding wildly in America. All it takes is  hard work and strong families, and all these groups have strong  families.\n\nI encourage our educators and all our policymakers to educate the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Thunberg syndrome, in which they hate  America, in which they want us to adopt policies that will guarantee  the destruction of America.\n\nThey are now clearly a majority in the wildly wealthy city of  Minneapolis. These people are also a majority in many wildly wealthy  cities in California and in New York City. Unless we find a way to deal  with their psychological…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…insanity. It has been some 16 years, 17 years since the project was  approved. They have spent $17 billion, and there has not been a single  passenger.\n\nEven under the most wildly optimistic scenarios, we are going to have  a line from Palmdale to Gilroy in 20 years that will require 2 hours of  additional travel on each end to get from San Francisco…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}]