[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…well-kept secret--\n\nThe former President had to say--       has to do with the environmental record of our       administration, which is one of achievement in parks,       wilderness land, and wildlife refuges. According to studies       by the Environmental Protection Agency, the quality of our       air and water has continued to improve during our…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…me the  time.\n\nMr. Speaker, I rise in opposition to this legislation, which risks  polluting the Boundary Waters Canoe Area, as has been stated, our  Nation's most visited wilderness.\n\nIf this resolution passes and the mineral withdrawal is overturned,  toxic sulfide-ore copper mining will contaminate the water and the  habitat in this priceless wilderness.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in strong opposition to H.J. Res. 140, a  resolution that would threaten America's beloved Boundary Waters Canoe  Area Wilderness in northern Minnesota.\n\nMr. Speaker, Boundary Waters draws more visitors than any other  wilderness in the country. Millions of Americans have paddled, fished,  swum, and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Ditch Act,  introduced by my colleague and good friend from Colorado (Mr. Neguse).\n\nMr. Speaker, the Bolts Ditch Headgate and ditch segment are located  within the Holy Cross Wilderness in Colorado's White River National  Forest. This infrastructure is essential for delivering water to the  Bolts Lake Reservoir, supporting water supply needs and economic…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…It is the skyrocketing utility bills that Americans are facing  because of the Republicans' relentless attacks on affordable American- made clean energy.\n\nOpening precious wilderness to industrial development is not going to  fix that, especially when it is to drill for oil that costs so much to  produce. Drilling in the Arctic Refuge is not going to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…bases,  our veteran population, our reservists, our Guard, our military  families, our DOD civilians--our map is a map of American military  history: Yorktown, Appomattox, the Wilderness, Fredericksburg, the 9/11  attack on the Pentagon. Everything about Virginia is connected to our  Nation's military mission.\n\nI know the President would make the same claim…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Speaker, today I rise in strong opposition to H.J.  Res. 140. This resolution would permanently allow copper sulfide mining  in the watershed of the Boundary Waters Canoe Area Wilderness.\n\nCopper sulfide mining is the most toxic industry in America, and it  is particularly ill-suited to water-rich environments because it  acidifies the water. It leaches heavy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…eliminate the health-harming emissions  and pollution.\n\nOne such Clean Air Act program, the Regional Haze Program, addresses  haze and visibility impairment in national parks and wilderness areas.  Unsurprisingly, coal plants are the Nation's most significant source of  haze. The same coal pollutants that drive severe health issues and  deaths nationwide, including…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…the darkest skies in the  country in what is an International Dark Skies Sanctuary and one of the  most breathtaking trails that one can experience in our Nation's first  wilderness.\n\nRegardless, SRS is incredibly important to help ensure that our  schools and our roads continue to function as we expand New Mexico's  outdoor recreation economy.\n\nMr.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…northeast corner of Alaska. However, at the time,  Congress failed to permanently protect 1.5 million acres of Coastal  Plain, the biological beating heart of this incredible wilderness--a  wilderness that is often called America's Serengeti; that is because of  the hundreds of thousands of caribou that migrate and depend on these  lands. Herds that Alaska…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1612, the Flatside Wilderness  Additions Act, introduced by my colleague from Arkansas (Mr. Hill).\n\nThis bill would expand the boundaries of the Flatside Wilderness Area  in the Ouachita National Forest…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…still open to cars, jeeps, and other street- legal vehicles. They are just closed to vehicles that have the ability  to travel off-road and cause severe damage in proposed wilderness and  other sensitive landscapes.\n\nThat is 94 percent of the roads in this Park Service unit open to  motor vehicles, including off-road vehicles, and  then just 6 percent…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise in opposition to a provision  tucked away in the Republican's budget proposal that will open up the  Boundary Waters Canoe Area Wilderness to toxic sulfide-ore copper  mining.\n\nMy husband and I take our kids camping and paddling in the Boundary  Waters every year, and we are not alone. The Boundary Waters is…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691611/boundary-waters-canoe-area-wilderness"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…vacuum. Without these  limitations, there are fewer constraints, fewer eyes, and fewer brakes  on how Vladimir Putin expands and modernizes Russia's nuclear forces.  In this wilderness, we would see a broader breakdown of norms on  nuclear weapons.\n\nBoth the United States and Russia have openly mused about potentially  restarting nuclear weapons testing.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…dreams, Who was born in Hampstead, London in a home of modest       means, With a small toy chimp named Jubilee clutched close       against her heart, And a yearning for the wilderness,       imprinted from the start.\n\nShe would read of Doctor Dolittle and apes of Tarzan's       land, While her mother, kind and gentle, held her daughter's       reaching…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recreation opportunities.\n\nUnder this new rule, dozens of miles of popular trails and shorelines  are closed off to highway vehicles in what the State of Utah called de  facto wilderness management. Even small road closures can have profound  consequences for public access.\n\nFor example, the National Park Service effectively cut off access to  the adjacent…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Management, and Recreation Act to allow for additional entities to be  eligible to complete the maintenance work on Bolts Ditch and the Bolts  Ditch Headgate within the Holy Cross Wilderness, Colorado.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1729\n\nBe it enacted by the Senate and House of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…HILL of Arkansas. Mr. Speaker, I rise in condolence to Jill  LaMalfa and the LaMalfa family of northern California, that beautiful  area north of Sacramento, deep in the wilderness, home to Mt. Shasta.  There was no better representation of the people of California than  Doug LaMalfa.\n\nHe was a gentle giant. I had so much fun with him over the years.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…community, manage water flow into the Everglades National  Park, and raise structures within the camp to prevent catastrophic  flooding. The Everglades is the largest subtropical wilderness in the  continental United States and one of the most unique ecosystems on the  planet.\n\nFor generations, the Miccosukee Tribe has served as a responsible  steward of the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693410/miccosukee-reserved-area-amendments-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…more than a decade, the State of Alaska has worked on this RMP to  revoke Public Land Order 5150, which would unlock millions of acres of  land from restrictive, de facto wilderness management and return it to  multiple use.\n\nUnfortunately, the previous administration reversed this decision  against the wishes of Alaskans and finalized a new RMP that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…period of       20 years, subject to valid existing rights, to protect and       preserve the fragile and vital social and natural resources,       ecological integrity, and wilderness values in the Rainy       River Watershed, the Boundary Waters Canoe Area Wilderness       (BWCAW), the Boundary Waters Canoe Area Wilderness Mining       Protection Area…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, nestled among the rugged wilderness of  the western Maine mountains, the town of Strong, ME, was incorporated  on January 31, 1801. This 225th anniversary is a time to celebrate the  spirit of determination…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…the United States.\n\nMany who are watching, when you think about Montana, you think about  our amazing fly-fishing streams, our national parks, our beautiful  mountains, our wilderness areas, the tremendous hunting and hiking  opportunities we provide, but many don't know that Montana has more  recoverable coal than any State in the United States.\n\nThink…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696070/9999"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…available  acreage from 18.6 million acres to just 11.8 million acres, and  restricted infrastructure corridors across millions more. In effect,  the plan attempted to create a wilderness area in a petroleum reserve,  and it did so without listening to the people who actually live there.\n\nAlaska is asking us to act.\n\nThe Inupiat people who live in the area…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1612) to designate the  Flatside-Bethune Wilderness in the Ouachita National Forest, and for  other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Arkansas. Mr. Speaker, I thank my good friend, Mr.  Westerman, and my colleagues in the House who serve on the Natural  Resources Committee for working with me on the Flatside Wilderness  Additions Act over the past 5 years.\n\nI stand in strong support of H.R. 1612, which I think is a model for  how to go about considering recreation conservation lands in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…demonstrates why Whiting  prides itself on being a small town with a big spirit.\n\nThe Revolutionary War reenactment is especially significant as one of  the early settlers of the wilderness of far Downeast Maine after  America won its independence was a hero of that conflict, General John  Crane. A Massachusetts carpenter, Crane was a leader of the Sons of…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recognized as three of the top five best beach towns in the South.\n\nJekyll Island was ranked as the fifth best beach town in the South,  celebrated for its beauty, pristine wilderness, otherworldly nature,  and function as a refuge for local wildlife.\n\nTybee Island was ranked fourth on the list, being praised as a little  island packing a big punch. Tybee…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…not       permanently adversely affect conservation area surface       resources.\n\n``(C) The right-of-way shall not be located through or       under any area designated as wilderness.''.\n\n(c) Preservation of Transmission and Utility Corridors and       Rights-of-Way.--The expansion of the Conservation Area       boundary under the amendment made by subsection…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…explorers--men whose dreams were too big for  the low horizons of the Old World. Our ancestors settled a new  continent, tamed a frontier, raised up a great civilization from the  wilderness, and planted our flag on the Moon. It was American genius  that connected the world, first  through the great steam engine, spanning this continent from coast to  coast,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]