[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…unique educational and recreational  opportunities for children and families and help connect the public to  our food systems. That is what I love about agritourism. It is a win- win for everyone. Farmers get to share their work and support their  farm, and visitors learn about where their food comes from, who grows  the flowers they send on Mother's Day,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…coaching, and resources to individuals who happen  to be almost entirely women-based businesses in opening and operating  family care childcare businesses.\n\nNow, this is a win-win-win. We create more jobs in childcare, allow  more parents to enter the workforce, and lower the cost of care through  increased supply.\n\nAs a Congress, we need to work together…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…rising costs that we all live with. We  should take on corruption no matter where we see it, no matter the  party.\n\nThe last thing that we need is a bunch of wimps looking for a win-win  every time. Not every fight is going to have a win-win.\n\nThere are villains in this story, in this society of ours, who have  made life miserable for so many. You can call…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…emergencies, hazardous materials incidents,  and other life-threatening events each year.\n\nMr. Speaker, I cannot think of a more critical and all-American cause  or more of a win-win than having the backs of our fire firefighters and  our servicemembers.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695629/filling-firefighter-positions-on-military-installations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…individuals, and we want to give them a massive,  beautiful tax cut and make them even more richer and powerful. They  will love us, and they will keep us in power. What a win-win, to give  away the Treasury to the richest people in this country.\n\nBut they had a problem. There was no filibuster-free, fast-track lane  that allowed creating a deficit.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…using.\n\nOverall, it is estimated to cost less than a fraction of 1 percent of  the company's annual revenue and facilities have years to comply.\n\nThis should be a no-brainer, a win-win scenario of reducing cancer- causing emissions and promoting innovative technologies to modernize  industry and provide regulatory certainty. I really don't understand  why…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…expands the Sloan Canyon National  Conservation Area by 9,290 acres to enhance the preservation of the  desert landscapes and habitat unique to southern Nevada.\n\nI call that a win-win-win. It is no wonder that my legislation  received bipartisan support in the House Natural Resources Committee,  and I thank my colleagues for that. It is also supported by…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…sell the reversionary interests at fair market value.  The conveyance is supported by the Department of the Interior.\n\nThis transparent and targeted land conveyance would be a win-win for  the Federal Government and the community in Sacramento.\n\nI thank Representative Matsui for her leadership. She has been  working on this bill for several years. I know…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…efficiency of widely  used cement, and similar materials while achieving measurable  greenhouse gas emissions reductions in their production processes. We  like to call this a win-win.\n\nH.R. 1534 would also accomplish this goal by directing the Secretary  of Energy to support research, development, and demonstration of  innovative technologies that could…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…for long-term  certainty. However, I firmly believe that we can find a solution that  protects these sanctuary resources and treats all stakeholders fairly.\n\nWe can find a win-win solution that supports innovation, continues to  support our local economies, and ensures that the American taxpayer  gets a fair return for use of our natural resources.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…waste  emissions charge, also known as the methane polluter fee, but also  prevents the EPA from ever taking similar action in the future.\n\nControlling methane pollution is a win-win for all Americans. It is  unfortunate that my Republican colleagues are willing to throw all of  this away in order to line the pockets of their corporate polluter  friends,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…admiration. We ought to say that we  should do everything we possibly can to support them, everything they  need to win. We have to finish that sentence: Everything they need to  win.\n\nThe win must not be through some sort of appeasement. It will not  help. It will not work. Putin will go on to seek other territory and  other land. He is very hungry for that.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…emissions by giving  them a path to reclassify as area sources once they meet that  threshold. That is not only good for industry, it is good for our  environment. It is a true win-win, Mr. Speaker.\n\nNow, here is some background. Under section 112 of the Clean Air Act,  facilities that emit over 10 tons of a single hazardous pollutant, or  25 tons of a combination,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…doesn't  love that when we do it.\n\nIf we put things on par, companies will almost, in every  circumstance, choose to do business in the U.S. and we get more  revenue. It is a win-win, and it is not what you are being lied to  about.\n\nThis is good, sound, competitive tax policy that will strengthen our  Nation, grow our revenue, and make it easier for business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…to  complicate our adversary's targeting. We can't do either of those with  only the Air Force's planned buy.\n\nWe avoid war by ensuring that our enemy knows that we will win. We  win with both the F/A-XX and the F-47, not one or the other.\n\nDon't take my word for it. Our high-ranking uniformed leaders,  warriors all, shared with us the importance of…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…innovation back  to China, often through stealing trade secrets, breaking export control  laws, or violating conflict of interest policies.\n\nThese talent recruitment programs are a win-win for China. China wins  twice. First, U.S. taxpayers are funding their research, not China;  and, second, China then uses the research it would not have otherwise  had to advance…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mineral in the mine, yet it is the biggest untapped copper- nickel find in the world.\n\nWe will not rely on China or other adversarial nations. We can do it.  This can be a win-win-win. If anybody knows how to mine, it is the  Minnesota miner. It is better in our backyard than China, Russia, or  other adversarial nations.\n\nMinnesota has been mining for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…and noble professions this country  has to offer, and southern Minnesota is the home to some of the best  dairy farmers and manufacturers in the world.\n\nThis legislation is a win-win for school-age children and dairy  farmers across this country. I am proud that we now, once again, can  say loudly: ``Milk: It does a body good.''\n\nMr. Speaker, I encourage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…would prevent them from  receiving these updates.\n\nIt will also reduce postage costs, allowing the VA to spend money in  ways that better serve our Nation's heroes. It is a win-win overall.\n\nMadam Speaker, I thank my colleagues, Mr. Van Orden and Mr. Tran, for  their help in introducing this bill as we continue to work to improve  the lives of veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…these  works to Alaskans and the hundreds of thousands of people who come to  my great State to visit who want to take home a piece of Alaska Native  heritage. So it is a win-win-win for everybody, but it is an economic  driver of a lot of small villages in my State.\n\nAnd by the way, carving, harvesting walrus ivory is completely legal  under Federal…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…navy went all  the way around Australia just a couple of weeks ago.\n\nFriedman naively references Chinese Communist Party talking points:  ``healthy interdependencies'' and ``win-win.'' These guys always use  that ``win-win'' and ``We will rise together.'' Yet he ignores the  military menace of the CCP abroad and its genocidal tendencies at home.\n\nBut,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…county  and the Tribes for years to come.\n\nAt a time when Congress is exploring all opportunities for cost  savings, the La Paz County Solar Energy and Job Creation Act is a win- win. The county receives opportunities for jobs and economic  development, and the Federal Government receives a fiscal benefit for  otherwise undeveloped lands.\n\nMy neighbors…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}]