[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…march on the  Capitol.\n\nNow, the third reason it is absolutely so important is that history  can't just be written, in this case, by the winner. And that is, Donald  Trump did win the election. It was a fair-and-square election, despite  all those things I just said that are true--not just that I believe are  true.\n\nBut what happened on that day was shocking…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Madam President, families lose, and billionaires win.  That is the Republican plan. It is a plan that slashes $1.5 to $2  trillion from programs that families depend on. And why? To fund tax  cuts for the very richest Americans.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…ability to have a job in the future.\n\nWe are going to wind up with China dominating the auto industry and  the planet. That is what we are voting on tonight: Who is going to win  in the long term?\n\nBy the way, the Republicans have a comprehensive plan to hand this  entire industry over to the Chinese. They are going to do away with all  the tax breaks…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…came as no surprise when the family turned their moment of good  fortune into a lifetime of impact. It is often noted that their  generosity and values didn't change after the win, only the size of  their checks did.\n\nWith their winnings, Al and Carmen created the Castellano Family  Foundation to uplift San Jose's Latino community. Through the years,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…It will be at the hands of  Republicans who vote ``yes.''\n\nThe top 1 percent are salivating over getting an extra $300,000 a  year because of this dangerous bill. Billionaires win.\n\nMr. Speaker, 17 million Americans will lose their health insurance.  This is the largest healthcare cut ever.\n\nMr. Speaker, 42 million Americans are at risk of losing food…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693181/one-big-beautiful-bill-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…all. He teaches us that love of  the stranger can lift us all and defeat hatred. Or, as Rabbi Ulman and  Mr. al-Ahmed have titled their visit around the world, ``The Light Will  Win.''", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…strategies_cost-of-federal-mandates-to-retain-fossil- burning-power-plants.pdf\n\nHttps://energyinnovation.org/wp- content/uploads/Coal-Cost-Update.pdf\n\nMr. Speaker, we cannot win the AI race of the 21st century with  energy policies from the 20th century. Not only is it bad policy, but  it is soul crushingly expensive to do so.\n\nHardworking American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Mrs. McCLELLAN. Mr. Speaker, on January 6, 2021, a crowd of people  stormed the Capitol seeking for the second time in American history to  take by force what they could not win at the ballot box.\n\nCapitol Police were beaten as they tried to protect Members of this  body and the Vice President of the United States from harm.  Congressional leaders begged…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…which is why the security guarantees are so important.\n\nIndeed, our leadership here is a strategic and moral imperative, but  this administration has never said who it wants to win this war. It has  blamed Ukraine for starting the war. It has put absolutely no pressure  on Putin to negotiate in good faith while it paused aid to Ukraine.\n\nThe President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I congratulate Dearborn's Divine Child High  School for winning the Division 4 State championship with a thrilling  23-22 win.\n\nAfter a dominant season, they rose to the moment at Ford Field to  earn their first State championship in 40 years. It was an incredible  game and an accomplishment that these…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…possible tripwire for       an accidental apocalypse.\n\n``Getting trapped in an argument about the cheapest way to       keep ICBMs operational in their silos is ultimately no-win,''       Daniel Ellsberg and I wrote for The Nation in autumn 2021. We       added: ``Better sooner than later, members of Congress will       need to face up to the horrendous…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and creating informed practices for our  agencies, institutions, and researchers to implement, the CHIPS and  Science Act is continuing the innovation ecosystem necessary to win  into the mid-21st century.\n\nFrom my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Nutrition       Programs. A much smaller transfer for WIC does not undermine       performance of the Child Nutrition Programs and raises no       such concerns.\n\n22. Amid this no-win quandary and upon further       consideration following the Courts' orders, USDA has       determined that creating a shortfall in Child Nutrition       Program funds to fund…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dollars--to the national  debt. I think of my grandson when I think of that. They want to make  the biggest cuts to Medicaid ever. This is the Republican agenda:  Billionaires win. American families lose.\n\nRepublicans have gotten by so far with a bunch of empty and deceptive  promises that none of the outrageous cuts they propose will come back  to harm…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Congratulations to Lincoln High School and Sprague High School\n\nMs. BONAMICI. Mr. Speaker, I rise today to celebrate and congratulate  two high school teams on their recent cochampionship win of the We the  People: The Citizen and the Constitution competition.\n\nRun by the Center for Civic Education, this competition tests the  knowledge of high school students from…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…vote, as do 73  percent of Democrat voters.\n\nDemocrat politicians standing here today oppose it, just as they have  opposed every election integrity measure.\n\nDemocrats cannot win on their ideas because their agenda has made  life harder for American families.\n\nThe Democratic Party knows that cheating is their only path to  victory. Their goal is to replace…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700002/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…his  way to achieving the Division I State Title for High Jump at the State  Track and Field Meet. Nathan overcame the challenges posed by intense  competition in his effort to win the title.\n\nIn pursuing the State Championship, Nathan defeated his opponents  with an impressive jump of 6 feet 9 inches. His hard work and  dedication, both on and off the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…they actually increase  depression, anxiety, and suicidal ideation among those for whom these  medical procedures are performed.\n\nThe purpose of our military is to fight and to win wars. It is to  create warfighters, killers, not to participate in the latest  progressive fad.\n\nUnder the Biden administration, we diverted money away from readiness  and lethality…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…stand on  equal footing when going toe-to-toe with the IRS. Without the guarantee  of rights, taxpayers are put in a situation where the  IRS is essentially saying: Heads, I win. Tails, you lose.\n\nMr. Speaker, the Ways and Means Committee has been working tirelessly  to strengthen taxpayer rights. This year alone, the committee has  approved several…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who scare the crap out of us,  we have still got to do the right thing. Someone running for the United  States Senate today, in your first term--if you are blessed enough to  win--you are going to have to deal with the fact the Social Security  trust fund is gone, the Medicare trust fund is gone. Our preliminary  math says in 2033, the first year that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the intelligence cooperation that  members of his administration had actually wanted to end.\n\nAs our colleagues will recall, the President observed last month that  Ukraine can win--the President said Ukraine can win--and unlike some of  his advisers, the American people are indicating in clear majorities  that they think we ought to help.\n\nBy one recent…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are winning and regular  Americans don't seem to have a chance.\n\nThe Republican budget ends their reconciliation bill. Their tax cuts  are going to make sure the rich always win.\n\nNow, Trump's approval ratings are the lowest of any President in the  last 80 years. In the latest poll released today, Americans give him  F's. He is getting F's on the economy.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Volleyball Playoffs, the Calvert  Senecas overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, Tiffin Calvert defeated the  Monroeville Eagles to win the state volleyball championship. The  members of this very special team have shown that their sport requires  an individual effort for a team result. Their hard work and dedication,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…job in rising to the  leadership of her party as a member of the socialist wing, and they are  about to elect a socialist mayor of New York. I think Mr. Mamdani is  going to win. They have said to our request--let's just continue the  status quo for 6 more weeks--they said: We will give you 6 more weeks  if you will give us $1.5 trillion.\n\nThat is what…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Frozen Four.\n\nAfter a slow start to the season, including a 0-9 start in Big Ten  play, the Nittany Lions persevered to be one of four Big Ten teams in  the tournament. With their win Sunday evening, they are the last Big  Ten team standing.\n\nI congratulate Guy Gadowsky, head coach of the Nittany Lions men's  hockey team, as well as all of the talented athletes…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…greatest of our generation.  Let's inspire this generation and the generations that follow by  recognizing these standout citizens--some of them citizen warriors who  helped us win World War II--so that when future Americans are called to  greatness, they, too, in Clyde Milligan's words, will do anything for  their country.\n\nOn this monumental birthday,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…relay teams  in their event.\n\nIn pursuing the State Championship, Alyssa Webb, Aubrey Abeyta,  Jasmine McDearmon, and Olivia Hudson defeated their outstanding  competitors to win with an impressive time of 1:24.25. The members of  this very special team have shown that their sport requires an  individual effort for a team result. Their hard work and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693428/special-recognition-of-oberlin-high-schools-girls-4x200-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a testament to the strength  of their program as well as their personal strength, talent, and  determination.\n\nCarter Starocci made history by becoming the first wrestler to win  five individual NCAA titles, while Mitchell Mesenbrink claimed his  first national title with an outstanding performance.\n\nBeyond individual triumphs, the Nittany Lions made…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689222/congratulating-penn-state-wrestling"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Knights defeated powerhouse  Springfield College in a thrilling straight-set sweep of 25-20, 25-23,  and 27-25, capping an extraordinary 35-1 season. This victory wasn't  just a win on the court but the culmination of years of hard work,  perseverance, and belief.\n\nLed by veteran Coach Tom Peterson, who has now guided three different  programs to NCAA titles,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Academy.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force, the United States Air Force.\n\nGuided by the motto ``Aim High . . . Fly-Fight-Win'' the U.S. Air  Force is the world's preeminent force in air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692699/congratulating-kai-agyemang"}]