[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…balance the planetary emergency with the  need for people to be able to cool and heat their homes and keep their  lights on and all the rest of it.\n\nAll of that is out the window. Why? Because clean is cheap and cheap  is clean. Clean energy is now the cheapest kind of electricity that we  can get on the grid in any kind of reasonable timeframe.\n\nThere…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…increases in their healthcare costs,  millions of people will suffer, and healthcare premiums will rise to  incomprehensible levels.\n\nJust this week, Connecticut launched a window-shopping tool that  allows residents to preview their healthcare options for next year. It  allows consumers to see how costs compare to next year's costs. Very  frankly, the…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3390, the Bringing the  Discount Window into the 21st Century Act, sponsored by Representative  De La Cruz.\n\nIt has been almost 3 years since we saw the dramatic failure of  Silicon Valley Bank, Signature Bank, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…powerful party can ram whatever it wants through this body without  constitutional procedure, without judicial safeguards, and without  compromise.\n\nSo they broke wide open the window of what can be brought through the  Congressional Review Act in time. It used to be just a matter of  usually just a couple of months--depends on the change in elections--60…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…guy in a  trash can rooting around, and I don't say a word. Kevin knows me. I  look in the rearview mirror, our eyes meet, and he immediately stops  the car. I roll down the window. He knows that I am going to want to  try to see what is going on here three blocks from my home. I am trying  to live my values.\n\nI say, ``Hey man, you all right?'' and he…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. This weekend, President Trump put out a social  media post conflating the actions of a small group of people who broke  a window, broke a couple of windows, at the Federal building, with the  thousands of peaceful protesters that were exercising their  constitutional right to fight against fascism, their…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699509/we-will-not-back-down"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…numbers with the American people; and in the process, we are tearing  down that second pillar that reconciliation will never be used to  extend deficits past the reconciliation window of 10 years--because,  you see, that has never been allowed by either party, never done.\n\nIn fact, the ruling in 1996, the one that tore down that it can only  be used for…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…require community input and  Tribal consultation.\n\nI strongly urge my colleagues not to continue this race to the  bottom. Republicans have already thrown so many norms out the window.  Republicans have already disregarded Democrats in all of their  legislation and have started this radical appropriations process, where  it is party line, Republican only.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…healthcare, including the subsidized ACA  policy. Removing subsidies will ultimately lead me to financial  bankruptcy.\n\nThere are more stories just like this, and they are a window into how  the chaos and unpredictability of this administration is making it  harder on working families to succeed and thrive.\n\nSince January, we have dealt with the uncertainty…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…released without an apology when they realize:  Oops. You actually are an American citizen.\n\nImagine agents with full kit on, no identifying information, masks,  breaking your car window when your 2-year-old is in the backseat.  Imagine peacefully protesting and having rubber bullets shot at you.\n\nImagine masked men detaining a 5-year-old who is coming home…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…have had the Congressional Budget Office  and we have had these rules, as imperfect as they may be, that we have  to follow, that things have to be paid for within a 10-year window.\n\nCurrent policy baseline means that rule goes out the window. If we  think that, in establishing this new precedent, this will be the only  time it is ever used, that is crazy.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…Charlotte's Web.\n\nBorder Patrol agents engaged in extreme racial profiling, excessive  force, and brutal tactics, spreading fear in our community.\n\nIt was fear that shattered the car window of a U.S. citizen born in  Honduras. He was thrown on the glass-covered ground in handcuffs after  he already identified himself to agents.\n\nIt was fear when more than 30,000…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the back of her car to the  side of her car to the front of her car and shot through the front  windshield and then moved to the side and shot two shots in the  driver's side window. That is what happened.\n\nAlex Pretti was out with his cell phone camera observing what was  going on and was shocked, I am sure, to see that an ICE agent was  pushing a woman…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to adopt a resolution of disapproval.  Republicans have tried to disapprove of the withdrawal, but they  weren't able to bring it to the floor. Congress didn't ask, and the  window of disapproval closed.\n\nNow they are trying to use the Congressional Review Act to get a do- over. The CRA wasn't created to overturn a public land order,  especially one that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Parliamentarian determine privilege for the purposes  of the CRA. But Republicans are now threatening to throw that process  out. And the consequences of throwing the rule book out the window will  be very, very serious, but it is not too late to turn back.\n\nRepublicans must understand exactly what they are doing. So, today, I  think it is important to establish…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…confirming  that this 2024 Record of Decision is a rule under the Congressional  Review Act. That opinion, printed in the Congressional Record in  September, triggered the CRA window that allows Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…extends if you are retired, and you happen to have  the ability when you are retired to purchase that retired service  weapon, you have a 6-month period in which to do that. The window is  very short.\n\nGSA, under the bill, has every opportunity to come up with the rules  and regulations related to this. A lot of this is distraction. This is  the same bill…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fact that Republicans often say they believe in States' rights, but  when a State like California actually chooses a policy they don't like,  they throw that principle out the window.\n\nWhen Congress passed the Clean Air Act, it gave States that had  standards before 1966 the right to apply for a waiver. Congress decided  that. For 50 years, California has…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…working for every person receiving their benefits. A decade  from now, that is going to fall to 2.7, 2.6. Then, it really starts to  crash. When we start to look at the 30-year window, we are down to  about 2.4. That may not mean much to you, but trying to make these  numbers work, it can be done. It is just hard.\n\nYou are going to hear people come behind…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…nonprofit service has offered  Americans unfiltered, gavel-to-gavel coverage of their government in  action. However, millions of streaming households were left without  this vital window into the debates and decisions which shape our  Nation.\n\nBy adding the C-SPAN networks, YouTube TV and Hulu + Live TV are  making a strong and, I hope, enduring commitment…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697293/c-span-goes-streaming"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…other.\n\nNow, it really shouldn't matter. I am against gerrymandering wherever  it occurs no matter which party stands to benefit, but this present  uncertainty has created a window of opportunity for a bipartisan  agreement to bring this madness to an end.\n\nMr. Speaker, I have introduced H.R. 4889 to ban mid-decade  redistricting in every State in the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things that  actually would affect the crushing debt that CBO just told you is  coming screaming at you?\n\nRemember, the CBO report here basically says in this 9-year budget  window, 10-year budget window, your country goes over 120 percent debt  to GDP, surpassing World War II.\n\nAre we going to fix it by little incremental things, or are we going  to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…turnout special election, asking a partial electorate to overturn the  will of our full electorate. To further suppress voter participation,  he has thrown election rules out the window in a hyper-accelerated  timeline unlike anything our State has ever seen, meaning fewer polling  places, fewer notifications to voters, and at least at first a digital- only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…there are some bad apples along the way, that they get held  up for greater scrutiny.\n\nBut if this becomes a straight skins-and-shirts game, then all  discretion is out the window; then all oversight is really out the  window; then the responsibility of scrutiny goes out the window because  it is one team versus the other team, with nobody looking out…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…compete  with us. That sparked an idea, and then we got our economists to do the  modeling.\n\nIt creates about $150, $160 billion of additional tax receipts in the  10-year window, but in the second 10-year window, it explodes. We wrote  an immigration reform bill, moving the American immigration system to a  talent-based system, but it has the word…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…vision is clear: America is building again.\n\nMy Judicial Review Timeline Clarity Act, which is included in this  vital permitting reform package, establishes a strict 60-day window to  challenge section 404 permits once the Army Corps of Engineers grants  authorization.\n\nSection 404 of the Clean Water Act exists to safeguard our waters,  not empower radical…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Congressional Budget Office.  Apparently, it didn't make me particularly popular with a few people,  which actually provides me a perverse joy. If you read it, in the 30- year window, it looks like if we do all this without an attempt to pay  for, if we drive up interest rates by 1 percent, in the 30-year window,  it looks like you break CBO's budgetary…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We have some great data, and I  won't make you live through my charts that show expensing, research and  development expensing and expensing. It has a cost in the 10-year  window.\n\nHopefully, everyone has listened to my dozens and dozens of speeches  walking through what expensing is. Expensing is nothing more than  depreciation. Do you take the expense…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Even if you do the CBO's number of $80 billion for 3 years of  subsidies on top of subsidies, and then you put in the 10 years of  interest, you know, because of the interest window, this costs $111  billion.\n\nUnderstand what the left is telling you. They are basically saying  they don't give a damn about healthcare. It is financing. If we wanted  to change…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the rules and  pass the bill (H.R. 3390) to amend the Federal Reserve Act to require  the Board of Governors of the Federal Reserve System to carry out a  review of discount window operations and to implement improvements to  such operations, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}]