[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…according to the chairman, millions of women, 2 million, and  7,000 centers that are now going to be able to access TANF dollars.\n\nThese TANF dollars were meant not to provide baby wipes and diapers  for babies up to 6 months old, but to help a woman navigate her way  into the workforce to get job training, to have cash assistance until  she can get on her…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…The practice of American religious organizations assisting in legal  immigration goes back more than a century, and President Trump's  rescission package that is before us wipes out funding to a dramatic  degree for virtually all of them.\n\nHebrew Immigrant Aid Society has had to lay off hundreds of staff.\n\nWorld Relief said this:\n\nPresident Trump [has]…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…catastrophic. It is not policy. It is punishment.\n\nLet's talk facts. It slashes Medicaid, cuts Medicare, and dismantles  the ACA. It shutters rural hospitals, closes nursing homes, and wipes  out health centers. It takes food off kitchen tables, throws clean  energy workers out of jobs, and spikes utility bills. Why? So  billionaires and oil companies can  cash…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 2269, the WIPPES Act.\n\nThe improper disposal of nonflushable wipes can damage plumbing and  lead to environmental contamination and pollution. Environmentalists  from across the country have expressed the need for manufacturers to  clearly…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…mismanagement of the White House.\n\nThis is not fiscal responsibility. It is moral failure. This bad bill  pulls millions of children out of school, leaves small farmers without  tools, wipes out access to clean water, and cuts off contraception for  women and girls.\n\nMeanwhile, our adversaries are stepping in. China and Russia are  seizing influence as we retreat.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interest rates are going to explode.\n\nRemember, there are datasets--I presented them here on the floor-- that just a single point of interest going up over the next decade  wipes out almost all the good we are trying to do extending the tax  reform of 2017.\n\nMr. Speaker, there is a way to make this work, and I am mentally just  exhausted. Maybe I need…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…was distributed. These  critical volunteers also ensure families receive essential items for  their infants and young children to include: formula, diapers, pull  ups, baby wipes and wash, as well as age specific clothing. In 2024,  more than 44,000 diapers and 9,500 items of clothing were distributed.  These volunteers have a `can do' attitude no matter…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…addresses a costly and growing  problem in our communities. Every year, Michiganders' water utilities  spend over $18 million responding to clogs and damage caused by  nonflushable wipes. These products, when disposed of incorrectly,  create massive blockages in our wastewater systems, which lead to  backups, environmental hazards, costly repairs, and, ultimately,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692752/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…was  distributed. These critical volunteers also ensure families receive  essential items for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers have a `can do' attitude no…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…was  distributed. These critical volunteers also ensure families receive  essential items for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers have a `can do' attitude no…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Requirements.--\n\n(1) Cylindrical packaging.--In the case of a covered       product sold in cylindrical or near-cylindrical packaging,       and intended to dispense individual wipes--\n\n(A) the symbol and label notice shall be displayed on the       principal display panel in a clear and conspicuous location       reasonably visible to the user each time…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}]