[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…from the wild fish  population.\n\nThe planned method within the Great Lakes is to clip the adipose fin,  the small fin on the dorsal side near the tail, combined with a coded  wire tag, or CWT. A CWT is a 1.1 millimeter-long, tiny stainless steel  wire marked with serial numbers denoting a specific group of fish.\n\nThis tag can be extracted after recapture,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Italy in World War II.\n\nIt was in April of 1944, in the Italian countryside, that Squires  braved automatic gunfire, artillery, and mortar  fire to carry messages through barbed wire and over minefields, to  organize troops, and bring reinforcements to the front line. With total  disregard for his own well-being, he fought German soldiers day and  night.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is  worse?\n\nSecond, what is the plan to reduce decades-old technology, equipment,  and infrastructure at our airports?\n\nOne of the reasons Newark had a problem was a copper wire burnt. Did  they ever hear of fiber optics over there at the FAA?\n\nThree, what is the plan to quickly fill critical leadership  vacancies?\n\nMembers have been fired at the FAA,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have only been a high school for 4  years--the Cardinals won their first State title, capping off the  season with a 23-5 record.\n\nThe championship game itself came down to the wire. With two outs and  the tying run in scoring position, the Cardinals recorded the final out  and sealed the win.\n\nI congratulate Gainesville High School on its historic championship-…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…boulder. It stands where the government  locked up thousands of Japanese as so-called enemy aliens.\n\nMy great-grandfather, my GG, was one of them. He was locked behind  barbed wire while his son, my grandfather, joined the Military  Intelligence Service in service to a country that saw him as the enemy.  That small stone marker is all that remains to tell…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Alcatraz and  think to themselves: How could our government do this? How could our  leaders do this?\n\nWill students on school trips one day walk through cages behind razor  wire, trying to comprehend the brutality that took place there?\n\nMore importantly, these future generations of Americans will look to  us, the Congress, to see what we did to try…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, 80 years ago, over 120,000 Japanese  individuals were stripped of their rights and forced into barbed-wire  camps because of the way they looked and the language they spoke.\n\nMy great-grandfather, my GG, was one of them. He was taken from his  home on Maui and imprisoned not for…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Netanyahu government campaign has continued, and thousands more  homes have been flattened by controlled demolitions. That literally  means the military folks go up to a home, wire it, and blow it up. It  is a home. Thousands more have been demolished by bulldozers. Israeli  forces have bulldozers, and they flatten the home.\n\nYou know, it is too late,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…counts in a Federal  corruption investigation. This is his former chief of staff. She left  the office at the end of last year.\n\nThe charges include conspiracy to commit bank and wire fraud, bank  fraud, wire fraud, conspiracy to defraud the United States and obstruct  justice, subscribing to false tax returns, and making false statements  to the FBI. The…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…over their garrison, it symbolizes home, and I promise you that  last mile may feel like a sprint to get to that cloth.\n\nWhen a platoon returns from a patrol and reenters the wire, she  symbolizes safety.\n\nImagine what our enemies would think of our strength and resiliency  if we ever allow flags flown contrary to the principles of America.\n\nI promise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…advertisers to demonetize and  suppress American political speech by naming the ten riskiest cites to  include the New York Post, the Federalist, Newsmax, The Blaze, The  Daily Wire, RealClearPolitics, Reason, One America News Network, The  American Spectator, and The American Conservative.\n\nMr. Chair, 98 percent of the political donations coming from the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699045/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…accused of financing Islamic terrorism.\n\nYou can't make this up. It goes on and on. So here is more. For  months, a new publication in the State of Maine known as the Maine Wire  reported on a similar event taking place in Lewiston, ME, also known  today as Little Mogadishu. Gateway Community Services, founded by a  Somalian refugee, received $28.8…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…willing to wait another 20 years. You know what they did, something  just crazy? Instead of being patient and waiting for us to spend  billions of more dollars and run a piece of wire, they went out and  stuck up a satellite dish. Forty-eight hours later, for several hundred  dollars, they had broadband for the whole neighborhood, for the whole  what we call…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bigger than many  States.\n\nWe chased around, and we met with a number of people who said they  were tired of waiting. They weren't going to wait another decade to get  that wire or that fiber, whatever it was, to their chapter or to their  community so they could get broadband. They were doing something crazy.  They ordered a satellite dish, and 48…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…of 66 of 100.\n\nA Global Disinformation Index report on the online news lists the 10  riskiest online news outlets as the New York Post, The Federalist, The  Blaze, The Daily Wire, Newsmax, One America News Network, The American  Spectator, The American Conservative, Reason Magazine, and RealClear  Politics. They are all conservative.\n\nLeft-leaning sites…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. We are down to the wire here. In just a moment, the Senate  will vote on whether or not to keep the government open.\n\nRight here--24 pages. Not partisan. Not complicated. Simple.  Straightforward.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Wilner, Michael:       Los Angeles Times; Wilson, Mallory: Washington Times;       Wingrove, Joshua: Bloomberg News; Winkie, Davis: USA Today;       Winston, Kate: S & P Global; Wire, Sarah: USA Today; Wise,       Lindsay: Wall Street Journal/Dow Jones; Wiseman, Paul:       Associated Press.\n\nWolfe, Frank: Defense Daily; Wolff, Eric: S & P Global;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "French Hill", "party": "Republican", "sentence": "…money to make payments,  formerly starting out with cash. We wrote checks. We use debit cards  and ATM cards at the point of sale. We use credit cards. We can send  money by wire transfer or by an electronic check. The private sector  has innovated all along that continuum of financial technology, and  that is why today we don't want the Fed to drive…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…apparent legitimate or even profit-motivated criminal motive in the  operation of the facility.\n\nMeanwhile, Jesse Zhu, its operator, was receiving unexplained  payments via wire transfer from Chinese banks.\n\nAs I mentioned, the report concluded that we don't know if there are  any other unknown biolabs because there is no such monitoring system.  That…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}]