[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Mr. Neal for the time.\n\nMr. Speaker, time is up. The ACA tax credits are expiring December  31.\n\nThe ACA premium tax credits have provided healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698372/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…them to think more deeply about what we need to do  in the atmosphere that we are in now to protect Americans' Social  Security data that was mined by DOGE.\n\nMs. MOORE of Wisconsin. Mr. Speaker, I have no further speakers, and  I yield myself the balance of my time.\n\nMr. Speaker, I just want to thank my colleague for introducing this  very important piece…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3937, legislation introduced  by my colleague from Wisconsin (Mr. Tiffany).\n\nThis bill would authorize the conveyance of 14 acres of National  Forest System land to Tony's Wabeno Redi-Mix, LLC, a concrete company  based in northern Wisconsin.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Act to the 24 million Americans who are facing unprecedented enormous  health insurance premium hikes since we are extending healthcare stuff  today.\n\nIn my own State of Wisconsin, Mr. Speaker, 279,000 people receive  credits to help make insurance coverage affordable. In my State, for a  60-year-old couple not yet eligible for Medicare, earning $85,000…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I rise today in agony about the  severe flooding that recently struck southeastern Wisconsin, hitting my  district and my constituents hard.\n\nOn August 9, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695324/recognizing-milwaukees-severe-flooding"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank the ranking member for  yielding.\n\nMr. Speaker, if you are a Republican with misgivings about the  massive debt that this bill creates or if you are worried…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693187/one-big-beautiful-bill-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, did you grow up watching  ``Clifford the Big Red Dog,'' or ``Sesame Street,'' or ``Reading  Rainbow?''\n\nDid you spend time in ``Mister Rogers' Neighborhood,''…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692233/corporation-for-public-broadcasting"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Ms. McClellan for  yielding, and I thank Representatives McClellan and Clyburn for  initiating this Congressional Black Caucus Special Order on education.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…However, I would yield  30 seconds to the chair if he could let me know who voted for those  laws that were enacted in Georgia.\n\nMr. FROST. I yield to the gentleman from Wisconsin.\n\nMr. FROST. Reclaiming my time. I am curious what body wrote the  legislation, voted on the legislation, and sent it to the Governor's  desk?\n\nMr. FROST. I yield to the gentleman…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Chair, I rise in support of my amendment  No. 233 to the FY 2026 Defense Appropriations bill. I thank Chairman  Calvert and Ranking Member McCollum for including it in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694170/department-of-defense-appropriations-act-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I want to thank my colleagues in  the Congressional Black Caucus (CBC) for organizing this Special Order.\n\nAs we get ready for Thanksgiving, families across our…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I include in the Record a news  article titled: ``Child care providers reporting unnerving stakeouts''  by Kristen Taketa.                  [From the Union-Tribune,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I missed the Roll Call today.  Had I been present, I would have voted NAY on Roll Call No. 156, H.R.  2966.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692128/american-entrepreneurs-first-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, here we go again. Donald Trump  lost the 2020 election. He is aggrieved about that, and so now he is  peddling claims of fraud as a pretext to take over our elections…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700008/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank the gentlewoman from  Connecticut for yielding. It is so good to be here with her.\n\nI want to focus a little bit on the importance of bringing this to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…read the title of the bill.\n\nMr. Speaker, I rise today in strong support of H.R. 4305, the DUMP  Red Tape Act, introduced by Representative Wied from the great State of  Wisconsin.\n\nMr. Speaker, entrepreneurs across America are driving our economic  growth, but too often they are forced to fight through layers of red  tape just to keep their doors open.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…that       begins on or after August 1, 2026.\n\nMr. BOST.  983.\n\nMr. Speaker, I rise today in support of H.R. 983, offered by my  friend and colleague, the gentleman from Wisconsin (Mr. Van Orden).\n\nThis bill would reduce tuition costs for Montgomery GI Bill Selected  reservists by making them eligible for the same in-State tuition  waivers.\n\nWhen a veteran…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…tremendous amount of credit for persevering and  working and marshaling bipartisan, bicameral support. I thank him for  his tremendous leadership.\n\nI thank the gentleman from Wisconsin (Mr. Steil) for being a subject- matter expert and working in a bipartisan way to build a bipartisan  coalition for this moment.\n\nThere has been a lot of talk, Mr. Speaker,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…officials and shall update such information on a regular       basis.\n\nMr. BOST.   981.\n\nMr. Speaker, I rise today in support of H.R. 981 offered by the  gentleman from Wisconsin (Mr. Van Orden), my friend and colleague.\n\nThe bill would improve the information schools are required to give  individuals regarding GI Bill benefits.\n\nCurrently, schools…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…590th Field  Artillery Battalion, 106th Infantry Division during World War II.\n\nAt just 18 years old, while working as a stock clerk at Peterson Boat  Works in Sturgeon Bay, Wisconsin, Mr. Moddie answered the call to serve  his country by enlisting in the U.S. Army. Following basic training at  Camp Roberts, California, he was assigned to B Battery of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695299/recognizing-mr-john-moddie-on-his-100th-birthday-and-for-his-service-with-the-590th-field-artillery"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…spending time with us tonight.\n\nOn to the great island of Guam, I yield to the gentleman from Guam  (Mr. Moylan).\n\nMr. MOORE of Utah. I yield now to the gentleman from Wisconsin (Mr.  Grothman).\n\nMr. MOORE of Utah.  Maloy).", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Alabama. Madam Speaker, I yield 5 minutes to the  gentlewoman from Georgia (Ms. Greene).\n\nMr. MOORE of Alabama. Madam Speaker, I yield 2 minutes to the  gentleman from Wisconsin (Mr. Grothman).\n\nMr. MOORE of Alabama. Madam Speaker, I reserve the balance of my  time.\n\nMr. MOORE of Alabama. Madam Speaker, I yield myself the balance of my  time to close.\n\nMadam…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…the Packers hosted the immensely successful 2025 NFL  Draft, which drew an official attendance of 605,000 and delivered a  major economic boost in our region in northeast Wisconsin.\n\nMr. Speaker, as the Representative from northeastern Wisconsin and as  a lifelong Packers fan, I want to thank Mark Murphy for his many years  of dedicated leadership with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694121/recognizing-mark-murphy"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Intelligence, who crafted the STABLE Act, which is the base text that  led to this joint, good work between the House and Senate.\n\nI yield 3 minutes to the gentleman from Wisconsin (Mr. Steil).\n\nMr. Speaker, this bill, the GENIUS Act, and the bill we debated a few  minutes ago, the CLARITY Act, are all about consumer protection. There  are no rules federally…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. The following Senators are necessarily absent: the  Senator from Wisconsin (Mr. Johnson) and the Senator from Kentucky (Mr.  McConnell).", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699932/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the gentleman's  remarks.\n\nMadam Speaker, I yield to the gentleman from Mississippi (Mr. Guest).\n\nMr. MOORE of Utah. Madam Speaker, I yield to the gentleman from  Wisconsin (Mr. Grothman).\n\nMr. MOORE of Utah. Madam Speaker, I thank the gentleman from  Wisconsin and the issue that he brings up. It is something that some of  my State legislators are working…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise in strong support of H.R. 980.\n\nMr. Speaker, I thank the chairman and my friend and colleague from  Wisconsin (Mr. Van Orden) for including my bill, H.R. 913, the  Streamlining Aviation for Eligible Veterans Act, in the text of this  bill.\n\nThis bill will make meaningful improvements…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}]