[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Program, and as a founding member of the Grandview Youth  Court where he acted as treasurer and board member.\n\nBeyond his professional life, Jim led a life of faith, empathy and  wisdom. Jim could often be found spending time with his family,  watching a Kansas City Chiefs game or NASCAR race. He spent his life  uplifting and empowering the residents of Grandview…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that--in a democracy, the  legislature says: Here are the programs, here is how we want to run  them, and here is how we are going to fund them. It brings together the  collective wisdom of a large group that comes from every portion of the  Nation, like we do here--100 Senators from 50 States. We not only bring  our geographic differences; we bring our life…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…mystery       roster. She had so many interests and talents and loved to       share them with all of us.\n\nIn the past few days, I have been seeking some comfort and       wisdom in processing the loss of a woman that all of us loved       so much and loved you all in return.\n\nTwo such examples have resonated with me, and I hope they       can do the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…who will carry his laughter, his stories, and his  legacy forward.\n\nFor over 60 years Mr. Jenkins served Mount Zion Baptist Church as a  deacon, offering his time, prayer, wisdom and treasure. As a proud  member of Alpha Phi Alpha Fraternity, Inc. for 70 years, he embodied  the fraternity's ideals of manly deeds, scholarship, and love for all  mankind…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and difficult mission  in Caracas. The skill, professionalism, and courage are beyond question  of these men and women.\n\nBut military capability is not the same as strategic wisdom. The  ability to achieve tactical objectives does not guarantee beneficial  long-term outcomes, and executing a successful raid does not constitute  a plan for governing a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…repeated military strikes against civilians without congressional  oversight, and he has claimed that such military action is justified  because he himself, in his ultimate wisdom, has deemed these civilians  to be criminals, which leaves us to ask: What is to stop him from  arguing that anyone he dislikes deserves the same treatment? What is to  stop…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…finally as a  director on the Armed Services Committee. As so many in the Navy and  Congress can attest, our country benefited from his experience,  knowledge, judgement and wisdom at every post he was assigned to. He  retired from the U.S. Navy Reserve holding the rank of Commander and  received well deserved commendations and medals for his outstanding…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Boston Celtics have in the  NBA. The Los Angeles Lakers have 18 titles, as well.\n\nEighteen titles for a land-grant university in rural Connecticut  defies any conventional wisdom about big, high-paying university  programs. They just keep getting it done.\n\nCoach Hurley, who coaches the men's team, was rooting on Geno and the  women as loudly as anyone.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…instilled in each student that service is  sacred and that courage and empathy partners in every response. Her  gifts saved thousands of lives and comforted families.\n\nThrough wisdom and devotion, Heidi built a living legacy of  protection and care across our region. From all of us in northwestern  Ohio and every life touched by those she trained, thank…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698529/recognizing-heidi-hess"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…missed the mark  I think in terms of what law enforcement week should be all about.\n\nMr. Speaker, I appreciate my distinguished colleague's suggestion  that I may have the wisdom of somebody who has been here for 21 years,  but actually I wasn't here either. I got it just from the books myself.\n\nI was here, I should say, in 2021, when the Chamber was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…interconnectedness of our  world's indigenous peoples.\n\nThe estimated 476 million indigenous peoples spread across all parts  of our world are bound together by a common heritage, common wisdom and  common challenges that transcend often artificial lines of national  sovereignty. To recognize their international status and leverage their  collective knowledge, in…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…take it because conscience dictates, and conscience tells  one that it is right. I understand that my stance may be neither safe,  nor politic, nor popular, but I honor the wisdom of Dr. King and take  my stance because my conscience says it is right.\n\nIt is not unusual for the U.S. House of Representatives to vote  multiple times before passing important…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…included the voices  of sovereign Tribes when we made decisions. He taught me what true  government-to-government respect means. I remain deeply grateful for  his friendship, his wisdom, and his example--for his brotherhood. His  legacy reminds us that true leadership is measured not only in  achievements but in the strength and hope it instills in generations…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…agencies through  executive action that Congress had created.\n\nAs a reminder, Congress and only Congress, under Article I--this is  something that the Founders in their great wisdom decided was  important, the separation of powers, something we all learn early on.  Apparently, not too many of my colleagues on the other side have  incorporated this message:…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…sent to Mr. Goldberg.\n\nMr. Goldberg, by the way, deserves a Congressional Medal of Honor. He  is the hero in this story. He is the person who has had the courage and  also the wisdom and insight to understand that before you release this,  you need to do some checking. So he did his due diligence before  releasing information.\n\nMr. Goldberg, the person…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…pray for the safety of our  troops and Americans in the region. The world is safer today because of  President Trump, and we pray that the Lord would continue to give him  wisdom and discernment as he leads our Nation and continues to work on  bringing down tensions in the Middle East.\n\nGod bless President Trump, God bless our troops, and God bless…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with me in  Pennsylvania this weekend. His presence will be sorely missed.\n\nIn a town full of self-important figures, Doug was authentically  normal. I will certainly miss his wisdom, his sense of humor, and  incredible friendship. I turned the tables on Doug when it came to  nicknames. I affectionately named him the ``Governor of Jefferson,''  and he eagerly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…decades, including 22 years as the  senior resident superior court judge for the 24th Judicial District in  North Carolina. Throughout his tenure, he upheld the rule of law with  wisdom, with fairness, and with integrity.\n\nJudge Ginn's influence extended far beyond the courtroom, where he  not only delivered legal rulings but also mentored those around him,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Artificial Intelligence       Wisdom for Innovative Small Enterprises Act'' or the ``AI-      WISE Act''.       SEC. 2. ARTIFICIAL INTELLIGENCE EDUCATIONAL RESOURCES AND                     MODULES FOR SMALL BUSINESS…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to vote in Federal elections. Well over half the Democrats  voted in favor of 16-year-olds. Why would one want to do that?\n\nMr. Speaker, 16-year-olds have nowhere near the wisdom and experience  to make decisions as to who to vote for in elections. The only way you  would want to do it is if you want to manipulate these young minds in  the schools across…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the bill in its totality. We should look at  the difficulty of the task that we asked the chairman and the ranking  member to do. We should thank them for the hard work and wisdom that  they both exhibited in bringing this product to the floor.\n\nMr. Speaker, I do worry about the rhetoric around this bill. I  personally believe it is not intentional,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Larry once said that being elected to his office was one of the  greatest honors of his life, and it is clear he poured his heart and  soul into this work. He also showed wisdom and humility, knowing when  it is time to pass the torch.\n\nAs Larry steps into retirement, I thank him for his courage,  dedication, and service, both in uniform and in the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…neighborhoods and the people they protect, like our bill to send  local recruits to police academies if they agree to serve in the  precincts in their own communities.\n\nIt requires wisdom and experience, like the bill to give State and  local agencies the ability to rehire retired officers in civilian law  enforcement roles.\n\nIf you stand on the side of justice…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Fill-in-the-Blank Hospital. It is because Christians came  together to say that we should care for those who need help, but then  came in government.\n\nIn all of its infinite wisdom, government came in and regulated  healthcare, restricted our options and socialized the payments.\n\nNow what is the result?\n\nIt is an impossibility of the average American…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hope to those navigating  complex mental health systems. Whether advocating for youth mental  health, organizing community events, or mentoring families, Joanne is a  voice of wisdom, patience, and grace.\n\nIt is clear Joanne Gillespie has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…textile industry. She is the  proud grandmother of four, with ten great-grandchildren and five great- great-grandchildren. She is not shy to be blunt and share her many  years of wisdom with the younger generations.\n\nOn behalf of all of Western North Carolina, I congratulate Gertrude.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…communication between tribal governance and the General Tribal Council.\n\nA public servant in every sense, Jerry also served his Nation as a  judge on the Oneida Judiciary, where his wisdom, fairness, and devotion  to justice left a lasting impact.\n\nBeyond his public service, Jerry was a man of deep personal warmth  and abiding family values. He is survived by…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…then people who are       always strictly truthful are often respected for it and their       candor is accepted in deference to the values they espouse.\n\nTruth derives from wisdom and like wisdom it is more       valuable than much pure gold and sweeter than honey from the       honeycomb. The English philosopher Francis Bacon (1561-1626)       said…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…these cables in.\n\nMr. Speaker, NOAA had the assignment to come up with what the lease  cost would be to put these cables across a marine sanctuary. In all of  NOAA's infinite wisdom, they came up with a price tag of $40,000 to  $100,000 per mile, subject to inflation.\n\nNobody has gotten one of these permits. Nobody has put a cable across  because this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…reliable nuclear stockpile.\n\nConfirmation is critical to President Trump's ``peace through  strength and strategic deterrence'' agenda. Hopefully, my colleague  will see the wisdom in allowing this confirmation--this individual who  is clearly qualified to be confirmed today.\n\n107,  Brandon Williams, to be Under Secretary for Nuclear Security; that the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}]