[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Virginia region. Achieving 155 years of ministry is a milestone worth  celebrating. It is a privilege to work alongside this great  congregation in the community, and I wish them continued success  through faith, family, and service.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…across Congress will  continue to shape the institution he devoted his career to  strengthening. I thank Gene Dodaro for his extraordinary service to our  country and wish him continued success in the next chapter of his  public service.", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…it is important to  recognize educators like Ed Donnellan and encourage others to follow in  his footsteps.\n\nMr. Speaker, please join me in honoring Ed Donnellan and wish him  continued success in educating students on America's past.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…community, I commend Rajiv  Malhotra and the Infinity Foundation for their outstanding  contributions to Hindus around the world. I thank them for their  exceptional work. We wish them continued success in their quest to  foster better understanding and goodwill between Hindu Americans and  other faith communities.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…education. Her legacy is one  of integrity, dedication, and a deep commitment to the belief that  every child deserves a champion. We thank her for her remarkable career  and wish her continued success in all her future endeavors.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…congratulate the Gibson Center for Senior Services  for achieving this incredible milestone. Granite staters are grateful  for organizations such as the Gibson Center, and I wish them continued  success in the years to come.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…are also the reason  generations of young Vermonters have grown up with a love of the  outdoors.\n\nWe are deeply proud of all our Vermont athletes have achieved, and we  wish them continued success as they pursue the next chapters of their  athletic careers and beyond. Their accomplishments will inspire young  skiers and outdoor enthusiasts across Vermont…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700207/recognizing-vermont-olympians-and-medal-winners"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…those who have selflessly given back to our country  and community.\n\nI commend American Legion Post 667 for fifty years of leadership,  service, and sacrifice, and I wish them continued success in the  decades ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…not only strengthened the Igbo  community but have enriched the broader Dallas- Fort Worth landscape. I  congratulate them once again on this remarkable occasion and wish them  continued success, growth, and many more milestones in the years ahead.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Philippe  Charles, Matt Koppe, Alix Schnee, and many more.\n\nFrom the floor of the House of Representatives, we salute the Rotary  Club of Yonkers-East Yonkers, and I wish them continued success in all  of their good works.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…of our community.\n\nI am deeply grateful for Robert's contributions and proud to  represent him in Congress. I congratulate him on this well-deserved  recognition and wish him continued success in all his endeavors.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…It is my honor to congratulate Lee Vent on his recognition as a  Legacy Leader and for his decades of service. I thank him for  preserving the legacy of learning. I wish him continued success, and  may his actions continue to encourage others.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693884/recognizing-lee-vent"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Year for 2025. I  congratulate the Cocalico girls' soccer team on their accomplishments  in 2025 and coaches Hogan and Parmer, for their well-deserved  recognition. I wish them continued success both on and off the field.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…devoted woman of faith  and attends Saint Michaels and All Angels Episcopal Church in Dallas.  Trinka has truly made an incredible impact on the world around us, and  I wish her continued success for many years to come.\n\nIt is an honor to bestow my friend Trinka with the Patriot Award for  her exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…invite my colleagues in the United States House of Representatives  to join me in honoring the East Palestine Fire Department for  150 years of exemplary service and to wish them continued strength and  success for many years to come.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…years ahead. I extend my sincere congratulations to the City of  Brooksville and its residents on this historic occasion. I commend them  for 170 years of achievement and wish them continued growth, unity, and  success for generations to come.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Veblen continues to serve as a strong  example of South Dakota values and traditions.\n\nI offer my congratulations to the citizens of Veblen on its  quasquicentennial and wish them continued prosperity in the years to  come.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…community be recognized on the  national stage for telling her story through art.\n\nAs a fellow Parkland Trojan, I congratulate Kate, her family, and her  teachers, and I wish her continued success as she pursues her passion  and future opportunities.                          Recognizing Mario Landino\n\nMr. MACKENZIE. Mr. Speaker, I rise today to recognize…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…State  of Texas' Certificate of Appreciation. I am pleased to commend Carmen  for her dedication to serving and representing the City of Celina with  distinction, and I wish her continued success for many years to come.\n\nIt is an honor to bestow Cannen with the Patriot Award for her  exceptional service to the people of North Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Firestone, Sally Bollinger, and Leah Flinchbaugh for  their leadership in the Pennsylvania FFA. As they settle into their new  roles and prepare for bright futures ahead, I wish them continued  success in all of their endeavors.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…community a great place to live,  work, and do business.\n\nI congratulate the entire Rochester Area Chamber of Commerce family  on celebrating this incredible milestone, and I wish them continued  success for the next 160 years and beyond.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700187/recognizing-the-rochester-area-chamber-of-commerce-on-160-years"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…continues to grow, Gallery 209 stands as a reminder that  local art and culture remain essential to our community. I commend its  artists for sustaining this tradition and wish them continued success  for generations to come.                           Recognizing Swann Seiler\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Swann  Seiler, named…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…determination despite technical hurdles.\n\nTheir creativity and determination for success are truly inspiring. I  know both Ishan and Rikhin have bright futures ahead. I wish them  continued success as they pursue their academic and professional goals.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699627/recognizing-congressional-app-challenge-winners-for-indianas-third-district"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…their achievements both academically and athletically.\n\nOn behalf of the 12th Congressional District of Texas, I congratulate  the Fort Worth All Saints football team and wish them continued success  in all their future endeavors.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700254/recognizing-the-all-saints-football-team"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…ethic and  devotion to agriculture--making all of Pennsylvania's 11th  Congressional District proud. I congratulate the Garden Spot FFA on  their accomplishments, and I wish them continued success.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…work ethic, these students exemplify the character of  Pennsylvania's 11th Congressional District. I congratulate the Manor  FFA chapter on their accomplishments, and I wish them continued  success.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}]