[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…extraordinary  talent on a national stage.\n\nAgain, I want to congratulate Mira Cahalane for her exceptional win  and on being named this week's Champion of the Week. I wish her the  best of luck as she prepares to compete in the Jimmy Awards, and know  she will represent Northeast Ohio well.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691952/mira-cahalane-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Shamira A. Brown for her outstanding achievements and unwavering  commitment to science and education. She is a true asset to our  community and to our environment and I wish her the best of luck in her  research to come.", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…community. As a school that is so new, it has been amazing to see all  that it has accomplished. They are one of the first graduating classes.\n\nWhatever comes next, I wish them all the best of luck and success in  this new chapter of their lives.\n\nMr. Speaker, I congratulate the Independence High School Tigers.           Congratulating Loudoun County High…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…hole, J.J. sunk a 64-foot putt to clinch his first major  championship. The 31st Congressional District wants to congratulate him  on his incredible victory, and we wish him the best of luck at The Open  Championship in Northern Ireland.               Honoring the Retirement of Captain Daniel Regan\n\nMr. CISNEROS. Mr. Speaker, I rise to honor the retirement…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and the focus of  the power of the Sun's rays to destroy the debris.\n\nI am eager to see what our students continue to do with their company  in the future, and I wish them the best of luck in tackling  sustainability in space.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…and her tireless dedication  to the people who she serves. Her willingness to answer the call of  public service embodies the very, very best of civic leadership.\n\nI wish her the best of luck as she takes on this new role on behalf  of our community. I commend Treasurer Medrano for her invaluable  contributions to Dallas County and to the State of Texas.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Nathan's work in the  classroom, as he has inspired many students  and helped them build important life skills.\n\nI congratulate Nathan on this amazing achievement, and I wish him the  best of luck as he continues his fantastic career.            Congratulating Dominique Claseman and Ahren Jurgensen\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Dominique…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to congratulate the university leadership,  players, staff, and head coach Jerry Mack on an incredible season and a  hard-fought win. We wish them the best of luck in their upcoming bowl  game.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697964/congratulating-kennesaw-state-university-football"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…up  on our dreams. Through dedication, determination, and hard work he made  his vision a reality.\n\nMr. Speaker, I congratulate Mitch on being signed to the NFL. I wish  him the best of luck and continued success with the Seattle Seahawks,  of course, except when he plays the Green Bay Packers. He has made all  at St. Norbert, St. Norbert alumni, and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692195/recognizing-mitch-van-vooren"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Mr. Speaker, Tarquin's remarkable talent and dedication are an  inspiration to his peers and to his State. I congratulate him on this  incredible accomplishment and wish him the best of luck in his bright  future. I know this is just the beginning.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…concert and marching band,  and he is a Special Olympics volunteer and a member of the National  Honor Society.\n\nI thank Lucas for his commitment to service and wish him the very  best of luck as he embarks on this exciting new phase of life at West  Point.                         Congratulating Bryony Shipe\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "French Hill", "party": "Republican", "sentence": "…uplift his  community and help those around him build a stronger foundation in  finance.\n\nI look forward to seeing Keaton's continued impact in central  Arkansas  and wish him the best of luck in his bright future in banking.            Honoring John Edward Hain, Jr., on His 100th Birthday\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to honor John Edward…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…her shine in the next  chapter of her life where she will, once again, continue to thrive.\n\nMr. Speaker, we will miss her here, but I congratulate Lauren Fine  and wish her the best of luck in the next chapter of her life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…sport has allowed them to be part of  and said that their team works to be professional in defeat and  gracious in victory.\n\nOn behalf of the Seventh District, I wish them the best of luck in  Houston.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689758/congratulating-alexandria-high-school-robotics-team"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…job done. The most important  thing that we know is that Jack is a true friend, and I can say that  from personal experience. We are all going to miss him, and I wish him  the best of luck as he begins his new chapter in life.\n\nMr. GRAVES. Mr. Speaker, in closing, naming the House Press Gallery  after Frederick Douglass is going to honor his commitment…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…rebounds, and 2 blocks.\n\nOn behalf of everyone in Pennsylvania's 13th District, I congratulate  Thomas and his parents, Jennifer and Ryan, on this incredible victory.  I wish the best of luck to Thomas and the entire Florida Gators team in  the national championship game tonight.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…strength, and an unwavering commitment to  victory.\n\nI am proud that their hard work has paid off. As these talented  students prepare for their next endeavors, I wish them the best of luck  and blessings for an even brighter and more victorious future.\n\nGo Bearcats.\n\nIn God We Trust.                  RECOGNIZING GORDON LONGHORNS BASEBALL TEAM\n\nMr. WILLIAMS…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}]