[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…people.\n\nAnd so that brings me to my vote this week.\n\nI strongly oppose combining Homeland Security funding with the other  important Appropriations bills in this package. I wish that it had not  been tied to funding for the Departments of Labor, Health and Human  Services, Education, Transportation, Housing and Urban Development,  Treasury, State, and…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…named Career Fire Chief of the Year in  2024.\n\nCongratulations to Chief Johnson on his exceptional career. We thank  Chief Johnson for all his service to our community, and we wish him a  happy retirement.      Celebrating Independence High School Varsity Winter Guard's 2025                       Scholastic State Championship\n\nMr. SUBRAMANYAM. Mr. Speaker,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Black Clergy of Westchester County. He has done  all of this with his wife, Aro Denise Edwers, as his life partner, and  all of this was done in a mere 65 years.\n\nMr. Speaker, I wish a happy birthday to Bishop Edwers from the floor  of the House of Representatives.                        Recognizing Shoreline Publishing\n\nMr. LATIMER. Mr. Speaker, in a world…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…reunion.\n\nMr. Speaker, I look forward to continuing to work with the Korean- American community in my district and across the country to make these  reunions a reality, and I wish everyone a happy Korean-American Day.                                 Immigration\n\nMr. SUBRAMANYAM. Mr. Speaker, my office has been working with so many  constituents who have…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Presidency of Mr. George Bush, but  now, looking back over the times from which we have entered, I have to  give him credit where credit is due. He gave a speech that day that I  wish my Republican colleagues would take the time to listen to, and I  will summarize it. Mr. Bush was the person who granted the land rights  on behalf of African Americans.\n\nHe…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…with Australia and the U.K. deepens and grows, he can  look back with great satisfaction for time well spent.\n\nTo him, his wife Micki, his children Cooper, Jack, and Parker: I wish  them all the best on their next chapter in life and thank them  sincerely for being part of Phil's amazing work on behalf of our  Nation.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…local schools.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative Bird for her dedication to serving  her community. I wish Shannon and her family all the best on their next  endeavor.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…not been arraigned yet or  convicted of anything in the Ethics disciplinary process. They just  said, well, there is bad press. We want to get rid of him.\n\nBeware of what you wish for. Is that the rule that you want here in  the House of Representatives, that you can just draw up a Member of  Congress in 24 hours or 48 hours because there is a bad newspaper…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…I just say that the President said yesterday  that  that oil was the United States' oil, not the Venezuelan people.\n\nI thank the gentlewoman for her passion, though. I only wish she had  the same passion to speak out against the Trump administration's mass  deportation of Venezuelans legally in the United States of America.\n\nMr. Speaker, if this truly…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trade war with Canada has caused prices to rise, led to  more job losses, disrupted trade, and caused tourism to drop 31  percent. These are no victories.\n\nMr. Speaker, I just wish to say that I voted to end this upside-down  trade mess today. Let's strengthen our economy and make life affordable  again.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…change conferences, or COP.\n\nDr. Leinen's work has left an extraordinary mark on oceanography. I  thank Dr. Margaret Leinen for her service. Along with all of San Diego,  I wish her the best in her retirement.                       Recognizing Dr. Alessandro Sette\n\nMr. PETERS. Mr. Speaker, I rise today to recognize a constituent of  mine, Dr. Alessandro…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…uncovered waste  and fraud in a very bipartisan way, and he regards his job as  bipartisan. He would be the one to eliminate waste, not with a meat-ax  but with a scalpel.\n\nI wish my colleagues had been in the hearing today, the joint hearing  of the House and Senate Veterans' Affairs Committees, to hear Commander  Al Lipphardt of the Veterans of Foreign…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to place remarks on the Record this  evening focusing on liberty versus dictatorship.\n\nWe have several Members who wish to submit comments for the Record.  Congressman   Mike Quigley is here this evening. Congressman Eugene  Vindman is in a committee markup right now, and Congressman   Steve…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Even last Congress, the  Republican majority had votes on privileged resolutions under the  emergency law.\n\nI can understand why some of my colleagues across the aisle might  wish to avoid such a vote. They don't want to be seen raising taxes and  increasing costs on everyday families in this country, but their  inaction is doing just that, by letting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695525/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…millions of children and  families in communities across the country. Her talents and  contributions will be sorely missed.\n\nI congratulate Ms. Barlow on a distinguished career and wish her the  best in her upcoming retirement. I hope her retirement gives her more  time with family, including her husband and two children, and much  success with her community…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…America.\n\nMr. Speaker, I am grateful for the work of dedicated individuals like  Cathi who relentlessly strive to promote policies that protect the  dignity of every Arizonan. I wish Cathi well in her much-deserved  retirement.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690597/congratulating-cathi-herrod-on-retirement"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…development initiatives and  outreach to high schoolers to introduce them to opportunities in the  construction trades.\n\nIt is my honor to thank Carl for his dedicated career and wish him  all the best with his next step.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688140/recognizing-carl-harris"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…esteem by his friends, family, colleagues, and community.\n\nTherefore, on behalf of the United States House of Representatives  and California's Third Congressional District, I wish Chief Estes a  happy retirement and thank him for his many years of service.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…time with  his kids and grandkids.\n\nToday, I join Nebraskans everywhere in thanking Gary Sadlemyer for  his decades of commitment to our state as a superb broadcaster and I  wish him all the best in his well-deserved retirement.", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699392/recognizing-gary-sadlemyer"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the mouths of those veterans of what  war is all about.\n\nTo date, I have submitted 95 stories from Iowa veterans to the  Library of Congress. There are more Iowa veterans who wish to share  their story, and I look forward to continuing my efforts to preserve  those stories.\n\nNormally, it would be this weekend at some major city in Iowa. I  would ask veterans…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…and Congress, leveraging his military construction expeltise to advance  our Nation's security.\n\nAs he transitions to his next assignment, I honor his exemplary  service and wish him, his wife Crystal, and their daughters well. His  legacy endures.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693703/recognizing-sergeant-major-harold-m-watts-iii-service-to-the-national-guard-bureau"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…shining example of the thriving communities and  pristine nature our great State of Maine has to offer. I congratulate  the people of Carthage, ME, on this 200th anniversary and wish you all  the best in the years to come.", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…VisionCorps has helped  thousands of individuals lead independent and successful lives.  Pennsylvania's 11th Congressional District is grateful for Mr.  Steiner's impact, and I wish him all the best in his well-earned  retirement.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…reason President Trump is having to reestablish it and it is  coming soon is because it got unestablished. That is what we are trying  to prevent in the future.\n\nMr. Speaker, I wish the gentleman from Kentucky (Mr. McGarvey), my  friend and colleague, were still here because I would thank the  gentleman for the kind words. He is a good friend with kind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Officer with the State  Department.\n\nI have requested the United States flag to be flown over our Nation's  Capitol to honor this special occasion. I congratulate Oliver, and I  wish him all the best in his future endeavors.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker. I wish to include in the Record the  following letters of exchange between the House Committee on Energy and  Commerce and the House Committee on Foreign Affairs with respect to  H.R.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…example how Members  of Congress could learn a little of something from Roscoe.\n\nMr. Speaker, from up here in Washington, D.C., I thank Mr. Bowman for  his friendship, and I wish him the happiest 90th birthday. I thank him  for his time and commitment to the people of east Tennessee.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692873/happy-90th-birthday-to-willis-roscoe-bowman"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…fostered collective hope for  future prosperity throughout Bedford County.\n\nOn behalf of everyone in the 13th Congressional District, I  congratulate Bette on her retirement and wish her the best.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…success helps provide recognition  for the important role STEM plays in keeping our country safe. I thank  them for their ambition and drive to participate in such a program. I  wish them all the best in their future endeavors.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…served several years on the City of  Beatrice Community Redevelopment Authority.\n\nDoug's steadfast work ethic is a model of Nebraska devotion to a job  well done, and I certainly wish him a happy retirement.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}]