[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…resilience, faith, and love for  others. I ask my esteemed colleagues in the United States House of  Representatives to please join me in celebrating her 100th birthday and  wishing her continued joy surrounded by family and community.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…spirit of community  and compassion.\n\nI ask my colleagues to join me in recognizing Corey Rose and her  Wishes & Heroes Benefit Concert for their outstanding contributions and  wishing her all the best in her future endeavors.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…diplomat from our most important ally.\n\nAmbassador Pierce's New Year's Eve celebrations will live long in  Washington memory.\n\nPlease join me in thanking Ambassador Pierce and wishing her the best  on her next mission to the West Balkans. Her legacy of diplomacy will  continue to inspire future generations.             Zoning In on Service: Honoring Gerry…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…happy birthday, but even  that goodwill does not change the fact that this is bad legislation.  So, unfortunately, I am going to have to rise in opposition to the bill  while wishing the gentleman a happy birthday.\n\nMr. Speaker, we are all grateful that the Republican shutdown is  finally over, but millions of Americans are still on the cusp of losing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…greater  tolerance and understanding. I commend KAAW and the volunteers listed  above for helping to bring such wonderful events to fruition and ask my  colleagues to join me in wishing them great success in their future  endeavors.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696020/recognizing-the-korean-american-association-of-the-washington-metropolitan-area-and-the-2025-korus-festival-volunteers"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…with the skills and knowledge to thrive,  Edith is worthy of the highest praise. Mr. Speaker, I respectfully ask  that you and my other distinguished colleagues join me in wishing Mary  Edith Brown Coleman a very happy 109th birthday.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…present--for a century of exemplary service  and stewardship.\n\nI ask my colleagues to join me in congratulating the Boston Passport  Agency on its 100th anniversary and in wishing its team continued  success in the years ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…strengthening the economic fabric of New York  City. Therefore, Mr. Speaker, I ask my colleagues to join me in  celebrating Theodore M. Renz for his outstanding contributions and  wishing him good health and joy in this next chapter of life.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Bronx more. After many incredible years, Lois's contagious positivity  and kindness is truly deserving of this body's recognition.\n\nMr. Speaker, once again, please join me in wishing Lois Washington  another year of good health and happiness as she celebrates the  milestone of her 100th Birthday.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698097/recognizing-lois-washingtons-100th-birthday"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…and strengthened an institution central to the well-being of our  region. I ask my colleagues to join me in thanking Ms. Kerrie Wilson  for her years of devoted service and wishing her a joyful, fulfilling,  and well-earned retirement.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…fighter, and he  is tenacious. He is facing some serious health challenges right now.\n\nMr. Speaker, I know you will join me and Representative Bergman and  everyone else in wishing him the absolute best as he is in this fight.  I know he has got it, and we are with him.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…After many incredible years, Dina Boccippio's contagious positivity and  kindness is truly deserving of this body's recognition.\n\nMr. Speaker, once again, please join me in wishing Dina Boccippio  another year of good health and happiness she celebrates the milestone  of her 100th Birthday.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694728/recognizing-recardina-dina-boccippios-100th-birthday"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…dedication to our parks system will benefit our region for generations  to come. I ask my colleagues to join me in thanking Mr. Gilbert for his  years of dedicated service and wishing him a joyful and well-earned  retirement.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…make his service possible.\n\nWe in Congress and the American people are indebted to the brave men  and women who stand watch on our behalf. I ask my colleagues to join me  in wishing First Lieutenant Duncan DeMarsh a safe mission and a swift  return home.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696916/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Rocklin Area Chamber of  Commerce and the Rocklin community at large.\n\nTherefore, on behalf of the United States House of Representatives, I  join the Rocklin community in wishing Robin Trimble a very happy  retirement and thanking her for her 20 years of contributions to the  Rocklin business community.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…connection to the community.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Shawn Christman for his remarkable 25 years of  service and in wishing him continued success and fulfillment in his  ongoing commitment to the community.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699581/recognizing-shawn-christman"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Volunteer Fire  Company.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Gary Braunscheidle for his remarkable 62 years of  service and in wishing him continued success and fulfillment in his  ongoing commitment to the community.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…region, and set a standard  of service that we should all admire.\n\nMr. Speaker, I ask my colleagues to join me in thanking Hooty Adam  for his extraordinary dedication and in wishing him the very best in  his well-earned retirement.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…childcare must be  included in an hourly employee's regular pay rates.\n\nThe Empowering Employer Child and Elder Care Solutions Act removes  this longstanding obstacle for employers wishing to provide these  highly valued accommodations to their workforce and aligns the  treatment of these pro-family benefits with other employer-provided  benefits.\n\nFor workers,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Etowah, Calhoun, Cleburne, Cherokee and St. Clair counties  in northeast Alabama. There are 70 programs of study offered to over  5,000 students.\n\nMr. Speaker, please join me in wishing Gadsden State Community  College a happy 100th anniversary.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…United States House of Representatives,  it is an honor and a privilege to acknowledge Kathryn Mandichak for her  career in public service. I join the people of Mono County in wishing  Kathy the very best in her retirement.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…and 10 great-grandchildren.\n\nI'd like to congratulate Mr. Ziegenfuss on his outstanding career.  Please join me in thanking him for his many years of service to others  and wishing him well on his retirement.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Nation. Their success reflects the leadership of head coach Eric Kjar,  who instilled in these men values of dedication, perseverance, and hard  work.\n\nI hope you all join me in wishing them good luck as they play in  their first ever Overtime National Championship against St. Frances  Academy.\n\nI would also like to congratulate Lone Peak High School and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…countless soldiers. Her legacy is one of dedication, leadership, and  unwavering professionalism. I ask my colleagues to join me in honoring  her exceptional career and in wishing her continued success and  fulfillment in retirement.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…profession, wherever  her journey might take her next.\n\nMr. Speaker, I ask my colleagues to join me in congratulating Carter  Forrest on her graduation from Drake Law School and in wishing for her  continued success in the years to come.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691562/recognizing-the-graduation-of-carter-forrest"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…distinguished  American who has devoted himself to the service of our Nation. It is  appropriate that we honor him today by expressing our gratitude for his  dedication and wishing him well on his new command.\n\nAnd while he may not be able to push the ``abort mission'' button, I  know that when the pressure rises, Commander Russell will rise higher.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…contributions to the United States Postal Service will not be  forgotten.\n\nMr. Speaker, I ask my colleagues to join me in celebrating the  remarkable career of Joseph Bongarzone and wishing him a fulfilling and  well-deserved retirement. May his legacy of integrity, commitment, and  service continue to inspire future generations of postal workers.", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…wife, BBB4 Wilbert D. Payne, Jr., and has been blessed with 4 children  and 12 grandchildren.\n\nMr. Speaker, please join me in recognizing Mr. Payne on this  milestone and wishing him a very happy birthday.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}]