[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…companies in  Rhode Island now employing over 41,000 people.\n\nMr. Speaker, I thank Dave for his many years of service to Rhode  Island. His impact will long endure, and I wish him a very happy  retirement.                    Concerns Over High Cost of Healthcare\n\nMr. MAGAZINER. Mr. Speaker, while Donald Trump and congressional  Republicans spend time building…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Clergy of Westchester County. He has done  all of this with his wife, Aro Denise Edwers, as his life partner, and  all of this was done in a mere 65 years.\n\nMr. Speaker, I wish a happy birthday to Bishop Edwers from the floor  of the House of Representatives.                        Recognizing Shoreline Publishing\n\nMr. LATIMER. Mr. Speaker, in a world…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, to the more than 3.8 million educators  across the country, I wish you a happy National Teacher Appreciation  Day.\n\nI know our teachers work tirelessly to provide our students with an  education that opens the door to opportunity, and I am sure everyone…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…celebrate not only General Hansen's 92nd birthday but also his  enduring legacy of patriotism and exemplary service that continues to  inspire our Nation.\n\nI thank him and wish him a happy birthday.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693452/brigadier-general-donald-wayne-hansen-celebrates-92nd-birthday"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Madam Speaker, I rise to wish a happy heavenly birthday  to my predecessor in representing New Jersey's 10th Congressional  District, the Honorable Donald Payne, Jr.\n\nHe served as Newark City Council president…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…also  in her care for her constituents. On behalf of countless Minnesotans, I  offer Senator Rest my sincere gratitude for her decades of service to  our great state. I wish her a very happy and well-deserved retirement  and a winning season for the Twins next year.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697262/recognizing-state-senator-ann-rest-for-her-service-to-minnesota"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…from Asian countries in  pursuit of the American Dream, like my family. Their stories and  success are a testament to the founding ideals of our country.\n\nMr. Speaker, I wish a happy AANHPI Month to everyone.\n\nMr. Speaker, I also rise today to recognize the month of May as  National Cancer Research Month.\n\nEvery day, 5,000 Americans will be diagnosed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…let us also reject any attempt to crown  a new monarch, whether with a golden crown or a gilded office, because  in this country no one is above the law.\n\nMr. Speaker, I wish a happy Separation Day to Delaware.                       Recognizing Gabriella Bourantas\n\nMs. McBRIDE. Mr. Speaker, I rise to recognize two extraordinary young  leaders from Delaware,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Mr. Speaker, I look forward to continuing to work with the Korean- American community in my district and across the country to make these  reunions a reality, and I wish everyone a happy Korean-American Day.                                 Immigration\n\nMr. SUBRAMANYAM. Mr. Speaker, my office has been working with so many  constituents who have been…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the YMCA of Metropolitan Atlanta as we work hand in hand to serve  our children. Next week, the supporters of Head Start from across  Metropolitan Atlanta will gather to wish a happy birthday to this  critically important Federal program.\n\nMr. Speaker, 60 years ago, President Lyndon Baines Johnson spoke from  the Rose Garden to announce the opening of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Career Fire Chief of the Year in  2024.\n\nCongratulations to Chief Johnson on his exceptional career. We thank  Chief Johnson for all his service to our community, and we wish him a  happy retirement.      Celebrating Independence High School Varsity Winter Guard's 2025                       Scholastic State Championship\n\nMr. SUBRAMANYAM. Mr. Speaker, I…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…need. They were always active in church. They were active in our  schools.\n\nI just can't say enough about how proud I am of my parents, Albert  and Sarah. I just want to wish them a happy anniversary this weekend.\n\nI love you, and I am looking forward to years ahead together.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700043/happy-50th-anniversary-albert-and-sarah-stutzman"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…officers deserve. I thank Jon and Haley for their courage,  compassion, and relentless advocacy bringing attention to this very  important issue.\n\nMr. Speaker, I want to wish a very happy birthday to my nephew,  Andrew Martino.\n\nHappy birthday, Andrew.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…several years on the City of  Beatrice Community Redevelopment Authority.\n\nDoug's steadfast work ethic is a model of Nebraska devotion to a job  well done, and I certainly wish him a happy retirement.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…uniform.\n\nHappy birthday to the United States Army.\n\nArmy Strong, always.                  Celebrating Richard Miller on His Birthday\n\nMrs. MILLER-MEEKS. Mr. Speaker, I wish a happy birthday to a very  special person, the eldest of eight children, my brother, Richard  Miller.\n\nRichard Miller served in the Army, served in the coal mines in  Pennsylvania,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…tool for our military than the lessons learned through Scouting.\n\nMr. Speaker, Scouting has touched the lives of so many. I am proud of  the way it has shaped our youth. I wish a happy 116th birthday to  Scouting America.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…so missed by many of us, including  me. We love his family, and we are grateful to him.                        Birthday Wishes To Trey Tenney\n\nMs. TENNEY. Mr. Speaker, I wish a happy birthday to my son, Trey,  today, and congratulate him for being a major in the Marine Corps.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Congressional District, I  wish my friend, Bart Mitcham, a wonderful 80th birthday and extend my  sincerest gratitude for his lifetime of service. May God bless him, and  I wish him a happy birthday.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…friendship.  She has watched  my kids grow up and been part of my family. Her presence will be missed  in the office each day, but I am grateful I will still see her around.  I wish a happy retirement to Debbie.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…example of love, service, and vitality is truly inspiring, and  her community is lucky to call her their own.\n\nI congratulate Joanna on this extraordinary milestone and wish her a  happy 100th birthday.      Congratulating Makennah Craft on Fourth Ohio State Wrestling Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to recognize the undefeated  wrestling…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…includes heroes, like him. May we never  forget that freedom is never free--and that behind every American flag  is the story of someone, like Floyd, who defended it. I wish a happy  105th birthday to Mr. Wells. May God bless him and his family, and may  He continue to bless the United States of America.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…trained, qualified providers. I am proud to have secured this  funding and remain committed to strengthening healthcare access and  training across Iowa.\n\nMr. Speaker, I wish a very happy birthday to Ambassador and Iowa's  longest-serving Governor, Governor Terry Branstad. Happy birthday,  Ambassador and Governor Branstad.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696799/recognizing-jones-regional-medical-center-project-funding"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…contractor- supported model.\n\nI encourage the Army to keep this effort going and to apply this same  contracting concept more broadly.\n\nLastly, I thank the PIF team and wish them a happy anniversary.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691922/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…families.\n\nIn Congress, I remain committed to supporting legislation that  strengthens our national defense and honors the men and women who wear  the uniform.\n\nMr. Speaker, I wish a happy 250th birthday to the United States Army.  May their legacy of service continue for generations to come.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}]