[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…community. As a school that is so new, it has been amazing to see all  that it has accomplished. They are one of the first graduating classes.\n\nWhatever comes next, I wish them all the best of luck and success in  this new chapter of their lives.\n\nMr. Speaker, I congratulate the Independence High School Tigers.           Congratulating Loudoun County High…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…professionalism, and unwavering commitment to public  service exemplify the very best of diplomatic tradition. Nick is  transitioning back to the Foreign Office in London, and I wish him the  very best for his future endeavors.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…we will be very sad to say farewell to this amazing  group of interns. I thank Henry, Carter, Maurice, Ally, Ethan, Keziah,  Addison, and Ryan, for their service. I wish them all the best as they  continue their professional and academic journeys.", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…extraordinary  talent on a national stage.\n\nAgain, I want to congratulate Mira Cahalane for her exceptional win  and on being named this week's Champion of the Week. I wish her the  best of luck as she prepares to compete in the Jimmy Awards, and know  she will represent Northeast Ohio well.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691952/mira-cahalane-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Shamira A. Brown for her outstanding achievements and unwavering  commitment to science and education. She is a true asset to our  community and to our environment and I wish her the best of luck in her  research to come.", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…own, and I am  honored to recognize his remarkable contributions to our home and the  world. I once again congratulate him on receiving the Citizen Diplomat  Award and wish him the best in his future work.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…High  School in April of 2025.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Dr. Paccione for her years of service and to wish  her all the best in her future endeavors.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…debris and the focus of  the power of the Sun's rays to destroy the debris.\n\nI am eager to see what our students continue to do with their company  in the future, and I wish them the best of luck in tackling  sustainability in space.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…even  greater educational advancement for her students and to  build a stronger, more civically adept community.\n\nI thank Mrs. Baker for her service to our community and wish her the  best in her studies as she completes the James Madison Fellowship.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689665/recognizing-jasmine-baker"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Space Force Base community.\n\nI ask my colleagues to join me in saluting Officer Mykul ``Moto''  Thomas. He showed us the powerful impact one person can have, and we  wish him the very best as he continues to live his ``why''.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…18th hole, J.J. sunk a 64-foot putt to clinch his first major  championship. The 31st Congressional District wants to congratulate him  on his incredible victory, and we wish him the best of luck at The Open  Championship in Northern Ireland.               Honoring the Retirement of Captain Daniel Regan\n\nMr. CISNEROS. Mr. Speaker, I rise to honor the retirement…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Australia and the U.K. deepens and grows, he can  look back with great satisfaction for time well spent.\n\nTo him, his wife Micki, his children Cooper, Jack, and Parker: I wish  them all the best on their next chapter in life and thank them  sincerely for being part of Phil's amazing work on behalf of our  Nation.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…revitalizing our community.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Mayor Bud Starker for his years of service and  wish him the best in all his future endeavors.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696268/recognizing-mayor-bud-starker"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…surviving spouses she has supported. Granite staters are grateful that  the spouses of our brave veterans may receive attentive care from  professionals like Pat, and I wish her only the best in the years to  come.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…service to the Centre  region both on and off air, and he will formally retire from the Patton  Township Board of Supervisors at the end of this year.\n\nMr. Speaker, I wish him all the best.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697750/recognizing-elliot-abrams"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…testament to the deep love Davie County has for the  game of baseball. We are proud to have them representing our community  on diamonds across the country, and we wish them all the best as they  take on their next chapter.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693987/recognizing-coy-james-and-davie-countys-baseball-legacy"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…will continue to serve her as she completes her senior year of high  school and goes on to tackle new challenges.\n\nI congratulate Makennah on her fourth State title. I wish her the  best in her very bright future.    Congratulating Portsmouth High School Girls' Basketball Team on Ohio                           Division V State Title\n\nMr. TAYLOR. Mr. Speaker,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…beds to children and youth who  do not have beds.\n\nMr. Speaker, I thank the Lock Haven Kiwanis Club for 100 years of  dedicated service to the Lock Haven community and wish them the best as  they work toward many more.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…confident in the ongoing  excellence of the Okefenokee Swamp Park board.\n\nMr. Speaker, I thank Dr. Clark for his commitment to improving the  Okefenokee Swamp Park and I wish him the best in his future endeavors.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in concert and marching band,  and he is a Special Olympics volunteer and a member of the National  Honor Society.\n\nI thank Lucas for his commitment to service and wish him the very  best of luck as he embarks on this exciting new phase of life at West  Point.                         Congratulating Bryony Shipe\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and the American people, the same  way he was for me and the members of the House Committee on Energy and  Commerce. I thank him, congratulate him on his new role, and wish him  the best in his future.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…make her shine in the next  chapter of her life where she will, once again, continue to thrive.\n\nMr. Speaker, we will miss her here, but I congratulate Lauren Fine  and wish her the best of luck in the next chapter of her life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Director for Congresswoman  Kat Cammack (FL-03). While she will no longer be working for a member  of the Kentucky delegation, I know she will succeed in her new role. I  wish her the best, congratulate her on her new role, and thank Kaley  Stidham for her service to the House Committee on Energy and Commerce.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Commerce to serve another member of the Kentucky delegation, Dean of  the House Hal Rogers (KY-05), as his Legislative Correspondent--a role  I know she will excel in. I wish her the best in all her bright future  and thank her for service to the House Committee on Energy and Commerce  and to the constituents of Kentucky's 2nd Congressional District.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Department, as he served with the Boy Scouts for more  than 30 years.\n\nOnce again, I want to thank Chief Nye for his selfless efforts  serving and protecting Lititz Borough. I wish him the best in his well- deserved retirement.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689982/congratulating-chief-kerry-nye-on-his-retirement"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…she will also.\n\nMr. Speaker, I congratulate Angela on her remarkable achievement, and  a special thanks to her parents for nurturing her in her educational  journey. I wish her the best as she furthers her studies.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699463/recognizing-angela-flores"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…accomplishments, and  her commitment to excellence, professionalism, innovation and  collaboration in the Okaloosa County School District. I thank her for  her service, and wish her all the best for her continued success.", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the job done. The most important  thing that we know is that Jack is a true friend, and I can say that  from personal experience. We are all going to miss him, and I wish him  the best of luck as he begins his new chapter in life.\n\nMr. GRAVES. Mr. Speaker, in closing, naming the House Press Gallery  after Frederick Douglass is going to honor his commitment…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]