[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…more than imminence; that is  actual kinetic hostility.\n\nThe United States is being urged to enter the war. The United States  is moving military assets into the region and withdrawing diplomats  from the region.\n\nThe Iranians are acknowledging that: If the United States enters the  war, we have plans to go after U.S. troops, the 40,000 U.S. troops in…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…looking for any opportunity to  expand its influence in the United Nations, and UNESCO is no exception.  We rejoined UNESCO in 2023 after a 5-year absence, and now, we are  withdrawing again. It sends a terrible message that the United States  can no longer be counted on. It is a message the Chinese will applaud.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…peacefully, and then less than 12 hours, 24  hours later, 6 Border Patrol guys shot a guy with a cell phone in his  hand in the back. They couldn't handle that.\n\nSo ICE is withdrawing from Minnesota. It is good. We are glad they  are leaving our State, let me be clear. And when I talked to Director  Homan about 10 days ago, he said this was the timetable,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…susceptible to ending up in the hands of terrorists  and narcotics traffickers halfway around the world is not a problem,  then it is understandable why some would favor withdrawing from the UN  Register of Conventional Arms, which provides transparency on arms  transfers and helps to deter the traffic in illicit weapons. But it is  as illogical as…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Sadly, with the passage of the one big, ugly bill, the need for this  guidance is significantly diminished, as congressional Republicans  inexplicably gutted this program by withdrawing $850 million in  funding. It is deeply disappointing that congressional Republicans  would rather use this money to give tax cuts to billionaires than  develop creative…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…maintain her physical and emotional health and provide       services to assist with her independence so she can continue       to be a contributing member of society. By withdrawing       funding for Medicaid, the policy would disrupt programs       serving disabled and elderly people in New Jersey and       throughout the country. And Medicaid is only…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…including the IMF.\n\nClearly our ability to advocate for Taiwan at the IMF, to carry out  the purposes of this bill, is undermined by the fact that Donald Trump  is examining withdrawing us from the IMF. Setting aside the central  point that the President has no authority whatsoever to withdraw the  United States from international financial institutions,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…reconciliation bill that was passed in  June, together with some other actions of the administration-- particularly unilateral actions of Secretary Kennedy and the President  in withdrawing healthcare funds from Virginia and unilateral actions  thrusting uncertainty into areas like vaccines--they have created a  huge healthcare challenge for Virginians and…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have allowed the Trump administration to run roughshod  over the very concept of safety, repealing numerous rules designed to  protect our communities and workers, and even withdrawing the rule that  was required by law that President Trump himself signed.\n\nThis bill, Mr. Speaker, and other energy bills we considered this  week out of the Committee on…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…they need to hear.\n\nMs. WATERS. Mr. Speaker, I move to take the words down.\n\nMs. WATERS. Mr. Speaker, I rise to take down her words.\n\nMr. Speaker, I thank Ms. Salazar for withdrawing her words, and let's  get on with this discussion about socialism.\n\nInstead of legislating and doing the work to tackle real problems-- Americans face the skyrocketing cost…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…applies to those powerplants and States that are supposed to  be good neighbors. And, according to this rule, they would be good  neighbors, but the EPA is rolling it back, withdrawing it.\n\nAnd so I am grateful to be here with two champions, my great friend  and neighbor the Senator from Rhode Island, Senator Whitehouse, who has  made this battle a constant…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Report Cycle,       NCUA announced that it would no longer be collecting       overdraft and NSF fee data from FICUs as part of the       quarterly Call Reports, thereby withdrawing the Reporting       Requirements. NCUA's Press Statement, which identifies the       withdrawal of the Reporting Requirements as a ``policy       change,'' notes that ``NCUA…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…communities, the  cost of living, and job losses across our Nation.\n\nJob loss and the withholding of funding by the Trump administration  of awarded contracts, Federal contracts, withdrawing those from  investment across our country, has caused real ruptures in district  after district after district. We are going to summarize just some of  those tonight.\n\nToday,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…has had a negative impact on energy production--as soon  as I get in front of a microphone, I have a tickle in my throat--by  restricting the areas that are open for use, withdrawing them from  mineral exploration, oil and gas exploration, and energy production.\n\nThe original intent of the Presidential proclamation authority in the  Antiquities Act was…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…order,  but here we are.\n\nThe President has unlocked America's energy potential, or at least  taken a giant step to doing so, by reopening 625 million acres for  drilling, withdrawing from the disastrous Paris climate agreement, and  approving new LNG projects.\n\nMr. Speaker, here before us today, we have what we call CRAs, under  the Congressional Review…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…point of our side is  undeniably true, which is that our healthcare system is broken and  costs continue to spiral out of control.\n\nHowever, it is also true that suddenly withdrawing premium support  from 22 million Americans is going to force those folks into a terrible  dilemma: either paying hundreds or thousands of dollars more, so they  face hard…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…National Petroleum Reserve- Alaska, the ANWR Coastal Plain, and construct the Alaska LNG pipeline.\n\nIn 1971, the Department of the Interior issued Public Land Order-- PLO--5150 withdrawing from selection a 5.3 million acre stretch of  Federal land to reserve it as a utility and transportation corridor to  facilitate monetizing the oil reserves on the North…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…legislation to make sure that we don't have any unintended  consequences in the language. We will do that as we move this  legislation forward. I appreciate the gentlewoman withdrawing the  amendment.\n\nMr. CALVERT. Madam Chair, I yield back the balance of my time.                    Amendment No. 248 Offered by Mr. Ogles\n\nMr. CALVERT. Madam Chair, I look…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…2214, setting aside 8.9 million acres to establish the Arctic National  Wildlife Range for the purpose of preserving unique wildlife,  wilderness, and recreation values, withdrawing the lands from ``all  forms of appropriation . . . including mining but not the mineral  leasing laws.'' PLO 2214 intentionally left open the possibility of the  development…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…ill-advised threats about Greenland  were to shatter the trust of our allies. Following through on this  provocation would be more disastrous for the President's legacy than  withdrawing from Afghanistan was for his predecessor.\n\nThe American people know this. Just 17 percent think trying to take  control of Greenland is a good idea. Seventeen percent think…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]