[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Texas. Mr. Speaker, I rise today to introduce the  Qualified Immunity Accountability Act because no one is above the law  or the Constitution.\n\nAcross this country, we are witnessing a dangerous pattern: Federal  law enforcement officers--specifically, ICE agents--operating with near  total impunity. We have seen constitutional rights violated, and we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…actually  trying to create good-paying union jobs that allow people to provide a  comfortable living in the United States of America.\n\nAmongst this all-out assault that we are witnessing in the United  States is an all-out assault on organized labor, an assault on  collective bargaining, and an assault on the freedom to negotiate.\n\nWhat is the difference,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…unmistakable  message to the world, in particular, Communist China, that aggression  pays.\n\nThings are even worse than all of that.\n\nUnder the tutelage of Donald Trump, we are witnessing a fundamental  transformation of American foreign policy from a force for good in the  world to a force for evil. Trump is aligning American foreign policy  with that of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Generations lost their chance at education, and the nation's  progress was stunted.\n\nMr. Speaker, if we do not learn from our history, we are doomed to  repeat it. We are witnessing the same pattern repeating in our own  lifetime.\n\nIn Hungary, Viktor Orban has taken over universities, closed  independent institutions, and forced academic programs to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of Illinois. Mr. Speaker, it is with a heavy heart that I  rise today with both anger and urgency.\n\nWhat we are witnessing in this country is not law enforcement. It is  violence followed by lies. It is authority without accountability.\n\nSince Trump returned to power, at least 36 people have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…have even  seen it in this Capital City, where I am speaking today, when  he forced troops to carry rifles around the quiet streets of our  Nation's Capital.\n\nNow we are witnessing it stretch from DC to the Caribbean Sea as  Trump is, once again, unilaterally--and unconstitutionally--using our  troops however he sees fit, rule of law be damned.\n\nTo…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…detained, simply for the way they look, by officers who  face no accountability. United States military veterans are being  picked up, detained, and deported.\n\nWhat we are witnessing is a slow methodical erosion of citizens'  rights and a cold indifference towards treating entire communities as  national security threats.\n\nWe are in the midst of history…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…watching as prices  keep going up while funding for programs people need, like SNAP,  Medicaid, and the ACA, keep going down.\n\nIt doesn't stop at the kitchen table. No, we are witnessing a whole- of-government effort to erase Black history, to diminish Black voices,  and to stifle Black progress.\n\nMore than $3 billion in Federal funding has been cut from…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Madam Speaker, we are witnessing yet another shameful  attack on the fundamental rights of millions of Americans.\n\nHouse Republicans are forcing a vote this week on the so-called SAVE  Act, a bill that does…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…proclamations, we must also  confront a harsh and unsettling truth: the significance of this day and  African American history is being erased. Across our Nation, we are  witnessing the systemic losses of our hard-fought gains--the stripping  of diversity, equity, and inclusion from federal institutions,  censoring school curriculums, and silencing conversations…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise to express my horror at what we are  witnessing in Minnesota. Kristi Noem's DHS has been working with no  oversight and no accountability. The irresponsibility and recklessness  are costing human lives.\n\nICE is terrorizing…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699296/dhs-is-working-with-no-oversight-and-no-accountability"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…trade? No, they won't. Will they lower the cost of utilities and  groceries or medical devices around the United States that Americans  need? No, they won't.\n\nWhat we are witnessing is one of the most astounding displays of  cowardice in the modern history of Congress. It is truly a spectacle.  In all my years, I have never seen a group of Members so…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…leadership. I thank him for continued  service to our community and his unwavering commitment to teaching  God's Word. I know  that the best is yet to come, and I look forward to witnessing his  continued impact and leadership.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Speaker, I urge my colleagues to join me in celebrating and  honoring the Jenkins Donelson Foundation for their ten years of service  in our community. I look forward to witnessing their continued impact  in the years to come.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699890/recognizing-the-jenkins-donelson-foundation-for-10-years-of-service"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…enforcement. This is on top of the unprecedented $170 billion the  agency received in Trump's big, ugly bill.\n\nICE has tormented our communities. Let's be clear: What we are  witnessing from ICE is not law enforcement. It is State-sanctioned  violence. A woman was killed by ICE.\n\nMr. Speaker, our communities deserve safety and justice, not  militarized crackdowns…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699381/communities-deserve-safety"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…stand up. It bends when people  refuse to be silenced. It bends when free nations lend their voices to  those who have been denied one.\n\nMr. Speaker, that is what we are witnessing in Iran today: a movement  not controlled by foreign powers, not directed by political elites, but  born from the ordinary people of Iran, who simply want the dignity that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I was not intending to speak. I had the  privilege of just standing in the Speaker's rostrum a few minutes ago  and witnessing this debate on an issue that has been important to me  ever since I got into public service. I think it is no small  coincidence as I was able to wear my kippah up there.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "French Hill", "party": "Republican", "sentence": "…director of our Arkansas Game and Fish Commission.\n\nA native of Scott, Arkansas, the outdoors and a passion for public  service were integral to Austin's upbringing.\n\nAfter witnessing the 9/11 attacks from his classroom at Catholic High  School in Little Rock, Austin was determined to serve his country,  ultimately becoming a Marine Corps officer and deploying…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…was a decorated Boy Scout and Cub Scout leader  and worked as a messenger boy for Western Union. During the Second  World War, he heeded the call to defend our nation after witnessing the  surprise attack on Pearl Harbor, and he proudly enlisted in the United  States Marine Corps. Walter served in combat as a Field Communications  Specialist during the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…American jobs have been  undermined. Biden's refusal to enforce our immigration laws created a  national security crisis, but now with President Trump back in office,  we are witnessing the power of real enforcement.\n\nHis executive actions are restoring order, protecting American  families, and putting our country first. Biden let chaos reign while  Trump…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…smells like the U.S.  Senate. I said the other day that this shutdown is just further proof  that human evolution is a slow, slow process. With this shutdown, what  you are witnessing now is just further proof about why it took human  beings thousands of years to learn how to stand upright. This shutdown  is bone-deep, down-to-the-marrow stupid.\n\nSome…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…years, Allen became a speaker, mentor, and educator. He  published a book of POW stories for schools, and he made personal  classroom appearances. He also authored a memoir, ``Witnessing the  American Century,'' sharing insights from a life lived at the  crossroads of world events.\n\nEven in his nineties, Allen embraced new adventures as he continued  to inspire…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…tax, and we will continue to  pursue this through the reconciliation process.\n\nToday's vote on the CRA provides all Senators the opportunity to put  our vote on record after witnessing the Biden's EPA bait and switch on  the implementation of this misguided policy. I encourage my colleagues  to support the CRA that is central to our mission of American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…under the rule of law. John Adams said: ``Our  Constitution was made only for a moral and religious people. It is  wholly inadequate to the government of any other.''\n\nWe are witnessing the reality of Adams' wisdom in the clash of  cultures as outsiders stream into our country without assimilating. A  prominent Muslim attorney argued in the U.S. court: Islam…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…so that we can not only pay down the  debt but also afford the tax cuts which Americans deserve.\n\nIn conclusion, we are in the golden age of American spaceflight. We  are witnessing a true renaissance of space exploration where the future  is literally being built today.\n\nI don't know what is next. There are stories about mining asteroids  for rare-earth…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…prices down through deflation, if we go into a  recession, if you raise unemployment, allow unemployment to rise to  about 8 or 9 percent where people lose their jobs. We are witnessing  deflation right now in China. For kids in China who just got out of  college, their unemployment rate is 25 percent. That is why their  prices are going down.\n\nThere is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…expanding access to  capital in agricultural communities.\n\nThe digital asset markets are in dire need of regulation, and the  CLARITY Act is the solution. I look forward to witnessing a new era of  economic prosperity and technological advancement that this bill will  bring to America.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693781/digital-asset-market-clarity-act-of-2025"}]