[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…country without a doubt.'' Sanders is now       preparing to submit all the necessary evidence to the       Guinness Book of World Records, including GPS data, photos,       and witness accounts, in hopes of officially claiming the       title as the oldest man to bike across America. ``He has       determination. He has grit,'' said Kathryn. ``And I think…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…understanding, and  human dignity. Despite enduring decades of persecution and restrictions  upon his Patriarchate in Istanbul, he has remained steadfast in his  mission, bearing witness not only to the strength of faith but also to  the power of compassion.\n\nHis All-Holiness Bartholomew, born Demetrios Arhondonis in 1940 on  the island of Imvros was elected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…legislation.\n\nAs a Massachusetts district attorney, I oversaw specialized sexual  assault police units, specialized sexual assault prosecutors, and  specialized sexual assault victim-witness assistance units. I founded a  child advocacy center to treat and reduce trauma for child victims of  sexual assault.\n\nI know from this one thing. The survivors want one thing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…getting home to my family.  But Caroline and her two sisters, Halina and Anne, like millions of  other American kids, have grown up in the shadow of Columbine. They  have borne witness to an endless onslaught of mass shootings. Each  tragedy is piled on top of the last one during their young lives.\n\nIn the summer of 2012, a gunman walked into a crowded theater…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership but his  unwavering witness for peace, human dignity, and care for creation.\n\nFor more than three decades as Ecumenical Patriarch, His All-Holiness  has been a global voice for reconciliation among peoples…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…serve as a testament to its remarkable history, its commitment to  academic and community excellence, and the enduring impact it has had  on Northwest Ohio and beyond.\n\nIn witness whereof, I have hereunto set my hand to honor Defiance  College and its distinguished history on this momentous occasion.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…with a straight       face today. I am sure it wasn't always deserved in       previous eras either. I am sure there have been times when       it was, and I was privileged to witness some of those       occasions.\n\nOur deliberations today, not just our debates but the       exercise of all our responsibilities--authorizing government       policies, appropriating…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…their families. May her legacy of compassion,  advocacy, and tireless commitment continue to inspire current and  future generations of Auxiliary members across the nation.\n\nIn witness whereof, I have hereunto set my hand to honor Cindy Rice  for her exceptional contributions and steadfast devotion to the AMVETS  community and to the service of our great…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…just  recently here in Congress with the Congressional Gold Medal for her  extraordinary work during World War II service.\n\nI am so proud that I could be there that day to witness her family,  her two children, Judith and Stanley, as we stood together while she  and others were honored.\n\nMr. Speaker, the statistics are long and strong about what we…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…second oath to ``faithfully discharge the duties  of a juror and a true verdict render according to the law and the  evidence.'' When testimony begins, jurors observe each witness take an  oath under penalty of perjury to ``tell the truth and nothing but the  truth.'' Judges, also sworn to follow the law, enforce rules of  evidence--including by striking…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to just puff ourselves up and  make permanent something that was already done in a temporary way.\n\nLet me read some of this pleading from Republican witnesses.\n\nRepublican witness Jaime Puerta, a courageous parent who lost his  child to an overdose, testified:\n\nIt is imperative that we educate our children on the       dangers of any kind of drug use…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, within 12 hours, this very Chamber is going  to witness a joint address to Congress. I will take my time and my  privilege as a duly elected Member of this Chamber to share some of the  sentiments about the state of the Union that…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…anti-efficiency resolutions  that we have seen recently from the Republicans, did not go through any  regular order. I want to stress why that is important. We never  received any expert witness testimony on the impact of the standards or  on the impact of repealing them. Instead, we are left to trust a  Republican Party that is decidedly antiscience on the impacts…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…is why he sent his Deputy Attorney  General to interview Maxwell for 2 days. Unprecedented, absolutely  mind-boggling to send the Deputy Attorney General, who may then be a  witness and potentially implicated in a coverup, to interview a vital  witness.\n\nWe don't know who was with him, but we have to believe there were  notes or recordings. They ought…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Obama and to cast her vote for Harold Washington, Chicago's first Black  mayor and for Barack Obama, Americas first Black President-- achievements she believed she would never witness in her lifetime, but  indeed she did. Defying age, at 94 years old, Mrs. Pough wrote and  recorded her debut song entitled ``Jesus Reigns Forever,'' earning  national spotlight…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…wall.'' Once       loving homes where the Divine forged an abode turned Into       blackened stones soaked from Hatred--filled wells of blood       and fire, With walls of witness wailing in silence Of strewn       bodies, young and old bonded. In death as in life, for the       land of ubiquitous. Memorials again and again and again, Till       when?…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697096/recognizing-october-7-revisited"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…friend. While he will be deeply  missed as the leader of the Archdiocese of New York, I wish him the  very best in his retirement and have no doubt that his voice and his  witness will continue to inspire for years to come.                    Honoring Life of Alfred ``Al'' Magnatta\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Alfred…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…sets  Richard apart in my life and in the lives of many others is his  faithful service to his Lord and Savior, Jesus Christ. With each day  and every encounter, Richard's witness is as apparent as it is  infectious. I saw this personally in the Raleigh men's class of Bible  Study Fellowship where for nearly 40 years Richard met with dozens of  men…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…conducted by members of the Committee and such Committee       staff as are authorized by the Chairman, Vice Chairman, or       the presiding member.\n\n8.4. Counsel for the Witness.--(a) Generally. Any witness       may be accompanied by counsel, subject to the requirement of       paragraph (b).\n\n(b) Counsel Clearances Required. In the event that a…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "John Rose", "party": "Republican", "sentence": "…year.  That is in large part because of the influence of the Grand Ole Opry  over the last 100 years.\n\nMr. Speaker, any seat in the house will do at the Grand Ole Opry to  bear witness to the iconic barn background behind the stage. The lights  that look like stars above you and the acoustics around you make for an  unforgettable evening. No matter how many…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…to Epstein, his associates, his       detention and death, or any investigative files.\n\n(9) Documentation of Epstein's detention or death,       including incident reports, witness interviews, medical       examiner files, autopsy reports, and written records       detailing the circumstances and cause of death.\n\n(b) Prohibited Grounds for Withholding.--…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…should be able  to overthrow through force the will of a democratic majority that has  been established through a democratic, free, and fair election.\n\nThat is what we bore witness to in Los Angeles. Yet, instead of doing  everything possible to restore order, to protect the citizens of Los  Angeles, to protect our law enforcement officers, and our Federal…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Meanwhile, my colleagues on the other side of the aisle have largely  ignored this issue. It was Democrats who redacted an email to mislead  the American people about the truth of a witness that exonerated  President Trump. It was a Democrat, Representative Plaskett, who  literally texted with Jeffrey Epstein as we questioned Michael Cohen.  It was Democrats…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…safety and to call for the passage  of the ROTOR Act.\n\nTwo of those family members, Amy Hunter and Laura Augendre, are in  the Gallery today. I am happy that they are here to witness the Senate  passing the ROTOR Act, along with the language removing the offending  NDAA provision. Senator Cantwell, Senator Moran, and I have made  significant progress with…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…This program strengthens our  critical supply chains and helps us counter the harmful global  influence of nations like China and Russia.\n\nDon't just take my word for it. A witness testifying before the Ways  and Means Trade Subcommittee put it bluntly when discussing the  potential for a lapse in AGOA when he said: ``There will be a party in  Moscow.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…breathe,  unlike the last administration.\n\nThe day of the shooting, my oversight unit quickly got to work. They  talked to patriotic whistleblowers. They performed dozens of witness  interviews, including local law enforcement officials, rally goers, and  local businesses. My staff obtained and reviewed weeks' worth of  security footage, text messages,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…and the certainty of his destination.\n\nSo with that, I just say thank you Pastor Bjorge for making me  better.  Thank you for your ministry. Thank you for your testimony and witness.  I just wish his family well and just know that I am going to miss him.  I am going to miss him but grateful that I knew him.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…elected in 2014 and has since dedicated himself to justice in our  community.\n\nOver the years, Larry has tackled some of the toughest cases--murder,  assaults, gun crimes, gangs, witness intimidation--always with  integrity and unwavering commitment to public service.\n\nLarry once said that being elected to his office was one of the  greatest honors of his…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…reports. Unfortunately,  throughout this investigation, Democrats have chosen to manufacture yet  another anti-Trump hoax instead of pursuing justice. They have  mischaracterized witness testimony and selectively released documents,  complete with targeted redactions in an effort to smear President  Trump.\n\nFor example, former U.S. Attorney General Bill Barr,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…written statements of reasonable length may be       submitted by witnesses and other interested persons who are       unable to testify in person.\n\n(c) Filing of Statements.--A witness appearing before the       committee, or any subcommittee thereof, shall submit an       electronic copy of the written statement of his proposed       testimony at least…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}]