[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…the National Guard from West  Virginia and condemning that horrific act that took the life of Army  Specialist Sarah Beckstrom and has left Air Force Staff Sergeant Andrew  Wolfe gravely injured.\n\nMr. Speaker, as it relates to the Save Our Seas 2.0 Amendments Act,  this bill will improve the administration of the National Oceanic and  Atmospheric Administration's…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Walton, Christina Ware, Emily Welch, Laura Wengloski,       Nicholas West, Grayson Westmoreland, Garrett Wilbanks,       Clifford Williams, Jordan Wilson, Luke Wilt, Kaitlyn Wolfe,       Zoe Wong, Noah Yantis, Elizabeth Yoder, Connor Young, Amira       Zaidi, and Kristina Zuccarelli.\n\nThe Capitol venues team was led by Grant Scherling from the Office…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…honor Officer Schneider  for his ongoing commitment to serving and protecting the region as a  dedicated public servant.                      Recognizing Detective Sterling Wolfe\n\nMr. KILEY of California. Madam Speaker, as part of the California  Third Congressional District Police Honor Roll and in honor of National  Police Week 2025, I wish to recognize…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…their jobs of keeping us safe,  were ambushed by a gunman here on asylum.\n\nIt was 20-year-old Sarah Beckstrom who tragically perished from her  injuries and 24-year-old Andrew Wolfe who remains in critical, yet  stable condition.\n\nWe all in the Senate and across America continue to pray for these  guardsmen, for Andrew's recovery, and for their families…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…a few weeks ago  when a deranged jihadist shot two of our National Guardsmen just steps  from the White House. Just before Thanksgiving, SPC Sarah Backstrom and  SSG Andrew Wolfe were on patrol near the White House when they were  attacked by Biden-imported Afghan Islamists. A 29-year-old jihadist  radically, viciously attacked them, killing Specialist…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…witnessed a heartbreaking and senseless act of  violence involving two members of our National Guard from West  Virginia, Specialist Sarah Beckstrom and Staff Sergeant Andrew Wolfe.\n\nSpecialist Beckstrom gave her life in service to our country. She  wore our Nation's uniform with honor, stood ready to defend her  neighbors, and lived out the highest ideals…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…stark.\n\nThanksgiving week we saw what happened with the West Virginia  National Guard servicemembers, Specialist Sarah Beckstrom, who was 20  years old, and Staff Sergeant Andrew Wolfe, 24. They were savagely  ambushed and shot blocks away from the White House. Specialist  Beckstrom tragically lost her life. The attacker, Rahmanullah Lakanwal,  an Afghan…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Annaleah Grither, Sarah Grither, Kaleigh Harper, Courtney Hensley,  Savannah Janzen, Alexia Lambert, Emma Morris, Ashlyn Spitzer, Brooklyn  Spitzer, Hannah Tinnell, and Madalyn Wolfe.\n\nTheir success was guided by Head Coach Becky Cantrell and Assistant  Coaches Daren Lam, John Jenkel, Emma Earhart, Morgan Landes, and  Aleisha Lambert.\n\nSpecial commendation…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Winkie, Davis: USA Today;       Winston, Kate: S & P Global; Wire, Sarah: USA Today; Wise,       Lindsay: Wall Street Journal/Dow Jones; Wiseman, Paul:       Associated Press.\n\nWolfe, Frank: Defense Daily; Wolff, Eric: S & P Global;       Wolfgang, Benjamin: Washington Times; Wong, Edward: New York       Times; Wood, Daniel: New York Times; Woodall, Candy:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…as we all will  recall,  one of the National Guard servicemembers working here in the District  of Columbia. We are continuing to pray for the recovery of Staff Sgt.  Andrew Wolfe, who was injured in the shooting. But, of course,  Specialist Beckstrom lost her life.\n\nThe news cycle moves very quickly, and it seems like while something  happens today,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Wise, Justin: Bloomberg Industry Group; Wiseman, Oliver: The       Free Press; Witley, Skye: Bloomberg Industry Group;       Wittenberg, Ariel: E&E News; Wolf, Lauren: Nature; Wolfe,       Kathryn: Politico; Wolman, Jordan: Politico.\n\nWood, Graeme: Atlantic Monthly; Wren, Carl: Politico; Wu,       Nicholas: Politico; Wyant Johnson, Sara: Agri-Pulse;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…One of the servicemembers was Sarah Beckstrom. She was an Army  specialist from West Virginia. She died on Thanksgiving Day. She was  only 20 years old.\n\nThe other is Andrew Wolfe. He is a staff sergeant in the Air Force,  also from West Virginia, and is 24 years old. He remains hospitalized  in critical condition, fighting for his life.\n\nWe join all…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Elizabeth Mortensen  turns 108 years of age on April 21, 2025.\n\nMargaret was born in Deer Lodge, Montana on April 21, 1917. Her  parents were John Matthew Briggeman and Gerena Wolfe Briggeman. Their  family moved with the Wolfe family to Lemhi, Idaho about 1920.\n\nMargaret attended grade school in a one-room schoolhouse in Lemhi.  She then attended Idaho…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}]