[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…integrity and his compassion. And all of  that is at risk. All of that is at risk right now if we let the abusive  handling of this good man and so many other good men and women around  the country--if we let this go without our firmest opposition, without  our strongest pushback, without our strongest defense of our democracy.\n\nWith that, I ask the Senator…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…doesn't have the means to pay for a passport,  they would need a birth certificate that states their current legal  name. This act could suppress the votes of millions of women in this  country who have changed their names after marriage.\n\nTo be clear, if you are a married woman, I guess Republicans don't  want you to vote. If you can't afford a passport,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…walk on. The  freedoms and privileges we enjoy today are because of those who came  before us. These are their stories.\n\nOver the next hour, we will hear from women Members across the  country who will share the stories of heroines who changed the course  of history.\n\nDeborah Ross.\n\nMs. SCHOLTEN. Madam Speaker, I yield to the gentlewoman from  Minnesota…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…pregnancies.  Secretary Kennedy fired staff at the Maternal and Child Health Bureau,  which oversees important programs that support children and pregnant  women.\n\nCountless women across the country have become mothers thanks to the  incredible advancements in IVF, and a good number of this President's  women supporters supported him because he vowed to make the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…healthcare inequities. As a proud  mother of four children, I know firsthand how critical access to  quality healthcare is for expectant mothers. However, far too many  women in this country still do not have access to the vital maternal  resources they need to survive and lead to good outcomes for them and  for their babies.\n\nToday, Black women are three…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689759/devastating-maternal-healthcare-inequities"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Malliotakis; specifically Representative  Malliotakis for her leadership in transforming the National Women's  History Museum from a dream into a real possibility.\n\nWomen across the country have shaped and molded this society with  their contributions being an integral part of the fabric of who we are,  and their efforts, our efforts, and work should…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…based on  the actions of other people--particularly folks who run Iran.\n\nSo if we are going to protect the national security, if we are going  to protect the men and women of this country who will always respond to  the call of the Commander in Chief--that is what makes them such  wonderful patriots. They cede the authority to make the decision about…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, as this year's Women's History Month comes to a  close, there is no better way to honor the prolific and powerful  contributions of women in this country than to finally authorize the  creation of the Smithsonian American Women's History Museum on The  National Mall.\n\nAs one of the original cosponsors of this bipartisan…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689368/womens-history-month"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…foreign lobbies or Big Oil, like the American Petroleum Institute. He  is someone who has voted against bills like the SAVE Act, which  endangers the voting rights of women in our country. He is someone who  voted against the Laken Riley Act, which allows the persecution and  racial profiling of Latinos by ICE agents. He is someone who voted  against…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…who are mostly women, depend on  Medicaid themselves.\n\nOver 37 million children rely on Medicaid and CHIP. Republicans would  strip this essential healthcare from women across the country. Why? To  give tax breaks to their billionaire bros.\n\nWomen need to know how they will be impacted wherever they live.\n\nEarlier today, we heard Representative Valadao…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…possesses an updated passport or a birth  certificate that matches her current name.\n\nThis isn't just bureaucratic nonsense. It is an outrageous attack on  the rights of women across our country.\n\nThe worst part, Madam Speaker, is that Republicans have known that  this was an issue with this bill for years, and they have done nothing  to fix it. They either…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…was not. Instead, he was shielded by a nonprosecution       agreement that blatantly violated the rights of children, and       he was set free to continue abusing women in this country for       another 9 years before his death.\n\nOur government conspired with him and, in doing so, failed       to protect hundreds of girls who would never have been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the ranking member of the Education  and Workforce Committee, Mr.  Bobby Scott, for yielding time.\n\nMr. Speaker, like so many women across the country, I struggled for  so many years to get pregnant. My husband and I tried everything that  we could do to start a family of our own. Being a mom for me was what I  always…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…being  tied.'' That is the result of the kind of strict abortion ban  Republicans have imposed on Texas women that some here want to impose  on all 50 States and all women in our country.\n\nI think the death certificates for so many other women who have been  denied treatment for pregnancy complications should really read the  truth, which is ``Cause…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…boy. She started to experience debilitating  headaches, and she sought medical care. She was discharged and her pain  was dismissed, as is so often the case for Black women in this country  and certainly in our healthcare system.\n\nThe next morning, Adriana woke up gasping for air and was taken to  Emory Hospital, where she was declared brain dead.\n\nThere…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…than  1 percent of fraud in the system. It is an incredibly lean system. It  pays out less than any other system.\n\nStill, even with it as it is, 40 percent of pregnant women in the  country rely on Medicaid so they can give birth to healthy babies. They  would strip that away from those women. It is even higher in rural  areas, and those hospitals in the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…issues, but the electrical cord  that began when he came down the escalator, that continues to this day,  is taking on illegal immigration and the forgotten men and women of  this country whose jobs were initially displaced when the failed  policies of the politicians of this town sent their jobs overseas--the  towns that I grew up in--and then when…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…that I experienced,  endured, and am a survivor of that I accidentally uncovered 2 years  ago, almost to the day. Today, I still don't have justice, like  millions of women across the country.\n\nWhen I spoke out, I got attacked. When I spoke out, I was shamed.  When I spoke out, I was defamed and smeared. That goes on today, right  now, in the present.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…tremendously negative impact on our economy and the  standard of living, like the folks I mentioned back home.\n\nThis is really about lifting up hard-working men and women across the  country. The tax cuts are about helping every hard-working American  achieve their dreams. If President Trump's tax cuts are not extended,  as I say, virtually everybody…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…process by which the States  establish. If you are already registered to vote, you are fine. Read  the bill. Stop insulting women.\n\nI am sick and tired and I know women across this country are sick and  tired of being talked down to and being insulted repeatedly with the  fear-mongering tactics of the left. It is disingenuous for them to  stand there…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}]