[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black, pregnant women had their first heart  attack either while they were pregnant or shortly thereafter. Oh, by  the way, the disparities in cardiovascular care for Black women and  men: The death rate is higher than for White men and women.\n\nI began to look at how do we put policies in place that address the  maternal mortality crisis as a whole, but…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…well as a major player in labor history. The historic actors strike  of 1919 that established union protections for live performers  succeeded in large part because of the women and men of the chorus who  formed their own union and walked off Broadway stages in large numbers  to join the fight.\n\nAnd 2025 is a particularly auspicious year to celebrate the…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694729/recognizing-2025-as-a-chorus-year"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…measure, almost 15 years ago, the idea that Roe v. Wade could or would  be tossed aside was unimaginable. It was firmly established law for  decades, relied on by American women and men.\n\nIn a stroke of catastrophic, misguided ruling, the Supreme Court cast  it aside, ignoring strong precedent and all the doctrines of law that  normally would apply. So…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…As we continue to navigate the aftermath of traffic aviation  accidents and harrowing near misses across this country, we must  support the mental health of the dedicated women and men on the front  lines of ensuring the traveling public reaches their final destination  safely every day.\n\nFor far too long, many aviation professionals suffer in silence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…laws are  implemented, they are right to be concerned.\n\nThis meeting has filled me with a renewed sense of optimism for the  days ahead, for it is clear that these young women and men are not  waiting for the future to arrive. They are shaping it. They labor to  build a society that is more just, more inclusive, and more responsive  to the needs of all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…overwhelmingly live in Republican  districts?\n\nSure, get rid of any identified bloat, as every President does, but  this is a budget about billionaires, not about every American, the  women, men, and children who we represent. Yes, I want to move toward a  much smaller deficit budget.\n\nI listen to   David Schweikert every closing afternoon during his  Special Order…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…leadership.\n\nMr. Chair, I rise today on behalf of the 88,000 brave American  heroes, veterans, who call the State of New Hampshire home.\n\nWe owe a sacred obligation to the women and men who served our  country in uniform. We have got to make sure that they receive the  high-quality healthcare they have earned.\n\nThere are 48 States here in the continental…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692944/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…names of victims, as the law  required. Let us not forget what this entire Epstein scandal is about.  It is about powerful, wealthy men grooming, abusing, and raping young  women and men. That is what it is about.\n\nI cannot understand for the life of me why the Republican leadership  just objected for us to seek enforcement of the law that we passed  unanimously…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…cook for the Union Army during  the Civil War. From the Tuskegee Airmen, the valiant and courageous Red  Tails, to the brilliant and extraordinary Six Triple Eight, Black women  and men have always been on the front lines, standing for the values  that make our Nation great.\n\nWith such a storied legacy of service to our Nation, it is  unfortunate that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…as we would say, just a little tyke, maybe 4 years  old.\n\nI see these kids looking out across the warehouse because in other  cages inside that warehouse were groups of women or men. My impression  was they were looking to see, where did my mother go? where did my  father go? where is my sister?\n\nI said to the Customs and Border Protection agent: Were…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…my colleagues of the Congressional  Black Caucus to commemorate the life and legacy of the Reverend Dr.  Martin Luther King, Jr.\n\nDr. King held an unyielding belief that women and men everywhere,  regardless of color or creed, are equal. He used the power of words and  the example of nonviolent resistance to bring us closer to racial and  economic justice.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…opportunity, working together across this political spectrum, and  get the job done.\n\nMr. Speaker, I look forward to working with all of my colleagues. I  thank all the women and the men who have been so supportive of this  project, and I look forward to seeing all of them at the  groundbreaking.\n\nMs. De La CRUZ.  Chu).", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…these last few weeks.\n\nFirst, I want to pay tribute to our Iowa teams who made it into the  NCAA Division I basketball tournament. That includes Iowa State  University women's and men's teams, the University of Iowa women's  team, and the men's team at Drake University in Des Moines.\n\nDivision I wrestlers from the Iowa Hawkeyes, Iowa State Cyclones,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…that is designed for  females.\n\nIt is an indisputable fact there are significant physical,  biological, I dare say science or scientific, differences between men  and women. Biological men generally have greater muscle mass, bone  density, cardiovascular capacity, and physical strength than women do.  This is very obvious.\n\nAllowing men to compete in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…I thank the chairman for his  support and for yielding this time.\n\nMr. Speaker, every year under Xi Jinping and his Chinese Communist  Party, tens of thousands of young women and men, average age 28, are  murdered in cold blood to steal their internal organs for profit or to  be transplanted into Communist Party cadres, leaders and members alike.\n\nThese…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…shootings.\n\nI also know that as a former Governor and having had the State patrol  of Nebraska report to me, that our law enforcement officers are  dedicated professionals, women and men who put their lives on the line  to keep us safe, and they will do a great job for us in investigating  what could be done better.\n\nThe Department of Homeland Security…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…the world, but he brings up a  valid point, not only for Jews but for many innocent victims, whether  it was Laken Riley or whether it was the women who were raped, the  women and men who were killed, those who were beaten, or those who were  hurt who were in law enforcement.\n\nIllegal immigration is not a good thing. Yes, there are a few illegal  immigrants…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise today in recognition of  National Nurses Day to thank the women and men across our country who  care for the sick, comfort the hurting, and keep our healthcare system  running.\n\nI began my own medical career as a nurse. My sister was a nurse,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…will realize it is  ridiculous to say this country is in any way xenophobic.\n\nAs I mentioned, one of the strong predictors of success in this  country for everybody--for women, men, and children--is that of strong  families. I think we have to spend some time pondering why it seems to  be that people who are used to the American culture seem to have…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, the fundamental question this bill addresses  is: Should a Federal contract intended for women go to men and  fraudsters, or should a Federal contract intended for women-owned small  businesses actually go to women?\n\nFortunately, even though we Republicans and Democrats disagree…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}]