[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…services that are too hard to navigate, and roads that don't get fixed.\n\nThis shouldn't be a partisan issue. All of us here today should be in  favor of making our government work better and strengthening programs  that our constituents rely upon. In fact, some of my Republican  colleagues, led by Congressman Tony Gonzales, wrote in a letter to  Speaker…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…be  considered on this floor because that is what we should be doing. We  should be bringing rules ideas to this floor to be wrestled with in  order to make this Chamber work better.\n\nAnd so I appreciate that the plan wasn't to just try to get UC on the  proposal but to get UC to consider it. Why shouldn't we all agree to  that? So I am not sure where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Supreme Court orders.\n\nThis is a constitutional crisis; that is a fact. We don't need to be  cutting services and critical programs for our families. We need to  make them work better for our families. Instead of gutting healthcare  and Medicaid and food assistance in our public school system, Congress  should make the ultrarich pay more taxes and make…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690549/dte-rate-increase"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…sometimes? My computer  is on the blink a little bit, and I just want to take a hammer and hit  it up the side. That makes me feel good, but it doesn't actually make  the device work any better.\n\nThere are several techniques being used by the Federal Government  that may make us feel good but don't make it work any better. You see,  you can fire people--and they…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…agency can continue to provide  critical assistance to our State and local law enforcement.\n\nWe can do a lot better. They deserve so much better from us. Let's  please work to do better.\n\nMrs. McBATH. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…First Amendment  did it to protect the rights of Alex Padilla and all of us, but they  did it for another reason. They did it because they believed it would  help democracy work better, that democracy works better when people can  speak freely. Democracy works better when people can profess their  religion, when the press can operate freely. And democracy…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…is vowing to  withhold the benefits of Americans as a result of mistakes made by the  Social Security Administration. Instead of making the Social Security  Administration work better and remain solvent, the Trump administration  is accusing seniors of fraud and calling their earned benefits waste.\n\nThe fraud is an unelected billionaire, the richest man…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…deserves.\n\nMr. FIGURES. Mr. Speaker, I support the Mental Health in Aviation  Act, and I recommend my colleagues do the same. It is an important  piece of legislation that will work to better the lives and better the  safety of our aerospace professionals.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…work anymore. More often than not, we pass appropriations bills within  the first few months of the new fiscal year--not ideal but workable. We  certainly need to work to make it better, and the full-year continuing  resolution we find ourselves in right now is a prime example of its  failing, but throwing in the towel, as this bill does, would make…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…have seen for a very  long time, but he is coming in with a powerful mandate to grow the  German economy so that we can be even better security partners, so that  we can work better together on the manufacture of the F-35 and to help  Ukraine in its defense.\n\nBut the Trump tariffs are standing directly in the way of this new,  pro-American government…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to access dignity.\n\nPeople that we have talked about and that we read their letters, they  all said: We can help you find efficiencies. We can help you make the  programs work better. We can help you, but why are you doing this if it  is all part of a larger package to give tax cuts to the wealthiest  Americans, to give tax cuts to billionaires? How…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…generation of scientists because of this  recklessness.\n\nI urge the administration and my Republican colleagues to reverse  course, maintain our global leadership, and work toward a better future  for the 40 percent of Americans who will be diagnosed with cancer in  their lifetimes.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…healthcare, and that is why we must  do more through this bill and not privatize.\n\nThere are other components of the bill that are equally alarming. I  hope we can continue to work better on both sides of the aisle to  improve care for our veterans. This bill doesn't get us there.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692955/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…other way when the DOE workforce is slashed without  evaluating the impacts.\n\nI don't think Republicans care about reducing costs for American  families or helping government work better for our families and  industries. Mr. Speaker, just look at their budget that they adopted  last week. The only thing they care about is cozying up to greedy  billionaires.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…ensure that farmers, workers, and businesses  get the full benefit.\n\nBut Trump's trade taxes aren't addressing enforcement issues with  Mexico and Canada, or making the USMCA work better. Instead, he is  unilaterally undermining supply chains across the board.\n\nHe has imposed new tariffs on scores of products we buy from Canada,  making groceries, housing,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…efforts to  promote ecology and the protection of the environment. He has been at  the forefront of religious freedom and bringing together others from  many faiths to work towards better cooperation and understanding.  Through dialogue and visitations, the Ecumenical Patriarch Bartholomew  has significantly advanced Orthodox relations with the Roman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…are going bankrupt, and the other side just wants  to demagogue and say: Leave them alone; leave them be.\n\nTo let them go bankrupt would be irresponsible. We can make them work  better for the people who are actually here in America who pay into  those programs and who have earned those programs or who had something  bad happen in their life where they…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…people  within the Social Security Administration.\n\nAs identity theft becomes more commonplace, the system at the Social  Security Administration needs to be streamlined to work better for the  victims. The Improving Social Security's Service to Victims of Identity  Theft Act addresses this problem head-on.\n\nSpecifically, this bill will establish a single…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…providing  families the breathing room and additional time to get their lives back  together.\n\nPresident Trump was elected on the promise of finally making the  government work better for working people. All Americans, but  especially Americans recovering from a natural disaster, deserve easier  tax filing. With tax day in just a few days, we must look…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}]