[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…McIVER. Thank you so much to the gentlewoman from New Mexico for  joining us and for your remarks.\n\nMr. Speaker, tonight we have heard about the increased discrimination  in the workplace, the repealing of protections for those with  disabilities, and the dangerous construction sites our neighbors are  forced to show up to.\n\nAll of this is part of the dangerous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…conditions  and were regretfully considered expendable.\n\nToday, through the power of collective bargaining, our workforce has  the ability to negotiate with management and enact workplace  protections that say we value labor and we value safety.\n\nAs a Federal legislator, I am committed to building on the progress  and am very concerned about proposals to cut…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691010/federal-workplace-protections"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…warehouse employees, to  construction crews and factory staff, many are laboring in extreme heat  with no Federal protection from one of the oldest, most serious, most  common workplace hazards, and that is, of course, heat stress.\n\nThe science is clear, the medical evidence is overwhelming, and the  moral case is undeniable. Yet, the Occupational Safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Missouri AFL-CIO and Business Manager of Laborers Local 264, a  position he held for more than 15 years, let us celebrate the work he  has done to defend workers' rights, raise workplace standards, and  expand union access across numerous industries.\n\nMr. Thomas began his career in the labor movement with Laborers Local  264 in May 1996, earning promotions…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…working families.\n\nMs. DEXTER. I am not waving it, Mr. Chair.\n\nWe are--\n\nMs. DEXTER. Mr. Chair, we are wasting valuable time trying to ban the  display of Pride flags in any workplace or common area at the  Department of Defense. This is time that could be used to fund the  government or lower costs for working families.\n\nThis obsession with attacking,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695236/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…majority includes  Democrats and Republicans who recognize that collective bargaining is  not a partisan issue. It is about fairness, dignity on the job, and a  voice in the workplace.\n\nIn his order, President Trump said ending collective bargaining was  about protecting our national defense, but in my district and many  others, affected workers build…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…thirteen Class 1 departments that serve over 500,000 constituents.  Throughout his service, Chief Baker has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…on price gouging, nothing to bring down rent, nothing  to help people buy a home, nothing to lower prescription drug costs,  nothing to raise wages, nothing to strengthen workplace protections,  and nothing to create jobs. Just culture war garbage and corporate  giveaways is all the GOP knows how to do.\n\nAfter 1 year of total power, there is nobody…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…introduced my first bill, the Protect Veteran Jobs Act, to  reinstate veterans who were recklessly terminated without cause under  the Trump administration's purge of the Federal workplace. My bill will  also hold the executive branch accountable for any future terminations  that may occur.\n\nThis isn't about politics. This is about basic decency. This is about…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…into  everyday justice through their implementations. When the landmark  Supreme Court decisions in 2023 and 2024 further restricted race- conscious university admissions and workplace policies, they  accelerated a retreat from this understanding.\n\nThe history of DEI efforts in America is not some partisan agenda. It  is part of our Nation's ongoing work…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Trump's Department of Labor that threatens worker  safety, fair pay, and basic protections for millions of Americans.\n\nThe Department is moving to rewrite or repeal more than 60 workplace  regulations. Let me say that again: 60 workplace regulations. It will  affect conditions in farms, factories, construction sites, and mines.\n\nThese changes are being framed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…who care for our veterans, the flight safety inspectors at  the FAA, nuclear power plant safety workers, and countless others lost  their right to have representation in the workplace. This is unfair,  and it is wrong. Workers deserve the right to make their voices heard  with a union.\n\nMr. Speaker, I was the mayor of my city of Long Beach, California,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…exonerate  the Groveland Four, provide compensation to James Joseph Richardson,  who was wrongfully incarcerated for 22 years, outlaw discrimination  against pregnant women in the workplace, and a Specialty License Plate  to benefit organizations that comprise the Divine Nine with 85 percent  of the proceeds from the sale of the plate benefitting the  organizations…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…about her employees and was  a conscientious friend and mentor to many who aspired to follow in her  footsteps. She was also a fierce advocate for women's equality in the  workplace and in society. She credited her mother and grandmother for  encouraging her and her sister to pursue an education and pursue  careers they could be passionate about.\n\nI…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…because they lack the  skills or the willingness to work, but often because they face  persistent structural barriers, such as discrimination, limited  flexibility in the workplace, and inadequate transportation options,  among others.\n\nWhile small firms employ half the private-sector workforce, they may  face challenges of their own, such as outdated…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…anniversary, I ask my  colleagues to join me in wishing them a hearty congratulations on 50  years of preparing students to learn with integrity, whether in the  classroom, workplace, or the community.\n\nMay God's favor and blessing be upon Trinity Baptist College as it  embarks on the next 50 years.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689692/recognizing-50th-anniversary-of-trinity-baptist-college"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…thousands of Federal workers. These are  career public servants, many of them veterans, who show up every single  day to serve our country. Every American deserves a voice in the  workplace, and that includes the people who keep our government running  and open.\n\nEnsuring collective bargaining rights strengthens our Federal  workforce and helps deliver more…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697983/protect-americas-workforce-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Workers, ascending through the ranks from journeyman to  Business Manager of Local 1070. Over the course of 25 years, he  negotiated contracts that improved wages, strengthened workplace  safety, and upheld the dignity of electrical workers across Michigan's  Upper Peninsula. His dedication towards empowering Michigan's  electricians helped strengthen apprenticeship…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696859/recognizing-thomas-hogan-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…1,000,000       additional STEM professionals than it is on track to produce       in the coming decade.\n\n(3) The field of data science, which is relevant in almost       every workplace, relies on the ability to work in teams and       use computational tools to do mathematical and statistical       problem solving.\n\n(4) Many STEM occupations offer higher…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…toys and new treatments available and new drugs out there, but  if you want me to impact the true cost of healthcare--whether you are  getting your insurance through your workplace, whether you are on  ObamaCare, or if you are on Medicaid or Medicare--if you want me to  save the Federal Government's budget, we need to fix the cost of  healthcare. Getting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…stories and       voices; and\n\n(3) takes all possible steps to ensure the safety,       security, and dignity of American Jews in all aspects of       their lives, including the workplace, college and university       campuses, synagogues, and at home.\n\nMr. SCHMIDT.  Res. 352.\n\nMr. Speaker, this month, we celebrate Jewish American Heritage Month.  First proclaimed…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…government shuts off access to their bank?\n\nWe had a trial run of this during COVID. Lots of people really  objected to all sorts of things about COVID policies, like when their  workplace imposed mandates and restrictions including shots that  weren't really tested or proven. Now we find out that the data, there  is a lot of concern about mRNA, in particular.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…20, the Richard  L. Trumka Protecting the Right to Organize Act of 2025, a bipartisan  bill that would expand workers' rights to organize and collectively  bargain in the workplace, hold employers accountable for violating  workers' rights, and allow for free, fair, and safe union elections.\n\nMr. Speaker, in addition to the slate of partisan bills that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in promoting social justice for  other minority groups, the Jewish community has continued to be  subjected to antisemitism and Jew-hatred, including discrimination in  the workplace, at school, and in public spaces; and\n\nWhereas, this antisemitism and Jew hatred has manifested in places of  work, on campuses, and in society, expressing itself as both…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Republicans worked to undo the damage of the Biden- Harris administration, resulting in less red tape, bigger paychecks, a  blue-collar boom, and a stronger, more resilient workplace.\n\nThe United States will always be the land of opportunity, but the  previous administration shuttered small businesses, choked economic  growth, and enacted countless regulatory…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of a complaint of any form of assault,       harassment, or retaliation, or any other type of complaint,       filed by the covered individual; or\n\n(2) associated, beyond workplace interactions, with the       subject in a manner that may present an actual or apparent       conflict of interest.\n\n(c) Notification Requirement.--With respect to a member…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…they no longer did  a check to verify what their income was? That is not fair.\n\nHowever, the good news is that with this new bill, there are  incentives to get back into the workplace. The latest numbers that came  out indicate 10 million Americans are going to be going back to work.  The odds are they will actually get health insurance paid for by their…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…explanation of the rule lists ESG  factors that it believes are relevant to investment performance,  including impacts to climate change, corporate board composition, and  workplace diversity and inclusion.\n\nH.R. 2988 is essential to restore the neutrality of financial factor- only evaluation when investing to protect America's retirement savers.\n\nMr.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…other communities have banded together to similarly  show support to the members of their community who lost a loved one on  that tragic night.\n\nIt is in each home, school, workplace, and community where each of  the 67 victims was known and loved that they will continue to be  remembered, celebrated, and honored. As we have learned more about the  individual…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…of the resolution is as follows:                                H. Res. 480\n\nResolved,       SECTION 1. MANDATORY COMPLETION OF PROGRAM OF TRAINING IN                     WORKPLACE RIGHTS AND RESPONSIBILITIES.\n\n(a) Requiring Training for All Members, Officers, and       Employees.--\n\n(1) Requirement.--Not later than 30 days after the date of       the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692190/mandatory-completion-of-program-of-training-in-workplace-rights-and-responsibilities"}]