[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…on the side of the American people to solve  problems for hardworking American taxpayers to make life more  affordable and to ensure that in America, Mr. Speaker, when you work  hard and play by the rules, you should be able to provide a comfortable  living for yourself and for your family. You should be able to educate  your children, purchase a home,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…hospital visits rise, and costs skyrocket for  families and the entire system.\n\nHouse Democrats are fighting for a different vision. We are fighting  to make sure that if you work hard, you and your family should have  healthcare and should be able to afford to see a doctor, fill a  prescription, and get the care you need without going bankrupt.\n\nWhile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, House Republicans are back from their 54- day taxpayer-funded vacation. But don't get me wrong, they do know how  to work hard. When billionaires wanted tax breaks, they moved mountains  to make it happen. When Argentina needed a $40 billion bailout to help  Trump's buddy, they moved quickly to make…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696676/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…by the Center for Hope saw  zero homicides. Now they are having to lay off people. Guess what is  going to happen. Those shootings are going to go up again.\n\nWe had to work really hard to find this consensus on a very difficult  issue. It is illegal, what the President has done. He is not allowed,  under the Constitution, to decide unilaterally to cancel…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…who  do so much for the well-being of our country, and whose prosperity is  so essential to the well-being of our whole country.\n\nFarmers like to feed people. They like to work hard. They don't want  a bailout, and they don't want a handout. We have got the tariff  policies that are wrecking the markets, and then we have got a bailout  that is going…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Guatemala to the United States to pursue his  dreams and to help his mother. He was only 26 years old.\n\nCarlos came from Mexico, seeking a better life, and was willing to  work hard for it. He was only 24 years old--taken from us far too soon.\n\nSix individual lives, connected to their coworkers through service,  connected to their families through love,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…tariffs as part of our commitment as Democrats to do what is  necessary to lower the high cost of living and to make sure that every  single American in this country, when they work hard, when they play by  the rules, they should be able to live an affordable life, a  comfortable life, and live the good life.\n\nIt is not too much to ask for in the wealthiest…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…and especially in my home State of Nevada, tipped  workers show up every day, serving food and cleaning rooms. They keep  our restaurants, hotels, and casinos running. They work hard. They  deserve to be paid fairly for every hour that they work.\n\nUnder current law, there is a commonsense protection in place. A  worker  can only be paid a tipped wage…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698970/tipped-employee-protection-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…government, businesses, community groups, and schools to  plant trees, clean up litter, and transform vacant lots into vibrant  community green spaces.\n\nMr. Speaker, they work so hard. Their work makes our neighborhoods  healthier, safer, and more connected, but this administration  terminated grants that made this great work possible. It appears that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…It is a narrowly tailored  fix, but one that delivers profound relief and long-overdue justice.\n\nThis legislation is also about reaffirming a core American value: If  you work hard, play by the rules, and keep your word, your company and  country should keep its word to you.\n\nThese retirees did not speculate. They did not gamble. They paid into  a system…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Affordable Care Act bill--because it is just a reminder that you  are under no obligation as a U.S. Senator to do the wrong thing if you  know what the right thing is.\n\nYou work so hard to get this job, spend your entire life working to  become somebody who can make important decisions like we can in the  U.S. Senate, and you are under no obligation to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…ensure that families like Karisa's  can focus on healing instead of having to focus on the bills they can't  afford.\n\nLook, New Mexicans aren't looking for handouts. They work hard. They  care for one another. I know it because I have lived it. When I was a  kid, we moved in with my grandparents, Celedon and Nestora Lujan. I  didn't understand it then,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…Area welcomes the NFL for Super Bowl LX,  I would like to also properly call attention to this remarkable  program. Bulldogs Coach Tim Tulloch says it best: These students work  hard to overcome adversity, and this transformational program builds  young men for the rest of their lives. The team has a 3.4 GPA. Thanks  to their academic achievements and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…TPS Committee and a member of the National TPS       Alliance.\n\nI have lived in Malden, Massachusetts for over 20 years       with my wife and two U.S. citizen children. I work hard every       day to provide for my family and to be a productive member of       my community in Malden. I am very proud of my two children.       My oldest is 19 years old…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…authorized,  appropriated, and signed into law. Our community should never be  shortchanged. Our taxpayers send their dollars here. They have a right  to get them back. Our people work too hard for a living. We need to  respect them, and we need to build our communities forward, not  backward.                               Year-round E-15\n\nMs. KAPTUR. Mr. Speaker,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Democrats' newfound opposition is  grounded in Trump derangement syndrome.\n\nMs. FOXX. Mr. Speaker, I also thank Mr. Salazar for his work and,  actually, all the staff who work so hard around this Capitol. We are  very blessed.\n\nMr. Speaker, I understand that Mr.--I am going to say this in a  second--Mr. McGovern is ready to close, and I am ready to close.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…low-income housing  where you may get an apartment that other people would have to pay  $1,200 for and you get nothing.\n\nEarned income tax credit can easily be, if you don't work too hard,  getting $7,000 or $8,000 and getting nothing if you are married to a  person with an income.\n\nThere are Pell grants. As one young gal about 22 years old told me,  she…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…The American people know better, and so do the more than 3 million  female high school and college athletes who deserve every single  opportunity to succeed. They work hard; they train hard; they set their  goals; they compete; and they work to succeed.\n\nTo celebrate all of these incredible accomplishments from these 3  million high school and college…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…instilled in him at a young age by his parents, the Reverend and  Mrs. Charles Ginn, to treat others without regard for position or  power, respect elders and love children, work hard, speak the truth,  stand for the American flag and those who fight for our freedom, and  give generously but quietly.\n\nJudge Ginn's life is a master class in respect, honor,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…was a  bartenderess--what she thought about these programs in which you would  get a benefit, not only if you didn't get married, but an even larger  benefit if you didn't work too hard. She said she got married before  she had a baby, but a lot of her friends preferred not to get married  before they had a baby because they got free college. In other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…in the history of the world, is that whatever someone  is today, however much they make today, wherever they came from today,  they can be anything they want to be if they work hard, play by the  rules, and follow their dreams, whatever that dream is, even if that  person wants to be a billionaire\n\nMr. Speaker, frankly, talk to most billionaires. They…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…excellence. He doesn't just know policy and  process; he knows and understands people. He doesn't just build high- impact teams; he builds loyalty among the teams. He doesn't just work  hard; he works well with everyone.\n\nWhen the stakes are the highest, he always delivers results. I have  watched Arjun take on the toughest challenges and find solutions that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…gives schools the flexibility to  serve a broader variety of milk in the school lunchroom.\n\nDairy farmers in Pennsylvania's 15th Congressional District and  across our country work hard every day to produce nutritious milk for  our families and communities.\n\nI am proud to lead this legislation that would allow schools to serve  flavored and unflavored whole…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…service initiative focuses on one-to-one mentoring  relationships, a meaningful way to empower and uplift youth in our  communities. Examples like hers inspire students to work hard, serve  those around them, and find ways to give back to their communities.\n\nJust this past weekend, Allison went on to represent Ohio in the 2025  Miss  America's Teen competition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…almost certainly  can't be married. In order to be eligible, you can't be working very  hard.\n\nI think this body ought to get out of the business of encouraging  people not to work hard, and they especially ought to get out of the  business of discriminating against people who are married with  children. I sure hope that this body, when we finally deal with…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689925/perverse-incentives-of-our-welfare-state"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…players all season long, guiding them and pushing  them toward excellence on and off the field.\n\nI also recognize each parent who supported their players and  encouraged them to work hard. I congratulate each player for their  hard-earned victory and new State title.\n\nCongratulations. Go Fighting Tigers.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689087/congratulating-ironton-fighting-tigers"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…by sacrifice, hard work, and  determination, serve as a reminder of what the American Dream is all  about: that anyone, from anywhere, can come to the U.S. the right way,  work hard, make an honest living, and succeed. That is what it is all  about.\n\nMany of the small businesses I represent are family owned and  operated. As the fifth generation to grow…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…team and for House  Republicans. We passed landmark legislation, and people are going to  see the difference because of it.\n\nI am looking forward to 2026 and continuing to work hard for Utah's  First District.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…years, threatening their ability to survive and remain competitive.\n\nThis is not because small businesses do not want to offer healthcare  benefits. Small business owners work very hard to provide for their  employees. The problem is that healthcare in this country has become  simply unaffordable for far too many businesses and working families.\n\nEmployers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…it would be the sports moment of the century.  Little did we know, 2 days later, on that Sunday, when they played  Finland--it wasn't going to be a gimme game. They had to work hard and  they beat Finland. Remember what Coach Herb Brooks said: If you lose  this game, you are going to take it to your blankety-blank graves. They  were ready for it.\n\nI…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}]