[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…and  I am tired of it. I am tired of people getting kicked around because of  the countries they came from and color of their skin.\n\nI speak from personal experience having worked as a missionary in  Central America. And I know the kinds of people who come here, and I  know why they come here. They come for the same reason my great- grandparents came…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…childcare staff, and shielding public shipyard employees  from reductions in force or hiring freezes.\n\nI am very grateful that this bill moves forward a reform that I have  worked on for years. It authorizes automatic Selective Service System  registration for eligible men, making the system more fair and  efficient.\n\nI am especially proud that this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…partnerships. Her dedication to the men and women of Space  Base Delta 2 is evident in every action she takes on their behalf.\n\nDuring her time at Buckley, Colonel Dexter has worked to bolster the  morale and well-being of the personnel under her charge. Her commitment  to creating a supportive environment does not go unnoticed and has  contributed to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693378/recognizing-colonel-heidi-dexter"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Federal partner that  matches their commitment, and today, they are getting that.\n\nMr. Speaker, both New Mexico and I thank my colleagues on the other  side of the aisle who worked tirelessly to bring this legislation to  the finish line. I also thank the local leaders, our county  commissioners, school superintendents, teachers, parents, and  firefighters,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…away, he said: What happened to the Appropriations Committee?\n\nNow, Senator Hatfield was a Republican, and he had been chair of the  Appropriations Committee. And he said: I worked so closely with Dan  Inouye of Hawaii, and I worked so closely with Patty Murray of  Washington. What has happened to that collaboration?\n\nThat was several years ago. But as…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…residents whose lives are upended by the  constant, incessant noise of helicopters traveling at low altitudes  over our neighborhoods.\n\nSince taking office, we have consistently worked to address these  challenges, from the noise and nuisance they cause to the safety risks  that have been well documented.\n\nIn the 118th Congress, we introduced two pieces of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…students in Stafford.\n\nWhether in city hall or in the classroom, she has made community a  cornerstone of her tenure as a public servant and educator. She has  also tirelessly worked to increase reading comprehension, counter the  harmful impacts of social media on young people, and she supports  phone-free schools.\n\nHer work reminds us that educators don't…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…celebrating their 50th anniversary of  serving as the public housing authority for Jefferson County, Colorado.\n\nFirst created in the fall of 1975, Foothills Regional Housing has  worked to meet the growing housing needs of Jefferson County by  preserving existing affordable housing units and developing new ones.  In addition to supporting low-income renters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…airplane rides at the Nashua Airport. His slogan was: ``A $1  million thrill for a $1 bill.''\n\nHe went on to become a door-to-door salesman for Electrolux vacuum  cleaners. He worked hard because he believed in the American Dream. He  was a lifelong Republican who loved one of our great Presidents with  his whole heart, I think maybe the greatest economic…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…work, things that cure diseases we never thought were possible to cure.  That is how our economy has been so strengthened, and we have led  across the world.\n\nYou know, I have worked for years to cut redtape, and I know there is  more to do. I know there is more we can do to make our government  effective. But we can do that together and take the ideas…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President's actions have been as repulsive as putting  veterans in the crosshairs of so-called ``government waste.'' I want to  share the story of one employee, a woman who worked at the Marion VA  Medical Center in southern Illinois. Every year, this facility serves  43,000 veterans.\n\nLike many VA employees, she received an email in the middle of the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…things  than trying to again avoid a catastrophe like that.\n\nIt appears that this week we actually are going to take up the budget  reconciliation bill that again has been worked out down at the Mar-a- Lago hotel over the last 2 months or so, where a conga line of  billionaires have been observed walking through, meeting with  leadership of the Republican…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…who continually work to ensure those buried  far from home are done so in dignity and with their true heritage  represented. Their efforts and the efforts of those who have worked so  hard to bring this program and legislation to this point assure that  we, as a nation, with our  overseas partners, will work continuously for accurate representation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I want to first thank Chairman Rogers and  Ranking Member Smith for the manner in which they worked together in a  bipartisan way. It is an example of what has taken place here for  almost 60 years, where we come together for this legislation. I will  just add, though, that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…received Federal approval to use Medicaid to cover preventive mental  health services in the community, which can reduce costs down the line.  And with Senator Capito, I have worked on Federal legislation to  increase funding for trauma-informed care in schools and with first  responders, to help break the cycle of mental health challenges.\n\nI applaud…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…trained as a journalist and  took courses focused on broadcast journalism and photography, sparking  his interest in the industry.\n\nFollowing his tenure in the Navy, Bruce worked for a newspaper in  Connecticut and later returned to Pennsylvania and worked for the  Williamsport Sun-Gazette as a photographer. In 1973, Bruce accepted a  position as assistant…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…their commitment to environmental preservation and education  in the town of Cornwall and across the Hudson Valley of New York State.\n\nSince 2023, this grassroots group has worked with community members  to clean up litter and illegal dumping around the town and educate the  public on the importance of conservation and environmental protection.\n\nStarted…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rapid response efforts. In the days  immediately following Hurricane Helene, 49 residents received critical  assessments and essential resources. After Hurricane Milton, they  worked with 225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…prosperity, and that is  what this bill seeks to achieve.\n\nThe partnership between the private sector, States, and the Federal  Government envisioned by the Clean Water Act has worked to improve  water quality nationwide. This is a very good thing. We all share the  goal of achieving clean water. However, 50 years after its passage, the  Clean Water Act…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…companies on  Wall Street. It is about giving a startup in Pella the same shot as a  company in Palo Alto.\n\nIt is about jobs, real jobs right here at home.\n\nWe know the JOBS Act worked. Now, we have a chance to build on that  success. By passing the ELEVATE Act, we make it easier for Main Street  businesses to get access to the capital they need.\n\nI thank…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Chairman Cole for yielding  time.\n\nMr. Speaker, I rise in strong support of H.R. 6938. As chairman of  the Energy and Water Development and Related Agencies Subcommittee, I  worked hard to ensure this bill includes many House Republican  priorities.\n\nThe bill provides a total of $58 billion to advance our national  security, strengthen our economy, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Finance Authority.\n\nPresident Arrington succeeds President Mark Conine, who served the  authority from May of 2021 until his departure during 2025. President  Arrington has worked at the authority since 2014 and was previously the  vice president of homeownership and public finance.\n\nThe ADFA was established by then-Governor Clinton in 1985 to promote…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "French Hill", "party": "Republican", "sentence": "…substantively the same. They can't be treated identically. That is a  huge flaw in this rule.\n\nMr. Speaker, I reiterate my support for Mr. Flood's support of S.J.  Res. 28. He has worked hard on this with Senator Ricketts from his home  State of Nebraska. They stand on the facts that a vote for this  resolution is a vote to prevent the CFPB from stifling financial…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in the summer of  1900.\n\nIn addition to serving in the marines, Mr. Upham worked as a letter  carrier for the Guthrie Post Office for 40 years. He retired from the  U.S. Postal Service, and he died February 14, 1949, in Guthrie,  Oklahoma, where many of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…home and abroad. And they should not have to wonder when or  if they will get paid.\n\nA shutdown isn't good for our reputation abroad and our cohesion at  home.\n\nI have always worked to find some path, some deal, some way to keep  the government open, and I have talked to a dozen colleagues in recent  days about this fight and about tonight.\n\nThis is about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…perfect example but because they know  the profound human hunger for freedom--the legislator from Burma now  serving in exile; the legislators from Ghana and from Poland having  worked hard to resist corruption, oppression, state power, looking,  yes, to America's example but, frankly, charting their own course  because they know that the future for their…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…allotment that you wanted? Sorry. When you were  fighting for your country, we passed a law saying you can't get it  anymore.\n\nWell, look, I thought that was a huge injustice, so I worked on a  bill during President Trump's first term to say: Now, wait a minute, if  you were overseas serving your country, and you missed your ability to  apply for a Native allotment,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…veterans, he has taken on challenges that show  real initiative and follow-through.\n\nRia, a student at Moravian Academy, volunteered at a camp for  children with special needs, worked to better herself academically,  played on her school's tennis team, and planned a family trip to  Toronto. Her work reflects both compassion and determination and a  clear…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692462/recognizing-adam-wyatt-and-ria-gandotra"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…They serve as a bridge between the  private sector and government, and they help ensure that entrepreneurs  have a voice. Their efforts deserve our thanks.\n\nAs someone who worked in small business, I understand the challenges  entrepreneurs face, and while I was fortunate to help grow a small  business into a larger business, I never lost that small…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Commander in the 101st Airborne's 3rd  Brigade Combat Team.\n\nAfter his tenure as a company commander, Rob was stationed at the  Pentagon as an Army Staff operations officer. He worked directly for  the chief of the Integrated Personnel Pay System--Army (IPPS-A) program  and later returned to the 101st Airborne to serve as its Chief of  Operations and executive…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}]