[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Chappy, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Chappy's hard work, determination, and perseverance  at Mandalay Middle School and is clearly…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691280/recognizing-chappy-sharp"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Avery, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Avery's hard work, determination, and perseverance at  Wayne Carle Middle School and is clearly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691828/recognizing-avery-kenkel"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Violeta, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Violeta's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690383/recognizing-violeta-monserrat-diaz-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Zoe, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Zoe's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692041/recognizing-zoe-kante"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Darci, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Darci's hard work, determination, and perseverance at  Oberon Middle School and is clearly…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691150/recognizing-darci-lind-gartman"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Valeria, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Valeria's hard work, determination, and perseverance  at Arvada High School and is clearly…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689450/recognizing-valeria-seanz-alvarado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jackson, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Jackson's hard work, determination, and perseverance  at Drake Middle School and is clearly…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690051/recognizing-jackson-minor"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jayden, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Jayden's hard work, determination, and perseverance  at Arvada West High School and is clearly…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689669/recognizing-jayden-degroot"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Isabella, develop crucial skills and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Isabella's hard work, determination, and  perseverance at Excel Academy and is clearly just…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690024/recognizing-isabella-ekman"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Kai, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Kai's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691740/recognizing-kai-weiss"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Diego, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Diego's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690381/recognizing-diego-estrada-ponce"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Elijah, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Elijah's hard work, determination, and perseverance  at Oberon Middle School and is clearly…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691148/recognizing-elijah-bertone"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alfonze, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Alfonze's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690988/recognizing-alfonze-romero"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Elijah, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Elijah's hard work, determination, and perseverance  at Mandalay Middle School and is clearly…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691283/recognizing-elijah-stimpfl"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Brody, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Brody's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690316/recognizing-brody-hafer"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the Ironton  Fighting Tigers for winning their first football State championship in  35 years.\n\nWith an incredibly strong work ethic and a commitment to excellence,  the Ironton High School football team spent all season training and  working together with one goal in mind: the State title.\n\nIn the championship…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689087/congratulating-ironton-fighting-tigers"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…recognize and thank my  operations director, Alex Keledjian, for his 4 years of service in the  House of Representatives, and this is Alex's son, Anthony.\n\nAlex's dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and my office on track, smiling,  and teaching us Armenian history along the way.\n\nWhile…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690909/recognizing-alex-keledjian"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Executive Officer, Dan has exemplified steady leadership, a deep sense  of responsibility, and a commitment to doing right by others. His  career reflects the integrity and work ethic that define our state.\n\nThroughout his four decades at Principal, Dan helped guide the  company through times of change and growth while staying true to its  mission of serving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…decade of service to our Nation as a dedicated staff member in the  House of Representatives, most recently as my legislative director over  the last 4 years.\n\nHis diligent work ethic, sharp intellect, and the ability to build  trusting relationships on both sides of the aisle have made him an  invaluable part of my team.\n\nHis legislative team advised…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688120/thanking-alex-cisneros-legislative-director"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…free market economy.\n\nI think people like being free better. When you talk about  testimonials in the old Soviet Union, Mr. Speaker, and probably to this  day because the work ethic hasn't changed enough, you run into a lot of  very unhappy people because they are stuck in an economic system in  which they have to work for the government.\n\nAs a matter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…K-9 officer, member of the Selective Enforcement Unit, member  of the Lancaster County Special Emergency Response Team, and platoon  leader. Demonstrating an unparalleled work ethic, he rose through the  ranks, and in 2021, was appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…strategic planning  efforts.\n\nColleagues, elected officials, and staff throughout Michigan have  come to respect Karry Hepting's professionalism, integrity, and  tireless work ethic. She has set a high bar for public administration  in county government and leaves behind a legacy of collaborative  leadership.\n\nMr. Speaker, Karry Hepting's decades of…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…European Theatre of Operations. His  efforts played a key role in providing peace for our country and does  not go unnoticed. He also continued to demonstrate his strong work  ethic at General Motors, where he later retired from leaving a proud  legacy of hard work behind.\n\nBeyond his dedication to our country, Albert is a lifelong volunteer  who finds…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692324/recognizing-wwii-combat-veteran-albert-busacca-on-his-100th-birthday"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…graduation rate, and  exceeding expectations for college readiness.\n\nIn high school, students learn more than just math and chemistry  equations. Rather, students build their work ethic, establish critical  thinking skills, and learn what it means to be a citizen of our great  country. Teachers are endowed with educating our students, which is why  I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…that Frank finds himself  open downfield. In fact, this was Frank's first reception and first  touchdown of his NFL career. Frank's touchdown is the result of an  unwavering work ethic and a commitment to excellence.\n\nFollowing a commendable collegiate career at the University of  Wyoming, Frank went undrafted in the 2024 draft, but he did not let  that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…women in the  world.\n\nAs a father of three girls, I am happy to see young women like  Allison and Olivia setting a great example for girls around them of  confidence, a solid work ethic, and a drive to serve others.\n\nThis program is more than just a pageant. It promotes healthy living,  creative expression, and academic achievement, while offering  scholarship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Professionals Summits, Susan  has created career development and community building opportunities.\n\nSusan's impact reaches far beyond her formal responsibilities Her  tireless work ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in fostering an inclusive and…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…tenure, Ms. Krzysiak has demonstrated a commitment to  public service and to the residents of Crawford County. Her extensive  knowledge, attention to detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community members…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…pathway to public service.\n\nI congratulate Jack, Nicholas, Sara, Sadie, Madison, Mark, and  Jessica on their well-deserved achievement.\n\nTheir work embodies the values and work ethic of the University of  Georgia. The university's success reflects the amazing work of its  faculty, staff, and students.                            Cheers to Nic Wallace…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…in the footsteps of his father,  Joseph, and his two brothers, Paul and Jeff. His career was defined by  an unwavering commitment to his duties, demonstrating an exemplary work  ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}]