[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Speaker, working people are sick and tired of  corporate greed."}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "It's not       right or fair to give very earthly people tax breaks while       increasing necessary expenses for average hard working people       who are barely getting by."}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "I mean, we call it Medicaid, but it is healthcare for poor  children, for poor seniors, for working people, for disabled people,  for people that are living in nursing homes that have no other options."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "They say  they fight for working people."}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Congress is  perfectly capable of cutting taxes for working people without also  cutting taxes for those at the top."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, to hear the impassioned pleas for  regular working people to take high-pressure showers in motels because  that is not why Donald Trump signed an executive order on this issue."}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Speaker, we will continue to work and vote for working people,  and we will vote ``no'' on this budget."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Speaker, President Trump's tariffs are raising  costs on working people."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "For most hardworking people, this  is a catastrophic amount of money that suddenly needs to be added to a  monthly budget."}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "1949, the Unlocking our Domestic LNG  Potential Act, is a direct threat to working people and middle-class  families in my district and across the country."}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Speaker, I rise today because working people in St."}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Speaker, the working people of my district rely on Federal  programs and services, and they also rely on the essential  organizations in Illinois-03 that provide federally funded social  programs and services."}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "In Shackelford and Hockley Counties, folks said that it is about time  that we put a stop to Biden's war on energy so that we can lower energy  prices for working people; so that we can strengthen our energy  security; and so that we can unleash not just American energy  dominance, but American prosperity for our children and children's  children."}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "These are working people that they have forgotten."}, {"senator": "Chris Coons", "party": "Republican", "sentence": "President Trump ran on making America healthy again, on reducing  prices, on making life easier for the working people of our country and  their families."}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Not long after,  he stepped up as a union activist in CSEA's SUNY New Paltz Local  working as a shop steward and grievance representative, driven by his  belief in standing up for the working people."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "What we did in the  reconciliation budget: incentives to invest in America, to build new  plants of equipment, for working people to have some things to actually  draw them back into the labor force, no tax on tips, no tax on  overtime, some of these things."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "President Trump was elected on the promise of finally making the  government work better for working people."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "For working people in my district, who are not making about 27 or 28  percent more than the first year of the Biden administration, they are  poor today."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "It sounds like Bernie Sanders is in the Chamber, but  really this is about the working people of this country."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We cannot allow the taxes to go up on working people in this country."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "They crushed working people's wages."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "You did a suppression of working people's wages, and this one  takes us out about a decade."}]