[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…would saddle them  with more than $3 trillion in additional debt to provide massive tax  breaks to billionaires in this country, and then pay for some of it by  going after working-class Americans, everyday Americans, hardworking  American taxpayers, middle-class Americans, children, veterans,  seniors, and people with disabilities. Mr. Speaker, Trump's…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…percent of that will go to the shareholders. Forty-four percent of that  tax cut will go to high-end executives.\n\nThe fat cat executives are going to get this money, and working-class  and even middle-class people are going to get stiffed with the cuts.\n\nThis is about life and death. It is not a simple piece of legislation  that we will pass. There are…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688045/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…dollars will be spent on health  expenses that could be avoided.\n\nCommunities like the ones I represent, low-income neighborhoods near  freeways, ports, and warehouses and working-class communities of color,  are already, indeed, breathing some of the dirtiest air in our country.\n\nThousands of people in California and around the country wrote in  support…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690469/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "Ms. OCASIO-CORTEZ. Mr. Speaker, it is great. It is great that  Democrats have a line of people who are willing to fight for working- class Americans from coast to coast in this country.\n\nMr. Speaker, God forbid that we have a Member of the Republican  caucus who stands up and actually wants to extend the Affordable…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696688/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Speaker, I rise today to discuss the fiscally  irresponsible one big, beautiful bill that simply gives tax breaks for  the richest Americans and takes away services for working- and middle- class families.\n\nHere are the facts: We currently have about a $36 trillion debt, and  we are spending right now $2 trillion more every year than we take in.  The Republican…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that  principle is to extend the Affordable Care Act tax credits, which are  scheduled to expire in 15 days. That means that tens of millions of  Americans, working-class Americans, middle-class Americans, people in  urban America, rural America, small-town America, suburban America, the  heartland of America, Black and Brown communities all throughout…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…health care crisis,  skyrocketing costs from Trump's tariffs and a weakening economy,  Republicans have refused to extend the Affordable Care Act premium tax  credits for working class families, which will expire December 31,  2025. I include in the Record a note from a constituent named Shemeka  who captures how devastating the loss of the enhanced tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698417/healthcare-is-real"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…final approval for what would have been the  Nation's largest solar farm, a 6.2 gigawatt project in the Nevada  desert. He illegally ended low-cost solar installation for working- class families that would have helped them and their family budgets.\n\nThe President now has canceled major upgrades to the power grid out  of the bipartisan infrastructure law,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Democrat in this House to vote  against a devastating budget advanced by House Republicans to enrich  the ultrawealthy at the expense of our working families.\n\nI grew up in a working-class family. I am the first and only person  still to have gone to college and graduated in my family. A union job  offered me the opportunity at 16 to pay my way with rent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…citizen, I  unconditionally and absolutely reject President Trump's and Elon Musk's  work to steal American's Social Security benefits, a scheme that hurts  middle-class and working-class families and seniors to pay for tax  handouts to billionaires. When Americans already face increased prices  and economic hardship from the President's chaotic policies,…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…for anchoring this important Special Order hour.\n\nMr. Speaker, the bill that the House Republicans sent to the Senate  would create the largest transfer of wealth from the working class to  the well-off in our Nation's history. Folks who were already doing  everything they can to make ends meet, working several jobs to put food  on the table, and keep…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…agenda.\n\nDemocrats have made protecting Medicaid a centerpiece of       their attack on the party-line GOP agenda, accusing Trump of       trying to cut health care for the working class to pay for       tax cuts for the wealthy.\n\n``This letter from CBO confirms what we've been saying all       along: the math doesn't work without devastating Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…approval, capping the cost of childcare,  expanding health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where so many families felt  the strain, the message from Delaware is clear: We need solutions, not  tariffs and cuts to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…it will be the American people who are  footing the bill for the Trump tariffs.\n\nWhen we talk about American people, let's be clear. This is the  middle class. These are working-class, hard-working people who will be  impacted.\n\nDo you know what? This administration knows the truth. They know that  these tariffs will raise prices and spike inflation…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…for billionaires, adding $4 trillion to  the national debt over the next 10 years.\n\nSince then, House Republicans have only doubled down on their attacks  on the working class, the middle class, and vulnerable Americans.\n\nLast night, Republicans on the Appropriations Committee forced  through their reckless 2026 Labor, Health and Human Services, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed and on President  Trump's desk, then middle- and working-class families will be the ones  who pay the price.\n\nSome of my Democrat colleagues continue to lie about what our bill  does. Mr. Speaker, the truth is that the One Big Beautiful…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…appreciate the leadership of both Mr.  Moore and Mr. Arrington. Both of them are great mentors to me as a new  Member. I hope I can aspire to be as strong as they are someday.\n\nWorking-class families, seniors on fixed incomes, farmers growing our  food, restaurant waitresses working double shifts, law enforcement  officers putting in overtime, manufacturers…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…PERRY. Mr. Chairman, there are a lot of things I agree with the  gentlewoman from Ohio about. We have hardworking people. Whether they  are in Harrisburg or in Ohio, they are working-class people. I am one  of them, having spent most of my life turning wrenches, laying in  ditches, and things like that. We know how to work in Pennsylvania.\n\nWhere we agree,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…farmers in Mississippi and across the  Southeast have been weighed down by burdensome permits and processes  created by people too far removed from the realities of everyday,  working-class Americans.\n\nIt is past time we restore a commonsense approach to this and ensure  that our farmers can finally defend their ponds without any Federal red  tape in the way.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…with respect  to renewing the Trump tax cuts, with respect to creating and passing  legislation to prohibit tax on tips and tax on overtime, and all the  new blue-collar, working-class tax cuts that President Trump campaigned  on and received a mandate to do.\n\nAfter the mandate, draining the swamp, and passing the America First  agenda, next is to work…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Democrats fueled inflation. They opened our  borders, funded illegal immigration with your tax dollars, and  increased IRS audits on the middle class, all while leaving the working  class behind.\n\nPresident Trump promised to make America great again, and 77  million--77 million Americans supported that promise. They voted for  change. The One Big Beautiful…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…have the  opportunity to give the country what they voted for.\n\nOur one big, beautiful bill is exactly what voters want. It delivers  the largest tax cut for middle- and working-class families in decades.  It cuts taxes on tips and overtime, allowing American workers to keep  more of their hard-earned money. It increases the child tax credit,  which…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…characterize  this imminently reasonable request as something that is parochial in  nature. I will say, however, that when we advanced the largest tax cut  for middle- and working-class Americans in American history, when we  advanced this broader initiative to make Medicaid more sustainable for  all Americans and take Medicaid back to its original purpose,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…inflation,  by the way--which offered tax credits for electric vehicles that are  produced with reliance on Chinese supply chains and, perversely, taxed  low-income and working-class families in order to provide the subsidies  for rich people who could buy electric vehicles. Just bizarre.\n\nInstead of incentivizing the purchase of these exotic vehicles…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…resolution  paves the way for historic investment in our country's border security,  permanent tax relief for the middle class, getting rid of the inflation  tax that has hit the working class, and rooting out waste, fraud, and  abuse throughout our government.\n\nMr. Chair, Americans demand better. This resolution does that. I urge  a ``yes'' vote.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688043/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…national       and energy security. During a time of high inflation across       the country, this misguided rule will almost certainly lead       to higher energy prices for working class families across       America. Restricting access to energy development limits       consumers' access to affordable, reliable energy.\n\nFurthermore, oil production on the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…particular about  the One Big Beautiful Bill Act.\n\nThe narrative that the One Big Beautiful Bill Act only gives tax cuts  to billionaires is just false. The bill cuts taxes for working-class  families who need it most. As a result of the One Big Beautiful Bill  Act, the top 1 percent will pay more in Federal taxes than they did  before the Tax Cuts and Jobs…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…doing this. We have a bunch of provisions  of the 2017 tax reform that begin to expire. Most of those provisions  actually are to the benefit of small businesses and the working class.  I will show that over and over and the distributional effects.\n\nMr. SCHWEIKERT. Madam Chair, I yield myself such time as I may  consume.\n\nI have to figure out, do I sit…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…chance to lock in the agenda that the American  people voted for in November by cutting out waste, fraud, and abuse,  supporting small businesses, and supporting the American working class.\n\nThis legislation that we have produced in the Energy and Commerce  Committee will strengthen Medicaid for low-income children, for  pregnant women, for the elderly, and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…of the Union  speech, Republicans stood in agreement and Democrats sat on their  hands.\n\nThe President talked about passing the largest tax cut in American  history for working class families, like yours and mine, a tax cut that  is significant.\n\nIn Indiana right now, by the way, early tax returns for Hoosiers, a  10.9-percent increase in those tax…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}]