[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I thank the distinguished gentlewoman, the  top Democrat on the House Appropriations Committee, for yielding and  for her steadfast leadership on behalf of working families and  hardworking American taxpayers in the great State of Connecticut, and  all across America.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "This resolution would have us remove a capable and hardworking member  of one of the most serious working committees in this body on the basis  of a conversation from more than 6 years ago, which broke no rules,  broke no laws, and has no connection to any criminal activity.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-11-18"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "When you look at the largest freshwater basins of our Great Lakes,  when you look at the arsenal of democracy, when you see our incredible  trade unions from Saginaw up to Iron Mountain working and making and  delivering--the only polysilicon manufacturing in the Nation exists in  Michigan, in a place called Hemlock by a company called Hemlock--you  want to make sure that Michigan has its fair and equal representation.", "title": "Reflecting on America's History", "date": "2025-04-08"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "1949, the Unlocking our Domestic LNG  Potential Act, is a direct threat to working people and middle-class  families in my district and across the country.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Speaker, I rise in great urgency to voice the concerns of  hardworking families in Indiana's First Congressional District.", "title": "Devastating Harm Caused By Trump Administration", "date": null}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "It is about  ensuring these workers have a voice in their workplaces and the ability  to negotiate for fair wages, decent working conditions, and dignity.", "title": "Providing for Consideration of H.R. 2550 to Nullify the Executive Order Relating to Exclusions From Federal Labor-Management Relations Programs, and for Other Purposes", "date": "2025-12-10"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Or  maybe there is more electricity left over for the AI industry if you  are working in a way that is trying to maximize American ingenuity.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "At a time when China, Russia, and Iran are working overtime to  challenge American influence, this bill says: Go right ahead.", "title": "Providing for Consideration of H.R. Rescissions Act of 2025", "date": "2025-06-11"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "I am so proud of our bipartisan ranking  members working hard to get this provision and this bill across the  line.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-08"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "I thank Chair Guthrie for working with me on this bipartisan bill.", "title": "Secure Space Act of 2025", "date": "2025-04-28"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "So everyone in this room has, in  their State, hard-working immigrant families who do not appreciate  being demonized by the President and his policies.", "title": "-9999", "date": "2026-02-03"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Republicans are so out of touch with the reality of American families  right now, and it is shocking to call these cuts not meaningful when  their bill will hurt working families.", "title": "Gop Tax Scam Hurts Everyone", "date": "2025-05-20"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Republicans' ``Big Ugly Bill,'' which eliminated programs working to  lower household costs and get clean energy built, is expected to cause  wholesale electricity prices to rise by 74 percent over the next 10  years--that is just in one bill--while keeping 350,000 megawatts of  wind and solar off the grid over the next 10 years.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Speaker, I rise today because working people in St.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "A single mother in Atlanta working two jobs is now  facing losing her Medicaid.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Through the  persistent efforts of my staff working hand in hand with Army Personnel  Command, we confirmed that his Silver Star had been authorized decades  ago but never delivered.", "title": "Focusing on Results", "date": "2025-11-18"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Davis brings a strong record of public service and a deep  understanding of the legislative process gained from his time working  for me on the Senate Judiciary Committee.", "title": "-9999", "date": "2025-06-04"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mark began working in the House of Representatives just over 20 years  ago for his hometown Congresswoman, Ms.", "title": "Historic Tax Relief for Families", "date": "2026-02-04"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Ever since the Big Beautiful Bill was signed into law, and even when  lawmakers were working hard to make it over the finish line, our  Democratic colleagues said that they found political gold in this bill  and that this would be the pathway for them to win back the majority in  the House of Representatives in 2026.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Nita knew that real solutions come from working  across the aisle, and her ability to build consensus led to critical  investments in education, healthcare, and infrastructure that benefited  New Yorkers and Americans across our country.", "title": "In Memory of the Honorable Nita M. Lowey", "date": "2025-03-27"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "I appreciate the cooperative manner in which our       committees have worked on this matter, and I look forward to       working collaboratively in the future on matters of shared       jurisdiction.", "title": "Stop Forced Organ Harvesting Act of 2025", "date": "2025-05-05"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Harnessing  and unleashing American energy brings down electricity prices for  families and boosts real wages for hardworking  Americans who keep our economy running.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": null}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "During Audiology Awareness Month, Americans should be aware that they  can access hearing aids over the counter, and Congress is working hard  to improve access to those audiology services.", "title": "National Audiology Awareness Month", "date": "2025-10-28"}, {"senator": "John Carter", "party": "Republican", "sentence": "It breaks my heart because we do have such a good working  relationship across the aisle with Chairman Carter and myself.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "John Carter", "party": "Republican", "sentence": "He leveraged his expertise to improve  efficiency while working with several U.S.", "title": "Saluting the Service of Colonel Garry Patterson", "date": "2025-03-31"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "We are working across the  aisle, which we should do.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "We would simply go back  to the rule that was in place that was working fine before the Biden  administration came in and put this onerous rule in place.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''", "date": "2025-04-29"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Jay spent his life working to make Iowa a better place, from his  years as CEO of the Greater Des Moines Partnership, where he championed  economic growth across the metro, to his time as president of Simpson  College, where he put his students first every single day.", "title": "Myths of Medicaid Reform", "date": "2025-05-06"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Here is what one former employee told a local paper after the plant  closed for good:\n\nNow I am working at the Lutheran Home, driving a van, and       making a third of the amount of money I made before.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}]