[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Amelia's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.", "title": "Recognizing Amelia Ferkuniak", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This  award is a testament to Rachelle's hard work, determination, and  perseverance at Arvada High School and is clearly just the beginning of  a bright and promising future.", "title": "Recognizing Rachelle Martinez Marentes", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Lilith's hard work, determination, and perseverance  at Jefferson Jr./Sr.", "title": "Recognizing Lilith Roberts-Ruiz", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Darci's hard work, determination, and perseverance at  Oberon Middle School and is clearly just the beginning of a bright and  promising future.", "title": "Recognizing Darci Lind Gartman", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This  award is a testament to Fernanda's hard work, determination, and  perseverance at Jefferson Jr./Sr.", "title": "Recognizing Fernanda Orozco Saenz", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Luke's hard work, determination, and perseverance at  Arvada West High School and is clearly just the beginning of a bright  and promising future.", "title": "Recognizing Luke Setelin", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Omar's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.", "title": "Recognizing Omar Lautenbach", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Devonte's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.", "title": "Recognizing Devonte Bonggas-Ellenburg", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Julissa's hard work, determination, and perseverance  at Wheat Ridge High School and is clearly just the beginning of a  bright and promising future.", "title": "Recognizing Julissa Martinez", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Kloey's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.", "title": "Recognizing Kloey Kehl", "date": "2025-06-04"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Miya's hard work, determination, and perseverance at  Jefferson Jr./Sr.", "title": "Recognizing Miya Atencio", "date": "2025-04-28"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Diego's hard work, determination, and perseverance at  Jefferson Jr./Sr.", "title": "Recognizing Diego Moreno", "date": "2025-04-29"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This  award is a testament to Abdullahi's hard work, determination, and  perseverance at Jefferson Jr./Sr.", "title": "Recognizing Abdullahi Ali", "date": "2025-04-28"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Jackson's hard work, determination, and perseverance  at Drake Middle School and is clearly just the beginning of a bright  and promising future.", "title": "Recognizing Jackson Minor", "date": "2025-04-10"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "MaryJo has been a fixture at George Fox University, and her hard work  and determination led her to be one of two inductees to the Women's  Golf Coaches Association's Hall of Fame.", "title": "Congratulating Maryjo McCloskey", "date": "2025-12-12"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "John  Adams and his family demonstrated that ideas, hard work, and  determination can change an entire nation for the better.", "title": "Adams Memorial-Great American Heroes Act", "date": "2025-12-09"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Their stories, defined by sacrifice, hard work, and  determination, serve as a reminder of what the American Dream is all  about: that anyone, from anywhere, can come to the U.S.", "title": "Help Small Businesses Thrive Again", "date": "2025-05-06"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Pelissero's story reminds us of how hard work, determination, and  dedication can shape a community.", "title": "Recognizing Mr. Thomas L. Pelissero for Authoring Bring One Home", "date": "2026-01-21"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "She is known by others for her hard work,  determination, strong ability to collaborate with other colleagues and  work in a team, and for the brightness and positivity that she brings  to the school.", "title": "Ten Radical Failed Policies of Governor Newsom", "date": "2025-06-06"}]