[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…no place for them to  go.\n\nIt is not just the residents at these nursing homes; it is their  children who now can breathe easy for their parents who helped raise  them and worked so hard through the years to provide for them.\n\nStaten Island is a middle-class community, and so is Long Island--the  two places I visited--but their kids would not be able…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…enrolling in the Denver Joint  Electrical Apprenticeship program, and went on to become Vice President  of IBEW 68 and eventually President.\n\nAs a part of Local Union 68, he worked tirelessly to ensure his  fellow electricians had safe, rewarding careers. President Buchanan  embodies the qualities essential to being an effective leader. His  union brothers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…addition to his fervent work  to support Ukraine.\n\nFor years following the fall of Communism and particularly after the  Rose Revolution in 2003, the people of Georgia have worked to  successfully build their democracy and their economy, all while  fostering aspirations to join the EU and NATO.\n\nThe United States, along with European partners, have played…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…because they don't want you to have an energy-efficient appliance.\n\nThis isn't something that happens overnight. This is something that  manufacturers and consumer advocates worked on for years.\n\nThe previous speaker asked when the Department of Energy got into  energy efficiency. It has been decades that they have been doing this,  trying to help people…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…1988, she retired from Point Park College, now  Point Park University, as the associate director of office services and  the director of the mailing department.\n\nWhile she worked at Point Park, Mrs. Cole earned her associate of  arts degree in journalism and communications. She was inducted into the  Alpha Sigma Lambda, a National Honor Society for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…their laboratory  got shut down.\n\nMedical devices was another one. I met a gentleman who was a  mechanical engineer. He had been trained and earned his Ph.D. in  research. He worked for the Federal Government. I believe he was at the  FDA, if I recall correctly. He did tests to make sure that the medical  devices that were up for approval had been tested…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and drove him to appointments       was a skilled and compassionate person. Most of all, this man       respected and showed love for my dad. He lived an honest       life, worked 24 hours a day, 7 days a week--and performed a       job that was desperately needed. This man who kept my father       alive was an immigrant with temporary status.\n\nRemoving…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…vote on--would save businesses up to $4.6 billion  over 30 years. These are savings that restaurants and grocery stores  could pass on to their customers. And if you have ever worked in a  kitchen, you know the importance of reliability and cost savings.\n\nEliminating this rule would only inject further uncertainty into the  market, punish forward-thinking…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…skating in the past.\n\nTo the servicemembers who lost their lives on PAT 25, we thank them  for their service to our Nation.\n\nTo the first responders who rushed to the scene and worked in frigid  and dangerous conditions to save anyone they could, including Fairfax  and Prince William Counties' first responders, we are so grateful.\n\nTo the professionals at…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688367/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…for farmers to reach to grow and prosper.\n\nAccording to the World Bank, in the recent decade, trade has lifted 1  billion people out of poverty. My colleagues here, who have worked on  deals in the past that opened up markets in places like Chile, Peru,  Singapore, the Central America Free Trade Agreement, the update of the  USMCA, all know that this…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…state of former President Jimmy Carter, and the 60th inaugural  ceremonies. And after the President-elect requested the ceremonies be  held indoors, our staff and partners worked around the clock to prepare  the U.S. Capitol Rotunda for the ceremonies and the Capitol Visitor  Center Emancipation Hall for additional guests to watch the  proceedings.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…bipartisan  GENIUS Act. This legislation builds on the bicameral negotiations that  Chairman Hill, former Chairman McHenry, Chairman Steil, and I, and so  many others, have worked so hard on for the past years.\n\nThe GENIUS Act is smart bipartisan legislation that backs stablecoins  through the U.S. dollar on a 1-to-1 basis and allows States to make…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693833/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…businesspeople like Thomas, some of whom have  gone out of business. A chocolatier who just loved making her  chocolates but who can no longer afford it had to fire the people who  had worked so hard in her company.\n\nI met with another New Yorker, a man named Jeremy. He lives in the  Hudson Valley, in Kingston, NY, who relies on the ACA tax credits to  pay for health…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Down syndrome and we are now       retired, depending on our Social Security for the three of       us--for food, utilities, clothing, medical services, things       that we worked [for] all our lives, only to have billionaires       come in and take what little we have to live on away.\n\nYes, the billionaires may not care about Social Security, but here…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…celebrated its 25th year of service  at their annual closing ceremony on July 10, 2025, at the Macon City  Auditorium in Macon, Georgia.\n\nExecutive Director Lakesia Toomer has worked hard with her staff to  help ensure that Next Level is a safe haven and launchpad for all  children and families that need it. It is their solemn mission to  ensure that no…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rapid  response efforts. In the days immediately following Hurricane Helene,  49 residents received critical assessments and essential resources.  After Hurricane Milton, they worked with 225 displaced individuals who  remained in shelters, demonstrating their unparalleled ability to adapt  and respond under pressure. The team leveraged the Human Services…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…coal hats on, their miner hats on, their shirts,  and a lot of them from Kentucky saying, what am I going to do? This is  something I had depended on.\n\nI will tell you, we all worked on it. I will have to say that his  constituent, our colleague on the other side of the bill and the leader  at the time, Leader McConnell, took that as his issue. I will tell…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…that the majority leader has laid on the floor.\n\nI am the senior Democrat on the subcommittee of Appropriations that  writes the bill that funds our national defense. I have worked well and  closely with Senator McConnell in this undertaking this year. I am  about to vote no on proceeding to take up the House Defense bill, which  may surprise some of…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Marilyn has been a constant force for many years, leading with  strength, dedication, and a genuine heart for the people of North  Myrtle Beach.\n\nShe is a pioneer. She has worked harder than anyone. In fact, she is  one of the hardest-working women that I know to make North Myrtle Beach  not just a premier tourist destination but a place we are all…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Lauren Fine.\n\nLauren began her career here on the Hill on the Senate side with  Senator Joni Ernst before coming over to the House and joining Team  Scalise, where she has worked with me for over the last 8 years.\n\nLauren started as my press secretary before serving as my  communications director for the last 6 years. I know many of you in the  press…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…violent  criminals and the scourge of narcotics. She is also a member of the  Attorney General's Review Committee on Capital Cases.\n\nDuring the first Trump administration, she worked on detail in the  Solicitor General's Office. She drafted numerous briefs and presented  oral argument to the U.S. Supreme Court. Her former colleagues in the  Justice Department…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…want Americans to believe that this discharge petition  and underlying legislation are the be-all and end-all in this  investigation. However, it is House Republicans who have worked  tirelessly to achieve true justice for victims.\n\nTo date, the significant information that has come out has come from  the Oversight and Government Reform Committee as a result…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…a fighter for folks in the heart of the  heartland, she helped lead more amendments to the prestigious farm bill  than nearly any other Member in Congress.\n\nFurther, Emily worked across the State and across the aisle to earn  bipartisan support and helped our team be in the top 10 most bipartisan  Members of Congress.\n\nThroughout her tenure, Emily has…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688336/recognizing-emily-tuttle-millard"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…two  times faster, have employee turnover that is 12 percent lower and a  higher business survival rate.\n\nI know the value that PEOs provide. Before coming to Congress, I  worked for a PEO, and I saw firsthand the positive impact they had on  small businesses in my home state of Indiana.\n\nMr. Speaker, I would like to congratulate the PEO industry for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…who served with a deep love  for our country and brought the heartland to Washington, not the other  way around.\n\nAs a fourth-generation rice farmer, he never forgot who he worked  for--farmers, families, and rural communities who were too often  ignored by Washington.\n\nHe will be missed. We will all miss him. My heart is with his family,  his staff,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698709/9999"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…President Trump proved him wrong.\n\nThis operation also demonstrated what strong leadership looks like.  Our military, intelligence community, and law enforcement agencies  worked seamlessly together, drawing on decades of experience, to  deliver accountability.\n\nThe administration did not stop there. By cracking down on sanctioned  oil shipments and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…an unquestionable success.\n\nMy view has always been that tax incentives intended to spur  fledgling industries shouldn't last longer than necessary. That is why  in 2015 I worked with both the wind and solar industries to phase out  their credits over a period of years. Unfortunately, the Democrats so- called Inflation Reduction Act reversed course…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…$15 billion,  that is just from Canada, that we can use to pay down our debt and pay  down our deficit, again, as we have lower inflation and higher economic  growth. It has worked. The chairman talked about the cost of 5,000  lives a year in New York, almost 100,000 nationwide, but those  statistics are 1 year old.\n\nUnder President Trump's tariff regime…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699967/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…residents together.\n\nBrooksville's history is reflected not only in its historic landmarks  and longstanding neighborhoods, but also in the character of its  people--those who have worked to build local businesses, serve in  public office, educate future generations, and contribute to the  cultural and economic vitality of the region. The city's commitment to…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…its success. Ambassadors have taken on  vital roles in recruitment, outreach, and event planning. When the  CARES Senior Center closure displaced 25 volunteers, RSVP Pasco worked  diligently to connect them with new opportunities, ensuring their  passion for service was not lost. Similarly, at Grace's Food Pantry,  Ambassadors stepped in to address…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}]