[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…many community organizations that helped make  this project possible.\n\nAt a time when VA benefits and the workers who serve our veterans are  under attack, I am honored to work alongside MACV to support those who  have served our country. Please join me in recognizing the Minnesota  Assistance Council for Veterans for their outstanding efforts and in  expressing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…with our Federal workers and with all working families  across Oregon. I commend my colleagues for coming together to fight for  what is right. I am eager to continue this work alongside all of you to  prioritize the needs of working families.\n\nMr. Speaker, it is time we act. It is time we pass the Protect  America's Workforce Act because our workers cannot…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…resilience, and ecosystem  restoration.\n\nEach time this Congress gathers to address land restoration and  treaty reserved rights, we are doing incredibly meaningful work, not  only alongside the Tribes that we serve, but in service of the  integrity of our Federal Government's commitments.\n\nI also want to extend a special thank you to Chairwoman Frances…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…inspirational, and the contributions they have  made to Illinois' 13th Congressional District have left a significant  impact.\n\nIn my Washington Office, I was honored to work alongside Henry  Scriven-Young, Carter Wood, Maurice Mueller, Ally Denton, and Ethan  J.S.H. Reed. These five interns have worked tirelessly to support my  staff and have done an…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Baptist Church of Merrifield for its efforts to better the Northern  Virginia region. Achieving 155 years of ministry is a milestone worth  celebrating. It is a privilege to work alongside this great  congregation in the community, and I wish them continued success  through faith, family, and service.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bonds and promotes cultural  pride.\n\nA native of Cayey, Puerto Rico, Orlando moved to Rochester in 1991  and has carried his heritage with him throughout his life and work.  Alongside his leadership of the festival, he has built a distinguished  career as Real Estate Investor and Property Manager for RocOn Property  Management. In 2019, his impact was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Stroke. I stated in the Division of Translational Research,       then moved to the Division of Clinical Research, where I       remain today.\n\nHow proud I have been to work alongside titans of the       scientific community. Dr. Francis Collins, physician and       former director of the National Institutes of Health and the       National Human Genome…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Heart led the efforts to secure full Federal trust status for  the Tribe's Pinecrest Ranch, reclaiming a piece--a piece--of what was  taken.\n\nIt has been a privilege to work alongside him, meeting in Towaoc and  across the ancestral homeland of the Ute people, rafting the Colorado  River to discuss water and climate policy, visiting cultural sites in…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…passed  through the Committee on Homeland Security with support from Members  across the political spectrum. I especially thank Representatives  Swalwell and Evans for their work alongside myself and Congressman  Ogles to advance this important legislation. That cooperation reflects  a shared recognition that cybersecurity cannot be approached through a…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Evans County Sheriff's Office with the 2025 Support  Officer of the Year Award.\n\nSpecial Agent Cephus has served his community and State with  integrity and courage. His work alongside local law enforcement in  Evans County demonstrated steadfast support during critical  investigations and helped to strengthen the bond between State and  local public…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "James Risch", "party": "Republican", "sentence": "…on President Trump's ironclad support of Israel, we  urgently need a qualified ambassador in the region. I have no doubt  Governor Huckabee is that person, and he will work alongside President  Trump and Secretary Rubio and our friends in Israel to bring peace to a  turbulent region and ensure both American and Israeli hostages are  brought home from…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689827/9999"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…and independence. Amidst our  toughest challenges of the day, this legislation reminds us that we can  all work together.\n\nUnder this bill, leaders from both parties will work alongside the  Architect of the Capitol to compile the capsule's contents. This will  include a letter from congressional leadership, books, manuscripts,  relics, memorabilia, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…workers across the country  and saw their commitment to ensuring strong elections.\n\nNow, as the chair of the House Administration Subcommittee on  Elections, I am proud to work alongside Chairman Steil to advance  policies that lead to stronger elections across our country.\n\nThese tools will help the States ensure their rolls are accurate and  help prevent…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…not just a  government program. Companies like SpaceX, Rocket Lab, and Blue Origin  have dramatically reduced launch costs and are saving taxpayers  billions. These firms work alongside NASA and the Department of  Defense, proving that the private industry of America can be a powerful  force in advancing the United States' space leadership. Their success…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…by his consistent and active engagement and  his deep dedication to those he serves, going above and beyond the  regular call of duty.\n\nIt has really been a privilege to work alongside Chief Estes  throughout my time in office. It is an honor to represent someone held  in such high esteem by his friends, family, colleagues, and community.\n\nTherefore,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Transparency Act of 2025, over the finish  line.\n\nI thank my friends, the gentleman from California (Mr. Obernolte) and  the gentleman from Arizona (Mr. Hamadeh), for their work alongside me  to modernize the Veteran Readiness and Employment process. I also thank  the gentleman from California (Mr. Takano) and our Democratic  colleagues for understanding…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Yarborough pioneer ranching family  in Sanford, Florida, where she was raised with a deep respect for the  land and livestock, learning the ranching lifestyle through hard work  alongside her parents.\n\nIn 1985, she married her high school sweetheart and late husband,  Paul Mazak. Based in Sumter County and starting with just seven acres  and a mobile home,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is a tireless champion for her students, ensuring their needs are  represented and addressed with compassion and integrity. Her  collaborative spirit and willingness to work alongside general  education colleagues fosters an inclusive and equitable learning  environment.\n\nMrs. Prakash's creativity, professionalism, and genuine devotion to  her students…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…the early morning  flight from Des Moines to D.C., where she has been a tireless advocate  for the Cyclones and for our state's land-grant mission. It's been an  honor to work alongside her and an even greater honor to call her a  friend.\n\nMr. Speaker, I ask my colleagues to join me in thanking President  Wendy Wintersteen for her years of distinguished…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…decades on the front lines  as a volunteer firefighter and EMT, I have seen firsthand the  extraordinary courage and commitment of EMS personnel. I have been  privileged to work alongside them during some of the most challenging  moments a person or community can face. I can say with certainty that  these professionals are heroes in every sense of the word.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…attention when the spouse has passed.  Placing the OSA directly under the Secretary will help to recognize the  importance of this population.\n\nMr. Speaker, I was proud to work alongside Chairman Bost on this to  ensure survivors have a seat at the table.  I urge my colleagues to support and pass this commonsense legislation  again in the 119th Congress…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…a legacy of efficiency, professionalism, and  excellence. I have no doubt that that legacy will only continue to grow  in the years to come.\n\nIt has been a privilege to work alongside the South Tahoe Public  Utility District throughout my tenure as Tahoe's Representative in  Congress. Therefore, on behalf of the United States House of  Representatives…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…privileges  afforded under the International Organizations Immunities Act.\n\nIn doing so, we signal not only respect for their importance but also  our determination to work alongside them as equal partners in tackling  shared challenges.\n\nFrom advancing security and prosperity to fostering innovation and  confronting global health threats, these organizations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}]