[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…Education Act, the Adult  Education and Family Literacy Act, the Individuals with Disabilities  Education Act, and the Higher Education Act are some of our Federal  laws that work to ensure that opportunities to learn and advance are  not limited by income, race, ethnicity, or disability.\n\nThe expansion of public education is a great American story. Yet,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…will find a passionate group of caretakers, educators,  historians, and advocates who take such care to keep these lands  sacred.\n\nIt is people like this who continually work to ensure those buried  far from home are done so in dignity and with their true heritage  represented. Their efforts and the efforts of those who have worked so  hard to bring this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…workplace policies, they  accelerated a retreat from this understanding.\n\nThe history of DEI efforts in America is not some partisan agenda. It  is part of our Nation's ongoing work to ensure that America's promise  extends to every American. In 2025, as we face renewed attacks on these  principles, we must renew our commitment to this work.\n\nLet me be clear:…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…completed  through this license portability agreement. This data will surely prove  beneficial in highlighting communities with greater needs for care.\n\nWe will continue to work to ensure all veterans get access to the  care they need, whether it be through legislative levers like this or  continued efforts of outreach and advocacy.\n\nI am thankful to all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695497/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…radiation sickness endure.\n\nIn those cities, those gathered will recommit to preserving the  memory of the destruction, and to plead with current and future  generations to work to ensure that such horrors never ever, ever happen  again.\n\nMr. Speaker, I regret I cannot be with them in Hiroshima and  Nagasaki. That is why I have organized this Special Order…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…repayment  period, but our colleagues in the Senate worked to address these shared  concerns, and we in the Natural Resources Committee came together to  build on that work to ensure that this legislation addresses the real  water reliability challenges facing the people of southeastern Colorado  while remaining consistent with core reclamation law…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…building enduring partnerships among military commands,  public agencies, and the private sector. His deep commitment to both  the base and our community is evident in his work to ensure that  Ventura County's infrastructure, workforce, and expertise continue to  meet the evolving demands of 21st century national defense.\n\nAmong his many accomplishments,…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…chronic       conditions who rely on Medicaid to access medications and       technology that they need to manage their conditions.\n\nMembers of Congress should, instead, work to ensure access       to health insurance through the Medicare program--work to       ensure access to healthcare without barriers for the most       vulnerable Americans.\n\nHere…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…policies that undermine morale.\n\nI come from a defense-dependent State. I understand the importance of  the investments we make in our Nation's defense. We must always work to  ensure that our servicemembers have the best possible equipment to  defend our Nation. I am proud that the American-made Black Hawk  helicopters, the best helicopters in the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…spreadsheet--they are stolen chances, unfinished stories, and       futures left unrealized.\n\nI plead with my Republican colleagues: Break your silence. Let us  work together to ensure the chances for medical research are not  stolen. These stories should not be left unfinished, and those futures  should be realized. Let us protect medical research…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…technological edge, we must invest now in setting  standards for the next generation of wireless technology, which is 6G.  We need to counter China's influence. We must work to ensure that we  shape these global standards as they will define the future of  telecommunications technologies.\n\nThis bill will do exactly that. It will have a real impact on…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…is why today I voted to proceed to  consideration of S. 3012, the Shutdown Fairness Act, sponsored by the  Senator from Wisconsin. Senators from both parties should work together  to ensure payment of military servicemembers and others in critical  roles, including controllers, TSA workers, and those working at  Georgia's CDC. Debate of this bill should…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696375/s-3012"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…of the American people was done.\n\nI urge every citizen that is watching today to remember that the eyes  of the world have not looked away in the 5 years since. We must work to  ensure that the American ideals of freedom, justice and liberty endure  for generations to come. Never, ever forget.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698550/january-6-attack"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…associations, Eric  has maintained his commitment to housing for all.\n\nOn behalf of Illinois' Third Congressional District, it is my honor  to commend Eric Sirota for his work to ensure safe, just, and  affordable housing as a fundamental human right.\n\nI thank and congratulate Eric.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…funding necessary to end the HIV epidemic.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to commend Omar Martinez Gonzalez for his work to ensure  that our neighbors, no matter their sexual orientation, gender  expression, ZIP Code, background, HIV status, or citizenship status  receive every single thing they need…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…VA to publish the total number of  prevalent causes and manners of death among these veterans to better  identify trends.\n\nMr. Speaker, I thank my colleagues for their work to ensure that the  VA continues to develop the tools it needs to effectively deliver  benefits. I urge all of my colleagues to support H.R.\n\nMr. Speaker, once again, I encourage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to register to vote and vote, but we made a clarification to ensure  that UOCAVA governs what happens with our men and women in uniform. We  have made every attempt to work to ensure that this bill is doing  exactly what it is intended to do, which is ensure that only citizens  vote and that we present voter ID at the polls.\n\nI would just like to offer,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…such convoluted timekeeping requirements directly impact how  much pay Americans take home.\n\nLike many of my colleagues, I want to see Americans rewarded for  their hard work and ensure they are paid what they earn. That is why I  am proud to rise in support of H.R. 2312, the Tipped Employee  Protection Act, which creates stability for tipped workers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…that the appropriate t's are crossed  and i's are dotted. They can follow the law. We must do that.\n\nAdvocacy groups, such as Defending Education, have done tremendous  work to ensure we know about the CCP's influence, but it shouldn't take  a third-party nonprofit to tell us who is teaching our children.\n\nThe CCP remains a threat to American interests.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…pivotal to the success of our Nation's economy.  I join my colleagues this week in celebration of the small businesses  that keep our country thriving, and I will work with them to ensure  that there is opportunity long into the future.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…connects volunteers to  critical areas of need. Volunteers support food pantries, like Our Lady  Queen of Peace, St. Vincent DePaul and Shady Hills Mission Chapel. They  work to ensure families in high-need areas receive essential resources.  At Good Samaritan Health Clinic, RSVP volunteers assist with patient  intake and front desk duties, while at BayCare,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Commandant on all policies of the Coast       Guard that have Tribal implications in accordance with       applicable law and policy, including Executive Orders;\n\n``(4) work to ensure that the policies of the Federal       Government regarding consultation and engagement with Indian       Tribes and engagement with Native Hawaiian organizations and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…are using VA.\n\nMy friend, the gentlewoman from Iowa (Mrs. Miller-Meeks), recently  hosted a hearing to discuss improving care for women veterans. This  bill builds on our work to ensure this population of veterans has  access to the modern care that they have earned.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, I have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Business Development to create  an action plan to improve outreach to veterans and inform them of  available resources that directly apply to their unique needs.\n\nWe must work together to ensure that our veterans have access to the  tools necessary to start or grow their businesses. I urge my colleagues  to support our veterans and pass the SERV Act.\n\nMr.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…arsenals are, not  just to the military, but to the Nation. This is about protecting  readiness, our military, and America.\n\nWith the assurance of the chair that he will work with me to ensure  that this amendment does what we intend it to do and continues to  supply our military with the munitions they need, I will always fight  for Rock Island Arsenal,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…community are what make it truly  special.\n\nSo, as we celebrate this historic anniversary, let us not only honor  our past but also embrace the opportunities ahead. Let us work together  to ensure that Mercer County continues to be a place of growth, unity,  and prosperity for generations to come.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}]