[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…does the U.S. engage in foreign  aid? There are four real arguments for that.\n\nNumber one, economics: Again, we are the most economically powerful  nation in the world. We have the largest economy. We benefited the  most. If we can help other countries generate economies, we have access  to those markets. They will buy our stuff. It grows our economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…wrong direction.\n\nWe need only look at the notorious track records of mining companies  abroad to see what disaster will look like in the United States.\n\nBHP, one of the world's largest foreign mining companies and one of  the co-owners of the proposed Resolution Copper mine in Arizona, was  responsible for the disastrous collapse of a Brazilian tailings…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…treatment when he  became President.\n\nNow, he has already given them a lot of favorable treatment, but,  boy, this would be a coup--the oil industry having full access to the  world's largest petroleum reserves.\n\nBut, today, this morning, in our briefing, we did learn that there is  another objective.\n\nYes, Trump wants control of the oil for his friends. But…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…Science and Engineering Fair.  For more than 70 years, thousands of students from various science fair  networks have explored their passion for scientific research at the  world's largest pre-college science competition. Students from more  than 75 countries, regions and territories competed across 21 different  STEM disciplines. This year, Anusha competed…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693893/recognizing-anusha-arora-for-scientific-excellence"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…economic opportunity.\n\nOur trade agreements helped American farmers export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…entrusted to the  stewardship of the National Park Service.\n\nOnce the home of our Nation's first armory, the Springfield Armory  National Historic Site is now home to the world's largest historic U.S.  military small arms collection, commemorating the innovative  craftsmanship and ingenuity that enabled the production of the most  superior firearms for…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…First  campuses around the world. They have collaborated with the U.N. to  create a joint global summer school program. In addition to physical  schools, they also have the world's largest online language school.\n\nThese programs are designed to help English language learners pick up  the language quickly for attending school or starting a new job.\n\nIt can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695726/education-first"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…across Illinois and for continuing the proud legacy of Lions Clubs  International. Founded in Chicago in 1917 by Melvin Jones, Lions Clubs  International has grown into the world's largest service club  organization, guided by a mission of community service, humanitarian  assistance, and the promotion of peace.\n\nThe Chicago Indo-US Lions Club exemplifies…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698522/recognizing-the-chicago-indo-us-lions-club-for-its-outstanding-service-to-communities-across-illinois"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…constituents, their residents,  and protect our planet.\n\nAnd the truth is, they do have a tremendous blueprint to follow.  California is now the fourth largest economy in the world and the  largest contributor to the Federal Treasury. California didn't get  there by sticking our head in the sand as the clean energy transition  blossomed elsewhere. We leaned in,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…tactics of regimes in  Hungary, North Korea, and Venezuela. These are not governments we  admire. Yet, this latest move fits that mold.\n\nThe Library of Congress is the world's largest library and a symbol  of our commitment to free thought. We have seen growing attacks on  libraries and books nationwide. Now it seems even the Library of  Congress is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…leaders is about optics, power, control, and stoking the ego of  Republicans and king daddy.\n\nWe are tanking the California economy, the fourth-largest economy in  the world and the largest donor State. I refuse to support this  resolution.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…agreement will take  years, not months, and we are already past the danger zone.\n\nIf New START expires without a replacement, there will be no legally  binding limits on the world's two largest nuclear arsenals for the  first time in more than half a century. The consequences of that  outcome would be serious and immediate.\n\nThe United States would lose treaty-mandated…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…significantly increased  the risk of a problematic rollout of the new system.''\n\nTSP has approximately 7.2 million participants and $937 billion in  assets, making it the world's largest defined contribution plan.  Federal employees dedicate their careers to serving our country, and  they deserve a retirement savings and investment plan that provides…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…economic opportunity.\n\nOur trade agreements helped American farmers export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…announced the firm will be making a  $2 billion business deal with a fund backed by Abu Dhabi, using the  Trump firm's stablecoins. This deal also includes Binance, the world's  largest crypto exchange.\n\nRecently, Binance's founder has been seeking a pardon from the Trump  administration after he pleaded guilty to money laundering and spent 4  months…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…rural industrial powerhouse, including footwear,  furniture, textiles, and Maine's first cheese factory. By the mid-20th  century, the Forster Manufacturing Company was the world's largest  maker of toothpicks, producing some 20 million per day.\n\nThe townspeople used their prosperity to built what has been called  ``the prettiest village in Maine,'' with…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…mistake. This was not about policy, it  was about shutting coal out of the conversation, an essential piece of  our Nation's energy matrix.\n\nThe United States is home to the world's largest coal reserves, with  approximately 440 years' worth of supply at current production levels.  Today, our fleet of over 400 coal-fired power plants provide 16 percent  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Partnerships for Asphalt and Concrete Technologies Act, or  IMPACT Act.\n\nToday, much of the world is reliant on cement and concrete produced  in China, which is home to the world's largest cement industry. It  should go without saying that it is a big problem to be at the whims of  the Chinese Communist Party when it comes to materials that are  absolutely…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…of the whole Western  Hemisphere. If not, ask anyone who lives in my district, the city of  Miami.\n\nNow let's go back to American history, which says that Maduro is the  world's largest drug trafficker. In 2020, he was indicted by a Federal  grand jury in this country for pushing hundreds of thousands of tons of  cocaine to the streets of the United States.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…enormous pressure from Beijing.\n\nPalau is a small nation by land mass and by population, but its  exclusive economic zone is vast, and its courage to stand up to one of  the world's largest bullies should not be underestimated.\n\nAnd Palau is breathtakingly beautiful, truly one of the most stunning  places on Earth. When President Whipps visited Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…institution is breathtakingly picturesque,  offering stunning views of lakes, fields, forests, and mountains. Not  only is it one of the most beautiful, but it is reportedly the world's  largest as well, encompassing nearly 27,000 acres and offering 88 miles  of trails.\n\nBeyond its attractive exterior, Berry College offers state-of-the-art  education to over 2,000…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…mineral exploration and development.\n\nMr. Speaker, at issue is the Duluth Complex in northern Minnesota,  one of the largest mineral deposits on the planet, including the  world's largest copper-nickel deposit.\n\nThe Federal Government routinely granted and renewed mineral leases  to these deposits beginning in the 1960s. Decades of planning,  exploration,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…snacks available in the marketplace.\n\nThese efforts led to the creation of Jack Link's Beef Jerky. What  started as a small Wisconsin operation has now grown into the world's  largest manufacturer of jerky in the world. Through it all, the company  has remained 100 percent family owned.\n\nJack Link's induction into the Wisconsin Manufacturing Hall of…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700132/congratulations-to-jack-link-founder-of-link-snacks-inc"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…levels of  critical and emergency care.\n\nIn 2020, Stead Family also earned the Gold Beacon Award for  excellence from the American Association of Critical-Care Nurses, the  world's largest specialty nursing organization.\n\nThis award recognizes hospital units that exemplify exceptional  patient care, strong leadership, and a sustained commitment to safety…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…energy producers utilize the latest and the greatest technology,  enabling more energy production with the best environmental  stewardship.\n\nToday, the United States is the world's largest oil and gas producer,  and at the same time, we have also led the world in emissions  reductions\n\nSince 1990, U.S. natural gas production has doubled--this is an  interesting…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…security. For more than 130 years, mining in       Minnesota has created family-supporting careers for       generations of laborers.\n\nNorthern Minnesota is home to the world's largest known       undeveloped copper-nickel deposit. The importance of mining       these minerals in Minnesota echoes the determination that we       build it all, here in…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…the  impacts of utilizing the LPTA.\n\nOne example of when the LPTA may not be appropriate relates to the  procurement of Chinese drones.\n\nChinese drone maker, DJI, is the world's largest manufacturer of  personal and professional drones, and Federal agencies to this day  utilize DJI drones, which present a large national security risk.\n\nWhy would Federal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Today, the Red Cross continues that legacy by delivering disaster  relief, supporting military families, and offering health and safety  training. They run one of the world's largest blood donation networks,  supplying more than 40 percent of our Nation's blood products.\n\nEvery 2 seconds, someone in the U.S. needs blood. Yet only a small  percentage…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691605/american-red-cross-founding-day"}]