[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…literally texted Senator  Britt in agony.\n\nI was like, how do we decide on which poems to choose, because in  past page classes--I hope they are listening out there in the world.  They are just so top class. So it was very difficult.\n\nKatie and I went back and forth. We did a lot of consternation, and  we came up with the winners.\n\nThey  were all anonymous…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…The administration was all too proud to show the first part of this  same video, the first attack on this ship, to the American people.   They showed that to the whole world. They just didn't show all  of us the rest of that video; that is, they only showed the footage of  the first strike. What they withheld was the footage of the killing of  the survivors…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…be building goodwill in a  very unstable part of the world, one of many missed opportunities  because when we act to save the lives of starving children around the  world, we are not just doing the right thing morally, we are helping  make America stronger by building goodwill around the world.\n\nThe Trump administration has promised repeatedly that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…was just a regular, decent human being and a good guy. He was  always available. He never made you think he was a big titan of  business or a leader of industry in the world. He was just somebody who  was interested in what you had to talk to him about, and he would offer  his advice.\n\nIn Memphis, he did have his hand in just about everything. Our  basketball…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…current trend continues.\n\nSo it is in that context that this bill is essential. It is proof  that there is still broad bipartisan support for America showing up in  the world, not just with tanks and guns but with food and lifesaving  care and economic assistance. And we do that not just because we are  the indispensable Nation and that is the right…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…access sites established; upgrades to every large wastewater treatment  plant in the watershed to improve water quality; and the largest oyster  reef restoration in the world: These are just five of the biggest wins  in the last 43 years of the landmark Chesapeake Bay Watershed  Agreement. In fact, it was just updated last week after years of  careful and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698039/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…catastrophe.\n\nCongress must assert its authority on matters of war and peace, and  time is of the essence. Multiple warships have been moved from other  ports of the world to be just off the coast of Venezuela. By some  estimates, 10 percent of the Navy's deployed assets are now in the  Southern Command area of responsibility.\n\nThese actions certainly…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…children. The idea that one in five children in America lives in  poverty and goes to sleep hungry at night in the greatest country that  ever existed in the history of the world, I just couldn't handle that.  That is what took me from kitchen to Congress and housewife to House  Speaker, to feed the children.\n\nWhen Matthew says: ``When I was hungry, you…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…girl  and an 87-year-old Holocaust survivor. Also among the murdered was  Rabbi Eli Schlanger--a pillar of Brooklyn's Crown Heights community-- who welcomed a son into the world just 2 months ago.\n\nMay the memories of all those killed and injured this weekend be a  blessing.\n\nI have warned repeatedly that anti-Semitism is a scourge around the  world that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…have every single thing they need to thrive, not money  used to execute U.S. citizens.\n\nLet me end by saying this: We brought the Department of Homeland  Security into this world just two decades ago. We also have the ability  and the authority to build a world without it, and I will work every  day to make that happen.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Proclamations.       We have recognized that `` `a statement by an agency that       simply restates an established interpretation `tread[s] no       new ground' and `le[aves] the world just as it found it, and       thus cannot be fairly described as implementing,       interpreting, or prescribing law or policy.' '' However,       while the RMP restates certain…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…one Wednesday,  students from around the Nation would gather. It was about 3 years  later that it started spreading globally, to where literally students  from around the world were just going to their flagpole, and they would  just gather to be able to pray.\n\nNow, people have said over the years: Why a flagpole? Well, it is  because every school has a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…fiscal year 2027 cycle. We are  already, technically, behind on that. So we have got efforts there.\n\nWe obviously need to do more when it comes to the situation around  the world.\n\nWe just had a vote on a motion to discharge a War Powers Resolution  as it relates to Venezuela. We need to strengthen sanctions on Russia,  which continues to prosecute this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…funding  to Arkansas for forest management.\n\nHe also cofounded the Fire Learning Networks, a national  collaboration of fire practitioners helping 14 countries around the  world. Just last year, he visited Tanzania to share fire and forest  management strategies and tour Katavi National Park.\n\nCongratulations to Doug for his dedication to conservation,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…net- zero cities in Mexico. Funding for USAID programs is also frequently  going to NGOs that work to promote their liberal agenda in the most  conservative parts of the world.\n\nJust imagine $1 million going to one of the cities in our  congressional districts and the impact that it could have there. It is  a disgrace that Americans' hard-earned tax…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…School's Mavericks Robotics team, which won the 2025 FIRST Robotics  Competition World Championship.\n\nThe Mavericks Robotics team competed against 3,700 teams from around  the world just to clinch a spot in the world championship. Only 600 of  those teams made the cut, and this robotics team won it all.\n\nThese talented students from McCutcheon High School…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…redress. We  are protecting our great Nation by investing in our military and  military families. We are preserving tax cuts that made the United  States economy the envy of the world just 8 years ago. We are reviving  our Nation's fiscal outlook by finally cutting wasteful spending and  unleashing our economy from harmful restraint--restore, protect,  preserve,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…companies  are rich beyond belief. They are the wealthiest companies, the richest,  biggest companies, not just in America, not just in the world, but in  the history of the world.\n\nBut I just want to say that no amount of money justifies subjecting  our children to sexual abuse. No amount of money justifies  ``sextortion'' of children on these platforms.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…because I know  we are running deficits in the trillions, and we have piled up $36  trillion in debt. I want to help our national defense because it is  still a dangerous world.\n\nI just got back from Israel last week. We know how dangerous it is.  They know how dangerous this world is.\n\nThis bill is common sense, and it is step one of a three-part process…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…socialism and Marxism crush the human soul. It is not  just in my community in Miami. Millions of Cubans had to flee. It is  the rest of the hemisphere and the rest of the world. Just look at  Russia, look at North Korea, and look at Iran.\n\nWhat a coincidence that, today, President Trump is receiving in the  White House the mayor-elect, Mr. Mamdani, from…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}]