[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…utility bills, and now Republicans are going to make  it worse.\n\nIt is raising costs on all of us in more insidious ways too because  we do have a climate crisis across the world. Mr. Speaker, when you are  paying more to  address climate-fueled disasters caused by hurricanes, such as  repairing your home, emergency response, and property insurance, then…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…and financial  transparency that benefit and protect investors and thereby protect our  capital markets, which so many speakers have pointed out are the envy  of the world.\n\nMr. Speaker, I ask my colleagues to vote ``yes'' on this bill, and I  yield back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise today for the 26th time to call on  the Trump administration to honor its word and restore funding for  lifesaving food aid around the world.\n\nMr. Speaker, the words from the Trump administration have been pretty  good on this. Elon Musk said that funding for emergency food aid will  be restored. Marco Rubio has repeatedly…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693095/calling-on-trump-administration-to-restore-lifesaving-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…thousands,  but it also means that our adversaries, particularly China, have a  golden opportunity to swoop in to the rescue and build good will with  nations all around the world.\n\nMr. Speaker, foreign aid is not just charity. It serves our interests  as a country, as well, when we build good will with nations that have  rare earth minerals and can assist…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…will hurt families.  It will hurt older Americans. It will hurt people that Republicans  represent in rural America and all while undermining American  leadership in the world.\n\nMr. Speaker, once again, this is unfortunate. Once again, we see a  Congress not functioning as a separate and coequal branch of  government. We see a Congress, given this Republican…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…efforts. New York City, which I  represent in part, is a major worldwide tourist destination.\n\nThere is still time to build this industry to make us the best in the  world.\n\nMr. Speaker, I thank the U.S. Travel Association for leading the way.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Gurudev Sri Sri Ravi Shankar. For more  than 45 years, Gurudev has dedicated his life to promoting peace,  advancing human values, and serving communities around the world.\n\nMr. Speaker, I wish to extend my deepest gratitude to Gurudev Sri Sri  Ravi Shankar for his work in promoting meditation, and I encourage my  colleagues to join in a moment of silence…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698204/recognizing-december-2025-as-world-meditation-day"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…priority.  Paying for groceries and healthcare, keeping the lights on, and heating  your home are the basic expectations that should exist in the  wealthiest country in the world, Mr. Speaker. They should not be  luxuries.\n\nThis affordability crisis isn't just hitting hardworking families  across central New York and the Mohawk Valley. It is squeezing our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…became the epicenter of invention and innovation.  They not only inspired a westward movement but addressed favorably the  quality of life of people across the great world.\n\nMr. Speaker, all of this is a part of history and now underpins the  opportunity to grow an innovation economy. Yet, under the Trump  administration, working people are being betrayed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…administration at  the time. We were lied to. There were no weapons of mass destruction,  and look at what that cost us in terms of life, treasure, and  credibility around the world.\n\nMr. Speaker, again, I think there are things that we should be  focused on here right now that are much more pressing than the items  that are before us here today.\n\nMr. AUSTIN…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Our people have  died for it, defending these ideals around the world. Yesterday,  President Trump cowered and appeased one of the most dangerous  dictatorships in the world.\n\nMr. Speaker, it is shameful. It is un-American. It is not patriotic.  It is almost traitorous--maybe it is traitorous to do that. We know  Russia. We know North Korea. We know Iran.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Flying W Wranglers band, which was formally named in 1957, have  performed at every show at the ranch since 1953 and are the second  oldest Western performance band in the world. Mr. Speaker, I can  personally attest to the Flying W Wranglers' skill and musical ability.  They truly are talented and entertaining cowboys. I am proud to have  such a historic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…particularly proud of the fact that Patriarch  Bartholomew has been an outspoken defender of human dignity and has  reached out to Jewish and Muslim leaders throughout the world.\n\nMr. Speaker, I ask my colleagues to join me in welcoming His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C., and in  paying tribute to his decades of ministry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…1979, 100,000 Jews lived in Iran. The same people who Iran likes  to fund to talk about genocide, suffering, and rooting out people and  all these problems around the world, Mr. Speaker, you can say: How many  of those folks still live in Iran today?\n\nToday, estimates are that 10,000 Jews live in Iran. I am not saying  that 90,000 of them have been killed.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…shameless plug--End  Congressional Stock Trading Act, which would level the playing field  and help restore America's faith in Congress once again.\n\nThere is no reason in the world, Mr. Speaker, that we are  individually trading stocks. Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…hew.\n\nIf they looked behind them, there was a mighty ocean which they had  passed, and was now as a main bar or gulph to separate them from all  the civil parts of the world.''\n\nMr. Speaker, this editorial appeared since 1961. That is what they  did. They  came here. Then they went into the desolate wilderness and carved into  it a great country, a country…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…the free  because together with the CLARITY Act and the GENIUS Act, we will  protect Americans' financial liberty and make the United States the  crypto capital of the world.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693727/anti-cbdc-surveillance-state-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Securing America's Critical Minerals Supply Act, which will strengthen  our domestic critical mineral supply chain so we can be stronger here  at home and across the world.\n\nMr. Speaker, for years, Democrats told the American people not to  believe what they could see with their own eyes. They said that crime  was under control, our infrastructure was…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Senate.\n\nThis is when the legislative branch and the executive branch work  best together, when we are in alignment on putting pressure against bad  actors around the world.\n\nMr. Speaker, I thank the gentleman from Michigan for his work. I urge  a ``yes'' vote, and I yield back the balance of my time.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…These aren't trade wars. They are trade wins that deliver more jobs,  higher wages, and greater opportunities for American families and  American products around the world.\n\nMr. Speaker, the same focus on protecting working families is exactly  what we are doing with the bills before us today. This rule advances  commonsense legislation to strengthen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…and conduct ourselves in a way  that all of us, not just here in this room but across the country, can  be proud of because we truly are on display to the rest of the world.\n\nMr. Speaker, this is very interesting to listen to the arguments  coming from the other side of the aisle about what we are doing here  tonight.\n\nIn talking about free speech, it…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…we take care of our needs in the United States as we are  looking at not having enough electricity going forward to keep our  economy as the number one economy in the world.\n\nMr. Speaker, I often tell people back home that this is important not  just for today but for the generations to come because when you look at  the powers in the economic sphere…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}]