[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…undergo multiple surgeries that  significantly improved my ability to walk, transforming both my  mobility and daily life. Relying on Medicaid, SNAP in the past, and  SSI, I worry about what would happen to me and my friends if these  programs were taken away. Without them, I wouldn't be able to keep up  with doctors' appointments, medications, and transportation.''…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…nothing for the people in western New York or anywhere  else across the country. They are a means of giving tax cuts to the  ultrarich and powerful, those who never have to worry about access to  reliable healthcare.\n\nThese cuts are more than numbers on a balance sheet. These are lives  that hang in the balance. For western New York, this will make…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…a  natural disaster, as many of us in this House have experienced with our  constituents. Ensuring  those who are recovering can claim what they are owed and do not have  to worry about confusing collection notices is the absolute least that  we can do.\n\nThis bill is an easy win, and it is the type of policy that makes  government work and improves people's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Opportunity Act of 2025, as amended. I support the  improvements made by most of the bill, but I have concerns about some  of the provisions within this legislation.\n\nSpecifically, I worry that section 3 of the bill, which would  authorize the use of post-9/11 GI Bill benefits for independent study  programs taught at non-degree-granting, for-profit institutions,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…majority promised:\n\nWe can't go there.\n\nI am old enough to remember just when it was they said it because it  was their majority leader just 19 weeks ago--19 weeks ago.\n\nBut not to worry, the majority says, this is not what this is about,  they claim. Instead, we have heard the majority try to dress this up as  an attack on the nonpartisan Government Accountability…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people need to be in on that conversation. It is easy, I  learned in my time in the House and Senate, to get into a war but that  it is far more difficult to get out of one. I worry that, many times,  we have blundered into a situation which looks so simple in terms of  nation building, and it turned out to be so complex. Then the war went  on for years…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…senior vice president       at YMCA Childcare Resource Service in San Diego County. ``The       fact that they're even having to go through this is sad.''\n\nChild care leaders now worry that losing funding could       force some child care providers to close their doors, which       would exacerbate California's child care shortage.\n\n``It's very fragile. Child…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…person.\n\nI am very grateful that I had the ability to have private insurance,  group insurance, where I could pay for all of my healthcare and didn't  have to sit there and worry about how I was paying the bills while I  was getting healthy and well.\n\nThere are people all over this country who, if they ever get sick,  that is the absolute demise of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…sufficient  enriched uranium for multiple nuclear bombs.\n\nSome have assessed that Iran could have built up to 10 nuclear bombs  within a few months or even a few weeks. The worry, after the IAEA  report issued 2 weeks ago declaring Iran was no longer in compliance  with the Nuclear Nonproliferation Treaty, was that the regime may have  decided to do…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…will have my team put it back up--is the alarm bells are  now. The authoritarian actions are not down the street. They are not  around the corner. They are not something to worry about 2 months from  now. They are here right now.\n\nAll the basic characteristics of authoritarian control are present at  this moment in the United States of America: stealing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…children.\n\nI am a father. I have a 3-year-old and 1-year-old at home, Max and  Lucy. Like any parent, I want the very best for my kids. I am so lucky  that I do not have to worry about whether they will be fed today or  tomorrow. Yet, around the world, malnutrition and starvation is the  number one cause of death for children.\n\nWhen a child suffers…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…clean, then they want to make  sure they have some shield to protect the polluters.\n\nWe shouldn't let them do that. That is not what we are supposed to  do. We are supposed to worry about the public.\n\nMr. Speaker, I urge my colleagues to vote ``no,'' and I reserve the  balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our  Subcommittee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…covered.\n\nIf people are struggling to pay for their groceries or their rent,  they are out of luck as far as the House Republican Conference is  concerned. Taxes on tasers, don't worry. They have a plan for that.  They are working really hard to solve that existential challenge facing  the country as we speak.\n\nMr. Speaker, if we defeat the previous question,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…fired more veterans than any other American  President in modern history, over 6,000 and counting. He has been  forcing the bravest people you or I could ever meet to have to worry  about how they are going to put food on their family's table next week  or keep a roof over their heads next month.\n\nThe biggest predictor of veterans homelessness is not…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…order to establish that you are either working or seeking work, you  have to fill out a form. If you get sick and are bedridden and can't  fill out the form, they say: Don't worry, there is an exception for a  situation like that.\n\nGuess how you apply for the exception. By filling out another form.\n\nThere are only a couple million people on Medicaid…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…has built for  themselves in ``Star Wars,'' and, of course, it is fiction. The central  bank digital currency is kind of the equivalent. The central banks are  saying: Don't worry. We would need permission from the legislature  before we could establish a central bank digital currency. We are just  designing it.\n\nIn the movie, they didn't really get…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…what used to be called Third World  countries, right? People who have Thunberg syndrome, well, they may  object to a new, clean power plant in the United States. They never  worry about the plethora of new coal plants going up in Red China or  going up in India, and that is because those aren't Western countries.  There, miraculously, they don't care.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…artificial intelligence companies and the  data mining companies come to Ohio. However, if there is no energy,  then nobody is coming to Ohio.\n\nToday, more than ever, let's worry about national security, let's  worry that we can keep these lights on, and let's worry that this grid  is protected for our grandchildren who are not even born yet, so when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…to be strong on the  front of our battle lines fighting terrorism.\n\nIran is on the march. China is nipping at our heels, as is Russia. We  need men and women who, rather than worry about if I am a eunuch or  this or that, an attack helicopter, or whatever gender dysphoria they  have that day is--who are we going to make safe today? What freedom are  we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Corey Hill Memorial  Wrestling Tournament. As an Athletic Director, Coach Kupcik shares that  having a consistent announcer locked in is always a plus. It's one less  thing to worry about. But having a consistent, amazing, professional- level announcer that transforms a relatively meaningless Tuesday night  baseball or basketball game into a must-go-to,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…forbid, if there ever is another one, I want people there to respond. I  am grateful to the law enforcement officers who took longer to get  there than my speech will take, but I worry about what will happen next  time.\n\nMr. Speaker, I thank Representative Bacon for bringing this bill  forward. I thank Representative Roy for giving me the opportunity to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…who  attempts to reenter illegally is subject to a penalty of up to 20 years  in prison.\n\nAmericans deserve to be safe while driving on our roads. Parents  should not have to worry, when they give their 16-year-old the keys to  the car--who has learned how to drive or is just getting their first  driver's license--they shouldn't have to worry whether…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…somebody who had broken the law, an abuser, somebody who under normal  circumstances would not be viewed favorably.\n\nWe had a judge in Wisconsin stop the hearing. Oh, let's not worry  about putting this guy in jail. Let's let him sneak out the back door  so he is not removed from this country.\n\nThis was after about a month ago, our Governor, Tony Evers,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…used a synthetic opioid, it has rewired  their brain, and it is one of the ways we help them get through rehab?  How about if you are the police officer who doesn't have to worry about  having Narcan close by?\n\nThe other challenge I will give you is to go look up a couple of the  articles that are about Philadelphia and some of the animal  tranquilizers,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…80 percent.  Since ObamaCare was enacted--let me say that again--the premiums have  increased by 80 percent. Deductibles and out-of-pocket costs have  skyrocketed. Families worry about medical debt--that is, those who  still have access to doctors. In fact, 150 rural hospitals have closed  since passage of ObamaCare, and small businesses were crushed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…part of the Joint Economic Committee time, and my job there  as the chair of the Joint Economic Committee is I represent the  committee, and now I get to represent myself.\n\nI worry, but the opportunity is having basically authorizing  committees do what is necessary to save our future.\n\nMr. Speaker, a little while ago you saw a beautiful little baby here.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…hasn't had much to do with the legislation  in front of us. My friends chose all on their own to shut the  government down 43 days ago.\n\nDuring that time, soldiers have had to worry about getting paid. The  only reason they were paid is because the President of the United  States managed to pull a rabbit out of a hat twice or we would have  military families…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…With the assurance that the university can continue to operate the  park, they will have increased ability to invest institutional  resources and improve the park without the worry of additional red tape  and regulatory restrictions or, worse, the area reverting back to  Federal control.\n\nMy bill will provide the university with needed stability and confirm…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…stand up and deliver.\n\nI say: Do it now.\n\nI say: Stand up and fight for healthcare freedom now.\n\nI am tired of it. I don't want another election. I don't want  another: Don't worry, we will do it next time. I want to do it now  because too many people are suffering at the hands of a bureaucracy and  the tyranny of government-run health management rather…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…facts about  what is actually happening in our economy and, most importantly, how  America is moving in the right direction.\n\nGas prices are down. Inflation, despite all the worry of the last  month, was held in check. Food prices are down. The border is secure.  Enlistments are up. Respect is back around the world.\n\nLook at the scenes we are seeing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}]