[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…high  concentration of freeways and heavy trucking industry and communities  such as those in the San Fernando Valley like Pacoima and Sun Valley.  Stopping these efforts will worsen our air quality and the public  health of our communities that are already plagued with the effects of  air pollution and vehicles.\n\nMr. Speaker, I am against this resolution…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690477/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…significant improvements in order to earn support from Democrats.\n\nAs it stands now, the Military Construction, Veterans Affairs, and  Related Agencies appropriations bill would worsen the quality of life  for servicemembers and their families and raise costs for Americans,  while helping big corporations profit from privatizing medical care for  veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…shortage, forcing  people to drive across the country, across county lines, across the  State, waiting for hours to see a provider.\n\nThese proposed cuts to Medicaid only stand to worsen the crisis.  Let's be clear. These cuts wouldn't just impact individuals covered by  Medicaid. In my congressional district, 59 percent of individuals are  covered by California's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…benefits, then they  say: Well, we can't trust the VA. Then they will move in the direction  of privatization, and that is where this administration wants to go.\n\nThis bill would worsen the quality of life for servicemembers and  their families while putting veterans' safety at risk.\n\nWhile our military faces massive recruitment challenges, the bill  underfunds…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…says: Stop. Enough.\n\nThe Dow tanked on Friday, dropping 700 points. Futures opened today  down 400 points. The warning lights are everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It is really…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…from the Trump administration? Billionaires.\n\nWith the big, ugly bill, Trump and Republicans have implemented the  largest cuts to healthcare in the history of our country and worsen the  affordability crisis just to line the pockets of their billionaire  donors.\n\nThe big, ugly bill is also the largest cut to food assistance in  American history. The bill…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would be held in jail solely because they cannot afford to       pay. Meanwhile, wealthier defendants could simply buy their       freedom. This approach would displace and worsen DC's current       system, which, as detailed below, has been effective and       focused on public safety. Congress should, on a bipartisan       basis, soundly reject the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…instability. Medicaid cuts would force families to face       higher out-of-pocket expenses, leading many to delay or forgo       necessary treatments. The burden would worsen health       outcomes, especially for those managing chronic conditions       like diabetes, heart disease, and cancer.\n\nTo the extraordinary prescience of my colleague from…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…important step in addressing species'  needs below the Glen Canyon Dam, and preliminary data showed promising  results in protecting native fish species.\n\nAs drought conditions worsen and water demand continues to increase,  it is more critical than ever to ensure water management appropriately  balances agricultural, municipal, industrial, and environmental…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691058/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Indeed, EPA previously  found that for every $1 the country spends to reduce air pollution, it  is estimated to yield $30 in economic benefits in return.\n\nThese actions will worsen climate change and contribute to more  flooding and coastal erosion, which have cost homes and businesses in  my home State of Rhode Island millions of dollars in just the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…autonomy, force more juveniles into the justice system, expand the  President's gross overreach, and make things worse.\n\nThe bills proposed by my Republican colleagues will worsen the  already rampant injustices we see in the criminal justice system, make  law enforcement more dangerous, and steal the futures of many of our  youth.\n\nThese bills all send…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…going through a crisis, congressional Republicans want  that person to be able to go to a gun store and buy a weapon.\n\nMost veteran suicides involve firearms. This will deeply worsen the  veteran suicide crisis. This does not protect veterans' rights. This  protects the gun lobby's profits over the lives of our veterans.\n\nIf my colleagues vote for this,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692961/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…energy project they  possibly can, no matter how helpful it might be to keeping electricity  bills down or the lights on.\n\nMadam Speaker, the bills on the floor today will only worsen the  Republican affordability crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Sentencing Reform Act. This  bill is not a serious attempt to address crime; it is a regressive,  discriminatory, and counterproductive piece of legislation that will  only worsen the challenges facing our communities.\n\nThis bill would lower the age at which children can be prosecuted as  adults in Washington, D.C., from 16 to 14 years old for certain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…highlight and condemn the misuse of taxpayer dollars  funneled to illegal immigrants.\n\nAn outrageous pattern of perverse and intentional incentives reveal  deliberate efforts to worsen the border crisis and to allow tens of  millions of illegal aliens to invade our Nation at direct cost to the  American taxpayer.\n\nThe Biden-Harris administration cycled through…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Nebraskans of over 3,000 beds. They hurt seniors who wanted to  stay in their home community to be close to their family, to be close  to their friends.\n\nThis CMS rule will worsen this crisis. According to the Agency  itself, 75 percent of America's nursing homes will have to increase  staffing to comply with this regulation. Under the Biden  administration's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…The Trump administration has communicated it will not reduce funds  for treatment in PEPFAR, rather it eliminates programs antithetical to  American interests and ones that worsen the lives of women and  children. Enacting this rescission will get this funding stream back to  its core mission by refocusing it on protecting health and supporting  life-sustaining…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}]