[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…and by malnutrition.\n\nThe IPC, the world's leading hunger monitor, published a report on  Tuesday, and I have that report here. Let me hold it up. This report,  it says:\n\nThe worst-case scenario of famine is [currently] playing       out in the Gaza strip.\n\n``The worst case.'' The World Food Programme reports that hunger in  Gaza has reached ``astonishing…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…decisions, a Marine Expeditionary Unit has been  forced to relocate to SOUTHCOM, leaving our troops in Europe and the  Middle East without the emergency support they rely on in worst case  scenario moments, leaving our troops there hanging.\n\nHe just wants to look strong, and he doesn't care that, in the  process, he is making our Nation weaker.\n\nLook, I…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…about our armed services  members and veterans, but actions speak louder than words, and Donald  Trump's actions when it comes to sabotaging the VA are disgusting. And  the worst part about what is happening at the VA is the timing. While  Donald Trump creates a staffing crisis at the VA, his big, ugly bill  will jeopardize Medicaid coverage for veterans…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…about what comes next: Our ally Taiwan left  in greater jeopardy to a Chinese invasion; our allies elsewhere left  looking for security and other  trading opportunities; and worst of all, our enemies worldwide left  emboldened by Trump's isolationist actions.\n\nThe American people should be worried tonight. History has shown us  that when America is isolated,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…whole point of this misguided crusade against starving and sick  children overseas was to find waste, fraud, and abuse that simply did  not exist. This was a case of the very worst of us attacking the very  best of us.\n\nI have heard from hundreds of my constituents, former USAID public  servants, who dedicated their lives to making the world a better…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…revealed that roughly 65 percent of people in  immigration detention have zero criminal convictions--zero.\n\nIt is clear that this administration is not targeting the so-called  worst of the worst, as President Trump claimed on the campaign trail.  Instead, they are targeting everyone that they think they may be able  to deport.\n\nTom Homan, the President's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, 2025 was one of the worst years for job  growth in decades. In fact, if you don't count COVID, the United States  created fewer jobs last year than any year since 2009. You don't need  data. Just ask…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Chamber  this afternoon has been absolutely stunning, truly, as I sat here this  afternoon.\n\nWhat the GOP is doing is they are introducing a budget resolution  that takes the worst of the House and the worst of the Senate and puts  it in one big, beautiful bill that is going to blow a hole through the  national debt. It will do that by raising the debt…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689886/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…remarks.\n\nMr. Speaker, it is difficult to listen to this debate and to hear the  arguments peddled by my colleagues that are hypocritical at best and  intellectually dishonest at worst.\n\nWhere were my colleagues when 14 Federal judges appointed by  Republican Presidents issued injunctions against policies that the  Biden administration was pursuing over the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689720/no-rogue-rulings-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…schools are supposed to be our safest places, and, unfortunately,  that is far from a reality in the United States. What happened in  Evergreen High School is every parent's worst nightmare. I felt shocked  and horrified as I waited minute by minute not knowing how many lives  might be taken.\n\nI couldn't help but think: What if that had been my kids'…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…she had to go to the hospital because of a head injury, and her arms,  her wrists, might be suffering permanent damage. This was a citizen, a  citizen, mind you.\n\nThis is the worst case of mass civil rights violations by the Federal  Government in recent history.\n\nMr. Speaker, 2 weeks ago, Minnesota stood up to call out these  illegal abuses by masked…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, in just a few hours, the Rules Committee  will be making the final touches to America's worst budget ever. They  are doing it in the middle of the night to hide the fact that this bill  will make Americans sicker and poorer.\n\nTake SNAP, the most effective antipoverty…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691426/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…summits  to address some of the world's most pressing environmental problems. In  his own wise words, ``We must respond in an opportune manner to protect  life on earth from the worst consequences of human recklessness. May  God grant us the wisdom to act promptly.'' Thank you to His All- Holiness for emphatically voicing moral urgency on the climate crisis.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…leaving behind  everything that the Republican Party used to stand for, praising  Vladimir Putin, and attacking our NATO allies.\n\nMr. Speaker, policy flexibility is not the worst thing in the world.  I wish it weren't happening because of the reason that it is happening,  but policy flexibility is one thing. Yet abrogating your constitutional  duty…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…found one that  would save the family about $100 a month, bringing their premium down  to $1,800, allowing her to keep her doctor, but it has a higher  deductible. She said the worst case scenario is her out-of-pocket costs  would be $20,000 on top of the monthly premium.\n\nUltimately, it came down to: I don't go to the doctor that often, my  kids don't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…you  feel that aloneness out there, that you know there are people out there  who want to help and that you won't feel alone. I know being alone in a  tough situation is the worst thing that you could possibly feel, but  there are people out there who want to help you.\n\nSo, as we prepare for another March for Life this year, I hope we can  remember a…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…same qualified professionals are forced to  wait months for employment contracts after graduation. All the while,  our veterans suffer.\n\nIt is government inefficiency at its worst, and our veterans seem to  always be paying the price. Veterans are sent to emergency rooms while  skilled doctors are waiting to serve patients.\n\nThat is why I introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…welfare system, to discourage mothers and fathers to  stay together with their children.\n\nThis began in the 1960s under Lyndon Johnson, who I felt, before Joe  Biden, was the worst President in this country's history. In the 1950s,  we only had about 4 percent of American children born without a mother  and father at home. We now have over 40 percent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…critical to the U.S. economy,  employing millions of Americans and contributing more than $200 billion  annually.\n\nThis rule is not economically justified. It is Washington at its  worst. It is no wonder that before President Trump took office, 75  percent of the country thought that we were headed in the wrong  direction. It is rules just like this that they…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…little bit of work, but  as you work your way up and get a higher income in the company where  you work, you would lose that.\n\nLow-income housing, which I think is maybe the worst program of the  bunch because you are given housing if you are a young person, allowing  you to get out from having to live with your parents as a benefit for  having a low…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…consumers, we will also  be forcing on them all of the concomitant increases in the prices of  the goods that they buy every day.\n\nLet me remind you, California already has the worst poverty of any  State in the country. Madam Speaker, this waiver would have made it  even worse. That is why I think it is entirely appropriate for us to be  considering this…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Minnesota and lawless States like California and New York,  where you have sanctuary cities, then there are dangerous people  throughout our country, too.\n\nThis is just the worst of the worst from yesterday, just yesterday.\n\nIn Virginia, a 20-year-old citizen of Guatemala was convicted for  possessing obscene material of a minor and filming child porn.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…sharper increases. In Allentown, home prices have increased 63  percent in the past 5 years while rents have risen 44 percent. Working  families who were already squeezed by the worst inflation in decades  have been stretched to the limit by these increases, dashing their  hopes and derailing their plans.\n\nFor millions of hardworking Americans, especially…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…sometimes under  a reconciliation bill.\n\nI will point to the American Rescue Plan that took place when  Democrats took control of the White House, House, and Senate. We saw  the worst inflation we have seen in my lifetime under the guise of a  COVID relief package.\n\nThat company, which had some tax pressure removed from their books,  went straight to their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…door. I remember well what it meant to be a police family, and  I know the courage it takes not just for the officer but for the family  members who stand behind them.\n\nWhen the worst happens, when a first responder is lost in the line of  duty, it is the family who bears the burden of that sacrifice for the  long term. They are the ones picking up the pieces,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…really don't need to be  talking about on the floor. That was designed to stop reconciliation  between Saudi Arabia and Israel because, for the Iranian fanatical  regime, the worst nightmare is for the Arab world to make peace with  Israel and move toward the light. These people want darkness for the  world.\n\nSo what do we do now? Israel has had it. I…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that exists nowhere else in the country to provide comprehensive  care, comprehensive government-provided healthcare, to those who are in  our State illegally.\n\nHere is the worst thing. Not only is this fiscally unsustainable, but  those are funds that could be going to shoring up Medicaid, Medi-Cal,  and improving the system, improving access to  care,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…States, far more civilian casualties than  any war we have ever experienced in the history of the United States.  That is an average of well over 250 deaths per day.\n\nImagine the worst mass shooting we have ever had and multiply that  times five times a day for every day during the year for 3 years  running. That is what we are dealing with. That is the emergency…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…keep  it going for those who have already enrolled, but this is a significant  victory in forcing the Governor's hand.\n\nWhen it comes to homelessness, California has by far the worst  homelessness in the country, where the population of homeless has  skyrocketed during Newsom's tenure as Governor, where he spent $24  billion and a State audit determined…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Putin rejected the idea.  Instead, Putin initiated an agreement to halt attacks on energy  infrastructure, and then he immediately violated that agreement. Mr.  Putin did.\n\nWorst of all, throughout these so-called peace talks, Vladimir Putin  has repeatedly taken the lives of noncombatant civilians and pummeled  residential neighborhoods with bombs.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}]