[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…weigh heavy upon us.\n\nSince then, I have talked to survivors of those fires who have gone  on to rebuild, or tried to, only to see their insurance coverage  dropped. With worsening drought and prolonged dry seasons, insurance  companies are refusing to cover the same homes and businesses they  covered just a few years ago. They are seeing what we are…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…own healthcare decisions, free from intimidation,  deception, and coercion. At a time when our country has a shameful  maternal and infant mortality crisis and is facing a worsening shortage  of obstetricians, the so-called pro-life movement is focused not on  helping women or supporting their families or delivering the IVF  coverage the President promised;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…percent.\n\nThis should be a red flag to President Trump and Republicans that  this is, in fact, not a con job--affordability--devised by the  Democrats, but a frightening and worsening reality.\n\nThese rising costs are debilitating to American families, and the  Republican response is a slate of bills that assign busywork to an  already thinly stretched…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…California has done nearly all it can do to  reduce emissions from stationary sources of air pollution within its  jurisdiction. Given our unique air quality challenges and the worsening  impacts of climate change, it is essential for our State to reduce  pollution from mobile sources such as cars and trucks if the Federal  Government will not do so itself.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…regulate air pollution  and improve public health. Not only are Republicans taking away  healthcare from over 370,000 of my constituents who rely on Medicaid,  they are actively worsening the health problems many of them face. This  is insult to injury. I urge my colleagues to vote ``no.''", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690477/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and\n\n(ii) reintroduces cognitive and physical demands on such       student on a progressive basis only as such increases in       exertion do not cause the reemergence or worsening of       symptoms of a concussion.\n\n(5) Return to academics.--If a student enrolled in a public       school in the State has sustained a concussion, the       concussion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…immediate action to maximize resources to protect  internet freedom.\n\nI have also written directly to Secretary Rubio in support of the  Iranian people, while highlighting the worsening human rights abuses,  which are also affecting people back here who have Iranian family  there.\n\nWe support the Iranian people and their efforts to determine their  own futures,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…pollution in the United States, responsible for nearly a third  of our emissions. We know that this pollution of our air has powerful  effects on our climate and is driving worsening natural disasters.\n\nThe devastating wildfires and hurricanes that we have seen, fueled by  climate change, aren't just our children's problem. They are here  today. The pollution…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…attacks our federal investments in clean energy, which will cost  over 790,000 jobs over the next decade and raise household energy  bills, all while adding to air pollution and worsening our climate  crisis.\n\nAnd even after all that, it will add $4 trillion dollars to the  national debt with interest costs over the next decade, saddling future  generations…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…year-old, she has dementia. Her daughter is 78 years old. I can't  imagine this moment when you realize at 78 that you can't any longer  care for your 98-year-old mom due to her worsening dementia. Edna  receives Medicaid coverage and is now able to have full-time care at a  rehabilitation center for senior citizens.\n\nHer daughter, at 78 years old, is so grateful,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…barred  from holding them, this bill endangers veterans' safety.\n\nThe bill leaves military installations, servicemembers, and their  families vulnerable to climate change and worsening natural disasters  by failing to include dedicated funding to strengthen our military  installations against these threats or to help them recover from past  disasters.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the job.\n\n``When you're facing threats yourself, it kind of prevents       you from being totally there for the public you're       servicing,'' she said.\n\nAsked about worsening phone service, Dudek told reporters       in a call last week that ``a 24 percent answer rate is not       acceptable.''\n\n``I want people who want to get to a person to get…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…farmers. If that  weren't bad enough, the very people we rely on to protect our ag  industry and combat the spread of bird flu have been fired from the  USDA.\n\nThis chaos is only worsening the risk of disease spread and  threatening a hallmark industry in Delaware.\n\nAll of this has resulted in higher costs for farmers and higher  prices at grocery stores for…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…were also sold as innovative products without sufficient guardrails.  Instead, they caused millions of people to lose their jobs, their  homes, their savings, reversing and worsening any gains that had been  made in Black and Latino homeownership and wealth. The collapse of the  housing market during this time displaced approximately 10 million  Americans.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…days over 90 degrees this summer,  and wildfire smoke has resulted in 18 air quality alerts, nearing the  record of 22 days in 2023. This is not a fluke. It's a sign of a  worsening climate crisis that threatens our life, health, safety and  economic security.\n\nInstead of investing in solutions to this crisis, the Republican  majority in Congress is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…includes  funding for the Sahuarita Police Department radio replacement, so  officers can communicate clearly and safely in the field.\n\nAs the Colorado River continues to face a worsening drought, water  security is more important than ever. This package helps fund water  reclamation facility upgrades in Tombstone that will improve efficiency  and replace…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…of jobs and sustain one of the last  remaining formal industries in the country.\n\nFailing to extend these programs would further destabilize an already  fragile situation, worsening humanitarian conditions. Strengthening  economic opportunity in Haiti promotes regional stability, pushes back  on malign actors trying to gain influence with our neighbors,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}]