[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…provisions that, for me, were  profoundly important. It is a compromise. And ``compromise'' is not a  four-letter word; it is the way to get things done.\n\nThis picture of unity is worth a thousand of my words, but it is also  a clear response to a crisis that we face, and we face it today. It is  a crisis in healthcare. It is a crisis in hunger. It is a crisis…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…President to create electronic Monopoly money.\n\nWho is buying? Abu Dhabi is buying $2 billion of Trump stablecoin  while the Chinese interests behind TikTok are buying $300 million worth  of Trump coin, and that is just what we know about. There is a lot we  don't know about because cryptocurrency literally means hidden money.\n\nIt allows for bailouts under…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…potential that all of us want to see fulfilled in our  kids.\n\nThat is exactly what this program was doing before President Trump  and Elon Musk actively decided that it was not worth continuing.\n\nAll too often it is, unfortunately, sink or swim for disabled  students after high school in America. Students and their families are  left behind despite being…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…inane and  embarrassing, and we have, but its very existence and the fact that  House Republicans have chosen to waste time and taxpayer dollars to  bring it up for a vote, is worth considering.\n\nLet's talk about the real gulf of America--the gulf in America--the  gulf between the ambitions and priorities of this White House, aided  and abetted by the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…our park system into a vibrant, inclusive network of  outdoor spaces that serve more than 2 million residents across Northern  Virginia. His dedicated service to our region is worth celebrating and  commemorating.\n\nMr. Gilbert became Executive Director of NOVA Parks in 2005 after  serving many years on the NOVA Parks Board. During his tenure as  Executive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Defense Authorization Act must  reflect that spirit. We can modernize our forces and protect our  homeland without eroding the Constitutional safeguards that make our  democracy worth defending. It is with deep regret that, in my opinion,  this bill does not do enough to meet that standard.\n\nI oppose this legislation and I urge my colleagues to do the same.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…finally refusing to abide by a unanimous Supreme Court ruling.\n\nJust as I stand here in the House of Representatives, Mr. Trump is  traveling to the Middle East to accept a gift worth $400 million from a  foreign government.\n\nI have spoken with Americans all over the country.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…with ties to Senate       Republicans, spent about $123 million in 2024. Of that, $59.3       million went toward advertising, mainly to TV ads. More than       $53 million worth of airtime made One Nation the top dark       money spender on TV ads during the 2024 election cycle,       according to research by the Wesleyan Media Project. One       Nation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…tariffs that, together with this policy, the  Republicans are pushing will drive American energy bills and prices at  the pump sky high.\n\nHowever, I guess those high prices are worth the costs to Republicans  if it means Big Oil and Gas are pleased.\n\nThe Methane Emissions Reduction Program was created to make sure that  these big corporations pay for their…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…one goal, and that is to increase the  value of their companies' stock on our capital markets.\n\nOur capital markets are the envy of the world. The securities traded  there are worth over $100 trillion. It is fragile. It is delicate. It  is the nerve center of global capitalism. Why don't we just let big  balls take a whack at it? What could go wrong?…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…over $5 billion. How is he  doing that? By treating public office like a personal business  opportunity.\n\nCrypto investments make up $2.9 billion of the Trump family's net  worth. Just days after the inauguration, Trump announced a Trump meme  coin used to funnel money into his and his family's pockets. Now, the  Trump family crypto mining scheme is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…impacting electric bills.  We do import poles and wires and energy, and that is raising electric  bills, too.\n\nThe Trump administration has also canceled billions of dollars' worth  of cheaper, cleaner energy projects and solar projects in every State.  No one has been immune to this. That has also fed into skyrocketing  electric bills. All of this adds…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…has already mentioned this: Particularly from  Virginia's standpoint, Canada is our second biggest trading partner.  Virginia's businesses export approximately $3.3 billion worth of  products to Canada. We import about $3.2 billion. Virginia's farmers  sell about $430 million of goods to Canada. A lot of Virginia peanuts  go to Canada. They are not…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…students here in  Virginia graduate high school in 4 years, and we have amazing teachers  to thank for that.\n\nWe need to make sure our teachers are being paid what they are worth,  have the support they need in the classroom, and have access to all the  resources they need to do their jobs.\n\nHappy National Teacher Appreciation Day to all the teachers…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…and mother, I know what is at stake. Every child  deserves to explore our parks without wheezing from smoke or smog.\n\nClean air and healthy parks go hand in hand, and they are worth  fighting for.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693644/clean-air-and-healthy-parks-go-hand-in-hand"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…brothers  and sisters and protect our first responders--because so far, the data  on--let's call it a fentanyl vaccine--is that it is 92 to 98 percent  effective. What if this were worth a few hundred billion dollars in  economic savings to our society in a single year?\n\nRepeatedly, I come here and I talk about helping our brothers and  sisters with obesity,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…doesn't happen today in this  place. And I fear we are going down a path we may never ever be able to  go down again--or at least go the other direction.\n\nSome fights aren't worth winning, much less losing. I have always  loved this institution and the norms of it, but this is not normal.  This is the exception. And this I do not want to ever have become…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…syndrome and in need of a heart transplant. At just 6 months old, Zion  was denied that chance.\n\nThe doctors told the parents, Bobbi and Josh, that baby Zion's life  wasn't worth the heart, that it couldn't ``be wasted'' on a child with  a disability.\n\nThat is not just wrong, but it is inhumane. It should never ever  happen again.\n\nThis bill that we…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…strongest country ever. We are still a nation of builders, warriors,  and champions; and thanks to President Trump, we are stronger than we  have ever been before.\n\nThat is worth getting out of your seat and standing and applauding  and cheering and being in support of. I thought the President of the  United States gave an incredible State of the Union…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Administration, or WAPA, to enter into a memorandum of  understanding to address the impacts that bypass flows at Glen Canyon  Dam have had on the Upper Colorado River Basin Fund.\n\nIt is worth taking a moment to highlight why we are here today. Under  the Biden administration, the Bureau of Reclamation wanted to rush to  implement bypass flows to prevent smallmouth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…from their family for a few extra hours,  trying to make ends meet for their family, and they think: Gee, I have  got to give all that extra money back to the government, is it worth  being away from my family?\n\nWe say, you know what? Yeah, normal tax rates apply on everything  else, but if you work overtime, you are not going to pay taxes on that  overtime.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…Operations helicopter pilot with nine  combat tours, who has seen firsthand what makes this Nation  exceptional.\n\nAmerica's strength comes from our enduring belief that freedom is  worth fighting for and from our commitment to protect and empower the  hardworking families who make the American Dream possible.\n\nMy commitment is simple: Lower prices for Tennesseans,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…They literally violated their  own legal counsel. So now, we are in a quandary. GAO has broken their  own legal counsel. We have an issue that will have well over $100  million worth of effect onto the country. It is now a near nationwide  mandate on electric vehicle sales across the country without ever  having a vote in Congress.\n\nAnd our Democratic colleague…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…industrial and economic  support to Russia.\n\nIn fact, our State Department assessed that in the second half of  2023 alone, China supported the transfer of nearly $300 million worth  of semiconductors to Russia, including for use in missiles and drones.\n\nThe CCP's actions are blatant violations of U.S. export controls and  detrimental to our ongoing peace…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…As I wrap up, I thank Chairman Graves for his leadership, as well as  Congressman Collins and Congressman Rouzer. They have all said we need  to step up. Our environment is worth fighting for, and that is what the  Bean amendment does. I ask for your support.\n\nMr. Chair, I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…2024 for data       anomalies. It found more than 29,000 Social Security numbers       in 2023 and nearly 68,000 in 2024 that were used to receive       more than one year's worth of insurance coverage with       subsidies in a single year--meaning the same Social Security       number was used by more than one person.\n\nIn 2023 one Social Security number…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can all divide that by 10, so let's  call it $3.2 billion a year.\n\nWe borrow $6 billion a day. If that is $3.2 billion, you functionally  bought yourself 12\\1/2\\, 13 hours' worth of borrowing for the entire  year, and there is the mental breakdown. The left runs around and says:  Raise taxes. Okay. We are going to borrow 7.3 percent of GDP, which is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…millions of Americans we have lost to drugs or the countless numbers of  Venezuelans who have been political victims of the regime, but it is a  start.\n\nMr. Speaker, justice is worth fighting for. A Western Hemisphere free  from drug trafficking and gangs, supported and run by illegitimate  autocrats, is worth fighting for. Standing behind our principles,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…He celebrates his 100th birthday this week, and on this  momentous occasion, we owe him thanks for his service.\n\nThere he is. His story is powerful. His example is certainly worth  following.\n\nAt the end of 1941, a teenage attendant was knocked down when an air  compressor knocked him off his feet. He was working at Hoosier Pete  filling station in Indianapolis.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…coal out of the conversation, an essential piece of  our Nation's energy matrix.\n\nThe United States is home to the world's largest coal reserves, with  approximately 440 years' worth of supply at current production levels.  Today, our fleet of over 400 coal-fired power plants provide 16 percent  of America's electricity, and in five States, coal provides…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]