[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…fire. We lost  Josh Barrick, Deana Eckert, Juliana Farmer, Jim Tutt, and my friend,  Tommy Elliot. Five friends, neighbors, and loved one were taken too  soon.\n\nAmong the eight wounded was Officer Nick Wilt. Just 10 days out of  the academy, he bravely ran toward the gunman and was shot in the head.  Miraculously, he survived. That same day, just blocks…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…That was on March 15,  2022. It was supposed to have been put up on March 15, 2023. We are now  more than 2 years overdue in honoring those police officers, 140 of  whom were wounded, injured, disfigured, and many of them permanently  disabled. Several lost their lives in the days to follow that atrocity,  attack on this body.\n\nThere is a law which says…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…might be next.\n\nIt has been 26 years since the Columbine tragedy; 26 years since 2  gunmen murdered 13 students and a teacher and left many others  physically and mentally wounded for life. Since that day, Jefferson  County, CO, has done what no community should ever have to do: They  have built some of the strongest systems in the Nation to prepare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…profound.\n\nI am just so honored, and I know the gentlewoman feels the same way,  to have met President Zelenskyy and so many of his advisers,  individuals in the military, and wounded soldiers. Russia has lost over  100,000 soldiers. We are not sure how many. It is a lot. Those soldiers  didn't have to die. They could be doing things in Russia to help…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…marauding rioters and insurrectionists, Proud Boys, Oath  Keepers, Three Percenters, who came to try to overthrow a Presidential  election. They stormed the Capitol. They injured, wounded,  hospitalized, brutalized more than 140 officers, many of whom are still  suffering from the physical and mental wounds today.\n\nWe voted back on March 15, 2022, to put a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…pediatricians.  They are telling me every day that gun violence is just increasing.  Every day, over 125 Americans are killed from gun violence and more  than 200 people are shot and wounded.\n\nThese aren't just statistics, Mr. Speaker. These are human beings  with lives and futures. They are our babies, our friends, our  neighbors, our loved ones. Many of these…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…defeated the Nazi troops  in a surprise attack.\n\nThat was not without paying a heavy price. Nearly 1,000 soldiers from  the 10th Mountain Division were killed, and some 4,000 were wounded in  4 months of fighting the Germans. They were successful, and the Germans  surrendered.\n\nHoward lived to be 101 years old, making his final journey to Heaven  just last…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…House and the Senate, for the staff who work here,  and for the reporters who work here.\n\nWe have many officers who have had to leave the police service  because they have been wounded and disfigured permanently by the  injuries they suffered at the hands of these people. This is the very  least we can do at a time when the President of the United States…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…their ongoing response to this  senseless tragedy.\n\nWe are grateful to the first responders for their prompt action on  the scene and medical professionals for caring for the wounded.\n\nAs law enforcement continues their work, we thank them for their  efforts and wish them strength in their pursuit to bring to justice  whoever committed this horrific act.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698196/moment-of-silence-in-honor-of-victims-of-brown-university-mass-shooting"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…lives to protect us and our  democracy.\n\nAs seen here, these officers were brutally assaulted with flag poles,  bear spray, stun guns, knives, and bats. Over 140 officers were wounded  and sustained injuries from the attack. Many still deal with the mental  and physical trauma from that day.\n\nThere were numerous officers who died from their injuries after…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…been elected to her middle school student council; and Gabe  Zimmerman, Gabby's director of community research who died doing the  work that he loved.\n\nThirteen others were wounded, including Congresswoman Gabrielle  Giffords. She survived a gunshot wound to her head through the sheer  force of her will, exceptional medical care, and the unwavering support…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…that  ended in Lewes, Delaware, where he came under direct fire from a  suspect wielding an AR-15. Under threat, Lieutenant Moyer held the line  and even helped evacuate a wounded resident to safety.\n\nAt the same time, Trooper Nieto made a split-second decision. Knowing  an officer was pinned down, he maneuvered into harm's way, drawing the  suspect's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Well, maybe that takes care of the judges, Congressman Green,  but what about Members of Congress? He is just threatening them.\n\nRemember, we had a Member of Congress who was wounded. There was an  attempt to assassinate her. There were innocent bystanders there with  her who were harmed, deadly. It is about all of us. It is about when we  are out in the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Kelly Morrison and the Minnesota  delegation.\n\nI join my colleagues in condemning the attack that took the lives of  Speaker Emerita Melissa Hortman and her husband, Mark, and wounded  Senator John Hoffman and his wife, Yvette.\n\nLet me say this loud and clear as so many have said today. There is  no place in our democracy for political violence. It violates…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692861/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…inspected, and the individuals on board arrested and  prosecuted. Most disturbing of all, the Administration carried out a  so-called ``double-tap'' strike, deliberately targeting wounded  survivors after an initial attack. That conduct is indefensible and  inconsistent with the rule of law and the values the United States  claims to uphold.\n\nThe President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Pacific Theatre on the  islands of Peleliu and Okinawa, where he was twice awarded the Purple  Heart medal for wounds suffered in combat. On the occasion when his  Corpsman was wounded, Cpl Ivanoff attempted nobly to evacuate him, but  both were struck by enemy mortar fire that ultimately killed his  Corpsman and forced his own medical evacuation.\n\nOnce…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…got to the  top of the cliffs that the Allied military intel was misled by decoys  and that the entire invasion was now at risk. Bud, I know  parenthetically, was actually wounded leaving the landing craft but  tenaciously continued. In one interview, he said: I lost half my guys.\n\nFirst Sergeant Lomell and another Ranger, Sergeant Jack Kuhn, found…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…commitment.\n\nDuring the intense second Battle of Fallujah, Scott was one of only  nine Marines from his 41-member platoon to survive. Five of these  survivors were critically wounded. Scott and his unit demonstrated  dedication to our country and made tremendous sacrifices.\n\nAfter his service with the United States Marine Corps, Scott played a  vital role…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…from  1967 to 1968 with the 11th Armored Cavalry Regiment (Blackhorse), where  he served under Colonel George Patton and Colonel Jimmie Leach. During  that time, he was twice wounded by RPG attacks, survived two mine  explosions, and earned two Bronze Stars for Valor, the Army  Commendation Medal, and the Vietnamese Cross of Gallantry. He was  medevacked…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…the Vietnam War.\n\nServing with the 68th Medical Detachment (Dustoff), Mr. Sarrault  participated in numerous recovery missions, often under enemy fire. His  role in rescuing wounded soldiers from active combat zones demonstrated  extraordinary courage and was vital to saving countless lives. His  service reflects the bravely and sacrifice of so many Dustoff…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "James Risch", "party": "Republican", "sentence": "…dragged back into Gaza, including U.S. citizens. Hamas'       act of terrorism has claimed the lives of nearly 1,200 in       Israel, including at least 31 U.S. citizens, and wounded       thousands more. The attack was the single deadliest day for       the Jewish people since the Holocaust, and it was reminiscent       of the worst rampages of ISIS.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Service Medal, the National Defense Service  Medal, and the Army Service Ribbon.\n\nThe Purple Heart is a solemn testament to his sacrifice in defense of  our freedom, having been wounded in action while serving his country.  The Bronze Star Medal further attests to his heroic or meritorious  achievement in a combat zone, an enduring reflection of his courage…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…individuals to come see the names of their  loved ones and patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…of Azerbaijan yearned for freedom.\n\nOn January 19, 1990, violence erupted in Azerbaijan's capital city of  Baku where Soviet troops killed over 100 Azeri demonstrators and  wounded another 700. Undeterred, the people of Azerbaijan continued  their peaceful protests until declaring independence from the U.S.S.R.  on October 18, 1991.\n\nNow, 36 years on…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…invasion of Sicily, clearing the coastline for advancing Army units.  Later, it provided support during the Invasion of Southern France.  During combat, Radioman Scarpelli was wounded by land artillery and  treated at a field hospital before rejoining his ship, where he  continued his duties, including cutting mine cables and neutralizing  deadly sea mines.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…American  Division during the 1969 Tet Offensive. Amid intense combat near Phuoc  Hoa, South Vietnam, his company was ordered to relieve a friendly unit  under fire. Though wounded in action, Mr. Gilman refused to fall back.  He steadfastly manned his M60 machine gun and continued providing  suppressive fire, even while receiving medical treatment. Thanks…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "John Carter", "party": "Republican", "sentence": "…for 12 years, and coached youth soccer for  over a decade. Her selfless work has positively impacted the lives of  countless young people. Today, she continues to serve as a Wounded  Warrior member and volunteer and has been a member of the Fort Hood  Retiree Council for the last five years.\n\nCSM Wilson's life stands as a model of selfless and genuine…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689348/saluting-the-service-of-command-sergeant-major-angela-wilson"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Keith VanBuren.\n\nKeith's service in the United States Army reflects the very best of  sacrifice and devotion to our Nation. While deployed in Afghanistan,  Keith was severely wounded when his vehicle was struck by an IED in  Logar Province. For his bravery, he was awarded the Purple Heart, the  Bronze Star Medal, and the Combat Infantryman Badge.\n\nAfter…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690756/recognizing-keith-vanburen"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…country called, Duane Brewton answered. He served from 1944  to 1945 as a private in the U.S. Army during the Second World War. He  was stationed in Vire, France, where he was wounded in the line of duty  and later returned home.\n\nFor his sacrifice, he was awarded the Purple Heart, a lasting  testament to his courage, humility, and devotion to freedom.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…veteran--to be able to access  cannabis if, in fact, it is necessary and prescribed by a doctor and if  it helps them treat whatever they have come home with?\n\nMy father was wounded and left for dead in World War II, and he came  home. I know what it takes for these people and the hurt that they have  gone through on behalf of our country. They deserve…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692949/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]