[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…freezing temperatures present new threats. Palestinian families have  endured a genocidal campaign for years. Their homes have been reduced  to rubble. Many have no warm jacket to wrap their child in or a dry  blanket to tuck them under, and still they whisper the same prayer: I  hope my baby is okay.\n\nMr. Speaker, in Gaza, children have been murdered as U.S.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Nation by joining Federal service.  These are heroes who deserve our utmost gratitude. Instead, Trump and  Musk are giving them the middle finger.\n\nCadet Bone Spurs may like to wrap himself in the flag with one hand,  but with the other, he is signing off on the orders that sell out our  veterans to line billionaires' pockets, and our warriors deserve…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…doctors, farmers, lawyers,  and even astronauts. We all come together, and we--Congress--decide how  to fund America's budget, not the guy in the White House. Now, before I  wrap up, I would like to again acknowledge my colleagues across the  Capitol who came to the table with us to do the hard work of hammering  these bills out.\n\nGetting these funding…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…community anti-gun  violence initiatives, which is the work that local community groups are  doing in North Carolina and Connecticut and all across the country to  just try to wrap services around people who might be at risk of gun  violence or to stop that cycle of violence once the first shooting  happens.\n\nSo we passed this legislation, and we crossed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…going to do. I have told stories of  constituents in Virginia who found a plan they could afford but with  higher deductibles. They are worried. They say they are just going to  wrap themselves in bubble wrap and hold their breath.\n\nBubble wrap doesn't help you, Mr. Speaker, if you are in a car  accident. Bubble wrap doesn't help you, Mr. Speaker, when you…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…rightly so.\n\nWe are not a perfect country. We are not a perfect nation, but we  have been called to a perfect mission. We need to fulfill that mission.\n\nI think it is important to wrap up with this. Dr. King's dream, kids  learn about it in school now, and they see the replays, but in some  ways the dream has become a memory for many. I think it is important…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…notice, without public comment, and without regard for the  devastating impact this will have on families, caregivers, and our  long-term care system.\n\nMr. Speaker, I just can't wrap my head around some of these changes.  Home care workers are too valuable. They are already underpaid and  unprotected, with 2 in 5 already living at or near the poverty line.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…super-PACs, but rather the people, our  constituents.\n\nOr is it doing whatever Donald Trump tells you to do?\n\nThis is a critical moment in U.S. history. I will highlight, as I  wrap up my Special Order hour, a few people that despite the darkness,  despite the stoking of fear that you see happening throughout the  country, continue to demonstrate who we…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…they  failed to do their jobs and that they are out of those jobs.\n\nInstead, Trump and Elon Musk gave them the middle finger and a pink  slip. ``Cadet Bone Spurs'' may like to wrap himself in the flag with  one hand, but with the other he is signing off on the orders that sell  out our veterans to line the pockets of his rich friends, and our  warriors…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have  concluded in the last 24 hours, with the last vote that just concluded,  brings to its completion a sad and a sordid moment in the history of  the Senate. I want to just wrap up to leave a record of what took  place.\n\nBefore we got into this parliamentary rigmarole, there were two  things that were pretty clear: one, a Congressional Review Act, a…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…cuts services, your healthcare access will be  truncated. There is no two ways about it. It has been a very  interesting exercise to watch some of our Republican colleagues wrap  themselves into pretzels claiming not to have voted for the Medicaid  cuts, but it was just an overall structure giving direction of how we  should cut these moneys.\n\nRemember,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Republicans are talking about here is absolutely extraordinary.\n\nAnd I want to lay out for you, you know, a few additional facts and  numbers and ask you to respond to them as you wrap up your time talking  about this particular topic.\n\nBut let me just underscore what you have laid out very well. We are  talking about nearly $900 billion worth of cuts to Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…monthly premium.\n\nUltimately, it came down to: I don't go to the doctor that often, my  kids don't go to the doctor that often, so we will just roll the dice.\n\nShe said: We will wrap some bubble wrap around us, I guess.\n\nI don't think bubble wrap is going to help if they get in a car  accident.\n\nVictoria Cassels, an accountant in Roanoke, worries about her…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…through the force of law.  We are long past the moment where any letter or Executive order or  promise can secure our trust. This is our path forward.\n\nI am thinking about, as I wrap up this speech--I am thinking about  all of my colleagues who are here to speak with such intention about  what is happening. I want to just take a pause to acknowledge my…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…forced middle-class  Americans to pay the bill. It is unacceptable, and if we have any hope  of getting our fiscal house in order, this needs to change.\n\nCongress is about to wrap up for the year, but when we reconvene, our  debt will still be there--the largest it has ever been. We just can't  make this debt go away. Lawmakers are going to have to put…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Kentucky, Maryland, Minnesota, North Dakota, Oregon, and Virginia. They  are all in line to fight for their own State and protect the  environment in their own State.\n\nAs I wrap up, I thank Chairman Graves for his leadership, as well as  Congressman Collins and Congressman Rouzer. They have all said we need  to step up. Our environment is worth fighting…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…would just say is that the Financial Services Committee put  together an ESG work group that I had the pleasure of chairing, and we  came up with a report.\n\nMr. HUIZENGA. I will wrap this up.\n\nMr. Speaker, what that report identified was that what we are seeing  is materiality. By the way, material issues are legally required to be  disclosed for a publicly…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…has  never brought America into a forever war. Any operation he has  conducted is pretty much done before breakfast, just like Venezuela.\n\nI think my Democrat colleagues can't wrap their heads around that  something can be about more than one thing at a time. It can be about  Maduro and his lawlessness. It can be about drugs. It can be about the  people…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nAs we wrap up this debate, I want to take a moment to cut through the  noise from our colleagues on the left. Instead of focusing on the  legislation before us, they are resorting to fear…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…possession.\n\nI would hope that the Trump administration realizes that the United  States' taking control of Greenland, especially by military force-- which, again, I can't even wrap my head around that one--what harm that  would bring to our national security and our international  relationships.\n\nThis is the 21st century. This is where the United States…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…is called a special government employee. That means it is for a  period of time--130 days, in this case. And with that date approaching  soon, Mr. Musk indicates he plans to wrap up his work. But I must  emphasize that the work of DOGE must go on. The task of improving  government efficiency is one that will never be finished.\n\nI believe that Elon Musk…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the President's desk and get back to doing the business of  the people now that the government is open.\n\nMr. STEIL.  Hageman).\n\nMr. Speaker, before we close, I just want to wrap up a few things  that have been discussed today.\n\nWe were closed as a Federal Government for 43 days because Democrats  in the House of Representatives voted against a clean…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…sense of humor. Over the next four decades, Susan Mason  Catering became synonymous with silver service, culinary perfection,  and timeless Southern style. Whether planning wrap parties for A-list  celebrities or elegant weddings for local families, she made sure every  detail was flawless.\n\nShe is now 85 years young and still very much at the center…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693702/susan-mason-savannahs-style-and-service-icon"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…messages. I am lucky to  get five Members to come. I try to fill up 20 minutes, 15 of which your  dad would actually take. He would go on and on. I would try to get him  to wrap up so I could go to dinner. He was always there for me.\n\nTonight, we ran over time with the amount of people who wanted to  come and take time out of their very busy schedules…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…our public health, and I  look forward to working with our colleagues who, I understand, also  have a few thoughts on this legislation.\n\nMr. MARSHALL. Mr. President, before we wrap up this Whole Milk for  Healthy Kids Act, I just want to go back over a couple things as well.  Senator Welch, it is always a pleasure to work with you. Whether we are  trying…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…basis. I shake hands and greet people.  Whether I like them or not, I shake hands. It is something that I do,  but I can tell you what I don't do. I do not let other people wrap  their arms around me unless they are my kids, my friends, or my family.\n\nThat is Nicolas Maduro's hand right there. I will put a little arrow  there. That is Ranking Member…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…while Republicans want to  put government closer to the people, take power out of Washington,  D.C., and truly put America first.\n\nMr. WESTERMAN.  Greene).\n\nMr. Speaker, as we wrap up this so-called debate today, I want to  remind everyone of something that they are not seeing on the news every  day like they were several months ago, and that is hordes…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…offering encouragement and  understanding to others walking a similar path. She is also a certified  instructor for Mental Health First Aid and Wellness Recovery Action  Plan (WRAP), further extending her impact in the community. In addition  to her peer support and education roles, Joanne chairs NAMI Hernando's  Fundraising Committee and has been an active…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…And he brought the Scriptures to life. He was a  profound teacher. He was a solid doctor.\n\nAnd I remember, of all the many lessons I learned from him--and I am  just going to wrap up with this one story. And I remember it so well  because I remember reciting it back to him in a letter one time. In one  sermon, he said: We should all live with one eye…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Congress. It was the end of January 2020. We  had never heard of the term ``COVID'' before. We had seen a tax reform  bill take place at the end of 2017 that people couldn't really wrap  their heads around.\n\nI was working for a consulting firm, and I remember talking to some  of the partners at the firm. I was a principal at the time--actually, I  was probably…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}]