[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…the Year at the Avidity Awards  in Memphis, Tennessee. Their third project, 8:28: Live in Dallas, was  released in January 2023 and features the single ``'Til It's Good,''  written by Pastor Wesley. Their most recent live recording, 14:14,  inspired by Exodus 14:14, was released in 2025.\n\nIn addition to his leadership at Antioch and Undignified Praise,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…England-based Revolution Wind offshore project and correctly  determined that the Department, in fact, did not find a national  security problem but instead specifically issued a written finding a  year ago that Revolution's turbines ``would not have adverse impacts to  DOD missions.''\n\nMr. Speaker, you may recall, last September, the House debated an  amendment…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…wasteful.\n\nThat is false. Again, the hotspots rule limits the amount of money  that can be requested by an E-Rate applicant and prohibits the  duplication of the funding. It is all written into the law.\n\nLet me be clear: This repeal will not save the taxpayer a dime. What  does the resolution really do? It doesn't make our schools stronger. It  doesn't make…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Amendment and made sure that little  Black children would be able to get an education. Even before the  Department of Education was established, even before that, the IDEA was  written into law.\n\nI bring all of that background up to say that the Department of  Education was critical because when you think of all the various laws  that need to be administered…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…LICCARDO. Mr. Speaker, today I rise to commemorate the 50th  anniversary of Black April.\n\nAs Pulitzer Prize-winning author and one of San Jose's favorite sons,  Viet Nguyen, has written: ``All wars are fought twice; once on the  battlefield and a second time in memory.''\n\nOn this day, 50 years ago, fathers, mothers, sisters, and brothers  looked out across…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…electorate. I find it so interesting that in real time we are having  this conversation. When we talk about Black voters, we are going to  talk about Black voters.\n\nThis bill was written so poorly it doesn't even take into  consideration women of all races who changed their names when they got  married. It is ridiculous.\n\nIt has been a Federal crime, we know,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…lot of B's in this statement. None of them are very good.\n\nLet me be very clear: Republicans have barely made any attempts to  support working families. Instead, they have written an economic love  letter to people like Elon Musk. This is a 386-page love letter to Elon  Musk.\n\nRepublicans can run from the truth all they want--they have been  silent--but…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…say there is no way that the  Supreme Court is not going to essentially say that the President  interprets what is happening, given the language that exists there.  That was written with the belief that we would always have a capable,  responsible defender of the Constitution in the Oval Office and we  don't. So reforming that act and closing that loophole…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the statute to be found to be constitutional.\n\nHowever, the way this bill is drafted, none of those safeguards could  come into play because the initial provision as it is written makes all  of those superfluous and says that no matter what, if these charges  arise, then the person has to be detained for the entire pretrial  period.\n\nMr. IVEY. Mr. Speaker,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…first-generation Haitian-American, an immigration       attorney, and the Legal Service Coordinator and Immigration       Policy Analyst for the City of Somerville, I submit this       written testimony to address the devastating impact that       terminating Temporary Protected Status (TPS) for Haitian       individuals and families would have on our communities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…help our rural small businesses are riddled with red tape,  and they are often impossible to access.\n\nI have heard again and again that the rules of the road are simply  not written with the realities of rural America in mind, their  challenges and the opportunities. That is not right, and it is our job  as lawmakers to correct it.\n\nIn 1990, Congress…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…I heard about it. I wanted to  see it. The most graphic example I can remember from that experience  was when they showed me a bag of some grain supplement, and on it was  written ``USAID from the people of the United States of America.'' What  they were doing with this was making a lunch for the children in the  village. I don't think your kids or…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688339/usaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…challenges prevail, he will  invoke the Insurrection Act. He has said that if courts or Governors  delay the deployment, he will invoke an act that is 217 years old,  which was written after the Whiskey Rebellion and the Battle of the  Wabash, when local police simply didn't exist in most places or were  overrun in those areas by the farmers who were objecting…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…his damaging  cuts and harmful budget proposals, I will continue to join you in  pushing back against his agenda on the Senate floor. These are not the  bills we would have written on our own. I know that. These are not the  bills I would write on my own. But they do mark significant improvement  over the status quo where Trump and his Agency heads can…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…promise. They have betrayed the  American people.\n\nIf you want more evidence of that, look at the bills on the floor  today: more garbage, more culture war crap, more bills written by this  Republican majority of, by, and for the billionaire class.\n\nRepublicans moved Heaven and Earth to give tax breaks to the rich and  powerful. That got done in a nanosecond.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…coordinating the environmental  review process for interstate natural gas pipelines. It requires other  Federal and State agencies to align their reviews with FERC's timeline.\n\nIt is written with a clear objective, reducing delays and approving  coordination. Did I mention that gas has really needed to be given to a  lot more American households?\n\nHere is what…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Covered California proceeded. I  believe this raises a serious issue under HIPAA, a law designed to  protect the privacy of individuals' personal health information.\n\nI have written to Secretary of Health and Human Services, Robert F.  Kennedy, Jr., to ask for an investigation into what happened in  California, into how this was allowed to happen and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…important as China seeks to enhance  their chip and AI development.\n\nUnfortunately, there is a major loophole in our export control  regime. As the laws and regulations are written, physical export  controls do not apply to remote access of items. This means that still  to this day, the CCP can access our tech through the cloud and utilize  it for their…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…state,       local, and private security entities, procuring personal       security devices and services, and physical security       enhancements using SOPOEA funds, upon written delegation of       such authority by a Member.\n\n3.3 SAA Residential Security Program. The SAA Residential       Security System Program provides physical security support…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the       Internal Revenue Code of 1986 is amended to read as follows:\n\n``(1) In general.--No penalty under this title shall be       assessed or entered unless, before any written communication       with respect to such penalty (including proposal of a penalty       as an adjustment) is sent to the taxpayer, the initial       determination of such…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Act'');\n\n(ii) is not subject to any agency rules or judicial       doctrine regarding ex parte communications with a decision-      making official;\n\n(iii) may not, without the written consent of the person or       entity submitting such information, be used directly by the       Department of Commerce, any other Federal, State, or local       authority,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…article before. It is one of the best in explaining  the reality of the math and also the reality of the lies. They are just  outright lies. We have to tell the truth.\n\nThis is written by Jessica Riedl in 2023. What was done is, they took  all these tax proposals that the Democrats have proposed, the ones we  have scored, and then did the economic modeling.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "James Risch", "party": "Republican", "sentence": "…members of the       committee desire that a special meeting of the committee be       called by the chairman, those members may file in the offices       of the committee their written request to the chairman for       that special meeting. Immediately upon filing of the request,       the chief clerk of the committee shall notify the chairman of       the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…section 4.1(b)(2) of title 43, Code of Federal       Regulations (or any successor regulations), with the Board of       Land Appeals may submit to the Board of Land Appeals written       notice of such party's intent to seek expedited review of the       appeal. If a party submits such written notice, the Board of       Land Appeals shall issue a final…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…registration requirements no longer have a legal standing.  In fact, had it not been for the radical, partisan Senate  Parliamentarian, this intent would have been explicitly written in the  bill text.\n\nApparently, what the Senate Parliamentarian didn't understand is the  history and mechanisms of the National Firearms Act. Congress enacted  the NFA in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Beautiful Bill Act.\n\nIs it your understanding and intent, Chairman Smith, for the purposes  of this provision, vehicles shall be treated as ``acquired'' as of the  date on which a written binding contract is entered into for their  acquisition and a payment has been made?\n\nMr. LaHOOD. Mr. Speaker, I associate myself with the comments of the  managers. I am…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693196/one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…has come, to  supplement private-sector innovation in this Nation, is actually  Congressman  Jim Himes' white paper that he shared with me years ago. I  thought it was well-written, and it was another indication that this  was not the direction to go in.\n\nSince that time, I have visited with other central banks around the  world, in Europe and other…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…deem necessary and may delegate such authority       to any other member of the Committee.\n\n1.3. A special meeting of the Committee may be called at       any time upon the written request of five or more members of       the Committee filed with the Clerk of the Committee.\n\n1.4. In the case of any meeting of the Committee, other       than a regularly…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Davis, who some on the left view as a hero, as another person who was  antifamily.\n\nMore recently, Black Lives Matter, during their ascendancy a few  years ago, in documents written by their founders, wanted to get rid of  the Western-prescribed, so-called nuclear family.\n\nEven after that was out there on the internet, before they took it  down, a significant…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…SPECIFIED FOREST SERVICE PROPERTY TO                     PERRY COUNTY, ARKANSAS.\n\n(a) Required Conveyance.--Subject to this section, if the       County submits to the Secretary a written request for       conveyance of the property described in subsection (b) not       later than 180 days after the date of enactment of this Act,       the Secretary shall convey…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}]