[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…oppose the amendment offered by the gentleman from  Michigan, I do have a couple of observations about it.\n\nFirst, the effect of this amendment could be accomplished by just  writing a letter to GAO, along with the chair of the Education and  Workforce Committee. That would be faster than sticking it on this bill  and hoping the bill passes.\n\nWe may draw…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…so numerous to the Senate as a whole  that it locked up the lines. There are letters I am getting and emails  I am getting. There are people taking scraps of paper and just writing  their hearts out and sending them in to say: These are not ordinary  times. These are painful times, frightening times, times when people  question what is happening to America…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…billionaires, more crumbs for working  people, more favors for Wall Street, more struggles for Main Street,  more cruelty towards the vulnerable, more indifference to anyone who  isn't writing a campaign check. We have never seen pay-to-play as much  as we have seen in this Congress and in this administration.\n\nThis isn't governing. It is greed. It is corruption…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…James Comer, Chair,      Robert Garcia, Ranking Member,      Committee on Oversight and Government Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: I am writing       to you on behalf of the District of Columbia Bar (the D.C.       Bar) and its Board of Governors in support of the vital work       of the District of Columbia Judicial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…This is a young man--I think he was around 26--who moves to a new  town, doesn't know anybody there, with his wife and child. He becomes  the pastor of a church. He is still writing his dissertation at night,  and then he becomes the leader of the Montgomery bus boycott. Talk  about gifted leadership.\n\nNot too far into that--they were a few days in, actually--the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Center and Fluff-n-Fold  Laundromat, fostering job creation for local residents. Even amidst  significant health challenges, he remained dedicated to sharing God's  goodness, writing, preaching, and singing about His grace. He authored  two impactful books, ``Freedom in Worship'' and ``Stuck in A Rut,'' and  expanded his ministry globally through TBN and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…legally subpoenaed, checks paid for by American taxpayers.\n\nIt is corruption at a whole new level. With bribery and insider  trading, someone breaks the law. Here, Congress is writing a law that  protects and funds corruption. It is brazen and disgusting and an  effort to legalize corruption. Anyone who votes for this CR is  complicit in that corruption.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696697/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…allowed to go into Gaza unescorted by the Israeli Army.'' And when they  do, the full horror of the destruction there will become clear to all.\n\nFriedman continued, Mr. Speaker, writing: ``Israel, instead of being  seen by Jews as a safe haven from anti-Semitism, will be seen as a new  engine generating it; sane Israelis will line up to immigrate to  Australia…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…enjoyed working on this endeavor with my colleague  across the aisle, Mr. Aderholt. It has been a pleasure.\n\nMadam Speaker, in 1776, the Declaration of Independence put into  writing a set of ideals that reshaped this Nation and influenced the  world.\n\nEvery major anniversary since has given Americans a chance to reflect  on those principles and what they…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Domestic Violence, DC Democratic       State Committee, DC for Democracy, DC Jail & Prison Advocacy       Project, Fair Budget Coalition, Free DC, Free Minds Book Club       & Writing Workshop, Georgetown Law Center for Innovations in       Community Safety, Harriet's Wildest Dreams, Interfaith Action       for Human Rights.\n\nLeadership for Justice Innovation,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…American citizens, and  they did it in error.\n\nThey were also concerned about the immigrants who were taken out of  our community who do so much good in our community.\n\nI am writing a letter to Kristi Noem and reminding her that she said  they were going to get the worst of the worst: the murderers, the  rapists, and the sexual offenders.\n\nShe is not…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696772/take-ice-out-of-memphis"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…officially open for business in  Albany, NY, in Upstate New York.\n\nToday is the day I have been dreaming about since the time I wrote  the Chips and Science law and when I was writing the NSTC program into  the bill. I had always been thinking of Albany and of Upstate New York.\n\nThis center will be a leading hub for semiconductor innovation, not  just in…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…because of the increasing costs of       everything but most especially healthcare.                                Caleb--Norwich\n\nAs a small business owner in Connecticut, I am writing to       share my deep concern about the potential loss of the health       insurance exchange and the premium tax credits.\n\nFor business owners like me, the ACA marketplace…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…premiums are going up by hundreds and even thousands of  dollars every month due to the inaction of this Congress.\n\nMr. Speaker, I know that many of the people back home must be writing  to you with similar stories. We can't fail these families. We can't  turn our backs on working people who are struggling to get by.  Healthcare is a basic and fundamental…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…many ads. I think I  need it, Doctor.\n\nAnd in too many cases, the doctor, rather than get into a debate or  say there is a cheaper generic for this drug or the other, ends up  writing a prescription for an expensive drug. It is one of the major  reasons that health insurance premiums have gone up so high in the  United States of America.\n\nNow, I have a…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Representatives,      Washington, DC.\n\nDear Speaker Johnson: On behalf of the more than 140,000       members of the National Association of Home Builders (NAHB),       I am writing to convey our strong support for H.R. 3898, the       PERMIT Act, which will provide necessary clarity and       confidence required under the Clean Water Act (CWA)…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to be budget neutral. We need to be  good stewards for programs like Medicaid and to make sure that it is  spending in a fiscally responsible manner and that we aren't just  writing blank checks to States who can spend money how they choose.\n\nI will close by saying I greatly appreciate the leadership my friend  from Colorado has shown. She is a leader…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…threats to       human life, the painstakingly garnered civilization and the       very survival of all life on our planet Earth. Greenberg       attributes the impetus to writing this inspirational guide--      which aims to reassure readers from all persuasions that       covenantal life of the spirit is worth laboring and fighting       for--to his…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…no doubt about it.\n\nBut when I read this latest column called ``I Just Saw the Future. It  Was Not in America,'' I couldn't believe how shockingly naive Mr.  Freidman was in writing this. So I just wrote a response. I just  started writing after reading this thing. My goodness, this is very  naive. Then I submitted that to the New York Times. They said:…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Capitol Visitor Center.\n\n3.0 Senate Hallways--Any conditions or circumstances       pertaining to hallways not covered by the following       regulations must be submitted in writing to and approved by       the Rules Committee.\n\n3.1 Unobstructed Hallways. All hallways in the Senate       Office Buildings and the Senate wing of the Capitol shall…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690981/us-senate-hallways-and-balconies-regulations"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Amendments and Report Language\n\nTo the extent possible, amendments and report language       intended to be proposed by Senators at full Committee markups       shall be provided in writing to the Chairman and Ranking       Minority Member and the appropriate Subcommittee Chairman and       Ranking Minority Member twenty-four hours prior to such       markups.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688276/us-senate-committee-on-appropriations-rules-of-procedure"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…currency, the one ring to rule them all. We have been trying to stop it  for that long. The idea was maybe not even possible technologically  when science fiction writers were writing ``Brave New World'' or  ``1984'' or ``Fahrenheit 451.'' In Scripture, how could this even  happen, when we read Revelation through all time?\n\nToday, we can see the technology…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…general.--Except as provided in subclause (III),       before initiating a civil action under subparagraph (A), the       attorney general of a State shall notify the Commission in       writing that the attorney general intends to bring such civil       action.\n\n(II) Contents.--The notification required by subclause (I)       shall include a copy of the complaint…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Minority Member of the full Committee on Homeland Security       and Government Affairs waive the 2-calendar day waiting       period or unless the Subcommittee Chair certifies in writing       to the Chair and Ranking Minority Member of the full       Committee that, in the opinion of the Chair, it is necessary       to issue a subpoena immediately.\n\nWhen…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688278/us-senate-subcommittee-on-disaster-management-district-of-columbia-and-census-rules-of-procedure"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…records that were covered up by the Biden administration.  Indeed, the public ought to know and give credit to those FBI agents  for expressing their concerns and doing it in writing; in other words,  following what the law requires.\n\nI gave the same credit to FBI agents who were obstructed by their  leadership and then-Secretary of State John Kerry during…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to the       appropriate offices, unless the Chair and Ranking Minority       Member of the Committee waive the 48 hour waiting period or       unless the Chair certifies in writing to the Chair and       Ranking Minority Member of the Committee that, in the Chair's       opinion, it is necessary to issue a subpoena immediately.\n\n3. The Chair shall have…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Supreme Court of Virginia.\n\nA Roanoke native and graduate of Virginia Tech and the University of  Richmond School of Law--go Spiders--Justice Koontz was known for his  clarity of writing, profound sense of fairness, and deep commitment to  justice. Justice Koontz mentored generations of legal professionals and  leaves a legacy of wisdom, service, and an unwavering…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "John Rose", "party": "Republican", "sentence": "…leave the world better than they  found it. Yet we civilians don't fully appreciate just how much time  they spend away from their families to protect ours. They stay late  writing reports or working events. They are often required to testify  in court on their days off to ensure the conviction of a suspect they  have arrested. That time, overtime, is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…shall provide for procedures by       which a taxpayer may request an abatement referred to in       section 6213(b)(1)(B)(i)(V) of the Internal Revenue Code of       1986 in writing, electronically, by telephone, or in person.\n\n(e) Pilot Program.--Not later than 18 months after the date       of the enactment of this Act, the Secretary of the Treasury…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transportation and energy; we represent hundreds of thousands       of union workers; we include economic development       associations; we are business leaders and much more.\n\nWe are writing to express our strong support for Congress'       efforts to utilize the Congressional Review Act to disapprove       of the mineral withdrawal that was enacted in northeast…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]