[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…that the mining industry is different now and that our  regulations are in need of change. I agree that we are in need of  modernization, but H.R. 4090 is a move in the wrong direction.\n\nWe need only look at the notorious track records of mining companies  abroad to see what disaster will look like in the United States.\n\nBHP, one of the world's largest…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the  rule from the Biden administration permitted.\n\nPredictably, the Trump administration is walking away from that rule,  and now the House is continuing to go in the wrong direction. For  example, H.R. 2988 will impose unnecessary barriers to considering  things like sea level rise. The supporters are making up some risk,  suggesting that some of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…movements and civil society abroad remains  squarely in America's interests.\n\nThis administration's funding cuts for democracy and election  observation programs move us in the wrong direction. And directives  telling U.S. personnel to avoid speaking publicly about how elections  are run overseas only make it harder to call out abuses when they  occur. The United…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…deserve better. In fact, they need some breathing  room and lower costs.\n\nInstead of meeting families where they are and lowering costs,  Republicans are taking us in the wrong direction. At the start of this  year, 22 million Americans saw their premiums go up in 2026 because  Republicans refused to extend tax breaks to help families afford their  healthcare.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…it. Mr. Speaker, if you don't believe me,  look at when we vote for the debt ceiling increase; $5 trillion to $18  trillion. What are we going to vote for? This is the wrong direction.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689899/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…urge the foreign  policy committees of both bodies to consider these resolutions  promptly.\n\nUnfortunately, Mr. Speaker, activity in House committees is taking us  in the wrong direction. Last week, the Appropriations Committee  approved an energy and water bill that cuts the National Nuclear  Security Administration's Defense Nuclear Nonproliferation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…priority, not helping giant corporations looking to do another  stock buyback.\n\nUnfortunately, it seems like Republicans, on healthcare, are focused  on doubling down in the wrong direction. That is what this morning's  developments say.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…energy supply  or restricting it.\n\nIt is simple economics. When supply goes up, prices go down.  Unfortunately, recent actions by this administration have moved us in  the wrong direction.\n\nIn northwest Indiana, two major energy projects that would have  increased supply and lowered costs were canceled. An $8 billion  hydrogen project at the BP refinery…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…since 2022. It appears the American people are in for  a rough ride. Buckle your seatbelts.\n\nPrices are rising already, and our financial markets are turbulent in  the wrong direction. Economic recession looms ahead. Unemployment is  increasing and so is inflation. It wasn't supposed to be this way.\n\nThe economic repercussions of the Trump administration's…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…of worship, our streets, or anywhere in our  communities.\n\nYet, while this crisis and disparity continues to grow across the  country, some in Congress are moving in the wrong direction. Again, my  colleagues just shared that, just a couple of weeks ago House  Republicans voted along party lines to pass the so-called One Big  Beautiful Bill Act, which…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…depend on it. You can't destroy  an ecosystem and expect farms, cities, and wildlife to just thrive.  These things rise or fall together.\n\nThis resolution takes us in the wrong direction. Let's actually do  something real for farmers instead of deflecting and debating  distractions. Let's repeal the mindless tariffs on our allies and top  trading partners.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…come on the floor and talk to  the press and say everything is beautiful. That is just not reality.\n\nThis President and this administration are taking this country in the  wrong direction. We have people that are being murdered in our streets  by U.S. Federal agents. When is enough going to be enough? I can't  believe this. Go along to get along, I get…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…administration urging them to reverse course on this senseless  decision. We shared our strong bipartisan sentiment that this decision  ``marks a dangerous step in the wrong direction.''\n\nWe shared that it is clear that health plans are still consistently  violating the law and systematically limiting access to mental health  and substance use disorder…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…place in  our communities. People are right to be concerned about crime.  Democrats are taking it seriously. If the goal is safer communities,  this bill moves us in the wrong direction.\n\nMr. Speaker, let's also talk about who this bill impacts. More than  93 percent of youth arrests in D.C. in the first half of this year were  Black youth. D.C. already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…what our  priorities are because in general--this isn't true of all of them--the  Biden administration and Democratic majorities have moved our education  system in the wrong direction. They have had the wrong policies.\n\nI believe Republicans have generally had the right policies, but the  questions are: What kind of priority are we going to place on…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…is laying off thousands of  researchers working to help cure pediatric cancer or address ALS or do  research into HIV AIDS--decision after decision that moves us in  the wrong direction, that makes us sicker, poorer, and more divided.\n\nI am usually one of the first to walk across the aisle and say: Let's  find a solution. Let's find a way out of this.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…economically justified. It is Washington at its  worst. It is no wonder that before President Trump took office, 75  percent of the country thought that we were headed in the wrong  direction. It is rules just like this that they know about.\n\nThis is a bad rule. It is bad for business, and it is bad for  customers. Let's stop this misguided regulation before…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…ground in these areas with local elected officials who, for years, have  tried to generate a better experience for visitors to the Orange  Cliffs, and this goes in the wrong direction.\n\nWayne and Garfield Counties are counties that struggle in a State  that otherwise thrives. Utah has a really strong economy, but these  rural counties have really weak…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…when Democrats controlled all of Congress and the White House  following the 2020 elections. They had the ability to make those  changes, but they took the country in the wrong direction.\n\nThat is why the country, at the ballot box, made the changes that  they made. They took the House out of Democratic hands and made  Republicans lead the House of Representatives.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…with a marriage penalty, particularly when  coupled up with State programs that do have a marriage penalty, it is  another program we are expanding and it is going in the wrong  direction.\n\nIn any event, I encourage President Trump to do what is already going  on behind the scenes, and that is to work towards, perhaps in our next  reconciliation bill, a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ago in November, the American people delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction. President  Trump received the electoral vote and the popular vote, and he won  every swing State. Republicans secured majorities in both the House and  the Senate.\n\nThis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the fight isn't over. We need full  cooperation between Federal, State, and local law enforcement.\n\nIt is unfortunate that Colorado's leadership is still going in the  wrong direction. Despite Governor Polis saying in January that he was  open to working with the Trump administration, he instead signed new  legislation in May that expands protections…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…acreage. That is more than 4 million acres. It would also block  nearly half of our federally owned oil and gas acreage. That is nearly  213,000 acres.\n\nThis is absolutely the wrong direction. As demand for energy reaches  record highs and Americans want to pay less for everything, we should  unleash American energy, not shut it down.\n\nNorth Dakota does have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]