[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "We are talking about States like West Virginia, Wyoming,  Alaska, Tennessee, Mississippi, South Carolina, Texas, Alabama, South  Dakota, and North Dakota will be the States most impacted by the lapse  in the Affordable Care Act tax credits."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "And, finally, I met a woman named Roberta who lives in Wyoming  County, one of our big dairy counties, by the way."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "We urge the committee and the Senate to pass it as soon as possible to help small communities with the operation of their drinking water and wastewater utilities and compliance with all the federal regulations under the Clean Water Act and Safe Drinking Water Act.\" --Dan Coughlin, Board Member of Wyoming Association of Rural Water Systems on behalf of NRWA\n\nPortland Cement Association (PCA):\n\n\"Thank you for your continued leadership in advancing critical water infrastructure legislation."}, {"senator": "Sherrod Brown", "party": "Democrat", "sentence": "To pay for those  tax cuts that have exploded the Federal budget deficit--you don't have  to be an accountant like my friend from Wyoming to understand what has  happened to this deficit--President Trump wants to ask more from  families struggling to make ends meet, the families he promised to  fight for, the families he has betrayed."}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "Michael Bennet (D-Colo.) and John Barrasso (R-Wyo.)--is also supported by Sens."}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Fitzgerald's district\n\nRiver Hills Police Department: `Use of Force' guidelines       says Taser 10 is considered ``non-lethal force.''\n\nGrand Chute Police Department\n\nAnother article on procurement                                   WYOMING\n\nGreen River Police Department\n\nLaramie County Sheriff's Office\n\nMr."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Last week, my office met with Traci  Tapani, a Co-President of Wyoming Machine, a small family-owned sheet  metal fabricator in Stacy, MN who relies on Canadian aluminum for their  operations."}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "In Wyoming, 40,000 folks rely on the ACA tax credits."}, {"senator": "Michael F. Bennet", "party": "Democrat", "sentence": "Children's Colorado is the primary provider of care for children, adolescents, and young adults with complex pediatric illnesses in Colorado, Wyoming, Montana, North and South Dakota, western Kansas, western Nebraska, and parts of New Mexico."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "There is evidence that this group targeted several states, including Washington, North Carolina, Massachusetts, Rhode Island, Hawaii, Oklahoma, Wyoming, and Florida."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "President, my friend from Wyoming, my colleague on  the Republican side, just gave a litany of accomplishments of the Trump  administration."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "Senators Chris Murphy (D-Conn.), Ron Johnson (R-Wis.), and John Barrasso (R-Wyo.), all members of the U.S."}, {"senator": "Thomas R. Carper", "party": "Democrat", "sentence": "I also want to make it clear that the Environment and Public Works  Committee, on which I serve and lead with Senator John Barrasso of  Wyoming, was willing to approve this particular nomination unanimously  by voice vote, but it is what is it is, and we are here today."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "And, NewYork's Westchester County (population 967,506) is estimating over a $100 million decline insales tax revenue, plus nearly $16 million in reduced public transportation fares and $8 million incounty park fees."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "The administration is helping protect Americans' freedom to purchase a car or truck that meets their needs.\" \n\nThe people of Wyoming drive longer distances and larger vehicles than residents in any other state."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "President, I rise today to celebrate the 50th  anniversary of the Wyoming Trauma and Emergency Medical Services  Conference."}, {"senator": "Michael B. Enzi", "party": "Republican", "sentence": "\"For many industries like agriculture, machinery and minerals, this deal would help create and maintain quality jobs in Wyoming while fostering new innovation and fairer trade across the board.\""}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Speaker, I rise today to recognize the legacy of my  friend and a great Wyomingite, Juli Spitzer."}, {"senator": "Michael B. Enzi", "party": "Republican", "sentence": "Senator Mike Enzi, R-Wyo., cosponsored two bills that would either increase accountability or eliminate the Consumer Financial Protection Bureau (CFPB)."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Senators Mike Enzi and John Barrasso and Congresswoman Liz Cheney, all R-Wyo., released the following statements after agreeing to serve on President Trump's task force dedicated to reopening the economy."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "One of these heroes, Ian  McBeth of Montana, was actually a member of the Wyoming National Guard."}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Throughout my district and Pennsylvania, from Schuylkill County to  Wyoming County, to the Susquehanna Valley to Lebanon, from Luzerne to  Lycoming, these chambers are working every day to support job creators  and bring small businesses together."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Senators John Barrasso (R-Wyo.), Tina Smith (D-Minn.), Doug Jones (D-Ala.), and Cindy Hyde-Smith (R-Miss.).The bill text is available here."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Senators Michael Bennet (D-Colo.) and John Barrasso (R-Wyo.), was offered as negotiations continue on new, massive legislation to continue addressing the health care and economic fallout from COVID-19."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Last Congress, the Environment and Public Works Committee, which I  chair, heard testimony about a highway project in my home State of  Wyoming."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Justice) and the Senator from Wyoming  (Ms."}]