[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, on tariffs, early this morning, it was  reported that Donald Trump caved to Xi Jinping and the Chinese  Communist Party, with virtually nothing to show for American workers.  Donald Trump has changed his mind, once again, on his tariffs, with a  new ``deal''…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…limits and set the stage for a more comprehensive  nuclear arms control framework agreement.\n\nNext, President Trump can put nuclear weapons on the agenda when he  meets with Xi Jinping. He expressed a willingness to do this in his  Oval Office comments.\n\nEven talking about negotiations in itself can help reduce tensions. A  deal requires a first step, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…for what happened off the coast of  Venezuela.\n\nIt is not the American way of doing business of killing people who  are unarmed. That may be how Putin acts. That may be how Xi Jinping  acts. That is not how America acts. I know there are Republicans on  this committee who are concerned about how Hegseth has acted. We need  Hegseth before the Armed Services…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Charging Is Here, but Not for U.S.-Made Cars       Catl's and BYD's rapid-charging technologies underscore china's\n\ndominance in the EV sector, a technological priority for Xi Jinping                      (By Yoko Kubota, April 23, 2025)\n\nShanghai.--Two of the world's leading battery developers       are locked in a technological race that has brought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…individual--the President of the United States--with no requirement  that he first consult with anyone. A nuclear war could also be started  at any moment by Vladimir Putin, Xi Jinping, or any other leader of a  nuclear weapon state. Or it could be triggered by mistake.\n\nA single use of a tactical nuclear weapon, either by accident or  design, could trigger…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…there ever was a 19th  century idea.\n\nHe clearly sees little reason to compete or constrain them as  demonstrated by his willingness to accept the trade deal with China's  Xi Jinping that overwhelmingly--overwhelmingly--favored Beijing. He was  giving Xi Jinping stuff that he didn't even ask for the minute he was  worried that somehow we were going to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Putin's hands.\n\nTurning our backs on NATO allies would embolden dictators and further  undermine American credibility. Walking away would send a dangerous  signal to Putin and Xi Jinping. We cannot strip away resources from  allies confronting Russian aggression or leave a vacuum for our enemies  to exploit.\n\nInstead, we must reaffirm our commitment, strengthen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…the list is relevant and aligned  with AUKUS goals.\n\nThe Indo-Pacific faces growing challenges, and the unholy alliance is  growing more brazen and aggressive. This  week, Xi Jinping is hosting Iran, North Korea, Russia, and other  hostile actors for a military parade. They are clearly sending a  message to the United States and our allies that they are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to Taiwan, one  of our most important democratic partners in the Indo-Pacific.\n\nTaiwan is under growing pressure from an increasingly aggressive  Chinese Communist Party. Xi Jinping has made no secret of his  intentions. Folding Taiwan into the People's Republic of China is  central to his vision of national rejuvenation. He has made it clear he  is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…it is not publicized as  it ought to be: Putin has abducted 20,000 Ukrainian children and  subjected many to brainwashing schemes. In these horrors, we see the  likes of Xi Jinping and his Uighur reeducation camps. Putin routinely  locks dissidents in jail, just like his kindred spirits in other  censorship regimes.\n\nThis tyrant who wants to be treated…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Chairman, Committee on Foreign Affairs.\n\nMr. SMITH of New Jersey. Mr. Speaker, I thank the chairman for his  support and for yielding this time.\n\nMr. Speaker, every year under Xi Jinping and his Chinese Communist  Party, tens of thousands of young women and men, average age 28, are  murdered in cold blood to steal their internal organs for profit or to  be…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…We know that forced sterilization,  forced labor, brainwashing, and torture are rampant in the Xinjiang  Uyghur Autonomous Region.\n\nDespite exposure of the CCP's crimes, Xi Jinping is doubling down. A  civil society investigation uncovered that the CCP's harassment and  forced transfer of Uyghur workers is more pervasive than previously  thought, with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…If I had been a member of  this body in the thirties, would I have seen what was coming?\n\nAnd, in recent days, I have been chilled when watching a parade in  Beijing where Xi Jinping, the dictator of the PRC, assembled the  leaders of North Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry. It reminded me of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…for good in the world.\n\nYet challengingly, we have seen on the world stage leaders flock to  Beijing. From Moscow and Pyongyang, they have come to kneel at the  altar of Xi Jinping.\n\nThe reality here is that China is looking deep to degrade the West,  fracture our allies, and capture emerging nations around the world. It  illustrates why the U.S. must…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Minister Starmer--I don't  mean any disrespect; I just think he is wrong. The only person on this  planet who thinks this is a good idea besides Prime Minister Starmer is  Xi Jinping of China. He has been for years anticipating that this might  happen, cozying up to Mauritius, and they have become best buddies.\n\nIn fact, China has convinced Mauritius…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…That is what I want to do the next couple of minutes, talk about the  Freidman piece and, in my view, why it is so naive and misses so many  things and, particularly, gives Xi Jinping and the Chinese Communist  Party a giant pass in terms of their history and what they have done to  the international trading system.\n\nFirst, the Freidman article kind of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…people who support the government, your  social credit score might go up. If you attend events and your  geolocation data is associated with people who have been critical of Xi  Jinping, your social credit score goes down. If it goes down enough,  you can't even travel in China.\n\nThey are linking this digital ID with the payment system, the digital  currency,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}]