[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…don't want to hear it because they think it messages so well.\n\nWouldn't it be great if we had this magic Golden Dome, or whatever we  want to call it, to stop nuclear weapons? Yeah, it would be great.\n\nIf it is an impossibility to do the fundamental physics of it, then  we should stop talking about it, and we should certainly stop wasting  money on it.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that my colleague is asking  for remaining intact, so that we can fund all of police and stop our  President's attempt to defund police departments in blue States.\n\nMr. BOOKER. Yeah, I just--again, I have so much respect for my  colleague that I want to respond to some of the things he said,  because, again, I just want to affirm that he is right on the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…biking across the United       States. Would you be interested in being my support vehicle?'       '' Hoker recalled. ``I thought it over and got back to him       and said, `Yeah, I'll do it.' '' The ride       wasn't just about miles. It became a journey of connection       with the country and its people.\n\n``I have a good feeling about America now…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…those people who are getting those  bills and those payments today.\n\nSo I wanted to come to the floor today and talk about that. And I  would say to my Republican colleagues: Yeah, we all want to have  bipartisan bills. We want to work on bipartisan appropriations.\n\nBut what we have in front of us is a CR that is partisan, that says:  Do it my way or…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…defend that what we have done together cannot be  undone by the Executive.\n\nSo far, we have not received a ``Yes, we will defend the  Constitution.'' What I hear is mainly ``Yeah, President Trump would  never go for that.'' When you hear that, you know you are trapped in  authoritarianism because the vision of our Nation is that we the  Congress will…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…predict that my Republican friends, as always, will say: Oh, I am  really concerned about the cuts in Medicaid. I am really worried about  people who will lose their healthcare. Yeah, I know, I wish they  weren't cutting SNAP so deeply. Oh, yeah, I really care about this and  care about that.\n\nDo you know what they will do, Mr. Speaker?\n\nThey will come here,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…important battles, of the  Revolutionary War took place in South Carolina. If you talk to people  today about a war in South Carolina, they can only talk about the Civil  War.\n\nYeah, it started there in the Charleston Harbor, but if you go back  and look at the Battle of Charleston, that critical battle that we had  lost twice, General Gates was not a good…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…materialized.\n\nJune 16, 2019, the President said: ``We are going to produce  phenomenal healthcare, and we already have the concept of a plan, and  it will be so much better healthcare. Yeah, well, we will be announcing  it in about 2 months, maybe less.'' Nothing happened.\n\nIn a FOX News interview, the President said: ``We are signing a  healthcare plan within…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Stephen Colbert, host of the show ``Late Night,'' number  one amongst hosts in his slot and a Trump critic, has his show canceled  by CBS, a financial decision it is said. Oh, yeah.\n\nMeanwhile, CBS' great news leader, Edward R. Murrow, rolls over in  his grave.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694145/meanwhile"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…this country are asking, like, are you,  the people in power, the people with the gavel, are you going to help  me?\n\nMake me drop my notes.\n\nI want the party in power to say: Yeah, I am going to help you. I am  going to prioritize you. I am just not going to prioritize you in March  of 2026 before my name is on the ballot, I am going to prioritize you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…aisle. We care about the American people. We care about their  health. We care about their safety. We care about their well-being. I  am proud to stand here on the floor saying, yeah, we are going to  continue to defend ObamaCare until the very end no matter what it  takes.\n\nPresident Obama spoke to this Congress, as well, talked about  Presidential leadership.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pause, the  fiscal year expires and the funding authorization goes proof, and  suddenly the President has killed the program. And the Court, in their  preliminary response, said: Yeah, we think you can do that.\n\nSo Russell Vought certainly seems to have a better grip on where the  Supreme Court is.\n\nBut I just feel like we have to do everything we can, therefore,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…The hotline already exists, by the way. You can google it. So you  basically establish a hotline that already exists, Mr. Speaker. Boy,  that is helping small businesses.\n\nYeah, but that is not a big problem, Mr. Speaker. The big problem is  the high cost of healthcare and these tariffs which are just basically  putting many of our businesses out of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…happened? One day, we are going about  our business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors. Oh,  yeah, you bet, people were concerned, scared, and nervous.\n\nA lot of people expressed their First Amendment rights. We got the  National Guard. Orange County Sheriff Don Barnes did…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…was sitting in the Oval Office with President  Bukele, the President of El Salvador, and they were joking about it.\n\nLast week, when President Trump did an interview, he said, yeah, he  could just pick up the phone and have him brought back, but he is not  going to do it, despite the Supreme Court order. There have been other  orders, too, that they are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there is not enough savings for all the borrowing.\n\nThen, you get the idiot who says: Well, we will just print the money.  Of course you will. What is that thing called again? Yeah, inflation.  You debase the currency. Yes, you pay for it with inflated dollars, but  everything you have, your savings, become worth less. You make real  estate and things…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Committee. I don't. I am  just a regular guy and a Member of the House, that is all, so I don't  know about that rarefied air.\n\nI guess I am part of the sewage that Mr. Himes said. Yeah. Thanks for  agreeing with me, Ms. Plaskett. She has got us down. Unless you are in  the Intelligence Committee, you are crap. That is what the Intel  Committee says.\n\nBut here…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696896/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…that it was a war in Gaza now believe  it is not a war in Venezuela.\n\nNow, some of them on the quiet will tell you: Well, it was a war, but  it is all over. It is all done. Yeah. We are not going to quibble. We  really weren't arresting somebody. It wasn't a drug arrest. It was a  war. It is a mini-war. But it is all over, so the War Powers Resolution…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…meet for their family, and they think: Gee, I have  got to give all that extra money back to the government, is it worth  being away from my family?\n\nWe say, you know what? Yeah, normal tax rates apply on everything  else, but if you work overtime, you are not going to pay taxes on that  overtime. This is somebody making $60,000 a year, not the billionaire.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…them a market, so this is 7 percent of the  healthcare market, and 94 percent of that 7 percent gets a subsidy.\n\nLet's actually do math because you have been listening to--oh, yeah,  there has been actually no math today as people talked about subsidies  on top of subsidies. The CBO report that updated yesterday--and I can  do this off the top of my head--basically…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you basically are having to take on two things that push against each  other, that create a real math problem, and that telling the truth  about it--how do you say it?--oh, yeah, gets the crap kicked out of  you? Let's have at it, though.\n\nPresident Trump stood there just a couple days ago, and within his  speech, when you talk about some of the policy…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…guidelines  there is not enough water in there to actually get my clothes clean on  one time, so I supplement it with the backyard hose and add more water  to my washing machine.\n\nYeah, that is really, really good policy.\n\nI remember an old DOE energy standard from a few years ago that one  of my constituents told me about related to the washing machine. I…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economy. It is not that  complicated.\n\nUpper-income taxpayers overwhelmingly finance the Federal Government.  I know this isn't good politics. People like me are supposed to say:  Yeah, the rich need to pay their fair share. The top 20 percent of  earners pay 25.2 percent. The next core tile pays 15.8 percent. The  middle covers 11 percent. The fourth core…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…has  turned this into a shirts-and-skins game. So from now until eternity,  the first question is going to be: Oh, I don't know. Who won that  Presidential election again? Oh, yeah, the other team. Well, we can't  allow them to have their nominees on a simple voice vote.\n\nIt will, I am afraid, have a very, very, very bad ramification on  this institution…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…crashing repeatedly? It turns out if 33 percent of all American  healthcare is just diabetes, if 47 percent of all American healthcare  is obesity, why wouldn't we take those on?\n\nYeah, it means doing some very difficult things. It means having a  brutal discussion about agriculture policy, nutrition support, and how  we are going to deliver healthcare through…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Agency and  it is put in place--especially when there is a change in Congress and  the White House--that the next Congress and the next White House can  look at it and say: Yeah, that is out of bounds. That is too big. That  needs to be stopped.\n\nIt was actually first used under President Bill Clinton. He put in  what is called an ergonomics rule that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}]