[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the Subcommittee on Capital Markets, but,  particularly, for the hearings that we have had on this bill. I look  forward to working with her on this subcommittee for many years to  come.\n\nMr. Speaker, I rise in support of H.R. 3394, the Fair Investment  Opportunities for Professional Experts Act, offered by my friend and  Financial Services Committee chair,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…them for their service to our community, and I look forward  to the positive impact this facility will have on countless patients,  families, and first responders in the years to come.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695126/recognizing-jps-health-network-for-the-opening-of-a-new-psychiatric-emergency-center"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Lesa, and The Remedy  Church congregation on their fifth anniversary. May they continue to  grow, serve, and be a blessing to both our community and the Lord and  Savior for years to come.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…resilience, and, yes, optimism. While the curtain is closing on  this act of Maggie's brilliant career, I know her theatrical artistry  will continue to inspire our community for years to come.\n\nBravo, Maggie, bravo. Congratulations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…today if I did not  have my own Ms. Crankfield.\n\nMr. Speaker, closing disparities and exposing more students to new  ideas and opportunities sets them up for success in the years to come  and perhaps even a seat in this very Chamber.\n\nCongratulations to Ms. Crankfield.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697970/national-school-counselor-of-the-year-danielle-crankfield"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…repackaged some of their old ideas, and they are hoping the  American people won't notice that it is not going to help. Instead, we  should extend the tax credits for 3 years and come together.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…and printed bilingual period  information resources. These resources are being shared throughout West  Michigan, which will have a positive impact on our community for years  to come.\n\nOn behalf of Michigan's 3rd Congressional District, I congratulate  Adelyn Kim for achieving the highest distinction in Girl Scouts, the  Gold Award. I thank Adelyn for…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Across alpine skiing, cross-country skiing, and freestyle  disciplines, Vermont athletes competed at the highest level and  delivered performances that will be remembered for years to come. These  achievements did not happen overnight. They are the result of years of  rigorous training, personal sacrifice, and an unrelenting commitment to  excellence--supported…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700207/recognizing-vermont-olympians-and-medal-winners"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…farming in Illinois  unprofitable--not just by making the fertilizer, seeds, machinery, and  equipment more expensive but also by wrecking export markets like China  for years to come.\n\nI have met with these farmers throughout my congressional career.  They are proud, hard-working people. They are the backbone of so many  communities across our State.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…this morning. By every  single forecast, by every measure, Donald Trump's self-defeating  tariffs are actively making Americans poorer, and they are doing it now  and for years to come.\n\nEconomic growth, gone. Inflation, rising. Unemployment projections,  up again.\n\nExperts estimate Trump's tariffs will cost average families about  $4,000 a year. Many…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…successfully maintained its parks and facilities through  many challenges. They continue to provide exceptional recreation  experiences and will continue to do so for many years to come.\n\nI ask that my colleagues join me in recognizing this day as the  Carmichael Recreation and Park District's 80th Anniversary and thank  them for their dedication to their…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spooky decorations, he poured his heart into  making those weekends memorable. They became traditions that his kids,  grandkids, and now great-grandkids will carry on for years to come.\n\nBeyond all the arrests, titles, and awards, Rex was wise. He told the  best stories, made everyone laugh until they cried, always showed up  when he was needed most,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…is history. What we choose to  speak up for and speak out against defines us, and it will be the  legacy that we leave for every governing body that holds this space for  years to come.\n\nMr. MORELLE. Madam Speaker, I yield myself the balance of my time to  close.\n\nMadam Speaker, I think for all the reasons that have been described,  this is an important…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…her community a better place. Granite staters  are grateful that our brave veterans may receive care from  professionals like Janette, and I wish her all the best in the years to  come.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…thank you to Dr. Forman and John Adams Academy for  providing this tremendous recognition. I look forward to seeing the  award promote this idea of servant leadership in the years to come.\n\nCongratulations to Mark and Marcus Haney on being the inaugural  recipients.                             Secure Rural Schools\n\nMr. KILEY of California. Mr. Speaker, today…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…daughter Dr. Esther Bailey Smith keeps the Decatur  Telephone Company  tradition of service alive. Her dedication to the family legacy ensures  continued service for many years to come. I am proud to represent  Decatur Telephone Company in my Congressional District.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696702/recognizing-the-decatur-telephone-company"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…difference. Her work has inspired many to take an  active role in preserving the town's history and engaging in  volunteerism, creating a ripple effect that will be felt for years to  come. Andrea Read's tireless efforts in historic preservation, her  unwavering dedication to volunteerism, and her commitment to community  service make her a truly deserving…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…aspiring athletes everywhere.\n\nI applaud the SLCC Cross Country Program for their extraordinary  accomplishments, and I look forward to seeing their continued success  in the years to come. Their hard work, resilience, and sportsmanship  embody the best of what it means to be a Bruin.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…making a  difference.\n\nMr. Speaker, I thank Chief Kimball for his dedication to the people  of Bettendorf and for setting an example that will inspire future  officers for years to come.\n\nI congratulate Chief Kimball on his retirement. He has earned it.                   Recognizing National Small Business Week\n\nMrs. MILLER-MEEKS. Mr. Speaker, this National…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…celebrate more than a milestone. We celebrate that ray of  light that is never dimmed. May BEAM continue to shine, lighting the  path forward for those who need it most for years to come.                 Honoring the Life of Carrol Eugene Franklin\n\nMr. BEAN of Florida. Mr. Speaker, today I rise with a heavy heart but  a grateful spirit to honor the life…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…past Trustee. He lives the  Catholic Christian life of servitude. I am proud of Tom's lifelong  contributions to our community, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Tom with the Patriot Award for his  exceptional service to the people of North Texas.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…will borrow approximately--I am  conflating publicly sold debt with the debt we would create in the next  10 years. What took us 240 years to build, we will double in 10 years,  or come close to doubling in 10 years.\n\nDoes this body, the lobbyists in the hallways, the groups in the  hallways demanding more spending, or any of the staffers who might not…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, by passing this commonsense legislation,  the House will ensure that we can continue conserving vital waterfowl  habitats for years to come.\n\nThis is important for sportsmen and -women who depend on healthy  wetland habitats for hunting, fishing, and other forms of wildlife- centered recreation. H.R. 2316 is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…worked under both Democratic leadership  with Ms. Waters and Republican leadership to research this, talk about  it, think about it, and have hearings about it for over 5 years now. We  come to the House floor today with a bill before us that, while not  perfect, is a good bill, as has been evidenced by our speakers on the  floor.\n\nS. 1582, the GENIUS Act,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Hill to better  understand and assist their mission. His work has ensured that Hill  will continue to be a successful and important contributor to our  national defense for years to come.\n\nI am proud to recognize Steve's strong example of service, and I  congratulate him for this will-earned award. I thank him for his  support of Hill Air Force Base and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Auditorium.\n\nGracyn said that it was an honor to win this contest and represent an  industry that she loves and that she will strive to make a meaningful  impact on for years to come.\n\nGracyn Stevens says she appreciates the lessons that she learned  growing up showing cattle in 4-H. The cattle industry taught her that  true success is about the effort…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697999/congratulating-gracyn-stevens"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…their significant contributions in our community  and am confident that the legacy of service they have built over these  past 100 years will only continue to grow in the years to come. Their  efforts have made a lasting and meaningful impact in the city of  Lincoln and the surrounding region, contributing towards the quality of  life and well-being in…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…deepest congratulations to the  Westfield Fire Department on this milestone anniversary and look  forward to their continued growth and commitment to public safety for  many years to come.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692630/recognizing-the-westfield-fire-department-on-their-150th-anniversary"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…West Amwell Volunteer Fire Department celebrates 75 years of  distinguished service, I look forward to seeing their continued growth  and commitment to public safety for years to come.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690621/recognizing-the-west-amwell-volunteer-fire-department-on-their-75th-anniversary"}]