[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…front of the  January 6th Committee, including Michael Fanone, Officer Harry Dunn,  Police Sergeant Aquilino Gonell, and Officer Daniel Hodges.\n\nIt has been more than 2 years, Mr. Speaker--take a look at this  plaque--that the other side has failed to properly honor police  officers. Yet, they stand here and want to dictate to us how supportive  they are…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691171/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…dad who was killed by an ICE agent in Los Angeles. This bill  is also for Nenko Gantchev from Chicago, who died in ICE custody after  living in the United States for 30 years.\n\nMr. Speaker, this bill is for every person in America, citizen or  not, to know that when ICE agents break the law, they should be held  accountable. For the families of these victims,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698890/end-qualified-immunity-for-ice-agents"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…continue conducting the  critical research that ensures future generations can enjoy the same  beauty, biodiversity, and economic opportunities for our Great Lakes  for many years.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this  legislation.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Speaker, you can ignore someone who  says that those tools are for hammering nails.\n\nCrypto has been around since 2009. Watch how people used crypto over  the last 16 years, Mr. Speaker. You can ignore anyone who says that  this is a tool for legitimate finance. That is because the tool is  overwhelmingly used for crime.\n\nThe Russians use crypto to evade…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…those with the least. It is all so the rich can  get richer. I just find that awful. I find that awful. We don't share  the same values if you embrace this budget.\n\nYears from now, Mr. Speaker, when we are all gone, we won't be judged  by the size of our bank accounts. We won't be judged by how many tax  breaks we gave to billionaires. We will be judged…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, I rise today to recognize Chair Jerome  Powell, who has served with honor and integrity on the Federal  Reserve's Board of Governors for 13 years.\n\nMr. Speaker, I rise and join Democrats, Republicans, and other  leaders because the Justice Department's criminal investigation into  Chair Powell is yet another attempt by Trump…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699024/recognizing-jerome-powell"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the United Black Clergy of Westchester County. He has done  all of this with his wife, Aro Denise Edwers, as his life partner, and  all of this was done in a mere 65 years.\n\nMr. Speaker, I wish a happy birthday to Bishop Edwers from the floor  of the House of Representatives.                        Recognizing Shoreline Publishing\n\nMr. LATIMER. Mr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…do they spend that money? They spend that money right back in  Illinois' Sixth District. Yet Congress hasn't done anything to enhance  or extend the program in over 50 years.\n\nMr. Speaker, we are long overdue for a vote. We have got a plan that  both expands Social Security across the board, makes sure that people  who continue to work don't pay taxes…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…volunteer.\n\nHe is also a steward of Batavia's legacy. As the third-generation  owner of Hubbard's Home Furnishings, his family's business served the  community for over 100 years.\n\nMr. Speaker, I am proud to represent such an extraordinary citizen of  Batavia, Illinois, who exemplifies what it means to be a good neighbor  and a true public servant. I ask my…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…going by the wayside. Of course, my friends at the UAW  reminded me that too many plants have shuttered this century. In the  year 2025, when you look at the last 25 years, Mr. Speaker, too many  plants have shuttered. It is really quite outrageous, Mr. Speaker, to  hold up this article from The Detroit News that was written on April 4  of this year,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…they want you to have to hire a lawyer or to sue the  Federal Government to get your own money back. Donald Trump himself  said that you may have to litigate this for 5 years. Mr. Speaker, 5  years? That is not relief. That is a bureaucratic maze. It is a rigged  system designed to exhaust you, to outlast you, and to ensure that the  little guy never sees…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Montelena.\n\nIn his civilian career, Colonel Dinh continues to serve honorably,  keeping our communities safe as an Orange County deputy sheriff, where  he has served for 27 years.\n\nMr. Speaker, I appreciate his commitment to service not only for  Orange County but for his country.                      Concerns About ICE Raid in Georgia\n\nMr. MIN. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…infrastructure by way of the U.S. Virgin  Islands.\n\nThis bill is an important step to enhance American communications  security and competitiveness around the world.\n\nIn recent years, Mr. Speaker, the United States and many allies have  recognized the threat posed by untrusted Chinese telecommunications  equipment to our national security. Thanks to the work of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…bench. We cannot afford to lose these judges at the very  moment that bankruptcy filings are rising everywhere, up 30 percent in  our State alone over the last couple of years.\n\nMr. Speaker, I strongly support this bill to increase the access and  opportunity provided to all Americans under the bankruptcy system. I  ask all of our colleagues to read it…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Republicans aren't putting any  proposals forward, but they would deny a hearing on Social Security and  a vote on a measure that Congress hasn't addressed in more than 50  years.\n\nMr. Speaker, as you know, there are more than 70-plus million Social  Security recipients. Ten million baby boomers a day become eligible for  Social Security and wonder why Congress…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…protecting natural gas appliances,  keeping prices affordable, and undoing the damage inflicted on the  American people by the Biden-Harris administration for the past 4  years.\n\nMr. Speaker, I urge my colleagues to vote ``yes.''", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Trump's feet,  including what he is doing every single day as well as DOGE and how  they are trying to fix the crisis and the mess that was left behind by  the Biden years.\n\nMr. Speaker, the American people have time and again responded to  Democratic hair-pulling with, at best, disinterest. Yet, here we are  today on the House floor with more of the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Florida. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, is it true President Trump has done more in 100 days  than the previous President has done in 4 years?\n\nMr. Speaker, I have only got 60 seconds, but let's break it all down:  border closed; mass deportation of illegal immigrants; fentanyl  smuggling dropping; Laken Riley Act signed…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…accountable government.\n\nThis bill itself is a recommendation from the National Taxpayer  Advocate Purple Book and has been a recommended policy change for quite  a few years.\n\nMr. Speaker, I thank Chairman Smith, again, for working with me to  make the IRS run smoother and to ensure taxpayers are being treated  fairly.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…statesman  leader he was and how he was the right person to work with Tip O'Neill  and our Democratic colleagues to do something really big that hasn't  been done in 40-plus years.\n\nMr. Speaker, I thank Mr. Moore for the opportunity to address our  colleagues. I thank him for his leadership, his Conference leadership  and on the Budget Committee and the Ways…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Undersecretary of Commerce to reflect the important role that NTIA  plays. It eliminates unnecessary reports, codifies two critical  offices, and authorizes NTIA for 2 years.\n\nMr. Speaker, I urge my colleagues to support H.R. 2482, and I reserve  the balance of my time.\n\nMr. BILIRAKIS. Mr. Speaker, I thank Chairman Latta and Ranking Member  Matsui for…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…American  travel destinations. More than 17 million people visited last year.  That is in large part because of the influence of the Grand Ole Opry  over the last 100 years.\n\nMr. Speaker, any seat in the house will do at the Grand Ole Opry to  bear witness to the iconic barn background behind the stage. The lights  that look like stars above you and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…beneficial mergers from occurring. Community and  regional banks, as well as their customers, should not have to fear  that the rules will change dramatically in a few years.\n\nMr. Speaker, I can already anticipate the argument from my good  friend from California. I know what she is going to say here in just a  few minutes. She is going to say: Look at…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…was the first several  months of the year. I hope that we, as Republicans, get back to  exposing where the American tax dollars have been wasted over the last  several years.\n\nMr. Speaker, I encourage people to vote for this minor cut, but a  minor cut is better than no cut.\n\nMr. HARRIS of North Carolina. Mr. Speaker, if this $9 billion House  rescissions…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…future comes through my jail. I advised them to take that  time in that jail to reflect upon their life and the potential that  they have to turn themselves around.\n\nYears later, Mr. Speaker, I have had these same guys come to me, who  are now free, and say thank you. Thank you for talking to me the way  you did and handling me the way you did and making…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…this mean, really? It means civil penalties of up to  $250,000 and criminal penalties, including a fine of up to $1 million  and imprisonment for not more than 20 years or both.\n\nMr. Speaker, we are serious about sanctioning this egregious human  rights abuse.\n\nSanctions also include blocking and prohibiting all transactions in  property and interests…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…American  travel destinations. More than 17 million people visited last year.  That is in large part because of the influence of the Grand Ole Opry  over the last 100 years.\n\nMr. Speaker, any seat in the house will do at the Grand Ole Opry. To  beat witness to the iconic barn background behind the stage, the lights  that look like stars above you, and…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…year by year and $37 trillion in debt  overall.\n\nThis is common sense, and the President has finally stood up for  those people who have been left behind the last 4 years.\n\nSo, Mr. Speaker, I thank Congressman Knott very much for taking on  this real issue. It is the kind of discussion we need to have. If the  other side feels that we have not been telling…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…revolution and advanced manufacturing. The RMP  amendment locked up an astonishing 48 billion short tons of coal. That  is enough to meet U.S. coal demand for the next 116 years.\n\nMr. Speaker, 92 percent of Wyoming's coal is exported to other  States, helping keep the lights on and utility prices affordable in  distant places as far as Texas, Illinois, and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…illustrating a clear need for an extension.\n\nH.R. 410 would provide this relief by extending the Alaska Native  Vietnam era veterans land allotment program for an additional 5 years.\n\nMr. Speaker, I thank Representative Begich for sponsoring this  legislation, for his hard work on behalf of Alaska Native veterans, and  for ensuring that we keep our promises to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}]