[{"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…public  service as a parks commissioner, as a city councilmember, and as mayor  of Tacoma.\n\nI congratulate Victoria on an exemplary and distinguished career of  more than 15 years serving the people of Tacoma. Under her leadership,  the city launched the Equity and Empowerment Initiative, which led to  the creation of our Office of Equity and Human Rights.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…service.\n\nThroughout her time in the legislature, Representative Bird has  worked tirelessly to fight for all individuals. She served on the Joint  Budget Committee for 6 years, serving as vice chair and later  chairwoman, ensuring that corporate loopholes were closed while still  protecting small businesses. Representative Bird has been a champion  for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…and everyone at KYCC  who makes this work possible every single day.\n\nI am proud to congratulate KYCC on 50 years of impact and service,  and I look forward to 50 more years of them serving, lifting up, and  strengthening our community.", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698473/recognizing-the-50th-anniversary-of-the-koreatown-youth-and-community-center"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…duty. Upon graduating from Seattle  University, Bill pursued a career as an accountant at Boeing and then  as a life and health insurance broker, where he spent over 50 years  serving numerous clients in the Seattle Chinese community. He displayed  exemplary work ethic and was widely known for his willingness to help  others.\n\nOutside of his career,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…VEASEY. Mr. Speaker, I honor the Army & Air Force Exchange  Service, the Department of Defense's largest retailer, as the  organization reaches a tremendous milestone, 130 years of serving the  military community.\n\nSince July 25, 1895, the Exchange has lived out its motto of ``We Go  Where You Go,'' providing the best tastes of home to Soldiers, Airmen…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…time, mass firings are stripping thousands of dedicated  Federal workers of their livelihoods. They are Americans--parents,  veterans, and public servants--who have spent years serving their  communities.\n\nMore than 2,400 employees have been dismissed from the Department of  Veterans Affairs, undermining care for those who have served our  country.\n\nThe…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…percent.\n\nMelanie Panarese, an English teacher at Lodi High School, brings the  same commitment to her classroom every single day. With two decades in  the profession and 7 years serving Lodi students, Melanie's lessons  encourage critical thinking and creativity.\n\nShe also pioneered an academic yearbook course allowing students to  design, write, and produce…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "Ms. SCHAKOWSKY. Mr. Speaker, I rise today to recognize Kathryn  Angell, a dedicated public servant who has spent years serving the  residents of Illinois' 9th Congressional District with skill,  compassion, and professionalism.\n\nKathryn has been a member of my staff since January 2022, after  having…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…upon, and my staff  and I took every possible opportunity to work with him and his team.\n\nMayor Van Dusen has dedicated 52 years of his life to public  service--41 of those years serving as an elected official with the  Village of Skokie. Mayor Van Dusen has been a proud Skokie resident  since 1974, and it comes as no surprise that his engagement in the…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688871/recognizing-the-career-of-skokie-mayor-george-van-dusen"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…resources they need and the training they need to  keep Long Islanders safe.\n\nI am proud to stand alongside Nassau County Police Department and  congratulate them on 100 years of serving our community.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690168/congratulating-nassau-county-police-departments-100-year-anniversary"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Speaker, I rise today to recognize the  career of Doug Kennedy, who is retiring after 45 years of serving  southeast Nebraska as a radio broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station ownerships.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Doreen Neilson, who has devoted  60 years to serving the Town of Pendleton and the Wendelville Fire  Company Ladies Auxiliary. Over the course of her long and distinguished  career, Doreen has held numerous leadership and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699525/recognizing-doreen-neilson"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…support, connecting those in need with emergency responders. Mary's  colleagues praised her ability to remain calm despite the severity and  stress of the job.\n\nAfter 43 years of serving the people, some of them on the worst day  of their lives, and being a lifeline to those in the field, I  congratulate Mary on a well-deserved retirement. I wish her the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Alongside Patricia, his wife of 51 years and a State Committeewoman,  Mr. Ellis has shown an unwavering commitment to doing what is best for  his community\n\nDuring his 25 years serving as Chairman of the Smithtown Republican  Committee, Mr. Ellis has utilized his vast institutional knowledge and  experience to lead the party to unprecedented levels of…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Shawn Christman, who has  devoted 25 years to serving the Town of Pendleton and the Wendelville  Volunteer Fire Company. Over the course of his career, Shawn has served  as President and two-time Chief, holding many officer…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699581/recognizing-shawn-christman"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the Southern District of Georgia, who is  retiring this June.\n\nMarshal Lyons previously served as chief of police in Garden City,  Georgia, a position he held for 16 years. While serving as Garden City  police chief, Marshal Lyons was appointed to the Criminal Justice  Coordinating Council and was elected to the Executive Board of the  Georgia Association…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…I am confident that Kansans will still seek her advice  and consultation, or at least they will if they know what is best for  them.\n\nMr. Speaker, I thank Debbie for 8 years of serving as my district  director. More than that, I thank her for her decades of friendship.  She has watched  my kids grow up and been part of my family. Her presence will be…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the  birthday of Wilbert D. Payne, Jr. Mr. Payne turned 75 on July 13th.\n\nMr. Payne was born on July 13, 1950, and has devoted almost 50 years  to serving his community and country, becoming a historic figure in the  City of Opelika and a respected voice among Alabama veterans and civic  leaders. In 2016, he made history…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…support of this bill, which would rename a  post office in Rockford, Illinois, for Jay P. Larson.\n\nMr. Larson worked as a letter carrier for the U.S. Postal Service for  25 years. Serving with enthusiasm and commitment, known for his joy and  warmheartedness, Jay Larson was tragically killed in a mass stabbing  spree in March 2024 while delivering the mail.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Company, where he has served ever since.\n\nThroughout his 40 years with the Yardley-Makefield Fire Company, he  has stepped into a variety of roles--most significantly his 29 years  serving as President of the Fire Company. His leadership has helped  shape the growth of the department to ensure it remains prepared and  stays connected to the community it serves.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Rockdale  Flying Tigers Flight Club, Danny is an EAA member and works with the  Young Eagles Flight Program giving introductory flights. He has been an  instructor pilot for years, serving as a technical, emotional, and  mental mentor to many students who have made piloting their career.\n\nIt is with great honor and respect that I present Danny Charles Masur…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…age of 18 as a dispatcher, Sheriff Foster developed  strong ties to those he worked with early in his career and earned high  marks from his community.\n\nAfter more than 30 years serving the Sheriff's Office, Mr. Foster ran  for Wythe County Sheriff in 2021. Given community support of his law  enforcement experience and credentials, it was no surprise that…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694755/recognizing-the-dedicated-service-and-leadership-of-sheriff-charles-foster-of-wythe-county-virginia"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Commendation. His persistent efforts  in fostering beliefs of sacrifice and respect reflect his value as a  leader during service and in retirement.\n\nSFC Macleod devoted 27 years serving in the United States Army,  serving in several key leadership roles including Operations Non- Commissioned Officer in Charge (NCOIC), Platoon Sergeant, First  Sergeant,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Randy Moje, who has devoted 50  years to serving the Town of Pendleton and the Wendelville Volunteer  Fire Company. A second-generation firefighter, Randy has held numerous  leadership positions, including Chief, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize Brian Buhr, one  of my former professors at the University of Minnesota, who is stepping  down after 13 years of serving as the dean of the College of Food,  Agricultural and Natural Resource Sciences and the director of the  Minnesota Agriculture Experiment Station.\n\nAs our State's premier…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}]