[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…$270 in tax cuts. Putting this another way, for every  dollar they are giving to the average working person, they are handing  $288 to a person making over $1 million every year.\n\nLet me be clear about that statistic. I am not talking about a  millionaire, not someone who is sitting on a house and a 401(k) that  they have worked for and saved for for 30…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…already.\n\nNext week, we will celebrate the Fourth of July, a day when we  reflect with pride on the Nation that we have always been and the  values that we stand for. This year, let's reflect on those values of  charity and leadership, those values that have, under Democratic and  Republican administrations, guided our foreign policy.\n\nHere is the thing:…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…honoring the history my forefathers and foremothers endured.  Let's not forget, the White House and this country were built by  enslaved labor. As we commemorate Juneteenth this year, let it be a  call to action. The struggle for freedom will not end here. I am  committed to protecting the truth of our past, fighting for justice in  our present, and building…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…country, there are over 53 million Americans who currently  provide uncompensated care for their families, which provides an  estimated $600 billion in uncompensated care each year. Let that sink  in.\n\nBy protecting the health of caregivers, respite care decreases the  need for professional long-term care and allows individuals who require  care to remain…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…some of  my colleagues: It is too complicated; there are competing bills; the  legislative text is complex.\n\nThis is very simple. Just ban it. Not 5 years from now, not next  year. Let's just put a bill on the floor to ban it, period. Members of  Congress will no longer be able to trade stocks, simple as that.\n\nI hope, Mr. Speaker, that my colleagues will…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691220/stock-trading-ban-for-members-of-congress"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the company that  operates the Truth Social media platform, announced that it had filed  paperwork with the SEC to approach to launch the crypto blue chip ETF  later this year.\n\nNow, let's add all of this up.\n\nSince January of this year, President Trump and his family have  launched or are planning to launch six different crypto ventures.  Congressional…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…now, here we are. What is the  path forward?\n\nSenator Schumer back during the government shutdown at the end of it  said: Tell you what. Why don't we just extend it for a year. Let's put  a task force together to try and work out the differences because I  understand the Republicans don't agree with everything. Let's take a  year and extend it and try…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…buddies--buddies  who contributed to Trump's campaign and have gotten paid out big time  in return, with more than $4 billion in brandnew handouts from the  government this year alone.\n\nLet's call Trump's energy agenda what it really is: oil above all,  not all of the above.\n\nTrump's energy agenda is killing American energy, especially the most  affordable…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…that cause dreaded diseases because we don't care for  ourselves.\n\nDuring the month of June, let us highlight men's health, but let us  talk about men's health 365 days a year. Let us bring resources to bear  to make sure that we are preventive, that we are careful, that we are  taking care of ourselves, and that we are looking out for each other.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…State of Massachusetts, who are paying lower premiums and  copays due to these tax credits, which Democrats created in 2021 and  which are set to expire at the end of the year.\n\nLet me read you some of the stories from folks in my district: I just  received my letter, and my monthly costs have gone from $1,287 to  $3,026 for next year. As a working family…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…interviews  paused and their citizenship ceremonies canceled. Now, these decisions  build on a travel ban that was put in place by the administration  earlier in the year--or last year.\n\nLet me be crystal clear. At least in my mind, these bans are not  about your safety or mine. These bans are about limiting access to the  American dream to a select few…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…complete halt.\n\nThe Connecticut Department of Energy and Environmental Protection has  found that canceling Revolution Wind would cost taxpayers half a  billion dollars a year. Let's be clear--half a billion dollars a year  to Connecticut and Rhode Island ratepayers every year.\n\nThe project has a 20-year contract at 9 cents per kilowatt an hour-- less…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Americans are going to  be paying 10 times what we paid last year. And with Japan, President  Trump agreed to a 15-percent tax. That is also 10 times what we were  paying last year.\n\nSo let's don't pretend that these are some big wins. The President  can announce that, but they are only a slight improvement on a crisis  that the President created himself.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…That is what the models show. That is what we know.\n\nLook here. These are the projections of the way things will be if we  do nothing.\n\nThe blue line, we do nothing this year. We let the tax cuts expire,  taxes go up--let me repeat, I am against that--taxes go up, revenues  are projected to do what they do, and we will have the amount of debt  over the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…WIC is funded, whether SNAP is funded,  whether workers are funded, whether the military is funded; since we  are going to fight over who is going to win the election a year from  now, let's excuse the people who are not responsible for this  dysfunction from our dysfunction.\n\nThat is what Senator Johnson is trying to do.\n\nNow, we all agree, Democrats…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the  tax cuts in this resolution are people making less than $400,000 a  year. Democrats campaigned on not allowing taxes to increase on people  making less than $400,000 a year. Let us see if their voting cards show  up. Extending the Trump tax cuts will give the lowest income families a  tax cut of 15 percent, the highest of any income group.\n\nOn the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…disclose I have had a stunning amount of coffee  today, so forgive me if I am a bit cranky.\n\nWe were trying to do projections of what our interest coverage would  be this year. Let's see if I can make this make sense.\n\nHow many of you saw on Thursday or Friday that the Federal Reserve  actually lowered economic growth for this year and, functionally,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…They invade the United States of America with boats loaded with this  poison. It is distributed around the United States, and it kills tens  of thousands of people every year.\n\nNow, let's assume that these terrorists, instead of using the drugs,  were using explosives. If they loaded up one of these boats with  explosives and it was headed for the United…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…everyone has listened to my dozens and dozens of speeches  walking through what expensing is. Expensing is nothing more than  depreciation. Do you take the expense in 1 year or, let's pretend, 7  years? You still get the exact same amount of reduction on your taxes.  It is a timing effect. The difference is if you can't take it in the  first year and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…This is more than running. It is physical activity, academic support,  community connection, and character development all in one.\n\nMr. Speaker, as we begin a new school year, let us recognize the  power of programs like Active4Youth to change lives.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}]