[{"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…education and for the future of  millions of children.\n\nAs an occupational therapist myself, I have worked with children with  developmental disabilities in their earliest years, and I have seen  what happens when we make good on our promise to invest in special  education and early intervention. Early intervention care alters the  course of a child's life…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…tax credits are  overwhelmingly supported by Americans. Why? Because this is about their  families. This is about the fact that they know that healthcare--over  the years, they have seen the prices and what has happened with  pharmaceuticals, and they expect us to do better than what is happening  now. They expect us to do better than putting forward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…bending over backwards to keep these  files hidden.\n\nWe know that Epstein was at Trump's wedding. We know that Epstein  once called Trump his ``closest friend for 10 years.'' And we have seen  that Trump wrote Epstein a birthday card and said:\n\n``Happy Birthday--and may every day be another wonderful secret.''\n\nAnd the real kicker, we learned yesterday…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…No, they won't.\n\nWhat we are witnessing is one of the most astounding displays of  cowardice in the modern history of Congress. It is truly a spectacle.  In all my years, I have never seen a group of Members so deeply afraid  of just doing their job.\n\nThe American people sent us here to address their affordability  concerns. I had to say to one member…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…pay-to-play, where environmental regulations that keep us safe and  healthy are slashed, where corporate mergers are rubberstamped by  Federal regulators.\n\nFor 16 years now, we have seen the slow, cancerous corruption of  American democracy. We have seen how folks who pay the price get  outsized influence, that a small group of billionaires and corporations…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…do not provide medical care, though they imply that they do. Crisis  pregnancy centers are unregulated, deceptive, and dangerous.\n\nAs an OB/GYN myself for more than 20 years, I have seen far too many  patients who have had, at best, confusing and, at worst, life- threatening experiences at crisis pregnancy centers. They don't serve  patients. They serve…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…lives were cut short by hate, and  it continues to be a tragedy that these incidents continue to occur in  the United States and all over the world.\n\nOver the last few years alone, we have seen anti-Semitic hate and  extremist violence. It has done nothing but increase across this  country. All over America, Jewish people, we have been threatened,  beaten,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support my bill, H.R. 1998, Sanction Sea  Pirates Act. Over the last few years, we have seen and also been  reminded how fragile global supply chains can be and how the closing of  narrow physical chokepoints can lead to shortages and inflation. More  than 30…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…luck. As long as countries possess  massive arsenals of world-destroying weapons, the risk of  miscalculation and the risk of escalation is eternal.\n\nIn the last few years, we have seen multiple situations that remind  us of the extent of this fragility and of the danger. Nuclear-armed  India exchanged fire with nuclear-armed Pakistan just this year.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…hostages.  They couldn't include one reference to the organization that was  targeted? One?\n\nI have served in this body, as I mentioned previously, Mr. Speaker,  for 6\\1/2\\ years, and I have seen a lot of partisan debate unfold on  this floor, but I think it is disgraceful to not give my community an  opportunity to see our resolution considered on this floor.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…are  here on the floor of the Senate as the hours tick down to the end of  the Federal fiscal year and the shutdown of the Federal Government.\n\nI have served here 15 years. I have seen my share of shutdowns, and I  know how much they hurt, how much they hurt the men and women of our  military, Federal law enforcement, folks who serve and protect our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…place and have put these requests in place, don't care  about return. That isn't their goal. Their goal is social change.\n\nWhat we have seen, Mr. Speaker, is over the years we have seen time  and time again the cudgel of government and the cudgel of regulators  being used to pound business and investment into what they think is the  right place. What…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…the press. He takes questions. He  illuminates what he is working on and why he is pushing different  policies.\n\nThis is what is called open government. For the last 4 years, we have  seen behind-the-scenes maneuvering. Now, we see open government and not  just in talk but in action.\n\nI know there has been some criticism of DOGE, and nothing is ever  perfect.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…promoting new sustainable  fuels, right down to real-time advice to a pilot at a distant Signature  Aviation base on how to unsnag a challenge clearing customs.\n\nFor so many years, we have seen Mary on the bustling ramps at Super  Bowls, Oshkosh, Tarkio, presidential inaugurations, and other major  general aviation events. However, from my conversations with…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in the driver's seat to attentively monitor emerging threats and allow  the Department to utilize their existing authorities to address  vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and  bottlenecks for key grid components, such as distribution transformers  and natural gas turbines, can stifle infrastructure development.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the Understanding  Cybersecurity of Mobile Networks Act, led by the gentlewoman from  Florida's Third District and the gentleman from Ohio's First District.\n\nIn recent years, we have seen a rise in large-scale cybersecurity  attacks that put Americans at risk. Attacks like the Salt Typhoon have  directly impacted the communications of public officials,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…we saw as we looked at the data was that  last year's total of 1,170 was still 62 percent higher than the number  in 2019. So as we have looked at this in recent years, what you have  seen is an explosion of human trafficking and sex trafficking in this  country. While we know that human trafficking has been a problem over a  period of time, the concern…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the SAVE Act will provide States with  cost-free access to existing Federal and State databases so they can  perform this important voter list maintenance.\n\nIn recent years we have seen an increasing number of jurisdictions  across the country allowing noncitizens to vote in municipal elections.  Right here in our Nation's Capital, noncitizens are eligible…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…is going to be several Federal Agencies that are going into  Memphis. Now, the reason for this is that Memphis has had the highest  crime rate in the country. And for years, we have seen Democrats that  have enacted soft-on-crime policies, and this has taken, truly, a  tragic toll on Memphis. In many parts of the city, Memphians cannot  walk outside…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…utilities have historically undergone extensive planning processes to  methodically deploy ratepayer dollars to build requisite  infrastructure.\n\nUnfortunately, in recent years, we have seen States move away from an  integrated resource planning process centered on reliability and  affordability toward one intended to achieve climate and environmental  justice…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…images online surged to 104  million. Think about that--104 million reported sexually abusive  images. That is up from merely 450,000 as early as 2004. In the space  of 20 years, we have seen an explosion of sexual abuse material online.\n\nThe data does not lie. Our children are not safe. But I also know it  because whistleblowers tell us. The experts from…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}]