[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…engage in trade are small businesses, and those small businesses  represent one-third of all trade that our country engages in.\n\nThey are not big companies. They can't buy a year or 2 years'  inventory in advance. They live week to week. They live month to month.  And that is pretty much where they have been since April. They have  been trying to survive.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…for considering this  bill, the Great Lakes Fishery Research Reauthorization Act.\n\nThis bill would reauthorize critical Great Lakes research programs at  $15 million per year for 5 years. I thank my colleague, Representative  Huizenga, for his partnership on this bill in the House.\n\nProtecting and restoring our Great Lakes has long been a bipartisan  priority.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…This was a Republican President.\n\nIt is not a program for just one year. A year's plan in       this field is no plan at all. This is a time to look ahead       not a year, but 5 years or 10 years--whatever time is       required to do the job.      I shall propose to this Congress a $10 billion nationwide       clean waters program to put modern municipal…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…discharge petition or whether it is one of the bills on the  floor of the Senate, we have 22 days to act. We have 22 days to at  least say we will make sure that for the next year or 2 years or  however many we can, until this magical concept of a plan appears for  us to vote on, we will help them a little bit to at least pay for their  health insurance right…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…at me in terror and  run out of the room.\n\nThe political consultants care more about the power of the politics  than the fact that in 7 years, Medicare is $2 trillion a year. In 7  years, the Medicare trust fund is empty. In 7 years, the Social  Security trust fund is empty.\n\nIn the first full year, if we want to backfill that shortfall on  Social Security,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…That is an average of well over 250 deaths per day.\n\nImagine the worst mass shooting we have ever had and multiply that  times five times a day for every day during the year for 3 years  running. That is what we are dealing with. That is the emergency we  have. That is an emergency.\n\nThis opioid crisis is fundamentally different from any past drug  epidemic.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sisters? What would the effect be on  labor force participation, family formation, and all the other crazy  things we have seen in this data? What would it look like 1 year from  now, 2 years from now, or 3 years from now?\n\nThat is actually the thought experiment. Do we want to hand $33  billion of subsidies to insurance companies, or do we want to affect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Zoe to represent the Hudson Valley at the  Naval Academy in this year's newest class. With more than 2,000 career  points, Zoe has been named Daily Freeman Player of the Year 3 years in  a row, a record for the award.\n\nThis year, Zoe was also named Player of the Year by the New York  Basketball Coaches Association and was selected as a top player in…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…went up \\1/2\\ percent, that 1 year costs $206 billion  over 10 years. It is basically a table that says that if interest rates  pop up this much, and it only lasts for 1 year or 2 years, here is what  it will cost us over the 10-year window.\n\nThe whole point of this chart is to start to demonstrate so many of  the things we talked about here. We are going…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…good jobs; a lot of  them already have their own businesses--as they are sworn in as  American citizens.\n\nWhen you take it in 3-year increments--there is always one year or  other years as an outlier. If you look at it in 3-year increments, that  850,000 over the last 3 years is the most that we have taken in, as far  as I can tell, in this country's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…survive. We have  economists on the left and the right saying that if we can get to about  3 percent of borrowing of GDP, we can stabilize. We are borrowing 7.3  percent this year. In 9 years, we are borrowing 9 percent of the entire  economy.\n\nUnderstand what this means. That would be reduced spending this year.  We are going to spend--what?--$7.3 trillion…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…offers connection,  dignity, and a true sense of community.\n\nAt the heart of the community is the director, Lora Benzinger, who  has led the pantry for a little over a year after years and years of  service. Drawing on her background in social services, she has made it  her mission to ensure the pantry nourishes not only families' tables  but also a sense…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}]