[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…favorite hiking trails and biking routes,  ATV trails, and fishing streams are in these protected roadless areas.\n\nWhen the Nation debated the merits of the roadless rule 24 years ago,  the Forest Service held 600 public meetings around the country. These  were attended by tens of thousands of Americans. I should know, I  attended one of them. The Forest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Derry, NH, that may have to go out  of business due to what President Trump is proposing on tariffs on  Canada.\n\nThe owner of Chatila's Bakery moved to the United States 36 years  ago. He was a cardiologist and his brother a Ph.D. scientist. They are  from Lebanon. He became a citizen, raised his family, and sent his  daughter to college. He and his brother…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…vision of a mobility future. It is no surprise for me  to share in this House Chamber what we have heard from the chief  executive officer of General Motors, Mary Barra, that 6 years ago she  wanted to see a fully zero emission General Motors. I was surprised to  hear the vision in some respects but also I wanted to recognize that  she had a vision.\n\nShe…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…we would support the  motion to recommit. It would give us an opportunity to vote on an  increase in the minimum wage which hasn't been increased in over a  decade.\n\nA few years ago, it was noted that a full-time minimum wage worker  could not afford a modest two-bedroom apartment in any county in the  United States. Since then, housing costs have gone…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…intentionally caused by this  administration--because for all the tough talk, this is not just  politics as usual.\n\nIn fact, when the DREAM Act was first introduced over 20 years ago,  it was bipartisan, and it enjoyed bipartisan support for most of the  last 20 years. And even today, polling shows an overwhelming majority  of the American public supports…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. CASTRO of Texas. Three years ago today, I was diagnosed with  neuroendocrine cancer. That day, my youngest child, my daughter, turned  2 months old.\n\nThere is a drug that I have to take every month, every…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693230/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…trend of--at a time of great demand and growth--data centers and all  kinds of uses for AI that, through searches, require more energy than  what we were doing a couple of years ago.\n\nThat demand is growing. In Virginia, we see it all the time,  especially with a profusion of data centers. As the demand is growing,  if we are cutting off energy projects…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Madam President, I want to thank my colleague from  Hawaii. If he can spare 30 seconds, I would like to tell him a story.\n\nYears ago, I went to India to the dusty villages--not the big  cities--just to see what USAID was doing. I heard about it. I wanted to  see it. The most graphic example I can remember…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688339/usaid"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…His mother, Alison, shows up every day to care for JJ and to stand up  for families across the country just like theirs.\n\nTheir advocacy and their continued work started 10 years ago when JJ  was just 12 years old and was removed from a Trump rally in 2016, after  protesting the President's mockery of a reporter with a disability.\n\nFor over a decade,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690733/recognizing-jj-holmes-and-alison-holmes"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…here tonight on behalf of  the Congressional Black Caucus to commemorate National Minority Health  Awareness Month, but I am also here for personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was  excited. I was expecting a girl. I had placenta previa, so I knew we  were going to have to schedule a C-section. We had just scheduled…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…White House being demolished  today, at the very time as you were standing on this floor talking  about authoritarianism hurting the institutions that were put in place  250 years ago, what is your feeling about the true significance of this  demolition project going on at the other end of Pennsylvania Avenue?", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Valley, overseeing the ``You Don't Need a Home Vote'' project.  In addition, in that position on the League of Women Voters, she  facilitated candidate forums. I remember many years ago when I first  ran for the Concord City Council, Gwen was there doing her civic best  with the League of Women Voters.\n\nSadly, Gwen passed away in May. She will be remembered…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692306/recognizing-gwen-watson"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…taken a constitutional oath to defend.\n\nWhen I first came to Congress as an intern for Senator Hatfield, we  were celebrating our 200th anniversary. That is so long ago, 49 years  ago. And Senator Hatfield had a saying about appropriators, and that  was that appropriators--that is, those Members of the Senate who served  on the spending committee--they…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…rights as  men, but women worked and labored for our place in this society. We  couldn't vote. We couldn't buy land, and we couldn't even open bank  accounts until about 50 years ago. Societal norms dictated that women  were to be devalued and minimized, and it made it easy to overlook and  dismiss us.\n\nIn spite of this, women have played many important…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…individual rights and  liberties is what prompted me to introduce the Insurrection Act of  2024.\n\nWe all know that the Insurrection Act has a long history. It was  written over 200 years ago, in the aftermath of the Whiskey Rebellion  and the Battle of Wabash--in those instances, probably not at the tip  of the tongue of most of us.\n\nThe forces of law enforcement…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that we are going to have to  deal with is debt, deficits, and demographics.\n\nOnce again, remember, we functionally have the same number of 18 year  olds today as we had 20 years ago, but we have double the number of 65  and up. It is just what we are. Don't get mad. It is not Republican or  Democrat. It is just demographics and understanding when our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…innovative, and he is deeply committed to preserving the land and the  legacy of his family.\n\nCotton Hills Farm has been in the Wilson family since 1882. That is  over 143 years ago. Originally starting with only 100 acres gifted to  Jeff by his great-grandmother, it now spans over 1,000 acres producing  a diverse array of crops.\n\nJeff's story is one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…a speech right here on the floor of the  U.S. House of Representatives detailing trauma that I experienced,  endured, and am a survivor of that I accidentally uncovered 2 years  ago, almost to the day. Today, I still don't have justice, like  millions of women across the country.\n\nWhen I spoke out, I got attacked. When I spoke out, I was shamed.  When…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and you can even draw the graph: Should we  be spending a higher percentage of our GDP? Should we be collecting a  higher percentage of our GDP in tax revenues?\n\nTwenty-five years ago, approximately 17 percent of GDP was what we  collected in tax revenues, and at that same time, 17 percent of GDP was  spending. In those 25 years, our spending has gone…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the government  the year before that. Does anyone believe that the priorities of this  country are identical to last year? Does anybody believe that they are  identical to 2 years ago? Aren't there things that deserve a higher  priority? Aren't there things that deserve no money? Aren't there  things that deserve less money or maybe even the same?\n\nA long-term…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…percent milk and way better than skim milk.\n\nMr. Speaker, I urge my colleagues to strike a blow for freedom and to  bring the healthiness of our children back to what it was 50 years ago  and pass the Whole Milk for Healthy Kids Act.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698182/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…they reliably bring strength and composure. These  brave men and women spend hundreds of hours in training so that they  are prepared when they get ``the call.''\n\nThirteen years ago, I established the 16th District Congressional  Fire and Rescue and EMS Awards to honor officers, departments, and  units for outstanding achievement.\n\nOn behalf of the people…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Healthy Kids Act, and I thank them for  their support for this commonsense bill.\n\nMr. Speaker, the Pennsylvania Farm Show has grown exponentially since  it began over 100 years ago, a direct reflection of how our country's  ag industry has grown. It was an honor to attend the Farm Show this  year, and I thank all of those who worked tirelessly to make…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…couple of weeks ago, a second illegal biolab run by Chinese  nationals was discovered in Las Vegas. This follows the lab that was  found in Reedley, California, a couple of years ago. It was run by the  same international fugitive with ties to the Chinese Communist Party.\n\nWhile the samples are being tested now, it looks very similar to what  was found…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…months of this year.\n\nThe decisions were made prior to the present Trump administration to  take power offline. I know in my community down in Bowling Green,  Kentucky, a few years ago with the polar vortex, we actually had  blackouts, we had to have rolling blackouts because of taking power  offline.\n\nWe all want to address it. The way we address this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the mission  that Charlie lived for of open debate in a free society in the greatest  nation that the world has ever known.\n\nWhen al-Qaida terrorists attacked our Nation 24 years ago, they had  one goal--to destroy America. They didn't see us as Democrats or  Republicans, red States or blue States. They just saw Americans, one  nation under God, and their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$1.42 or $1.43. Our spending is up.\n\nWhat is driving that spending up? It is the refinancing of our debt  at higher interest rates, because we had all that debt we sold a few  years ago at very low interest rates. The fact of the matter is  healthcare costs keep going up. The stupid discussion we are going to  have here is a financing debate--how much more…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…lumber and  steel to make homes even harder to purchase? It is a terrible idea.\n\nWashing machines were already almost $100 more expensive as a result  of the original tariffs 4 years ago.\n\nHere is really bad news: Even beer will become more expensive. A  professor at Northeastern University states that a six-pack of Corona  could go up by 45 cents, but a…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…clear we must pass the SAVE Act and prevent noncitizen voting.\n\nThere have also been many other examples of noncitizens voting or  being  on States' voter rolls. Just a few years ago, Illinois removed almost  600 noncitizens from its voter rolls. In Pennsylvania almost 10,000  noncitizens were removed from their voter rolls. In Georgia an audit  recently…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…accepted the jurisdiction  of the laws that their very presence defies.\n\nThe Supreme Court has never considered this question. The closest it  came was the Ark decision 127 years ago, but that applied to legal  immigrants who had accepted the jurisdiction of the United States by  obeying its immigration laws and who had taken up legal, permanent  residence…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}]