[{"senator": "Julia Brownley", "party": "Democrat", "sentence": "…they are due, but  for the stability, the security, and the relief that comes with these  benefits.\n\nToo often, that wait stretches from months and sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves far too slowly for the urgency of their…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Founder & Senior Pastor of the       Reflections of Christ's Kingdom World Outreach International       (R.O.C.K.) church in Houston, Texas, serving ministry for 40       years full-time through Executive and Pastoral leadership       roles; and\n\nWhereas, Apostle Dr. Dana Carson is a testament to       resilience, perseverance, and dedication, overcoming…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…where those at the top have affordable care,  and everyone else is left in the dust.\n\nMr. Speaker, Republicans have controlled the House of Representatives  for 3 long years. During that time, the priorities of this majority  have been crystal clear.\n\nWhen billionaires, CEOs, and corporate special interests need  something, Republicans move with lightning…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President.\n\nIt is not a program for just one year. A year's plan in       this field is no plan at all. This is a time to look ahead       not a year, but 5 years or 10 years--whatever time is       required to do the job.      I shall propose to this Congress a $10 billion nationwide       clean waters program to put modern municipal waste treatment…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…facilities in Bethlehem, Pennsylvania, alone employed 30,000 people.  Manufacturing is still the biggest industry in the Lehigh Valley, with  investment booming in recent years. At the same time, leaders are proud  that they managed to diversify their economy after Bethlehem Steel  collapsed decades ago.\n\n``Brian Higgins, a longtime Republican commissioner…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…business. Yet that is  what this administration keeps creating.\n\nYesterday, we learned that new orders from manufacturers dropped in  February for the first time in 22 years. For the first time in 22  years, new orders from manufacturers dropped because companies can't  work with this level of uncertainty.\n\nLast Wednesday, the President was talking about…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…district are equally served. More  than $300,000 comes in monthly to recipients in your district in the  great State of Virginia, but that hasn't changed in over 54 years.\n\nNow is the time to act. Now is the time to get behind Representative  Stansbury's legislation that will be incorporated into the Committee on  Ways and Means' configuration on Social…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…going  to make those permanent in this bill.\n\nThere are other things that are going to be newer to the tax code,  and we will try them out to see how it plays out in 4 years to give us  time to be able to analyze and see how they are being effective and  overall impact.\n\nThis is going to provide real relief to American families, workers,  and businesses.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Jason Seidl.  They worked to ensure the safety of my family and me in the hours  following the attack.\n\nI had the honor of serving with Speaker Emerita Hortman for 4 years  during my time in the Minnesota Legislature. I will forever cherish the  conversations and friendship that I had with her then and throughout  the 20 years since.\n\nWhen I look at…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…call  when his neighbors needed him most. In 2003, he became director of  Hancock Emergency Management Agency, a role he has carried with steady  leadership for 22 years.\n\nDuring that time, he guided the county through countless emergencies;  destructive storms; and, most notably, the unimaginable challenges of  Hurricane Katrina. Through every crisis,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things that are truly  terrifying?\n\nAre we really going to avoid dealing with our actual jobs? Are we  going to allow the doubling of senior poverty in America in 7 years at  the same time we are bankrupting much of the medical system?\n\nIn 7 years, grandma gets a 24 percent cut in her check and our model  says that it will double the poverty of seniors.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I rise today to recognize my outgoing  communications director, Mr. Matt Reed.\n\nMatt has been on my staff for 2\\1/2\\ years. During that time, he has  been a crucial member of my team.\n\nMatt has tremendous work ethic, an infectious sense of humor, and is  a friend to everyone in the office. From late hours…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700048/recognizing-matt-reed"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…tear us down.\n\nFor those who come to this country and go to our universities and  work in other places, and their job is to undermine and defeat what has  existed for 249 years, it is time for us to revoke those visas and to  send them home.\n\nThe most important thing, Mr. Speaker, is that we must not be afraid  to tell the truth.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…requirements.  However, for cylinders manufactured in foreign countries and then sold  and imported into the United States, PHMSA only inspects those  facilities once every 5 years.\n\nOver time, certain foreign producers have deliberately evaded safety  and regulatory standards to gain a competitive advantage over domestic  producers, potentially jeopardizing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…many thousands of  innocent lives, and that is the collapse of the regime from within.  Opposition to the oppression of the mullahs has been simmering in Iran  for many years. It is time to provide material support to help these  groups liberate their country.\n\nPast administrations sent cargo pallets of cash on cargo planes to  these bloodthirsty mullahs…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…journey starts with the first step. We are going to fight,  and we are going to stop the policies that have bankrupted this  country, that you have put up with for the past 4 years. Time is up. It  is time for a new day.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…communications  director since the beginning of my journey here to D.C.\n\nEmma has served in my office and the constituents of Utah's Fourth  Congressional District for nearly 5 years.  During this time, I have come to rely on her sharp instincts, her keen  attention to detail, and her unwavering commitment to keeping my  constituents back home informed of the day-to-day…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Infantry Division). It was while he was there that he  met his wife, Mary. His next assignment was back to Germany with the  1st Battalion 64th Armor Regiment for three years. During this time, he  transitioned to the M1 series tanks.\n\nLater he was assigned to the 3rd Cavalry Regiment at Fort Bliss,  Texas. He was there for a year and transferred to Fort…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…discussion. Is it on the tax side or the spending side? I have done  entire presentations here on the floor where I have shown my  colleagues--go back to the last 65 to 75 years. Here is a time of very  high marginal tax rates. We take in about mid-17 percent of the economy  in tax collection. Very low marginal tax rates, we take in about mid-17  percent of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…embodies the mindset and diligence that is needed to  defend our Nation. He entered the Air Force in March 2000 as a security  forces member and has been serving for 25 years.\n\nDuring his time in the Air Force, he developed an impressive  background, which includes experience at varying levels in the Security  Forces. He has participated in operations in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}]