[{"senator": "Adam Smith", "party": "Democrat", "sentence": "Mr. SMITH of Washington. Mr. Speaker, I rise to recognize Phil  MacNaughton for his many years of dedicated service to the House Armed  Services Committee.\n\nAfter 17 years, this is Phil's last week on the committee. Phil  joined the committee staff in 2009 and has been the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be it resolved that, on behalf of the       constituents of the Ninth Congressional District of Texas, I       am proud to salute Apostle Dr. Dana Carson for his 40 years       of dedicated service to enriching the lives of his family,       congregation, our Nation, and the globe. Best wishes on this       momentous occasion.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Youth       Association.\n\nI would also like to give special recognition to the 2025 Champions  of Character Award recipient, Harold Leff, who is recognized for his 33  years of dedicated and tireless service to The Fairfax County Athletic  Council.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Stephen A. McLaughlin…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to recognize and honor Al  Hutchins of Blakely, Georgia, who is retiring after more than 20 years  of dedicated service on the Blakely City Council. An event to celebrate  his extraordinary career in public service will be held on Tuesday,  December 16, 2025, at the Al Hutchins…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…support among base leadership, local  stakeholders, and elected officials.\n\nAs he steps down from this role, I am proud to join our community in  recognizing Gene's 27 years of dedicated public service and his  extraordinary contributions to preserving the defense, economic, and  technological vitality of the County of Ventura.\n\nMr. Speaker, it is with…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Gerry was a dedicated public servant, a fighter, and a mentor to all  of us on the Oversight Committee. Gerry worked to hold our government  accountable for over 30 years and was dedicated to improving the lives  of all Americans.\n\nHe was a champion of our Federal workforce, of transparency, and in  making government work for all the people that we serve.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691832/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…I rise today to recognize Pastor  Christopher ``Chris'' K. Wesley, my constituent and the Senior Pastor  of Antioch Fellowship Church of Dallas. This month marks six years of  dedicated leadership as pastor of this historic and impactful church--a  church I am proud to represent and one that is truly on the move. These  six years have been marked by…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…agencies, elected officials, and local stakeholders has left a lasting  impact on the Ridgewood community.\n\nAs Mr. Renz embarks on a well-earned retirement after 37 years of  dedicated public  service, I extend my deepest gratitude for his leadership, and  unwavering commitment to strengthening the economic fabric of New York  City. Therefore, Mr.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Mr. Jeff Nelson,  CEO and Managing Director of MetroLINK, on the occasion of his  retirement in September 2025 after more than 35 years of dedicated  service to the Quad Cities.\n\nMr. Nelson has transformed public transportation in our region. Under  his leadership, MetroLINK became a model of innovation--connecting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694971/recognizing-jeff-nelson-on-his-retirement"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "Mr. GOMEZ. Mr. Speaker, I rise today to honor the Koreatown Youth and  Community Center--KYCC--as it celebrates 50 years of dedicated service  to Los Angeles.\n\nFounded in 1975, KYCC has grown into a leading multiservice  organization in Koreatown, serving more than 12,500 people each year.\n\nFrom youth…", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698473/recognizing-the-50th-anniversary-of-the-koreatown-youth-and-community-center"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "Ms. DelBENE. Mr. Speaker, I rise today to honor Mayor Brian Holtzclaw  for his twelve years of dedicated service to the City of Mill Creek.  Mayor Holtzclaw was elected to the city council in 2013, served as  Mayor Pro Tempore, and has led the city as mayor since 2020. During…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…title of Teacher of the Year.\n\nDr. Heather Povinelli is a second grade teacher at Bradoaks  Elementary Science Academy in the Monrovia Unified School District.\n\nFor 25 years, she has dedicated her career to teaching in elementary  classrooms. Living with dwarfism, Dr. Povinelli uses her own lived  experience as an opportunity to empower students and teach…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to congratulate Ms. Kerrie  Wilson on her upcoming retirement after nearly 25 years of dedicated  service as the CEO of Cornerstones in Reston, Virginia. Cornerstones is  a nonprofit organization that has provided Northern Virginia families  and individuals with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Community and a  founding member of the Greater Rochester Black Agenda Group, Jerome  Underwood has led with clarity, purpose, and unwavering integrity.  Throughout his years of dedicated service, he has been a moral compass  and unifying force in our community, championing social justice and  equity.\n\nBorn on the Caribbean island of Antigua, Jerome brought…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692565/recognizing-jerome-h-underwood"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…celebrate not only its  longevity but the critical role it plays in supporting readiness,  morale, and quality of life.\n\nI congratulate the Exchange. Here's to many more years of dedicated  service.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692591/recognizing-the-army-air-force-exchange-service-130th-anniversary"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…region in northeast Wisconsin.\n\nMr. Speaker, as the Representative from northeastern Wisconsin and as  a lifelong Packers fan, I want to thank Mark Murphy for his many years  of dedicated leadership with the Green Bay Packers and wish him the  very best in his retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694121/recognizing-mark-murphy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  Denise Sticha for 30 years of dedicated service to communities across  Pennsylvania's 15th Congressional District and beyond.\n\nDenise recently retired as the executive director of Centre County  Library and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698534/recognizing-denise-sticha"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mrs. FISCHBACH. Mr. Speaker, I rise today to recognize an outstanding  educator and mentor, Dave Blanchard, who was recently honored by the  Prairie Conference for 27 years of dedicated service to the Long  Prairie-Grey Eagle School community.\n\nFor nearly three decades, Dave has been the definition of stepping up  whenever needed. In addition to being…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Mr. Speaker, I rise today in recognition of Joe  Schumacher in honor of his 25 years of dedicated public service to  Virginia's 1st Congressional District. Joe has had a profound impact on  my work in Congress, and he is truly one of the finest leaders I know.  Mr.…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700090/recognizing-joe-schumachers-25-years-of-dedicated-public-service"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize the Veterans of  Foreign Wars Ottawa Post 3134 for their 80 years of dedicated service  to the Veteran community of the Iron River area.\n\nThe Veterans of Foreign Wars (VFW), established in 1899, is an  organization of United States Veterans who…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696860/recognizing-the-80th-birthday-of-the-veterans-of-foreign-wars-ottawa-post-3134"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, I rise to recognize the retirement  of Mr. George Woodward. After eighteen years of dedicated service, Mr.  Woodward is stepping down from his responsibilities as the Director of  Public Affairs for the 82nd Training Wing at Sheppard Air Force Base in  Wichita…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "John Carter", "party": "Republican", "sentence": "…warrants. He now  leads the CID Training Unit, supervising eight Training Agents/ Coordinators.\n\nI am honored to join LT Frick's friends and family in celebrating his  years of dedicated service and sacrifice. I applaud his work and wish  him success and safety as he continues to serve our community with  pride and honor.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate the Leechburg Rotary Club on an incredible milestone,  100 years of dedicated service to their community.\n\nSince receiving their charter in 1925, the Leechburg Rotary has been  a pillar of civic engagement, compassion, and leadership in Armstrong…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692828/leechburg-rotary-club-celebrates-100-years-of-service"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…February  16, 2025, and is survived by his loving wife, Vickie, son, Thomas,  daughter, Rachel, and his five grandchildren. Bobby was a loyal friend  of mine for almost 60 years who dedicated his life to advocating for  Florida's agriculture industry. Born on April 6, 1942, in Samson,  Alabama, Bobby later moved to Florida, where we shared an alma mater,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…focus on  Madisonville's growth and success goes far beyond the expectations of  his role.\n\nIn addition to this remarkable honor, Mayor Cotton was recognized for  his 4 years of dedicated service as a member of the Kentucky League of  Cities Executive Board and was presented with a copy of the Athenian  Oath in recognition of his commitment.\n\nOn behalf…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696906/recognizing-mayor-kevin-cotton"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  United Way of the Bradford Area as they celebrate 100 years of  dedicated service to our community.\n\nSince 1925, the United Way chapter has been a driving force in  improving lives across McKean and Potter Counties.\n\nFrom supporting food pantries…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691973/recognizing-united-way-of-the-bradford-area"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today to recognize an exceptional man  who recently celebrated 30 years of dedicated service to Waupaca County  and the citizens of northeast Wisconsin.\n\nLast week, Waupaca County Sheriff Timothy Wilz reached a milestone of  three decades of service in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691410/recognizing-sheriff-timothy-wilz"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Mr. Speaker, I rise today to honor Mr. William  ``Bill'' Ellis for his years of dedicated service to his community. In  his long career in public service, Mr. Ellis has made immense  contributions to keeping Suffolk County safe and prosperous.\n\nSoon after…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…his patriotism, and his enduring love of  community.\n\nI ask my colleagues to join me in thanking Mayor Joe Taylor for his  exemplary leadership and for more than fifty years of dedicated  service to the people of Langhorne Borough and the Commonwealth of  Pennsylvania. We extend our best wishes to him and his family as they  embark on this next chapter,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "Mr. HARRIGAN. Mr. Speaker, I rise today to recognize Hickory Police  Chief Reed Baer of North Carolina's 10th District, who is retiring this  summer after more than 30 years of dedicated service.\n\nChief Baer spent his entire career serving the entire community that  he grew up in. He started with the department in 1997 as a patrol  officer and worked…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}]