[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…kept to his fellow citizens.\n\nIn 1992, the people of Terrell County placed their trust in John  Bowens and elected him, Sheriff. That trust was repaid every day, for  32 years. He served longer than any sheriff in the county's history and  became the longest-serving African American sheriff elected in the  State of Georgia. But these distinctions tell…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…again broke  barriers, becoming the first Black principal in Santa Barbara County  when she was appointed principal of Mountain View School in Goleta.  Over the next 17 years, she served as principal of Brandon, El Rancho,  and Ellwood Schools and directed the Goleta State Preschool. Throughout  her career, JoAnne centered the well-being and success of…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…stores getting the licensing needed to do  business legally and be part of the Mercado. This Mercado Night Market  has become a community staple for five consecutive years.\n\nShe also served on the board of directors for the Kids Discovery  Station, a museum dedicated to children and currently sits on the board  for the Merced Main Street Association.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Institutes and  another to change the name of the Gulf of Mexico to the Gulf of  America.\n\nThe second bill may be the dumbest bill brought to the floor during  the 6 years I have served in Congress. With all of the important work  this Congress should be tackling, the Speaker and House Republicans  have chosen to indulge the President in a whim that…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Rivera\n\nMr. CORREA. Madam Speaker, I rise today to celebrate the incredible  service of Dr. Audrey Rivera Gomez, head consul of the Mexican  Consulate in Santa Ana.\n\nFor years, she has served the Mexican community in southern  California. Under her leadership, the consulate has promoted  educational, cultural, and preventive programs to keep young people…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Board following his appointment by the  Dallas City Council in 2024 to fill a vacancy, and he was reappointed  to a full two-year term in May 2025. Over the past fifteen years, he  has served our city through multiple appointments to boards,  commissions, and committees, including his prior role as Immediate Past  Chair of the Dallas Black Chamber of Commerce,…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…each  other.\n\nCSRIC has been in existence since 2009 and was rechartered in 2024  under the Biden administration and former FCC Chairwoman Rosenworcel  for another 2 years. It has served the FCC well by operating in a  collaborative manner with representatives from private industry,  government, and other key stakeholders. The Council is also now co-…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I thank my friend for yielding. He and I have  known each other for some 60 years. We have served in this body for a  very long time.\n\nI can remember two events. One was on September 11, 2001, and we  were, as the gentleman observed, attacked by an enemy from without.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Engagement. After graduating, she joined the Teach for  America program and moved to New Orleans to work as a middle school  math teacher in a public school.\n\nFor the next three years, she served as a teacher and mentor for  hundreds of students. I know she keeps in touch with some of her former  pupils who still recognize the impact that she made on their lives.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…teacher all her life in many ways--before serving on the Walnut Creek  School District governing board for almost a decade.\n\nGwen later served on the city council for 21 years and also served  regionally on the Association of Bay Area Governments. She had five  terms as the mayor of the city of Walnut Creek, during which time she  championed the development…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…something, and he has  certainly used his. His actions demonstrate that even in moments when  motivation is hard to find, we are not alone.\n\nA proud Marine Corps veteran of 13 years, who served as a drill  instructor at Parris Island, Officer Thomas has seamlessly translated  his leadership and mentorship skills into his role as a Department of  the Air Force…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…but our Republican colleagues, their reconciliation bill,  would limit the supplement only to those who reach the mandatory  retirement age of 57 no matter how many years they have served.\n\nIt would also apply not just to new hires but to all officers, to  those who clearly earned the ability to claim this benefit and didn't  sign up for this new rule.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…top  influential leader in Collin County. After his tenure as mayor, Corbett  served as the Executive Director of the Celina Economic Development  Corporation for ten years. He also served on the Board of the Upper  Trinity Regional Water District and the McKinney Urban Transit  District. He is the past President of the Preston Trail Rotary Club and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…mother as a young  girl, Reba has been a dedicated advocate for the beef industry from the  very beginning. She has been active in Florida Cattle Women for more  than 40 years and served as its President in 2004. She also served as  President of the American National Cattle Women in 2022 during the  organization's 70th anniversary. Reba has completed the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…After completing his military service in April 1972, Longo continued  his lifelong commitment to helping others, particularly his fellow  veterans. For the past six years, he has served as a chaplain,  providing spiritual guidance and emotional support to those who have  sacrificed for our nation. Today, he serves as Chaplain for People of  Impact at…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Virginia,  who passed away at the age of 85.\n\nJustice Koontz was one of the most consequential judges in the  Commonwealth's history. Over a judicial career spanning 42 years, he  served at every level of Virginia's court system, culminating in his  roles as the founding chief judge of the Virginia Court of Appeals and  as a justice of the Supreme Court…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the  retirement of Gary Fuller, Mayor of the City of Opelika, Alabama.\n\nMayor Fuller has tirelessly served the City of Opelika for over 20  years. He served on the City Council from 2000 to 2004 and was first  elected Mayor August 24, 2004.\n\nAs Mayor, he established Opelika as the first gig city in Alabama. He  helped establish…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…all students. Since her  retirement, Ms. Woody has reconnected with the cattle community and  remains involved with the Kern County Cattlewomen. Over the past nine  years, she has served in numerous leadership roles, including Vice  President and President. Currently she serves as Secretary and on the  Board of Directors, chairs the organization's annual…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…treasurer for 18 years  and spending significant time as a Crew Leader. Since 2012, Danny has  served as a Board Member for Minerva Water Supply Corporation; and for  17 years has served the Minerva community as a volunteer fireman where  he currently serves as their treasurer.\n\nAlongside his wife, Linda Matocha Masur, Danny has dedicated 58 years  of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "John Carter", "party": "Republican", "sentence": "…the Army and  his Nation exemplifies our Nation's altruistic spirit.\n\nMG Hamilton served honorably in Armor and Cavalry units in the Texas  Army National Guard for 35 years. He served full time in operational  assignments including Director of the Joint Staff, Chief of Staff to  the Adjutant General of Texas, and the Texas Army National Guard  Director…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…of calling on  Almighty God to consecrate our service for the good of the American  people.\n\nDr. Yancey Cook Arrington is an eighth-generation Texan who, for over  25 years, has served as the teaching pastor at Clear Creek Community  Church in the bay area of Houston.\n\nHe is joined today in the Chamber gallery by his lovely wife,  Jennefer. They are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697518/welcoming-dr-yancey-c-arrington"}]