[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Chairman Rogers and  Ranking Member Smith for the manner in which they worked together in a  bipartisan way. It is an example of what has taken place here for  almost 60 years, where we come together for this legislation. I will  just add, though, that I would love the day when the State  authorization bill stands on its own, so I look for and long for that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…resilience, and, yes, optimism. While the curtain is closing on  this act of Maggie's brilliant career, I know her theatrical artistry  will continue to inspire our community for years to come.\n\nBravo, Maggie, bravo. Congratulations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…today if I did not  have my own Ms. Crankfield.\n\nMr. Speaker, closing disparities and exposing more students to new  ideas and opportunities sets them up for success in the years to come  and perhaps even a seat in this very Chamber.\n\nCongratulations to Ms. Crankfield.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697970/national-school-counselor-of-the-year-danielle-crankfield"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Lesa, and The Remedy  Church congregation on their fifth anniversary. May they continue to  grow, serve, and be a blessing to both our community and the Lord and  Savior for years to come.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…this morning. By every  single forecast, by every measure, Donald Trump's self-defeating  tariffs are actively making Americans poorer, and they are doing it now  and for years to come.\n\nEconomic growth, gone. Inflation, rising. Unemployment projections,  up again.\n\nExperts estimate Trump's tariffs will cost average families about  $4,000 a year. Many…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the Subcommittee on Capital Markets, but,  particularly, for the hearings that we have had on this bill. I look  forward to working with her on this subcommittee for many years to  come.\n\nMr. Speaker, I rise in support of H.R. 3394, the Fair Investment  Opportunities for Professional Experts Act, offered by my friend and  Financial Services Committee chair,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Jennifer Ciavirella is school principal, leading a talented team of  professionals. We salute Amani Charter Public School on its 15th  anniversary. May there be many more years to come.                   Saluting the Life of Mayo Peter Bartlett\n\nMr. LATIMER. Mr. Speaker, I rise today to salute the life of Mayo  Peter Bartlett, who passed away in September…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…institution the Framers designed to reflect the will of the  American people and to serve as the guardian of their liberty and their  democracy.\n\nThrough the past 45 years, I have come to know many good, decent, and  patriotic Members chosen by their neighbors to represent them. They  come from both parties and all parts of the ideological spectrum.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…successfully maintained its parks and facilities through  many challenges. They continue to provide exceptional recreation  experiences and will continue to do so for many years to come.\n\nI ask that my colleagues join me in recognizing this day as the  Carmichael Recreation and Park District's 80th Anniversary and thank  them for their dedication to their…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…$15  billion in value to the military community.\n\nCongratulations to the Exchange on 130 years of serving those who  serve. Here's to ``going where you go'' for many more years to come.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…legislation to make sure  that we commemorate in a place of honor the women who helped shape our  country and helped shape the future of women in service and in the  trades for years to come.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…community a better place. Tess's work has brought us one step closer to  ensuring that health care is a right, not a privilege, for all. I wish  her all the best in the years to come.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…inaugural season and the excitement of cheering on  our new home team. The entire state of Colorado stands with them, and  we look forward to celebrating their success for many years to come.", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694256/recognizing-denver-summit-fc"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…the ACA, but who rely on a hospital in a  rural area, who now may see that hospital close because of the cuts  that are in this piece of legislation.\n\nOf course, for many years to come, we and our kids and our grandkids  are going to be saddled with even more debt in order to afford tax cuts  for those who need them the least. This is not just bad economics.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spooky decorations, he poured his heart into  making those weekends memorable. They became traditions that his kids,  grandkids, and now great-grandkids will carry on for years to come.\n\nBeyond all the arrests, titles, and awards, Rex was wise. He told the  best stories, made everyone laugh until they cried, always showed up  when he was needed most,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…invite my colleagues to join  me in honoring this  beloved institution and its legacy. I look forward to seeing it  continue to bring joy to generations of families for years to come.", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694751/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…celebrate more than a milestone. We celebrate that ray of  light that is never dimmed. May BEAM continue to shine, lighting the  path forward for those who need it most for years to come.                 Honoring the Life of Carrol Eugene Franklin\n\nMr. BEAN of Florida. Mr. Speaker, today I rise with a heavy heart but  a grateful spirit to honor the life…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…families, fans, and support staff  helped fuel this team.\n\nThe South Bend community celebrates this moment with the Huskies, and  their victory will serve as an inspiration for years to come.\n\nI congratulate the Huskies. This is an accomplishment that will never  be forgotten.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Mr. Speaker, it was an honor to nominate these young students. Their  dedication to serving our country is inspirational. I look forward to  seeing their successes in the years to come.\n\nMr. Speaker, I thank them all again for their commitment to our  Nation.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…aspiring athletes everywhere.\n\nI applaud the SLCC Cross Country Program for their extraordinary  accomplishments, and I look forward to seeing their continued success  in the years to come. Their hard work, resilience, and sportsmanship  embody the best of what it means to be a Bruin.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Saint Michaels and All Angels Episcopal Church in Dallas.  Trinka has truly made an incredible impact on the world around us, and  I wish her continued success for many years to come.\n\nIt is an honor to bestow my friend Trinka with the Patriot Award for  her exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, by passing this commonsense legislation,  the House will ensure that we can continue conserving vital waterfowl  habitats for years to come.\n\nThis is important for sportsmen and -women who depend on healthy  wetland habitats for hunting, fishing, and other forms of wildlife- centered recreation. H.R. 2316 is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to do tonight is respond to  basically a little bit--actually, a whole bunch of just a little bit of  misrepresentation that keeps coming into our office.\n\nEvery week for years, I come by here, and I sound like an idiot  economics professor when I walk through the math, trying to help our  brothers and sisters here in this body who might be crazy enough…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Hill to better  understand and assist their mission. His work has ensured that Hill  will continue to be a successful and important contributor to our  national defense for years to come.\n\nI am proud to recognize Steve's strong example of service, and I  congratulate him for this will-earned award. I thank him for his  support of Hill Air Force Base and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…best has allowed us to  develop the best technologies in all fields. Through strategic  investments under the leadership of President Trump, this will continue  for many years to come.\n\nIn today's era of strategic competition, Congress needs to provide  the administration with the tools it needs to ensure American  technologies are not falling into the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Community Church in Frisco,  where he has led Bible study classes for over 33 years. I am proud of  the work Corbett has accomplished, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Corbett with the Patriot Award for his  exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate legendary Coach  Jimmie Lewis, whose name will now be displayed at the Harlem High  School baseball field for years and years to come. Coach Lewis has been  the dedicated leader of the Harlem High School baseball program for  decades, securing eight state titles and over 900 impressive wins--the…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688921/harlem-high-school-baseball-field-named-after-legendary-coach-jimmie-lewis"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…accurate stories.\n\nWherever Andrew's next chapter takes him, his integrity, compassion,  and commitment to storytelling have left a mark on our State that will  endure for years to come.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Lighthouse lighting the way, Cutler has a  bright and hopeful future. I congratulate the people of Cutler, ME, on  this 200th anniversary and wish them all the best in the years to come.", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…past Trustee. He lives the  Catholic Christian life of servitude. I am proud of Tom's lifelong  contributions to our community, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Tom with the Patriot Award for his  exceptional service to the people of North Texas.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}]