[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…and recognize an  extraordinary American patriot, Sergeant Major Troy E. Black, United  States Marine Corps, on the occasion of his retirement following a  distinguished 37-year career in faithful service to our Nation.\n\nSergeant Major Black's journey began in Louisville, Kentucky, where  the values of duty, discipline, and perseverance were instilled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…belongs to those who prepare for it today.'' Cliff dedicated a  significant part of his life to preparing young people for their  futures, embarking on a distinguished 41-year career in education. His  educational journey included roles at his alma mater, South Girard High  School, South Girard Elementary, and Ridgecrest Elementary, where he  coached…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…South Shore YMCA. Kathy is a true community  leader, who has tirelessly advocated for disadvantaged communities in  Quincy and the South Shore throughout her remarkable 30-year career.  Whether during her time with the South Shore YMCA, Quincy Community  Action, or DOVE, she has dedicated her career to working for the  betterment of her community.\n\nIn…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…College, and a  Specialist Degree in Education and Counseling and Guidance from Auburn  University.\n\nArmed with the knowledge and skill, Mrs. Booker turned that gift into  a 46-year career in Education that touched the lives of thousands of  young people. Her career encompassed 12 years as a classroom teacher, 7  years as Director of Guidance at Talbotton…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…makes her a true force for positive change.\n\nThe Dr. Gladys West Women in STEM Award--Pamela Bingham: Pamela R.  Bingham is a trailblazing environmental engineer whose 30-year career  has bridged STEM, environmental justice (EJ), public health, and  community empowerment. As Operations Manager for the University of  Maryland's Health, Environmental,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to recognize Sergeant Major  Troy Black as he retires from a distinguished 37-year career in defense  of our Nation.\n\nSergeant Major Black was born and raised in Louisville, Kentucky,  before joining the Marine Corps in 1988, rising to become the 19th  Sergeant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…exemplary service to our state. She was  recognized for her contributions to making North Carolina a better  place for all of our people over the course of her more than 50-year  career in social work.\n\nPhyllis was a beloved wife, mother, sister, grandmother, and friend.  She embodied the true meaning of public service and made a lasting  impact on her…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…and General Manager of  WPVI-TV, Philadelphia's most-watched local news and entertainment  television station.\n\nA graduate of Temple University, Prazenica's illustrious 43-year  career in television saw stops in Pittsburgh, Richmond, and Raleigh  before he returned to Philadelphia in 1994. He would go on to serve as  the President and General Manager of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…today to congratulate the  Deputy Chief of Army Reserve, Major General Deborah ``Deb'' Kotulich on  her retirement from the U.S. Army Reserve.\n\nMajor General Kotulich's 35-year career has been characterized by  exceptionally meritorious service while serving in positions of  increasing responsibility and culminating as the Deputy Chief of Army  Reserve.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…SYKES. Mr. Speaker, today I rise to congratulate and announce as  our champion of the week North Canton City Schools Superintendent Jeff  Wendorf on his retirement after a 40-year career serving the students  of North Canton as a teacher, coach, and administrator.\n\nSince he began serving as the superintendent in 2016, North Canton  has consistently been…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690330/recognizing-superintendent-jeff-wendorf"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…thriving. He is walking and able to speak. He lit up my office  with energy. That is thanks to the care he received under Medicaid.\n\nChristina was forced to leave her 16-year career in corrections to  become his full-time caregiver, placing a significant financial strain  on their family. In the face of rising costs for American families,  Medicaid…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693218/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, the 12th Congressional District recognizes  and honors Richard  LeBlanc for his extraordinary 33-year career in public service and on  his recent retirement as the City of Westland's City Clerk.\n\nMr. LeBlanc's steadfast dedication to community and service to our  residents has…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693810/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today I rise to recognize Reverend Dr.  Curtis Theodore Walker, Sr. as Ohio's 13th Congressional District  Champion of the Week for his 50-year career in ministry.\n\nReverend Walker has served as a minister and pastor at multiple  African Methodist Episcopal Zion Churches in New York, Connecticut,  North Carolina, and Alabama.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Legislative  Assistant for Congresswoman Elaine Luria (D-VA). In 2023, I was lucky  to have her join my Washington, D.C. Office as a Legislative Assistant.\n\nOver her two and a half year career in my office, Alison covered many  issues, including Healthcare, Reproductive Rights, Education, and  Social Security. During her time in my office, Alison held hundreds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…stepping down from his responsibilities as the Director of  Public Affairs for the 82nd Training Wing at Sheppard Air Force Base in  Wichita Falls, Texas.\n\nThroughout his 30-year career as a Public Affairs Specialist, Mr.  Woodward has been a tremendous source of expertise for the United  States Air Force. Mr. Woodward has served in a number of critical…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate Joe Jensen on a  successful 50-year career serving as a 911 dispatcher. Joe started his  career at the Marshall Police Department as a dispatcher and is  wrapping it up with Lyon County.\n\nHis calm voice put people…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…the Marine Corps University and George Washington  University, where he earned master's degrees in military studies and  legislative affairs, respectively. During his 16-year career in the  Army, Rob served in key tactical and strategic positions. He has  successfully completed the Basic Officer Leader's Course, Air Assault  School, Marine Expeditionary…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Honoring Andrew Ozaki\n\nMr. FLOOD. Mr. Speaker, I rise today to honor a giant in Nebraska  journalism, Andrew Ozaki.\n\nOver the course of his 43-year career, Ozaki led KETV's Lincoln  bureau and built a reputation for both tenacity and kindness.\n\nWhether he was covering the unicameral, the Governor's office,  sports, or more,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…State's photography workshop, crediting this to his extensive  experience.\n\nBruce is a member of various photography associations and has won  multiple awards over his 40-year career. In 1986, Bruce earned the  Certified Professional Photographer competency and has held this  achievement for more than 30 years, a testament to Bruce's expertise  and technical…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Commendation. A ``Soldier for Life,'' COL Patterson embodies the values  of selfless service and true leadership.\n\nFrom 1972 to 2003, COL Patterson had an extraordinary 31-year career  serving our Nation in the U.S. Army, holding numerous leadership  positions across every level. As Chief of Staff for the 49th Armored  Division, he played a pivotal role…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…was defined by  service to others. He was a proud combat veteran of the United States  Navy, serving in Vietnam from 1960 to 1964. After returning home, he  began his 50-year career in politics and public service.\n\nStan made history in 1969 by becoming the first African American to  be elected to the Harrisburg City Council, eventually serving as the…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…School, Basic  Officer Leader's Course, and Air Assault schools. After completing  Airborne school and Master Jumpmaster school with distinction, Kyle  spent most of his 17-year career at the tactical level specializing in  combined arms maneuvers and large-scale combat operations. He deployed  three times in support of Operations Iraqi Freedom, Enduring…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…service.\n\nSergeant First Class Leidlein answered the call to serve his country  on September 5, 1991, when he enlisted in the United States Army. Over  a remarkable twenty-year career, he rose to the rank of Sergeant First  Class, serving in diverse and demanding environments across the globe.  After completing his initial training at Fort Sill, Oklahoma,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…municipal service in Georgia. During  his nearly seven-year tenure here, he led with vision, steadiness, and  a keen sense of public service, culminating in an impressive 48-year  career in local government.\n\nOne of Steve's signature achievements for Green Cove Springs is the  redevelopment of Walnut Street, where he oversaw the major redesign and  reconstruction…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today to recognize Mr. Harold Arve,  Jr., a lifelong resident of South-Dade and a pillar to the community of  Homestead.\n\nThroughout his 47-year career with the Florida Farm Bureau, Mr. Arve  has dedicated his career to community service.\n\nFrom earning the rank of Eagle Scout to coaching on the football  field and raising…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690190/recognizing-mr-harold-r-arve-jr"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…officers work tirelessly to protect and serve, putting their  lives on the line every day to uphold the rule of law.\n\nAs a former sheriff, a son of a police officer, and a 42-year career  police officer, I have walked in their shoes. I know the toll it takes  on them. I know the long hours, sleepless nights, and time spent away  from family. I know this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…officer with the Rochester Police Department,  Officer Mazurkiewicz was also an active member of the Rochester Police  Locust Club, a very distinguished club, for his entire 29-year career.  This included  serving as the tactical unit representative to the executive board for  over 20 years and as a member of the contract negotiations team, the  scholarship…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…proud Marine Corps spouse,  Jennifer is a national conservative leader, policy expert, and  political strategist whose faith has guided her throughout a  distinguished 20-year career in public service. She helped elect and  advise two U.S.  Presidents and two U.S. Attorneys General while leading national  grassroots and communications efforts that achieved…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…Distinguished Flying Cross.\n\nAfter the war, Mr. Speaker, this American hero relocated to  Jacksonville, Florida, with his wife and four children. There, he built  a successful 40-year career in commercial real estate property  management, development, and brokerage.\n\nAlways a community servant, Mr. Citrano generously dedicated his  time, serving on numerous…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698995/recognizing-james-jim-p-citrano"}]