[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Might the Senator be willing to retain the floor for  a moment to yield for a question?\n\nMr. WHITEHOUSE. In Rhode Island, we have a grid. ISO New England it  is called. It is through that grid that electrons get from powerplant  to the grid and from the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Will the Senator yield for a question?\n\nMr. WELCH. How are you managing to do this? You have been up all  night and your staff too. It is really, really quite extraordinary.\n\nMr. WELCH. Will the Senator yield…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Would the Senator yield for a question?\n\nMr. SCHIFF. I thank the Senator for yielding.\n\nI just watched footage of our colleague--my California colleague-- Senator Alex Padilla, being forcibly removed from a…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Mr. KELLY. Will the Senator yield for a question?\n\nMr. KELLY. Senator Merkley, I appreciate everything you are doing to  highlight the many ways that this President has been undermining the  Constitution and the rule…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…around, and bring fear to parts of the city of  Chicago. Little Village and Pilsen are the ones most well known.\n\nMr. DURBIN. It is a legitimate point.\n\nWill you yield for a question--\n\nMr. DURBIN.--for the Chair?\n\nThe point I am trying to make is there are areas of the city of  Chicago and I am sure in your State of Oregon where the intimidation  factor…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Will the Senator yield for a question?\n\nMr. LUJAN. First, I want to begin by thanking our friend, and I say  ``our friend'' because he is more than my friend, Senator Merkley. We  are friends from across our…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Yes. Would the Senator yield for a question?\n\nMr. SCHIFF. I thank the Senator for yielding and for your  extraordinary speech and all that you have elucidated today and for  your powerful advocacy on behalf of our…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…they won't bend the knee and politically persecute people  against whom there is no actionable claim?\n\nMr. KAINE. Mr. President, might the Senator from Oregon yield for  another question?\n\nMr. KAINE. Thank you. And I will tell a quick story. In fact, I am  going to hand you this picture now because my question is going to be  for you to describe it.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…access       to essential care for millions of Americans who rely on       Medicaid, including our Nation's most vulnerable populations.\n\nMr. BOOKER. I would yield specifically for a question, yes.\n\nMr. BOOKER. To my leader, Leader Schumer, I mean, that is the pain of  these stories from the families that I read of the fear that they have  to rely on these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…terrific way to respond to  Trump trying to provoke violence and failing to do so. I think the  Oregon National Guard will be extremely professional.\n\nMr. MERKLEY. Yes, I yield for a question.\n\nMr. MERKLEY. The reforms that my colleague speaks of are incredibly  important because we have a standard under title 10. Under title 10,  which is the federalization…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. I thank my colleague very much.\n\nI just want to make sure, from a parliamentary standpoint, would the  Senator from Oregon yield for my question?\n\nMr. WYDEN. Mr. President and colleagues, I want to start by  commending my partner from Oregon, who has now been on the floor for  close to 18 hours. What he is doing is…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Would my colleague yield for a question?\n\nMr. SCHUMER. Thank you.\n\nI first want to thank my colleague for taking the floor and showing  the American people how horrible this administration is treating  average…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Certainly, I appreciate all that you  have been saying over all of these hours. You are right; we are in a  real crisis here in this country.\n\nMr. PETERS. Would you yield for a question?\n\nMr. PETERS. Thank you. I appreciate that. And again, thank you for  bringing this to the attention of the American people in such an  eloquent way.\n\nFirst, I would just…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}]