[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…flopping.\n\nThe only thing Donald Trump's tariffs have succeeded in is raising  the  odds of recession and sending markets into a tailspin.\n\nI have talked to business owners in New York. I was in Suffolk County  at Tandy's, a well-known dress seller there. Her costs are going up 30  percent because of tariffs, and she is faced with two awful choices:  raise…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…District.\n\nMs. McCLELLAN. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMs. McCLELLAN.  Clarke), the chair of the Congressional Black Caucus.\n\nMs. CLARKE of New York. Let me first start by thanking Jennifer  McClellan of Virginia and  Jim Clyburn of South Carolina for anchoring  this evening's Special Order hour on behalf of the Congressional…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, it is with a heavy heart that I rise,  together with my colleagues from the New York delegation, to honor the  memory of former Congresswoman Carolyn McCarthy from New York's Fourth  Congressional District.\n\nShe was a trailblazer in Congress and a visionary…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…every American, as the conscience of the  Congress, we will continue that legacy.\n\nMr. Speaker, it is now my pleasure to yield to our chairwoman, the  Congresswoman from New York (Ms. Clarke).\n\nMs. CLARKE of New York. Mr. Speaker, I am Representative Yvette D.  Clarke, chair of the Congressional Black Caucus, proudly representing  New York's Ninth Congressional…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…their operation to oust Maduro was a  ``law enforcement'' operation about drugs. That is the legal pretext  for the action that they have led, but Maduro is now in jail in New  York City and 15,000 U.S. troops and an American armada are still  hovering off Venezuela's coast.\n\nWe already captured Maduro. He is in jail. So what are our troops  doing down…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…following standing committee of the       House of Representatives.\n\nCommittee on Science, Space, and Technology: Mr. Menefee,       to rank immediately after Mr. Riley of New York.\n\nMr. AGUILAR (during the reading). Mr. Speaker, I ask unanimous  consent that the resolution be considered as read.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699872/electing-a-member-to-a-certain-standing-committee-of-the-house-of-representatives"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…put an end to this insanity, or are we all just going to shrug it  off and move on? The President's own words show that he is living in a  different reality. He told The New York Times that acquiring Greenland  is psychologically important to him. Not to the United States, but to  him personally.\n\nMr. Speaker, just so we are all on the same page, the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the Congressman from Alabama (Mr.  Figures) and also Congresswoman Bynum from the State of Oregon and the  chair of the Black Caucus, Yvette Clarke of New York, for inviting me  to speak this evening.\n\nMr. Speaker, as we celebrate Black History Month, I rise to honor an  extraordinary American hero that I had the great pleasure to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…a house, to raise four kids, and to build a stable, middle-class life.\n\nMy father's side of the family had a similar story. They came from  Eastern Europe and settled in New York City. My great-grandfather got  involved in labor organizing, and my grandfather was a bookkeeper at a  company that sold fruit.\n\nThey all came of age during the New Deal era,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cover the cost of a nutritious meal.\n\nThe good news is that there are exciting partnerships happening that  show us it is possible to improve access to healthier foods.\n\nIn New York City, local nonprofits, the Centers for Disease Control  and Prevention, and the online grocery platform Mercato have partnered  to help thousands of low-income New Yorkers…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Administrator Loeffler  have outlined an agenda that will harm small businesses. Proposals such  as cutting the SBA workforce by 43 percent; relocating SBA offices away  from New York City, the center of that region; and firing an  independent inspector general do not represent anything that looks like  America First. It is an ideological agenda, and it is…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, it is with a heavy heart that I rise today,  alongside my colleagues in the New York delegation and many of our  other cherished colleagues, to mourn the loss of a giant of the House  and a trailblazer for women in public service, Chairwoman Nita Lowey.\n\nFor…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689210/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…fairness. I am standing up for the  people in my State of Georgia. There are 500,000 Georgians in the  healthcare coverage cap. If they lived in California, if they lived in  New York, if they lived in North Carolina, they would be covered.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697898/9999"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…3187--Conveyance of specified  Forest Service property to Perry County, Arkansas (Rep. Hill--Natural  Resources).                             personal explanation\n\nMr. GOLDMAN of New York. Mr. Speaker, I was unable to vote today due  to an important personal matter. Had I been present, I would have voted  YEA on Roll Call No. 335 and YEA on Roll Call No. 336.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698155/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…times, in terms of people trying to get appointments in  person, are going to get longer. Just in the Northeast, we have already  been told that the White Plains office in New York is going to be  closed, and they are telling people to go to New Haven, Connecticut, my  State. That is about a 2-hour drive for people if they want to have an  in-person appointment…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…future.  Passing this bill will equip our national security agencies with the  tools they need to adapt and defend against the threats of tomorrow  today.\n\nMr. GOLDMAN of New York. Mr. Speaker, I thank my colleague and friend  from Texas (Mr. Pfluger) for introducing this bill. It does make a ton  of common sense and is something that we all agree that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Louisiana.\n\n(32) Montz, Louisiana.\n\n(33) Springwater Township, Minnesota.\n\n(34) Grass Valley, Nevada.\n\n(35) Swanzey, New Hampshire.\n\n(36) Kinnelon, New Jersey.\n\n(37) Flanders, New York.\n\n(38) Glendale, New York.\n\n(39) Riverside, New York.\n\n(40) Pendleton, New York.\n\n(41) Weddington, North Carolina.\n\n(42) Goose Creek, South Carolina.\n\n(43) Fairview, Texas.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…hours, something you can do on a plane in 1 hour today.\n\nThis project has been called a project that won't even be built  within the next century by even sources like The New York Times. I have  introduced legislation to eliminate all future Federal funding for  high-speed rail. The Governor continues to believe that Federal funding  will come. It is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…like it or not.\n\nReimbursement quietly channels billions of Federal dollars into care  for illegal immigration through State Medicaid programs. States like  California and New York are actually the most abusive of this law.  These sanctuary States choose to allow illegal immigrants to receive  State Medicaid programs and then send the bill to Washington,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the       1980 Winter Olympics, officially the XIII Olympic Winter       Games and known as the 1980 Lake Placid games, from February       13 to 24, 1980, in Lake Placid, New York.\n\n(2) Team USA, comprised of collegiate players, defeated the       defending Olympic champion the Soviet Union 4-3 on February       22, 1980, in the final round of the 1980…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…process of it, we  have Texas, California, Nebraska, New Hampshire, Ohio, Kentucky,  Missouri, Utah, Florida, Maryland, Indiana, Illinois, Wisconsin,  Kansas, Virginia, and New York.\n\nThis is insanity. Where does it end?\n\nIt certainly won't end this election cycle. There is no reason that  in every election cycle now, Mr. Speaker, you won't have States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our statewide newspaper, the Arkansas Democrat- Gazette. He studied at the Rabbinical Seminary in Morristown, New  Jersey, and the Central Lubavitch Yeshiva in Brooklyn, New York,  receiving his rabbinical ordination in 1990.\n\nRabbi Ciment is a devoted husband to Estie and a proud father of 10  children.\n\nI extend my heartfelt thanks to Rabbi Ciment…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689253/welcoming-guest-chaplain-rabbi-pinchus-ciment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…that to his State, which applied for the program and  received a $212 million grant. And that is for 2026 alone. When the  State announced its application, the Office of New York State Mental  Health Commissioner, Dr. Ann Sullivan, stated:\n\nExpanding access to services in underserved communities is       an important part of our effort to strengthen…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…where she earned her bachelor's degree  in architecture. Her passion for architectural design pushed her to  pursue opportunities in some of our most storied cities like New York  City, Boston, and Dallas. No matter where she lived, her dedication to  upholding conservative values never wavered. For many decades, Trinka  served in leadership roles as…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…distinguished career, Mr. Camhi has exemplified the  highest standards of service, of leadership, and of integrity.\n\nFor over 15 years, Mr. Camhi has served with distinction in the New  York Police Department. His leadership, his commitment, and his  generosity have been nothing short of extraordinary. He has led complex  criminal investigations and tactical operations…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…can achieve in their life, Alaskan of  the Week.                                    China\n\nMr. President, I wanted to come to the floor to discuss a recent op- ed in the New York Times just a few days ago. It kind of made a stir. A  lot of people thought it was a really good op-ed. I didn't.\n\nI wanted to come to the floor and talk about this op-ed because…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…that pipeline blockades have  already driven average natural gas prices up by 160 percent in major  demand centers. This doesn't have to be the case.\n\nActivist States like New York have used their delegated authority  under section 401 to repeatedly kill interstate natural gas pipeline  projects. These Clean Water Act denials haven't been because of  legitimate…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…born to an enslaved family       in 1818;\n\n[Whereas Douglass bravely escaped slavery in 1838, and       spent much of his adult life as a journalist in Rochester,       New York;\n\n[Whereas Douglass published his first newspaper, The North       Star, using his own money in the pre-Civil War era;\n\n[Whereas Douglass was known for fiercely opposing slavery,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…volunteer firefighter. Those early memories and  experiences sparked a love for firefighting that never seemed to fade.\n\nAfter graduating from St. John's University in Queens, New York, in  1969 with a degree in Business and Marketing, he pursued a successful  30-year career in men's fashion. Yet, the call to serve his community  never left him. In 1975, he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…urge my colleagues to vote in favor of H.R.\n\nMr. STEIL. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I thank the gentleman from New York (Mr. Morelle), the  ranking member on the Committee on House Administration, for his work.\n\nThe gentleman correctly noted that we are in challenging times as we  face difficult…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}]