[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…I often think back to the start of my service to this Nation as a  young paratrooper leading an infantry platoon in the invasion of Iraq.  I think about the faces of those young men whom I was responsible for,  Black, White, Asian, Hispanic, from the North, from the South, East,  and West, from farms and from cities, rich and poor.\n\nWhen I think of America,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…crashing, ``That was our moment.'' I kept thinking about the veteran  who said that to me. It was an American moment, and our reason for  going to Normandy was to honor those young men who saved democracy.\n\nThis is our moment. This is our moment to save democracy. I know it  sounds like an exaggeration to say that our democracy is now under  attack, but…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Washington in Chicago who took down the political machine. It was Chuy  Garcia who stood next to our other colleague, Luis Gutierrez, when his  home was firebombed by two young men. His home was firebombed, and Chuy  Garcia was the person standing next to former Congressman Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise today to recognize the  tremendous achievement of eleven young men from Troop 407 in Las Vegas  who will receive their Eagle Scout Awards simultaneously on December 6,  2025. This event marks only the second time nationally, and the first…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…rejects the administration's proposed cuts to  oversight of privatized family housing and provides additional  resources for construction of new family housing. These are young men  and women, as you well know through your service, Mr. President--many  of them 19, 21, 23 years old--who signed up to serve not for money or  for glory but out of their…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…cancel their insurance coverage. Who are some of these people?\n\nWe have heard stories, at least under the Medicaid cut debate, we  heard Speaker Johnson say, well, these are young men who are living in  their parents' basement playing video games. Who are we talking about?  Who are these families who are going to see their health insurance  premiums spike?…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…families,  friends, and fellow marines.\n\nIt is a terrible grief that these families now carry, and it is  incumbent on all of us as a Nation to remember the sacrifice of these  young men.\n\nI ask all my colleagues to join us in a moment of silence in memory  of Lance Corporal Aguilera and Lance Corporal Gamino.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…bill. I can't possibly do justice to the passion and the  eloquence that the gentleman brought to this floor just a minute ago.\n\nMadam Speaker, we vote today to honor the young men who reinspired a  country at the height of the Cold War. The legislation awards three  Congressional Gold Medals, as the gentleman from Minnesota outlined.  They are going…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…congratulate 37 outstanding  students in my district who accepted appointments to the Nation's  military academies. They just reported last week, and these are  incredibly impressive young men and women.\n\nMy district, Virginia's 10th, has an incredibly competitive process  and nominates the most number of people  to military academies of any district in the country.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…prescription drugs, and even mental health  and addiction treatment, and we allowed children to stay on their  parents' health insurance until the kids reached--no longer kids, young  men and women reached the age of 26.\n\nWhat was the result? It worked. For 15 years, it worked.\n\nWe achieved the lowest number of uninsured Americans in our country's  history.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…as Barack Obama used to say:\n\nI'm not opposed to all wars. I'm just opposed to dumb wars.\n\nWe got away from that. Donald Trump seized that opportunity because  he saw those young men and women who came home who were injured with  physical and mental injuries and who were trying to reintegrate into  society, and said: What was all that for? We have to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…attention to this remarkable  program. Bulldogs Coach Tim Tulloch says it best: These students work  hard to overcome adversity, and this transformational program builds  young men for the rest of their lives. The team has a 3.4 GPA. Thanks  to their academic achievements and talent on the gridiron, many earn  scholarships to transfer to 4-year universities.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…school districts face growing challenges and  diminishing resources, educators like Christine and Melanie continue to  step up, providing stability, opportunity, and hope for young men and  women.\n\nTogether, their work reminds us that investment in public education  is ultimately an investment in our communities and our future.\n\nChristine and Melanie represent…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…this country who, when faced with the loss of their only  health insurance option for their disabled child, will watch their  child potentially face the same fate as those young men in your  neighborhood and my neighborhood.\n\nThat is the reason why I pose this question to you that you are  answering about the moral gravity of this moment because it is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…easy to get that kind of consensus. It is not easy to  get that kind of consensus, and we should celebrate the fact that there  are literally thousands of people--largely young men--who are alive  today because of the bill that we passed.\n\nBut this progress is in threat of being interrupted, and the reason  is that the Trump administration has reversed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…programs reaching the championship stage in four of the last five  seasons, it was only fitting that the trophy finally returned to the  home of the Treasure State.\n\nThe young men in blue and gold made Montana proud. Their victory  belongs not only to this university but to an entire State.\n\nMr. President, if you are watching, we would love to see…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698834/congratulating-montana-state-university-bobcats"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Air  National Guard recruits statewide. In total, the Second District  produced 351 enlistments in 2025, surpassing any other congressional  district in the State.\n\nThese young men and women have chosen a path of duty, sacrifice, and  leadership. Their decision to serve reflects on the strong values of  central Arkansas and the deep respect our communities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Super Bowl coming up. This will swarm  our country even more so than now with this issue.\n\nI have talked to school board members. I have talked to parents. I  have spoken to young men and women who have been trafficked, and it is  hard to speak about. A lot of the young ladies like to keep that to  themselves, but we have to look past that.\n\nWe in Congress…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…from Virginia  for leading this effort. There is likely no issue more important that  confronts us as a nation, as a people, as a Congress, than whether or  not to send our young men and women to war.\n\nI take a backseat to no one in my disdain and loathing of state- sponsored socialism. In fact, I wrote a book, ``The Case Against  Socialism,'' describing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…development, and  career preparedness.\n\nWith over 1 million members and chapters in all 50 States, Puerto  Rico, and the U.S. Virgin Islands, FFA stands as a pillar of strength  for young men and women pursuing careers in agriculture, agribusiness,  and related fields.\n\nFFA is a transformative experience that instills a sense of  responsibility, leadership, and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…leaving the school's  athletic facilities, baseball field, and other resources unusable  during the most crucial part of their season. The community rallied  around these young men as the team practiced at neighboring schools to  continue their playoff preparations.\n\nThe Longhorns are a testament to determination, teamwork, and the  strength of a small…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…highest ideals of Duty, Honor, Country.\n\nTherefore, I honor Captain Carol MacGibbon for her lifetime of  service to the United States, to West Point, and to the countless young  men and women whose lives she has helped shape.\n\nWe extend our gratitude and best wishes upon her retirement as  academy liaison officer for West Point.\n\nThe enduring legacy…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…very, very high rates--too high rates--of domestic violence  and sexual assault in many places in America. We should all be focused  on making sure the next generation of young men don't do that.\n\nSo one of the ways in which we have done that is my POWER Act, which  has been to get pro bono legal services for domestic violence survivors  and victims.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of Georgia. It is The Fight  Against Suicide. Born out of a student movement, this charity boxing  event was created to spread mental health awareness, particularly among  young men.\n\nWhat began in Athens now spans across eight universities with the  proceeds benefiting the Sam Asbury Foundation in Atlanta Georgia, and  other local charities.\n\nSam Asbury…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Mr. HURD of Colorado. Mr. Speaker, I rise today to recognize a  remarkable group of young men and their coaches from Western Colorado,  the Grand Mesa Senior All Stars baseball team.\n\nThis summer, these players, ages 14 to 16, won the Colorado Senior  Little League…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695294/recognizing-colorado-state-champions-the-grand-mesa-little-league-senior-all-stars"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…made school history by capturing  their first national title and county history as the only Miami-Dade  County high school to ever win a national basketball title.\n\nThese young men have demonstrated relentless dedication and  perseverance throughout the season. I am proud to see that their hard  work and commitment was rewarded. I extend my congratulations…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689833/congratulating-christopher-columbus-high-school-explorers"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…American people. Drug trafficking is down, not  up. That is a great success for the American people. The scourge of  human trafficking, the exploitation of usually young women and young  men, has been dramatically lowered. That is thanks to President Trump,  the people who he has put in charge of our border security and our  internal security, and the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…remarkable victory is a testament to their talent, hard work,  and perseverance. Under the leadership of Coach Edwards, rightfully  named VHSL Class 3A Coach of the Year, these young men came mentally  prepared and demonstrated the power of teamwork and determination to  bring home the school's second State trophy.\n\nTheir success has united our community…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school track and  field relay team in Ohio's Fifth Congressional District. The young men  of the Marion Local High School Boys 4 x 400 Meter Relay team have  represented their school ably on their way to achieving the Division  III State Track and Field Title.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693368/special-recognition-of-marion-local-high-schools-boys-4-x-400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…commit America's military to fight wars on behalf of the Nation is  the most consequential and humbling responsibility that Congress is  entrusted with. If we are to ask our young men and women to fight and  potentially give their lives, then we in this body can at least muster  the courage to debate if American military intervention is warranted.\n\nWashington's…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}]