[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…address this  crisis.\n\nIt is past time that we put the safety of our children before the  profits of the gun lobby and finally pass laws to protect our  communities and young Americans from gun violence particularly in  school.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695281/gun-violence-in-schools"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…their  claims, cancer care for veterans, and calibrating radiation detection  equipment. I could go on and on.\n\nIt is a betrayal to attack veterans' care. We do not send young  Americans off to fight wars and then when they come back to this  country, we betray them by attacking the VA.\n\nMr. Speaker, do you want to talk about fiscal responsibility?\n\nThen…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688314/staffing-cuts-at-the-va"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I first ran for public office to make all of  our  kids' futures brighter, and our government hasn't done the same.  Millions of young Americans have done exactly what has been asked of  them, but our country isn't returning the favor.\n\nFewer children than ever outearn their parents. The average age of a  first-time…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699836/empowering-americas-next-generation"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…is a cause beyond party and beyond factions. It has become a       common cause of all the people of this country. It is a cause       of particular       concern to young Americans, because they more than we will       reap the grim consequences of our failure to act on programs       which are needed now if we are to prevent disaster later.\n\nClean…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…paying their mortgage. That is unconscionable, and that is  most definitely un-American.\n\nWe must identify solutions to put the dream of homeownership back  into reality for young Americans, and we must make it less expensive  for Americans to get the skills necessary to provide a decent life for  themselves and for their families, but they can't do that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Congressmen    Mike Levin and   John Rutherford.\n\nThis bill will reauthorize the Congressional Award program, which has  been responsible for printing and distributing awards to young  Americans across this country since 1979. This important program  expired nearly 18 months ago, and it is in desperate need of  reauthorization.\n\nThe Congressional Award is the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…the Trump administration is reportedly considering eliminating  these specialized support services, which would cut off the lifesaving  resources they provide.\n\nYoung people, young Americans, when they are in crisis, should be  able to speak to a professional counselor who understands their  experiences and is trained to communicate with people facing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…public schools and to investing in them.\n\nIn the first part of the 20th century, it was the high school  movement that broadly expanded educational attainment, preparing young  Americans for success in a changing world and evolving economy. This  movement featured professional educators and engaged families and  communities. It was about general knowledge…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…millions of  children across this country will be able to get medicine, and have  their sight and hearing tested, and see dentists and doctors for the  first time. Millions of young Americans will be able to go on to  college. Millions of Americans not so young will be able to go back to  school to get the education and training they need to succeed in life.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the United States, Donald Trump's actions will  not only make our schools more segregated and less equal but they will  put quality education out of reach for countless young Americans today  and in the years to come.\n\nNo matter what justification the President gives, we know the real  reason he is tearing apart the Department of Education. That is to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…winners of the Congressional Award.\n\nThe Congressional Award honors those who strive to be part of  something bigger than themselves. With this award, Congress recognizes  young Americans who devote their free time to an important activity. It  could be taking on a public service project, pursuing a hobby or new  skill, starting a physical fitness program,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…organization that is near and dear to my heart, Scouting America.\n\nFebruary 8 is National Scouting America Day, which recognizes the  legacy of the organization and the young Americans who have gone from  Scouts to leaders in their communities.\n\nOn May 17, 1977, I became an Eagle Scout myself, as a member of Scout  Troop 52 in Walker Township, Pennsylvania.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…is considering this week is urgently needed.\n\nThe CCP does not want Americans to learn about the horrific Cultural  Revolution in their history classes. It does not want young Americans  to know that it slaughtered innocent students at Tiananmen Square, nor  does it want students to learn about the CCP's ongoing Uyghur genocide  and the slave labor that…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Charlie was one of the most influential people in America. He was an  extremely effective teacher--I repeat, a  teacher--of young people. He helped educate millions of young Americans  about patriotism and conservative moral values.\n\nHis organization, Turning Point USA, is largely credited with  President Trump's unprecedented success with young voters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…Congress can award our Nation's youth.\n\nThis program has helped generations of young people set goals, serve  others, and push themselves to achieve more. Specifically, young  Americans have to set and complete rigorous personal goals focused on  volunteer service, personal development, exploration, and physical  fitness.\n\nOne of my constituents, Caroline…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698221/congressional-award-program-reauthorization-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…not  given based on past achievement but, rather, an individual is honored  for setting goals, creating an action plan, and meeting those goals.\n\nEarning an award means young Americans completed self-designed  programs focused on four key goals. They are volunteer service,  personal growth, exploration, and physical fitness.\n\nUpon completion, participants…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…because  of a lack of food, and the Trump administration has to come to rescue  them from what they have turned that country into.\n\nWe are at a crossroads in this country. Young Americans, 70 percent  believe that socialism is good. One in three believes that government  should control major industries. One in four says that we should  abolish private property.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…policy made here in Congress that  consequently created over 10 years of kids without having access to  whole milk in schools and, indeed, created a whole generation of young  Americans with weak bones.\n\nPassing the Whole Milk for Health Kids Act through the Senate is a  huge win for schools, for students, for parents, and for American dairy  farmers.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…intern in my office.\n\nThe CBYX program is jointly funded by the U.S. Congress and the  German Bundestag.\n\nEvery year, this unique program offers 75 young Germans and 75 young  Americans the opportunity to study, work, and volunteer in Germany and  the United States. The participants fully immerse themselves in the  other culture, attending university,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Georgia placed in the top ten, a tremendous achievement.\n\nHeld in Washington, D.C., on Veterans Day, the National Civics Bee  celebrates civic knowledge and encourages young Americans to engage  with their communities and understand their government.\n\nGeorgia was 1 of only 39 State champions invited to participate,  representing the West Liberty community…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…student from each  state who exemplifies the values of leadership, service, and  citizenship. In being chosen to represent Iowa, SirMichael joins a  distinguished group of young Americans committed to putting service  over self and leading with integrity to build stronger communities,  inspire others through action, and uphold the enduring values that…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691587/recognizing-sirmichael-carrington-williams-thomas-on-receiving-the-2025-billy-michal-student-leadership-award"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…benefit from a higher child tax credit of $2,200. We  boost the standard deduction to give a tax cut to the 91 percent of  middle-income families who use it, up to $31,500.\n\nYoung Americans win. We expand choices for educational freedom and  open up savings options to include trade schools.\n\nMoms and dads get new support for adoption, paid leave, childcare,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…a generation that answered history's call  with quiet resolve and uncommon bravery.\n\nDick Burbine was born on January 9, 1926, in Melrose, Massachusetts.  Like so many young Americans of his time, his life was forever changed  by the events of World War II.\n\nIn the wake of the attack on Pearl Harbor, while most teenagers were  still in high school,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…enduring legacy of Robert Baden-Powell, whose  vision still calls each new generation to duty, service, and  leadership.\n\nMay we always support this movement so that more young Americans,  especially the young people of eastern Washington, can discover a  lifetime of impact and purpose, guided by the Scout oath and the Scout  law.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…thousands of chapters across  the Nation dedicated to educating students about the principles of  freedom, free markets, and limited government.\n\nCharlie inspired millions of young Americans to be involved in the  future of their country and make their voices heard. He traveled to  college campuses around the Nation to share ideas and talk about them.\n\nCharlie…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}]