[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate the winners of  this year's Congressional Award medalists from Virginia's 10th  District. These young men and women put in 400-plus hours of volunteer  work and 200-plus hours of personal development, as well as 200-plus  hours of personal fitness activities.\n\nThe winners of the Congressional…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…prescription drugs, and even mental health  and addiction treatment, and we allowed children to stay on their  parents' health insurance until the kids reached--no longer kids, young  men and women reached the age of 26.\n\nWhat was the result? It worked. For 15 years, it worked.\n\nWe achieved the lowest number of uninsured Americans in our country's  history. Millions…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reverence that the American people  have for this venerable institution that has protected us from  aggression and threats abroad.\n\nBy pursuing political goals with our young men and women in uniform,  he risks recruitment for the military; he risks the respect that our  constituents have that enables us to work for full funding and support  for our military,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Barack Obama used to say:\n\nI'm not opposed to all wars. I'm just opposed to dumb wars.\n\nWe got away from that. Donald Trump seized that opportunity because  he saw those young men and women who came home who were injured with  physical and mental injuries and who were trying to reintegrate into  society, and said: What was all that for? We have to stop…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…expanded to over 200 units, with 5,000 youth  participants and 1,950 adult volunteers across 40 states, the District  of Columbia, Japan, and beyond. Through this program, young men and  women cultivate essential values such as leadership, teamwork, and  self-discipline.\n\nThe Albany, Georgia chapter exemplifies excellence in service,  community engagement,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…are standing for our constitutional right to  be consulted on the most consequential decision that the United States  can make: whether we engage in hostilities and put young men and women  at risk.\n\nThe chairman's summer stock theater and cringey antics  notwithstanding, this has nothing to do with whether there are troops  on the ground in Venezuela.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…outstanding  students in my district who accepted appointments to the Nation's  military academies. They just reported last week, and these are  incredibly impressive young men and women.\n\nMy district, Virginia's 10th, has an incredibly competitive process  and nominates the most number of people  to military academies of any district in the country.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…districts face growing challenges and  diminishing resources, educators like Christine and Melanie continue to  step up, providing stability, opportunity, and hope for young men and  women.\n\nTogether, their work reminds us that investment in public education  is ultimately an investment in our communities and our future.\n\nChristine and Melanie represent…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…rejects the administration's proposed cuts to  oversight of privatized family housing and provides additional  resources for construction of new family housing. These are young men  and women, as you well know through your service, Mr. President--many  of them 19, 21, 23 years old--who signed up to serve not for money or  for glory but out of their love for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Afghanistan  veterans who are screaming from the rooftops right now not to make this  mistake again. If we allow this to continue, I will have to look into  the eyes of young men and women in Arizona--working-class kids like  everywhere in this country who are disproportionately the ones who  serve in our military--and explain what they are risking their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698605/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…America's military to fight wars on behalf of the Nation is  the most consequential and humbling responsibility that Congress is  entrusted with. If we are to ask our young men and women to fight and  potentially give their lives, then we in this body can at least muster  the courage to debate if American military intervention is warranted.\n\nWashington's…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Bowl coming up. This will swarm  our country even more so than now with this issue.\n\nI have talked to school board members. I have talked to parents. I  have spoken to young men and women who have been trafficked, and it is  hard to speak about. A lot of the young ladies like to keep that to  themselves, but we have to look past that.\n\nWe in Congress…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thank the brave men and  women of the South Carolina National Guard who are currently deployed  here in Washington, D.C.\n\nI have been fortunate to spend time with these young men and women on  several occasions during their mission. I have shared a meal with the  guardsmen. I visited as they prepared for patrol. I have seen them in  action while on duty.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the Army has  answered the call--not for glory but for country.\n\nIt is not just the history books or the battlefields that define the  Army. It is the people. It is the young men and women from small towns  and big cities who raise their hands, lace up their boots, and swear an  oath to protect this Nation and its values.\n\nI have seen what that sacrifice…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…are serving  overseas. I had the privilege of doing it again this year. This  Thanksgiving, I was with Wyoming airmen at Ramstein Air Base, which is  in Germany.\n\nThese young men and women came from Casper, Cheyenne, and Riverton,  serving our Nation. They are doing an outstanding job in their work and  supporting missions in Europe, in Asia, and in the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…will also be a dynamic panel discussion moderated by Scouting  leaders and alumni, highlighting the diverse ways this program shapes  the  next generation of leaders, young men and women who will one day serve  as firefighters, teachers, doctors, small business owners, and yes,  even Members of Congress.\n\nWe are also hosting Eagles on the Hill, a reception…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "French Hill", "party": "Republican", "sentence": "…National Guard recruits statewide. In total, the Second District  produced 351 enlistments in 2025, surpassing any other congressional  district in the State.\n\nThese young men and women have chosen a path of duty, sacrifice, and  leadership. Their decision to serve reflects on the strong values of  central Arkansas and the deep respect our communities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Virginia  for leading this effort. There is likely no issue more important that  confronts us as a nation, as a people, as a Congress, than whether or  not to send our young men and women to war.\n\nI take a backseat to no one in my disdain and loathing of state- sponsored socialism. In fact, I wrote a book, ``The Case Against  Socialism,'' describing the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…established in 1910 by William D. Boyce. The mission of  the organization is to prepare children for lives of impact and  purpose. Since it was founded, more than 130 million young men and  women have participated in Scouting America's programs.\n\nMr. Speaker, at its core, Scouting encourages its members to leave  our country and the world a little better than…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…highest ideals of Duty, Honor, Country.\n\nTherefore, I honor Captain Carol MacGibbon for her lifetime of  service to the United States, to West Point, and to the countless young  men and women whose lives she has helped shape.\n\nWe extend our gratitude and best wishes upon her retirement as  academy liaison officer for West Point.\n\nThe enduring legacy Captain…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…RYAN. Mr. Speaker, I thank the gentleman for the time.\n\nMr. Speaker, we face a fundamental question here: Who makes the  decision to send our most precious resource, our young men and women in  uniform, into harm's way? Is it a five-time draft dodger who has called  them suckers and losers, or is it the American people with us as their  voices?\n\nMr. Speaker,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and  career preparedness.\n\nWith over 1 million members and chapters in all 50 States, Puerto  Rico, and the U.S. Virgin Islands, FFA stands as a pillar of strength  for young men and women pursuing careers in agriculture, agribusiness,  and related fields.\n\nFFA is a transformative experience that instills a sense of  responsibility, leadership, and service…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…being paid. In fact,  starting tomorrow, the airlines are going to be canceling flights. Our  staffs are not being paid. Federal employees are not being paid. These  young men and women here, our pages, are not being paid. Our military  is only being partially paid.\n\nI am confused about SNAP payments. Some say the payments are being  made; some say…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]