[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…technologies get developed.\n\nSo, yes, we had that revolution from the 1996 act. I am very proud of  it. We called the companies that got created Google, eBay, Amazon,  Hulu, YouTube. I am very proud of that. We wanted a Darwinian,  paranoia-inducing revolution out in the marketplace. We would no longer  be tied to this old telecommunications system that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…That is how someone gets elected in Russia. Kill the opposition. My  friends, pay attention. Be informed. If we want to understand how a  tyranny operates, look at the film on YouTube. It takes 30 minutes. It  is called, ``Freedom Means Never Surrender.'' It is a documentary about  how a tyranny functions. It just won the Telly Award. Take the time to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…extent of       digital election spending remains difficult to quantify.\n\nThe major platforms that reported political ad sales for       2024 are Facebook, Instagram, Google, YouTube, X, and       Snapchat. Spending totals for Facebook, Instagram, Google,       and YouTube were collected by OpenSecrets, and spending       totals for X and Snapchat were…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…thrive.\n\nThat is why, on its 39th birthday, Senator Grassley and I wanted to  highlight how important it is for all television providers, including  major streaming services like YouTube TV, owned by Google, and Hulu +  Live TV, owned by Disney, to provide the American public with C-SPAN  and the opportunity to see their government work on the Senate floor.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican, Democrat, Independent, or someone who  doesn't follow politics--to tune in to the Committee on Rules. It will  be up on our website. I will be live-streaming on YouTube. It will be  on C-SPAN. Hell, maybe even cable will carry us live.\n\nI urge Americans to watch it and judge for themselves what this bill  means for them and their families…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…voluntarily fund C-SPAN as  a nonprofit service.\n\nLet's be clear. Millions of Americans are being denied access to this  vital coverage because major TV streaming platforms like YouTube TV and  Hulu + Live TV refuse to carry C-SPAN. At a time when trust in  government is more important than ever, no company should stand in the  way of public access to democracy…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't know if  they were screwing with me or having some fun. I think it is ``Forbes  Breaking News'' that took about 12 or 13 hours of these floor speeches  and put them up on YouTube. I have actually had a couple of people who  obviously don't have lives who have been watching them, and we have  been playing this game of: Here is the prediction, Schweikert,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…using colors and shapes.  Faith presented the color wheel to students and taught them how they  can use art to express and influence their emotions. She uploaded art  videos to YouTube for people to watch when they are feeling upset, and  she also passed out brochures that she designed with resources on how  to seek professional help if they need it.\n\nOn…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…highlighting the importance of continuous Senate coverage  for all Americans and the need for live coverage of C-SPAN to be  accessible on all platforms.\n\nYesterday, both Hulu and YouTube announced that YouTube TV and Hulu +  Live TV will be carrying the C-SPAN networks so Americans can watch  Congress's actions in realtime and see our democracy at work through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694940/c-span"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to applaud YouTube TV and Hulu +  Live TV for expanding public access to Congress by carrying C-SPAN, C- SPAN2, and C-SPAN3 beginning next week.\n\nFor 46 years, C-SPAN's respected nonprofit service…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697293/c-span-goes-streaming"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…an AI chat that sounds like a  person, that knows everything about the tax code, will stay on the  phone with you, will help you fill out your forms, maybe even send you  a YouTube video of how to fill out the form, maybe a PDF of the form,  and it will stay on the phone with you all night long and will always  pick up the phone. You get the union that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Carter", "party": "Republican", "sentence": "…further information because the  Veterans Crisis Line was referenced by the gentleman from Missouri.\n\nI want to make it very clear that the Secretary of the VA actually  did a YouTube video specifically denying firing anyone from the  Veterans Crisis Line when, in reality, he fired 24 people who worked on  the Veterans Crisis Line.\n\nIf there was any improvement…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…day, will stay  on the phone as long as the caller needs, will help them fill out the  tax forms, will actually email or text the PDF of the form, and maybe  even send the YouTube video on how to fill out the form.\n\nWhy does this scare the hell out of the IRS? It is because the IRS is  the second most unionized bureaucracy in the Federal Government.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…minors with sextortion and have  lured them into abductions. This is something we know. We have the  information. It is not hearsay.\n\nDrug dealers have used platforms from YouTube to Telegram to sell  lethal drugs like fentanyl to teenagers, fueling our Nation's drug  epidemic.\n\nThe list goes on and on.\n\nFor years, my colleagues and I on the Senate…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}]