[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…peace?\n\nHe said that he was going to bring peace to Ukraine on day one.  Instead,  what he has done is he is constantly giving comfort to the Russian  leader. He has lambasted Zelenskyy in the Oval Office and can't say  enough nice things about Vladimir Putin.\n\nThat is not my idea of peace. That is capitulation. That is giving in  to a vicious aggressor.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Trump showing weakness on that issue, literally rolling out  the red carpet for Putin, has only made the war worse. Ever since  President Trump has tried to blame the war on Zelenskyy and Ukraine,  Putin has ramped up the war, launching more aggressive attacks than he  ever has in the 3\\1/2\\ years of the war, and most recently, sending  drones over Poland,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…negotiate in good faith, reportedly  violating the very same cease-fire he unilaterally declared last week.  So far, he has refused to even direct negotiations with President  Zelenskyy in Turkiye.\n\nThis is the same man who has welcomed China's, Iran's, and North  Korea's support for his war effort. He has shown contempt for all  international democratic…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…we will hear from Senator Bennet. We have resolutions that support  Ukraine at a critical moment in its history.\n\nI have been there six times. I have come to know President Zelenskyy  not only from meetings there, but in Paris, Munich, a number of times  here in Washington, DC, and I will never forget my first meeting with  him shortly after he was offered…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, we have all seen the recent news on  Ukraine: Zelenskyy is set to meet Putin. Putin must immediately agree  to a 30-day cease-fire. To force that, the United States and President  Trump must increase the pressure on Putin.\n\nThis…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691141/peace-talks-with-ukraine"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…started this war.\n\nI am utterly disgusted that President Trump would refute this  absolute truth.\n\nI am equally horrified by President Trump's characterization of  President Zelenskyy as a dictator who does not want peace. I was with  President Zelenskyy just last week in Germany for the Munich Security  Conference. He is an honorable and earnest leader,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, please allow me to begin by applauding  President Zelenskyy of Ukraine on his exceptional and historic remarks  in Davos, Switzerland, earlier today.\n\nI heard an astoundingly unapologetic plea by a new world leader whose  remarks…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President Trump gave his tip of the hat to autocracy last week when  he attempted to revise history by alleging that Ukraine, not Russia,  started the war and that President Zelenskyy was the ``dictator'' in  this situation. These categorically false statements are either a  product of deliberate deceit or historical delusion.\n\nPresident Trump even directed…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…that the Ukrainians have exhibited through  bravery against that is profound.\n\nI am just so honored, and I know the gentlewoman feels the same way,  to have met President Zelenskyy and so many of his advisers,  individuals in the military, and wounded soldiers. Russia has lost over  100,000 soldiers. We are not sure how many. It is a lot. Those soldiers…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…determining the shape of any peace  agreement that is to come.\n\nIn this same month, Donald Trump, the President of the United States,  standing facts on their head, called Volodymyr Zelenskyy, the leader of  Ukrainian democracy, an unelected ``dictator,'' and incredibly, spewing  another blatant falsehood, blamed Ukraine for starting the war.\n\nIn this month, in…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…sovereign territory is beyond disgraceful. It is disgusting, and it is  un-American.\n\nThis weekend, I was struck by the images of President Trump's private  meeting with President Zelenskyy at the Vatican, which took place as  the world mourned the passing of Pope Francis. Pope Francis was a  global leader of humility, of empathy, and of service. He was a  faithful…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in the war of dictators with  rule of gun invading democracies with rule of law. War criminal Putin  is failing in Ukraine with Ukrainians inspired by President Volodymyr  Zelenskyy.\n\nIn Georgia, the legitimate president, Salome Zourabichvili, is  respected worldwide.\n\nIn Belarus, the legitimate president of Belarus, Sviatlana  Tsikhanouskaya, has been…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…global unrest. China is accelerating its military buildup in the Indo- Pacific. While I remain hopeful that President Trump can help broker  peace between Presidents Putin and Zelenskyy, Russia's brutal war  against Ukraine grinds on. That is why it is more important than ever  that we invest in our servicemembers, protect defense spectrum, drive  innovation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…is right, and Senator Kennedy of Louisiana is right.  There is one man to blame for this war. If Vladimir Putin puts down his  guns, there will be no more war. If Volodymyr Zelenskyy and Ukraine put  down their guns, there will be no more Ukraine. That is the simple  truth, and I appreciate the President expressing that forcefully.\n\nThen, today, GEN Jack…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and the  rest of the world along while innocent lives are being taken.\n\nIn order to achieve peace, President Trump needs a good-faith partner  both in Ukrainian President Zelenskyy and Russian President Putin.  Notably, while Zelenskyy has met with the President several times, most  recently at the Vatican, Putin has not. Instead of working for peace,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…guarantees if they are ever agreed to.\n\nIn the meantime, the Ukrainian people should be assisted in  continuing to fight for their freedom.\n\nI commend President Trump, President Zelenskyy, and European leaders  for continuing to come together to reach a consensus. As we seek a just  end to this brutal, unprovoked war, I urge everyone in Washington, in  Kyiv,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…not  acting seriously.\n\nI don't know a single fairminded person with an IQ above his age who  doesn't want peace in Ukraine. We all want to see peace in Ukraine.  President Zelenskyy wants to see peace in Ukraine. President Trump  wants to see peace in Ukraine. I thought President Putin did. I am  beginning to wonder.\n\nPresident Trump, who is leading…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]