[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…nationally ranked  colleges and universities while gaining essential college and career  readiness skills.\n\nNext Level is known for its immersive summer experiences like Camp  Zion, but the organization is not limited to the summer months; its  work continues throughout the year, through crucial after-school  programming that extends the mission of academic…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Feinberg, Cheryl Dzubak, Cheryl Eames, Cheryl       Marlin, Chris Hammond (Ward 7), Christine Payden-Travers,       Rev. Dr. Christopher Zacharias, (Pastor, John Wesley AME Zion       Church), Christopher, Connie Ridgeway, Cybele Kotonias,       Cynthia Lee, Dallas Windham, Darcy Skarada, David Holmes,       David Wendt, Delia T. Cooke.\n\nDenise Lindgren,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…fearless service, whose quiet strength lifted a  community for more than 9 decades. A funeral service celebrating his  remarkable life was held on January 29, 2026, at Mount Zion Baptist  Church in Albany, Georgia.\n\nAdrian Earl Jenkins, Sr. was born May 7, 1928, in LaGrange, Georgia,  to Julia Byrd and was primarily raised by his aunt and uncle, William…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…as a civil rights  leader who fought tirelessly for social justice and racial equality in  Seattle and who served devotedly as the beloved pastor of the Central  Area's Mount Zion Baptist Church.\n\nThe son of a Baptist minister and grandson of a Georgia sharecropper,  the Reverend Dr. McKinney was devoted to serving his community  throughout his life.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…commitment to bring about positive change.\n\nOverseer Carter answered the most important call of his life--the  call to preach the Gospel of Jesus Christ. This journey began at Mount  Zion Baptist Church in Camilla, Georgia, and expanded to include  service at Ephesians Baptist Church in Albany and New Mt. Pleasant  Church in Waycross, Georgia.\n\nIn 1984, he co-founded…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congressional District  Champion of the Week for his 50-year career in ministry.\n\nReverend Walker has served as a minister and pastor at multiple  African Methodist Episcopal Zion Churches in New York, Connecticut,  North Carolina, and Alabama. In 1992 he became the senior pastor at the  Wesley Temple Church in Akron, which is Akron's oldest Black  congregation.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…Josephine Barbee was a devoted mother and a  true pioneer in early childhood education and community service. Along  with her brother, Dr. Bishop Leonard R. Williams--pastor of Zion  Holiness Church and Bishop of the Great Lakes District--she played a  critical role in designing,  producing, and implementing vital community programs across Newark, New…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…are church schools: The AME Church at Allen University; the  Baptists at Benedict College and Morris College; and Episcopalians at  Voorhees. The African Methodist Episcopal Zion, AME Zion, has a school  up in Rock Hill outside of my district. I better mention Claflin  University in Orangeburg, as well.\n\nMr. Speaker, as we talk about education and think…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Paul Keenan. With only nine members, that congregation  grew into a thriving interdenominational ministry impacting lives  locally and globally. He also served as Pastor of New Zion Hill Baptist  Church and later organized Divine Covenant International Fellowship,  providing apostolic covering and mentoring more than 100 ministers,  preachers, and leaders--many…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Pena, Ananya Purimetla,       Chloe Ryder, Monish Saravana Kumar Divya Sundari, Dhruva       Rishi Sharma, Daniela Staton, Hannah Stefanovic, Liza       Stephen, Brady Surovek, Zion Tralongo, Shrika Velagapudi,       Alice Wenrich, Katerina Zaharewicz\n\nGA: Beyza Bahar, Malachi Ivey, Sean Lee, Sanaa Scipio,       Mihikaa Seth, Sumeda Sriram, Akshaya Tallapally,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…pain and loss simply  because their loved ones had a disability.\n\nOne of those families is from my district in Ocala, Florida, Bobbi  and Josh Sarmiento. Their infant son, baby Zion, was born with Down  syndrome and in need of a heart transplant. At just 6 months old, Zion  was denied that chance.\n\nThe doctors told the parents, Bobbi and Josh, that baby…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the largest coordinated nationwide  crackdown in more than four decades against a Christian urban house  church in China.\n\nIn that sweep, 23 pastors and church members of the Zion Church, one  of China's largest underground congregations, were arrested and  wrongfully detained, including Pastor Ezra Jin.\n\nPastor Jin and the members of the Zion Church…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}]