[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…and injuring 11 others.\n\nUnfortunately, this is not an isolated incident. Gun violence is a  public health epidemic that affects Americans and ravages communities  in every ZIP Code in every State. Yet, year after year, we see the same  devastating trend: Black Americans are dying from gun violence at  nearly three times the rate of White Americans.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…solution to the extremist  Supreme Court's decision to strike down Roe v. Wade. It would restore  the right for everyone, no matter what State they live in, no matter  their ZIP Code, to receive abortion care.\n\nIn a world where doctors are being threatened with prison time for  doing their jobs, it would protect providers who are simply trying to  save…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699219/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…are not a  luxury. They are part of what closes opportunity gaps. They are a  critical part of our effort to provide students across the country,  regardless of income or ZIP Code, with a world-class education. Yes,  this is about civil rights. Every single dollar is a good investment in  students and in our future.\n\nState administered title I, part…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…firsthand the impact IDEA  funding makes on students who need it the most. Without Federal  funding, States and local communities would have to cover the costs,  but your ZIP Code should not determine if you deserve to have your  children's educational needs met.\n\nAs a public school mom, this is deeply personal for me. People in my  community and communities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…get here, but not every child we represent has that  same ability. The Congressional Black Caucus, as the conscience of  Congress, will fight for every child no matter their ZIP Code, race,  creed, or background to get that education.\n\nMr. Speaker, I thank you for your attention tonight and I yield back  the balance of my time.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…sees a doctor.\n\nMr. Speaker, 2.8 million rural Americans will lose coverage. For  them, this is not politics. This is life or death.\n\nHealthcare should never depend on your ZIP Code. This clean extension  of the ACA tax credits will save lives.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…legislation at this time.\n\nAfter numerous conversations between the chair and former ranking  member, the late Mr. Connolly, the committee agreed on a bipartisan  basis that ZIP Code designation bills would only be considered if they  met the following criteria: One, the designated locality must submit a  letter from local leadership stating the reasons…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693901/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…student who was a Burmese refugee. Htet-Yet and  his family's story is empowering and a stark reminder that not only do  we have an obligation to help those no matter their ZIP Code, but we  have a duty to help those no matter where they are around the globe.\n\nThis legislation gives our country yet another tool to put financial  pressure on the Burmese…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697197/no-new-burma-funds-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Advancement Act to restore what the  Supreme Court gutted when it ripped out preclearance. We must pass the  Freedom to Vote Act to guarantee that every citizen, no matter the ZIP  Code that they live in, their income, or ancestry, can register, vote,  and be counted with dignity.\n\nWe must defend the courts and protect the power of judges to stop  injustice…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Constitution's separation of powers.\n\nWithout Federal oversight, enforcement of IDEA will vary widely from  State to State. A child's access to services will depend on their ZIP  Code. Families will face confusion, delays, and costly legal battles  just to secure what the law already guarantees their children. States  and school districts will be left…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…accomplish, but  now more than ever before, they are watching us to see who we will  become.\n\nI still believe in an America where a child's potential isn't limited  to his ZIP Code, the color of his skin, their gender, or other factors  beyond their control.\n\nI believe in an America where we can acknowledge our imperfect past  while working together…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…bureaucratic decision. It is dangerous. It is a  decision that tells every child in this country that their future  doesn't matter, that their dreams are negotiable, that their ZIP Code  should determine the quality of their education.\n\nLet me be clear, that is not just wrong, it is vicious because when  we give up on our schools, we give up on our communities.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Republicans cut Medicaid, these constituents would lose  their healthcare. We have the obligation to remain defiant in our  position that everyone independent of citizenship status, ZIP Code, or  age has a right to a dignified, healthy life.\n\nNow is the moment to remain united in our commitment to healthcare  for all, courageous in our resistance, and undeterred…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…not for power, not for prestige, but for purpose. That  purpose was clear: to uplift the forgotten and fight for the unseen and  to ensure that every child, no matter the ZIP Code they were born in,  had a fair shot at success.\n\nHis legacy will be defined by his lifelong fight for civil rights,  economic justice, and opportunity for all, but perhaps…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…act to establish new ZIP Codes for certain  communities.\n\nThis measure is aimed at fixing problems in about eight communities  all across the country where the post office's ZIP Code allocation  system has just completely fragmented these towns and cities because of  the proliferation of ZIP Codes that have occurred and been implemented  in some of these…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…modest, commonsense work requirements will restore  dignity and purpose to those on taxpayer-funded benefits.\n\nThe bill will also mean that safer streets are available in every ZIP  Code around the country because our border will remain fully and  totally secure.\n\nThe Republican Party stands for law and order, and this is the side  that stands with law enforcement,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…purpose and conviction to advocate for  the passage of H.R. 3095, a commonsense, bipartisan bill that directs  the United States Postal Service to designate a single unique ZIP Code  for specific communities across our great Nation, including 15 in my  home State of Colorado.\n\nThis legislation is not just about postal efficiency. It is about  fairness,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…peace of  mind.\n\nFor the first time, we are on the path to permanent school choice.  This bill empowers parents, not bureaucrats; funds students, not  systems; and ends the ZIP Code lottery.\n\nIt even helps families build for the future, establishing newborn  investment accounts to grow generational wealth from day one.\n\nThe American Dream is alive and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…TFA's  mission, its entire purpose, is to close the achievement gaps that  exist in this country so that every child, no matter where they are  born or no matter what their ZIP Code is, will have access to an  excellent education.\n\nMr. Speaker, the issue is that, in California, the governing majority  and education establishment there have a model of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…FOR CERTAIN COMMUNITIES.\n\nNot later than 270 days after the date of the enactment of       this Act, the United States Postal Service shall designate a       single, unique ZIP Code for each of the following       communities:\n\n(1) Canyon Lake, California.\n\n(2) Hidden Hills, California.\n\n(3) Industry, California.\n\n(4) North Tustin, California.\n\n(5) Tehachapi,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…American students receive their education  from a public school. Our public school system, envisioned by our  Founding Fathers, is meant to give every child, regardless of ZIP Code,  background, or ability, access to a quality education.\n\nThese schools provide knowledge and skills that allow our young  people to thrive and contribute to our communities.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688125/recognizing-public-schools-week"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…choice.\n\nStates like Utah have led the way. We have shown that when parents  are in charge and students are first, kids thrive. This bill brings  real education freedom to every ZIP Code in America.\n\nI grew up in the segregated South. My parents, both educators, saw  education as a legacy. I want that same legacy and opportunity for my  17 grandkids and millions…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692895/delivering-on-educational-freedom"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Madam Speaker, I thank the gentleman for yielding.\n\nI rise in strong support of H.R. 3095, which directs the U.S. Postal  Service to designate a unique ZIP Code for certain communities,  including North Tustin in my district.\n\nNorth Tustin has been a pillar of our Orange County community and a  census-designated place. However, its…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…ESTABLISHING NEW ZIP CODES.\n\nNot later than 270 days after the date of the enactment of       this Act, the United States Postal Service shall designate a       single, unique ZIP Code for each of the following       communities:\n\n(1) Eastvale, California.\n\n(2) Scotland, Connecticut.\n\n(3) Cooper City, Florida.\n\n(4) Miami Lakes, Florida.\n\n(5) Ocoee, Florida.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…organization when I was a teacher that was aimed at  closing achievement gaps in America. The different opportunities that  are afforded to young students depending on the ZIP Code that they live  in is an ongoing failure of our public education system. There are many  policy changes that we need to make to address that, such as providing  for greater…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of mind.\n\nI am proud to have secured this investment and will continue working  to ensure that rural Iowans receive the same quality care as any  American, no matter their ZIP Code.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…services, ranging from the delivery of mail to confusion for the local  fire department and utilities providers, while also complicating  economic development.\n\nWith mail ZIP Code designation intertwined with Casper, Wyoming, the  city has struggled with timely mail delivery, loss of property tax  revenue and franchise fees, and incorrect Census counts.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…tweeted it about a skillion times, and he is going to  veto Senator Paul's bill because his name is on it. He is going to  knock it to Uranus. He is going to knock it into a new ZIP Code.\n\nThen what have Rand and I done? We have put on a pretty performance.  I want to pass something. Now, I have tried to pass my bill preventing  Members of Congress from being…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]