[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, this week we are going to be taking up  legislation on H.R. 672, an act to establish new ZIP Codes for certain  communities.\n\nThis measure is aimed at fixing problems in about eight communities  all across the country where the post office's ZIP Code allocation  system…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, H.R. 3095 would require the United States  Postal Service to designate unique ZIP Codes for a number of  communities across the country.\n\nThis bill aims to address specific community concerns about disrupted  mail delivery and undeliverable mail. While I commend…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693901/single-unique-zip-codes-for-certain-communities"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…rise in support of H.R. 3095, a  bill that would assign a new ZIP Code to the city of Green, a  municipality within Ohio's 13th Congressional District.\n\nEstablishing unique ZIP Codes may not be what most folks think about  when they are considering Federal legislation; however, for the  citizens and businesses and the economy of the city of Green, Ohio,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, H.R. 672 would require the United States  Postal Service to designate unique ZIP Codes for a number of  communities across the country. This bill aims to address certain  issues related to economic development and public safety regulations  and mail delivery.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…down to one thing, at least  for  me. Our taxes are all going up next year.\n\nIn my district, it is over a couple of thousand dollars for an  average family. In some of my ZIP Codes--look, I represent a fairly  prosperous district; I represent Scottsdale and Phoenix--it is over  $3,000. For my average, it is a $2,062 tax increase next year.\n\nI have been…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3095) to direct the United States Postal Service to designate  single, unique ZIP Codes for certain communities, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…more funding  for startups, more opportunities for businesses that might otherwise be  overlooked, and more innovation happening everywhere, not just in a  handful of elite ZIP Codes.\n\nNewer, regional venture funds are often best positioned to back the  entrepreneurs who are building businesses on Main Street. The DEAL Act  ensures that these funds can…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…a  revolutionary step toward modernizing mail delivery and streamlining  operations for a rapidly growing nation.\n\nAt the time, the United States Postal Service envisioned ZIP Codes as  a simple tool to improve sorting and delivery, but over the decades ZIP  Codes have evolved into far more than postal convenience. They have  become integral to how we…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise in support of H.R. 672 to designate  single, unique ZIP Codes for communities across the United States.\n\nH.R. 672, which includes the community of Mills, Wyoming, would  resolve longstanding issues that have continually impacted a host…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 672) to establish new ZIP Codes for certain communities, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…resources like the 340B drug program, a  key revenue stream for rural hospitals.\n\nRural hospitals must not only survive but thrive. We need to keep  that because it is not about ZIP Codes.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…underscores the tremendous spirit of collaboration that  exists in our region, that we have so many people--it crosses party  lines, it crosses different communities, different ZIP Codes--who are  working together, who are all rowing in the same direction for the  benefit of our region. We have been able to achieve tremendous things  because of that. We have…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]