[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…lying.\n\nIn the last few weeks in Chicago, we have seen Trump's agents detain  innocent Americans, deny citizens their right to legal representation,  point weapons at civilians, zip-tie children, arrest elected officials,  ransack apartment buildings, injure journalists, and shoot a priest in  the head with pepper balls for the so-called crime of peacefully…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and relentless targeting of the  Affordable Care Act.\n\nThis big, pretty some may say, most would say ugly law will hurt  Americans of every party, of every background, of every ZIP Code. For  43 days, the Congressional Black Caucus stood firm to protect America's  healthcare and lower healthcare costs for people like Mike and so many  others that will…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…later, we see the excessive brutality of ICE agents.  Peaceful protesters are tear-gassed in the face. A pastor was shot in  the head with a pepper ball. We have children being zip-tied, car  windows smashed, people tackled and dragged, and guns pointed at  unarmed bystanders. We have people targeted for the color of their skin  or the accents that they…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698887/be-the-voice-of-moral-grandeur-and-spiritual-audacity"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Congressional Black Caucus for being here this evening.\n\nTo reiterate a little of what we have heard here today, I represent a  congressional district in South Carolina that includes ZIP Code 29203.  It happens to be the ZIP Code that I live in, Columbia, South Carolina.  My house in Columbia is about 5 or 6 minutes from the site of the new  medical school of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…healthcare is a luxury, that healthcare should be available to those  who can afford it, that healthcare should be dependent on where you  come from, where you were born, the ZIP Code that you reside in. I  believe that healthcare is a basic human right. We know Jesus gave it  for free.\n\nI subscribe to the notion that no one should be left without access…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…one where we  don't--one where every kid is on their own, one where lights are turned  off and doors are shut and opportunities are closed, unless you happen  to have the right ZIP Code or the right money.\n\nI know which future I am going to vote for today: the one where we  live up to our responsibility and all of our kids can live up to their  fullest…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Republicans cut Medicaid, these constituents would lose  their healthcare. We have the obligation to remain defiant in our  position that everyone independent of citizenship status, ZIP Code, or  age has a right to a dignified, healthy life.\n\nNow is the moment to remain united in our commitment to healthcare  for all, courageous in our resistance, and undeterred…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…come.                      Discriminatory Auto Insurance Rates\n\nMs. TLAIB. Mr. Speaker, I don't know about you, but I have no idea  that someone's income, occupation, education, ZIP Code, marital status,  credit score, or homeownership status have anything to do with  somebody's auto insurance rates or whether or not they are a good  driver. It has absolutely…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…pickup lines of their  school. They are dragging mothers out of their cars. They are smashing  windows to arrest old men, separating families in the middle of the  night, and zip tying children.\n\nThey are using immigration hearings and check-ins as setups and  defying court orders, and then our neighbors are being shipped off to  countries where they…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697454/fighting-dhs-immigration-raids"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Advancement Act to restore what the  Supreme Court gutted when it ripped out preclearance. We must pass the  Freedom to Vote Act to guarantee that every citizen, no matter the ZIP  Code that they live in, their income, or ancestry, can register, vote,  and be counted with dignity.\n\nWe must defend the courts and protect the power of judges to stop  injustice…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…what Black America had  long known: separate is not equal. That landmark decision was more than  a legal ruling--it was a promise. A promise that every child, no matter  their ZIP code, deserves a fair and quality education.\n\nSince then, the Department of Education has helped to keep that  promise. It protects students from racial and gender discrimination…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people thrown to the ground and  beaten. This is not speculation; it is videotaped. We have it.\n\nWe have seen children ripped from their beds in the middle of the  night and zip-tied outside of an apartment complex on the South Shore  Avenue of Chicago. And we have seen tear gas canisters deployed against  pastors, journalists, and police.\n\nThink about…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Halls not for power, not for prestige, but for purpose. That  purpose was clear: to uplift the forgotten and fight for the unseen and  to ensure that every child, no matter the ZIP Code they were born in,  had a fair shot at success.\n\nHis legacy will be defined by his lifelong fight for civil rights,  economic justice, and opportunity for all, but perhaps…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…or sees a doctor.\n\nMr. Speaker, 2.8 million rural Americans will lose coverage. For  them, this is not politics. This is life or death.\n\nHealthcare should never depend on your ZIP Code. This clean extension  of the ACA tax credits will save lives.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…bureaucratic decision. It is dangerous. It is a  decision that tells every child in this country that their future  doesn't matter, that their dreams are negotiable, that their ZIP Code  should determine the quality of their education.\n\nLet me be clear, that is not just wrong, it is vicious because when  we give up on our schools, we give up on our communities.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…means more funding  for startups, more opportunities for businesses that might otherwise be  overlooked, and more innovation happening everywhere, not just in a  handful of elite ZIP Codes.\n\nNewer, regional venture funds are often best positioned to back the  entrepreneurs who are building businesses on Main Street. The DEAL Act  ensures that these funds…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and peace of  mind.\n\nFor the first time, we are on the path to permanent school choice.  This bill empowers parents, not bureaucrats; funds students, not  systems; and ends the ZIP Code lottery.\n\nIt even helps families build for the future, establishing newborn  investment accounts to grow generational wealth from day one.\n\nThe American Dream is alive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise in support of H.R. 672 to designate  single, unique ZIP Codes for communities across the United States.\n\nH.R. 672, which includes the community of Mills, Wyoming, would  resolve longstanding issues that have continually impacted…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…want to defend.\n\nEnrique Tarrio, a former national leader of the Proud Boys and a  domestic terrorist, was pardoned by Donald Trump.\n\nGuy Reffitt, somebody who brought a gun, zip ties, and body armor,  was pardoned by Donald Trump.\n\nNot only that, they have gone after their pardons, and they haven't  stopped the criminal spree.\n\nA Houston man was pardoned…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…all, TFA's  mission, its entire purpose, is to close the achievement gaps that  exist in this country so that every child, no matter where they are  born or no matter what their ZIP Code is, will have access to an  excellent education.\n\nMr. Speaker, the issue is that, in California, the governing majority  and education establishment there have a model…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…modest, commonsense work requirements will restore  dignity and purpose to those on taxpayer-funded benefits.\n\nThe bill will also mean that safer streets are available in every ZIP  Code around the country because our border will remain fully and  totally secure.\n\nThe Republican Party stands for law and order, and this is the side  that stands with law…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3095) to direct the United States Postal Service to designate  single, unique ZIP Codes for certain communities, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…peace  of mind.\n\nI am proud to have secured this investment and will continue working  to ensure that rural Iowans receive the same quality care as any  American, no matter their ZIP Code.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…choice.\n\nStates like Utah have led the way. We have shown that when parents  are in charge and students are first, kids thrive. This bill brings  real education freedom to every ZIP Code in America.\n\nI grew up in the segregated South. My parents, both educators, saw  education as a legacy. I want that same legacy and opportunity for my  17 grandkids and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692895/delivering-on-educational-freedom"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…tweeted it about a skillion times, and he is going to  veto Senator Paul's bill because his name is on it. He is going to  knock it to Uranus. He is going to knock it into a new ZIP Code.\n\nThen what have Rand and I done? We have put on a pretty performance.  I want to pass something. Now, I have tried to pass my bill preventing  Members of Congress from…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Madam Speaker, I thank the gentleman for yielding.\n\nI rise in strong support of H.R. 3095, which directs the U.S. Postal  Service to designate a unique ZIP Code for certain communities,  including North Tustin in my district.\n\nNorth Tustin has been a pillar of our Orange County community and a  census-designated place. However,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…10 American students receive their education  from a public school. Our public school system, envisioned by our  Founding Fathers, is meant to give every child, regardless of ZIP Code,  background, or ability, access to a quality education.\n\nThese schools provide knowledge and skills that allow our young  people to thrive and contribute to our communities.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688125/recognizing-public-schools-week"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 672) to establish new ZIP Codes for certain communities, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…an organization when I was a teacher that was aimed at  closing achievement gaps in America. The different opportunities that  are afforded to young students depending on the ZIP Code that they live  in is an ongoing failure of our public education system. There are many  policy changes that we need to make to address that, such as providing  for greater…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…of purpose and conviction to advocate for  the passage of H.R. 3095, a commonsense, bipartisan bill that directs  the United States Postal Service to designate a single unique ZIP Code  for specific communities across our great Nation, including 15 in my  home State of Colorado.\n\nThis legislation is not just about postal efficiency. It is about  fairness,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]