[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…another photo op, this time in Nogales, Arizona, families across this  country are still grieving people who should be alive.\n\nLet's be clear: Border communities are not war zones. Border towns,  like Nogales, which I represent in Congress, are vibrant, binational  communities where families live, work, and thrive.\n\nInstead of listening to local leaders,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…children's programs like ``Sesame Street.''\n\nThis is a bill to rip lifesaving support away from the hungry,  displaced, and sick people in developing countries and conflict zones  across the globe and to end programs that treat deadly diseases and  prevent pandemics.\n\nThis is a bill to abandon the people of Ukraine while they resist  Putin's tyranny.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…clear. The dictatorship of Russia takes what is not theirs. Russia  invades territory that does not belong to it.\n\nIf one looks at this map, Russia is a vast country of 11 time zones.  It does not lack for territory. Here is Ukraine. Just think about that.  West of that lies Europe. Study the map. Mr. Speaker, if you know  nothing about Europe and that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise to introduce the Health Investment  Zones Act of 2026. This legislation would designate health investment  zones for 10 years in areas with large health disparities based on  income, life expectancy, provider shortages,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…people  to essential services like jobs, housing, and mental health care to  break cycles of violence.\n\nThe impact is undeniable. From May to July of this year, Detroit's  CVI zones saw about a 30 percent drop in homicides and shootings with  some neighborhoods faring even better.\n\nDespite this, cuts are taking their toll. This spring, the Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic  zones of all these jurisdictions combined exceed the land areas of  China and Russia combined, comprising a significant part of the vast  Pacific Ocean and our Earth's surface.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…are still very visible amongst us. Look to the people of the  Marshall Islands. Many of them are living in my district, part of our  Hawaii ohana, whose lands became sacrifice zones in the name of power.  Entire communities were displaced, and generations were scarred by  radiation. The Bikini Atoll, once a paradise, became a proving ground  for devastation.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic  zones of all these jurisdictions combined exceed the land areas of  China and Russia combined, comprising a significant part of the vast  Pacific Ocean and our Earth's surface.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…children's  programs like Sesame Street--yes, Sesame Street.\n\nThis bill rips lifesaving support away from hungry, displaced, and  sick people in developing countries and conflict zones and will end  programs that prevent conflict and pandemics.\n\nThis bill abandons the people of Ukraine while they resist Putin's  tyranny.\n\nThis bill puts America last.\n\nWhen…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…of meditation as a  practical tool for mental well-being and peace.\n\nThe day will culminate in a global moment of stillness at 10 am ET,  when millions of people across time zones will join a live, guided  meditation led by global humanitarian Gurudev Sri Sri Ravi Shankar,  founder of The Art of Living Foundation. Gurudev has devoted his life  to serving…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698102/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…summarizing not just the issue but the solution with  this bipartisan legislation, for it is this type of legislation that  would ensure that tax deadlines remain aligned in disaster zones and  that those who have survived natural disasters are not penalized by  confusing collection notices or a shortened tax lookback period.\n\nNow, currently, taxpayers have a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…prolonged droughts, shifts in water management practices,  ongoing aquifer depletion, and other major water uses. It is all about  having a public website displaying maps depicting zones at greater risk  of sinkhole formation, helping save lives and helping us have more  resilient communities.\n\nI thank Chairman Westerman, Ranking Members Huffman and Hoyle,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693480/sinkhole-mapping-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and  retired officers to carry concealed firearms on buses, trains, and  subways. It would even force States to allow for the concealed carry of  firearms in gun-free school zones. It also allows the off-duty and  retired officers to completely disregard State laws prohibiting high- capacity magazines.\n\nThis legislation not only supersedes the considered…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…between the United States Government and the  Pacific Island states.\n\nThis treaty authorizes the small U.S. purse seine vessel fleet to  fish in specific and exclusive economic zones in the Pacific Island  countries that are part of the treaty. These parties include Australia,  the Cook Islands, Fiji, New Zealand, Palau, Papua New Guinea, Samoa,  the Solomon…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691005/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic  zones of all these jurisdictions combined exceed the land areas of  China and Russia combined, comprising a significant part of the vast  Pacific Ocean and our Earth's surface.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Ft. Novosel, U.S. Army Aviation  Center of Excellence.\n\nColonel Tucker has served our Nation throughout a remarkable career  spanning multiple continents, commands, and combat zones. He is highly  decorated for valor and meritorious service, and his leadership has  been instrumental across a wide array of assignments, from commanding  aviation units in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…officers  qualified under LEOSA to carry concealed firearms in national parks,  certain Federal facilities that are open to the public, on public  transportation, in school zones, and in other areas.\n\nThe bill also reduces the frequency that qualified retired law  enforcement officers are required to meet certain qualification  standards.\n\nMany States…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…serving our Nation. They are doing an outstanding job in their work and  supporting missions in Europe, in Asia, and in the Middle East. They  are a long way from home--eight time zones away from Wyoming--away from  family, away from friends, away for the holidays.\n\nAnd I go every year, wherever I can find Wyoming troops, to thank  them for their service,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…true.\n\nWhat is true, however, is that the specific use permit, which under  current law only lasts 5 years, has caused national marine sanctuaries  to effectively become no-go zones for undersea cables. This means  reduced routes of diversity, consolidation of cable landing zones, and  an increased threat to our national security.\n\nNotably, this dynamic…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…it. Think about all the men  and women who currently serve, only about 10 percent have been  diagnosed with PTSD. That is of all who served.\n\nFor those who served in combat zones, the rate of PTSD can reach up  to 20 percent. Among first responders, police officers, firefighters,  and EMTs, 80 percent have experienced at least one traumatic event  while…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…distinguished friend from Alaska: Isn't it a fact  that General Caine time and again has demonstrated his aptitude and  leadership abilities while actually deployed in combat zones, leading  servicemembers in Iraq and Syria, and while serving in various Special  Operations forces units and also in the intelligence community and that  he ran some of our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…enforcement officers the opportunity to purchase the  service weapons they used before obtaining a new one; H.R. 2243, the  LEOSA Reform Act, which amends the Gun-Free School Zones Act to provide  an exemption for law enforcement officers certified under the Law  Enforcement Officers Safety Act to carry a concealed firearm in a gun- free school zone;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Cooperation trade and security agreement.  That is between China and 53 African nations. What does that do? That  also maintains a commitment to building nuclear weapon-free zones.\n\nNow, why did China do this, and why should we care? Because once  Mauritius owns the Chagos Islands--even though they say they are going  to sign a lease and allow the UK…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of which, if applied to  Iran, risk the total destabilization of the Middle East. The American  people are sick and tired of sending their children to fight and die in  war zones on the other side of the world with no tangible U.S.  interests at stake.\n\nAbdicating our constitutional responsibility by allowing the  executive branch to unilaterally introduce…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of minor construction and                improvement project management. Sec. 214. Preparedness plans for Coast Guard properties located in                tsunami inundation zones. Sec. 215. Additional Pribilof Island transition completion actions. Sec. 216. Scientific mission for USCGC Storis. Sec. 217. Coast Guard access to Department of the Treasury…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 900) to direct the Director of the United States Geological  Survey to establish a program to map zones that are at greater risk of  sinkhole formation, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…aboard CH-34 helicopters, MSgt Timmins participated  in numerous recovery missions, often under intense enemy fire. His role  in rescuing wounded soldiers from active combat zones required  extraordinary courage and was vital to saving countless lives. His  service reflects the bravery and sacrifice of the many Medevac crew  members who risked everything…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…exceeding the  losses of much larger allies with far greater resources.\n\nSo despite its small military, Denmark has deployed forces to some of  the most dangerous, kinetic combat zones, particularly Helmand  Province, fighting alongside UK units at the height of the insurgency.  Danish forces accepted frontline combat roles--some lost their lives as  a result…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…have greatly reduced       the footprint of development, allowing for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For       example, as much as 60-plus square miles can now be developed       from a single 12 to 14 acre gravel drill site. New drilling       capabilities…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Nation's success.\n\nHDTs are necessary for the construction and the maintenance of supply  routes, airfields, helipads, and logistical facilities in both combat  and noncombat zones.\n\nCurrently, our military is forced to rely on an outdated and an  unreliable fleet of trucks. Upgrading these vehicles will provide our  servicemembers with up-to-date safety…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}]